-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/box_plots.log
  log type:  text
 opened on:  14 Apr 2022, 10:51:54

. 
. **Set Ado file path
. adopath + "$projectdir/analysis/extra_ados"
  [1]  (BASE)      "/usr/local/stata/ado/base/"
  [2]  (SITE)      "/usr/local/ado/"
  [3]              "."
  [4]  (PERSONAL)  "~/ado/personal/"
  [5]  (PLUS)      "~/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "/workspace/analysis/extra_ados"

. 
. **Use cleaned data from previous step
. use "$projectdir/output/data/file_eia_all.dta", clear

. 
. set scheme plotplainblind

. 
. /*GP referral performance by region==========================================
> =================================*/
. 
. preserve

. gen qs1_0 =1 if time_gp_rheum_ref_appt<=3 & time_gp_rheum_ref_appt!=.
(67,486 missing values generated)

. recode qs1_0 .=0 if time_gp_rheum_ref_appt!=.
(qs1_0: 1113 changes made)

. gen qs1_1 =1 if time_gp_rheum_ref_appt>3 & time_gp_rheum_ref_appt<=7 & time_g
> p_rheum_ref_appt!=.
(67,492 missing values generated)

. recode qs1_1 .=0 if time_gp_rheum_ref_appt!=.
(qs1_1: 1119 changes made)

. gen qs1_2 = 1 if time_gp_rheum_ref_appt>7 & time_gp_rheum_ref_appt!=.
(66,399 missing values generated)

. recode qs1_2 .=0 if time_gp_rheum_ref_appt!=.
(qs1_2: 26 changes made)

. 
. expand=2, gen(copy)
(67,502 observations created)

. replace nuts_region = 0 if copy==1  
(67,502 real changes made)

. 
. graph hbar (mean) qs1_0 (mean) qs1_1 (mean) qs1_2, over(nuts_region, relabel(
> 1 "National")) stack ytitle(Proportion of patients) ytitle(, size(small)) leg
> end(order(1 "Within 3 days" 2 "Within 7 days" 3 "More than 7 days")) title("T
> ime to rheumatology referral") saving("$projectdir/output/figures/regional_qs
> 1_bar.gph", replace) name(regional_qs1_bar, replace)
(note: file /workspace/output/figures/regional_qs1_bar.gph not found)
(file /workspace/output/figures/regional_qs1_bar.gph saved)

. graph export "$projectdir/output/figures/regional_qs1_bar.svg", replace
(note: file /workspace/output/figures/regional_qs1_bar.svg not found)
(file /workspace/output/figures/regional_qs1_bar.svg written in SVG format)

. restore

. 
. /*
> *Regional GP referral performance
> preserve
> 
> graph hbox qs1, over(nuts_region) blabel(bar, color(black) position(inside) f
> ormat(%9.4f)) title("Quality Standard 1: GP referral within 3 days") ytitle(P
> roportion meeting standard) saving("$projectdir/output/figures/regional_gpref
> _box.gph", replace) name(regional_gpref_box, replace)
> restore
> */
. 
. *Rheum assessment performance by region======================================
> ====================================*/
. 
. preserve

. gen qs2_0 =1 if time_ref_rheum_appt<=21 & time_ref_rheum_appt!=.
(67,247 missing values generated)

. recode qs2_0 .=0 if time_ref_rheum_appt!=.
(qs2_0: 6036 changes made)

. gen qs2_1 =1 if time_ref_rheum_appt>21 & time_ref_rheum_appt<=42 & time_ref_r
> heum_appt!=.
(67,257 missing values generated)

. recode qs2_1 .=0 if time_ref_rheum_appt!=.
(qs2_1: 6046 changes made)

. gen qs2_2 = 1 if time_ref_rheum_appt>42 & time_ref_rheum_appt!=.
(61,711 missing values generated)

. recode qs2_2 .=0 if time_ref_rheum_appt!=.
(qs2_2: 500 changes made)

. 
. expand=2, gen(copy)
(67,502 observations created)

. replace nuts_region = 0 if copy==1  
(67,502 real changes made)

. 
. graph hbar (mean) qs2_0 (mean) qs2_1 (mean) qs2_2, over(nuts_region, relabel(
> 1 "National")) stack ytitle(Proportion of patients) ytitle(, size(small)) leg
> end(order(1 "Within 3 weeks" 2 "Within 6 weeks" 3 "More than 6 weeks")) title
> ("Time from rheumatology referral to assessment") saving("$projectdir/output/
> figures/regional_qs2_bar.gph", replace) name(regional_qs2_bar, replace)
(note: file /workspace/output/figures/regional_qs2_bar.gph not found)
(file /workspace/output/figures/regional_qs2_bar.gph saved)

. graph export "$projectdir/output/figures/regional_qs2_bar.svg", replace
(note: file /workspace/output/figures/regional_qs2_bar.svg not found)
(file /workspace/output/figures/regional_qs2_bar.svg written in SVG format)

. restore

. 
. *Rheum assessment performance by region using last GP pre-appt ==============
> ============================================================*/
. 
. preserve

. gen qs2_0 =1 if time_gp_rheum_appt<=21 & time_gp_rheum_appt!=.
(67,268 missing values generated)

. recode qs2_0 .=0 if time_gp_rheum_appt!=.
(qs2_0: 5927 changes made)

. gen qs2_1 =1 if time_gp_rheum_appt>21 & time_gp_rheum_appt<=42 & time_gp_rheu
> m_appt!=.
(67,264 missing values generated)

. recode qs2_1 .=0 if time_gp_rheum_appt!=.
(qs2_1: 5923 changes made)

. gen qs2_2 = 1 if time_gp_rheum_appt>42 & time_gp_rheum_appt!=.
(61,813 missing values generated)

. recode qs2_2 .=0 if time_gp_rheum_appt!=.
(qs2_2: 472 changes made)

. 
. expand=2, gen(copy)
(67,502 observations created)

. replace nuts_region = 0 if copy==1  
(67,502 real changes made)

. 
. graph hbar (mean) qs2_0 (mean) qs2_1 (mean) qs2_2, over(nuts_region, relabel(
> 1 "National")) stack ytitle(Proportion of patients) ytitle(, size(small)) leg
> end(order(1 "Within 3 weeks" 2 "Within 6 weeks" 3 "More than 6 weeks")) title
> ("Time from last GP appointment to rheumatology assessment") saving("$project
> dir/output/figures/regional_qs2_bar_GP.gph", replace) name(regional_qs2_bar_G
> P, replace)
(note: file /workspace/output/figures/regional_qs2_bar_GP.gph not found)
(file /workspace/output/figures/regional_qs2_bar_GP.gph saved)

. graph export "$projectdir/output/figures/regional_qs2_bar_GP.svg", replace
(note: file /workspace/output/figures/regional_qs2_bar_GP.svg not found)
(file /workspace/output/figures/regional_qs2_bar_GP.svg written in SVG format)

. restore

. 
. *csDMARD shared care performance by region, including no prescriptions=======
> ===================================================================*/
. 
. preserve

. *All patients must have 1) rheum appt 2) 6m+ follow-up after rheum appt 3) 6m
>  of registration after appt (12m+ for biologics)
. keep if has_6m_post_appt==1
(49,528 observations deleted)

. gen csdmard_0 =1 if time_to_csdmard<=90 & time_to_csdmard!=.
(15,780 missing values generated)

. recode csdmard_0 .=0
(csdmard_0: 15780 changes made)

. gen csdmard_1 =1 if time_to_csdmard>90 & time_to_csdmard<=180 & time_to_csdma
> rd!=.
(16,670 missing values generated)

. recode csdmard_1 .=0
(csdmard_1: 16670 changes made)

. gen csdmard_2 = 1 if time_to_csdmard>180 & time_to_csdmard!=.
(10,255 missing values generated)

. recode csdmard_2 .=0 
(csdmard_2: 10255 changes made)

. gen csdmard_3 = 1 if time_to_csdmard==.
(11,217 missing values generated)

. recode csdmard_3 .=0 
(csdmard_3: 11217 changes made)

. 
. expand=2, gen(copy)
(17,974 observations created)

. replace nuts_region = 0 if copy==1  
(17,974 real changes made)

. 
. graph hbar (mean) csdmard_0 (mean) csdmard_1 (mean) csdmard_2 (mean) csdmard_
> 3, over(nuts_region, relabel(1 "National")) stack ytitle(Proportion of patien
> ts) ytitle(, size(small)) legend(order(1 "Within 3 months" 2 "Within 6 months
> " 3 "More than 6 months" 4 "Not prescribed")) title("Time to shared care csDM
> ARD") saving("$projectdir/output/figures/regional_csdmard_bar.gph", replace) 
> name(regional_csdmard_bar, replace)
(note: file /workspace/output/figures/regional_csdmard_bar.gph not found)
(file /workspace/output/figures/regional_csdmard_bar.gph saved)

. graph export "$projectdir/output/figures/regional_csdmard_bar.svg", replace
(note: file /workspace/output/figures/regional_csdmard_bar.svg not found)
(file /workspace/output/figures/regional_csdmard_bar.svg written in SVG format)

. restore

. 
. *csDMARD shared care performance by region, not including no prescriptions===
> =======================================================================*/
. 
. preserve

. *All patients must have 1) rheum appt 2) 6m+ follow-up after rheum appt 3) 6m
>  of registration after appt (12m+ for biologics)
. keep if has_6m_post_appt==1
(49,528 observations deleted)

. gen csdmard_0 =1 if time_to_csdmard<=90 & time_to_csdmard!=.
(15,780 missing values generated)

. recode csdmard_0 .=0 if time_to_csdmard!=.
(csdmard_0: 9023 changes made)

. gen csdmard_1 =1 if time_to_csdmard>90 & time_to_csdmard<=180 & time_to_csdma
> rd!=.
(16,670 missing values generated)

. recode csdmard_1 .=0 if time_to_csdmard!=.
(csdmard_1: 9913 changes made)

. gen csdmard_2 = 1 if time_to_csdmard>180 & time_to_csdmard!=.
(10,255 missing values generated)

. recode csdmard_2 .=0 if time_to_csdmard!=.
(csdmard_2: 3498 changes made)

. 
. expand=2, gen(copy)
(17,974 observations created)

. replace nuts_region = 0 if copy==1  
(17,974 real changes made)

. 
. graph hbar (mean) csdmard_0 (mean) csdmard_1 (mean) csdmard_2, over(nuts_regi
> on, relabel(1 "National")) stack ytitle(Proportion of patients) ytitle(, size
> (small)) legend(order(1 "Within 3 months" 2 "Within 6 months" 3 "More than 6 
> months")) title("Time to shared care csDMARD") saving("$projectdir/output/fig
> ures/regional_csdmard_bar_nomiss.gph", replace) name(regional_csdmard_bar_nom
> iss, replace)
(note: file /workspace/output/figures/regional_csdmard_bar_nomiss.gph not found
> )
(file /workspace/output/figures/regional_csdmard_bar_nomiss.gph saved)

. graph export "$projectdir/output/figures/regional_csdmard_bar_nomiss.svg", re
> place
(note: file /workspace/output/figures/regional_csdmard_bar_nomiss.svg not found
> )
(file /workspace/output/figures/regional_csdmard_bar_nomiss.svg written in SVG 
> format)

. restore

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/box_plots.log
  log type:  text
 closed on:  14 Apr 2022, 10:52:02
-------------------------------------------------------------------------------
