-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/box_plots.log
  log type:  text
 opened on:   6 Apr 2022, 15:58:57

. 
. **Set Ado file path
. adopath + "$projectdir/analysis/extra_ados"
  [1]  (BASE)      "/usr/local/stata/ado/base/"
  [2]  (SITE)      "/usr/local/ado/"
  [3]              "."
  [4]  (PERSONAL)  "~/ado/personal/"
  [5]  (PLUS)      "~/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "/workspace/analysis/extra_ados"

. 
. **Use cleaned data from previous step
. use "$projectdir/output/data/file_eia_all.dta", clear

. 
. set scheme plotplainblind

. 
. /*GP referral performance by region==========================================
> =================================*/
. 
. preserve

. gen qs1_0 =1 if time_gp_rheum_ref_appt<=3 & time_gp_rheum_ref_appt!=.
(35,353 missing values generated)

. recode qs1_0 .=0 if time_gp_rheum_ref_appt!=.
(qs1_0: 945 changes made)

. gen qs1_1 =1 if time_gp_rheum_ref_appt>3 & time_gp_rheum_ref_appt<=7 & time_g
> p_rheum_ref_appt!=.
(35,341 missing values generated)

. recode qs1_1 .=0 if time_gp_rheum_ref_appt!=.
(qs1_1: 933 changes made)

. gen qs1_2 = 1 if time_gp_rheum_ref_appt>7 & time_gp_rheum_ref_appt!=.
(34,430 missing values generated)

. recode qs1_2 .=0 if time_gp_rheum_ref_appt!=.
(qs1_2: 22 changes made)

. 
. expand=2, gen(copy)
(35,358 observations created)

. replace nuts_region = 0 if copy==1  
(35,358 real changes made)

. 
. graph hbar (mean) qs1_0 (mean) qs1_1 (mean) qs1_2, over(nuts_region, relabel(
> 1 "National")) stack ytitle(Proportion of patients) ytitle(, size(small)) leg
> end(order(1 "Referral within 3 days" 2 "Referral within 7 days" 3 "Delay >7 d
> ays")) title("Time to rheumatology referral") saving("$projectdir/output/figu
> res/regional_qs1_bar.gph", replace) name(regional_qs1_bar, replace)
(note: file /workspace/output/figures/regional_qs1_bar.gph not found)
(file /workspace/output/figures/regional_qs1_bar.gph saved)

. graph export "$projectdir/output/figures/regional_qs1_bar.svg", replace
(note: file /workspace/output/figures/regional_qs1_bar.svg not found)
(file /workspace/output/figures/regional_qs1_bar.svg written in SVG format)

. restore

. 
. /*
> *Regional GP referral performance
> preserve
> 
> graph hbox qs1, over(nuts_region) blabel(bar, color(black) position(inside) f
> ormat(%9.4f)) title("Quality Standard 1: GP referral within 3 days") ytitle(P
> roportion meeting standard) saving("$projectdir/output/figures/regional_gpref
> _box.gph", replace) name(regional_gpref_box, replace)
> restore
> */
. 
. *Rheum assessment performance by region======================================
> ====================================*/
. 
. preserve

. gen qs2_0 =1 if time_ref_rheum_appt<=21 & time_ref_rheum_appt!=.
(35,070 missing values generated)

. recode qs2_0 .=0 if time_ref_rheum_appt!=.
(qs2_0: 5217 changes made)

. gen qs2_1 =1 if time_ref_rheum_appt>21 & time_ref_rheum_appt<=42 & time_ref_r
> heum_appt!=.
(35,080 missing values generated)

. recode qs2_1 .=0 if time_ref_rheum_appt!=.
(qs2_1: 5227 changes made)

. gen qs2_2 = 1 if time_ref_rheum_appt>42 & time_ref_rheum_appt!=.
(30,419 missing values generated)

. recode qs2_2 .=0 if time_ref_rheum_appt!=.
(qs2_2: 566 changes made)

. 
. expand=2, gen(copy)
(35,358 observations created)

. replace nuts_region = 0 if copy==1  
(35,358 real changes made)

. 
. graph hbar (mean) qs2_0 (mean) qs2_1 (mean) qs2_2, over(nuts_region, relabel(
> 1 "National")) stack ytitle(Proportion of patients) ytitle(, size(small)) leg
> end(order(1 "Seen within 3 weeks" 2 "Seen within 6 weeks" 3 "Delay >6 weeks")
> ) title("Time to rheumatology assessment") saving("$projectdir/output/figures
> /regional_qs2_bar.gph", replace) name(regional_qs2_bar, replace)
(note: file /workspace/output/figures/regional_qs2_bar.gph not found)
(file /workspace/output/figures/regional_qs2_bar.gph saved)

. graph export "$projectdir/output/figures/regional_qs2_bar.svg", replace
(note: file /workspace/output/figures/regional_qs2_bar.svg not found)
(file /workspace/output/figures/regional_qs2_bar.svg written in SVG format)

. restore

. 
. *csDMARD shared care performance by region===================================
> =======================================*/
. 
. preserve

. keep if has_12m_follow_up==1 //only those patients with >12m of follow-up
(3,538 observations deleted)

. gen csdmard_0 =1 if time_to_csdmard<=180 & time_to_csdmard!=.
(30,429 missing values generated)

. recode csdmard_0 .=0 if time_to_csdmard!=.
(csdmard_0: 7646 changes made)

. gen csdmard_1 =1 if time_to_csdmard>180 & time_to_csdmard<=365 & time_to_csdm
> ard!=.
(30,114 missing values generated)

. recode csdmard_1 .=0 if time_to_csdmard!=.
(csdmard_1: 7331 changes made)

. gen csdmard_2 = 1 if time_to_csdmard>365 & time_to_csdmard!=.
(25,880 missing values generated)

. recode csdmard_2 .=0 if time_to_csdmard!=.
(csdmard_2: 3097 changes made)

. 
. expand=2, gen(copy)
(31,820 observations created)

. replace nuts_region = 0 if copy==1  
(31,820 real changes made)

. 
. graph hbar (mean) csdmard_0 (mean) csdmard_1 (mean) csdmard_2, over(nuts_regi
> on, relabel(1 "National")) stack ytitle(Proportion of patients) ytitle(, size
> (small)) legend(order(1 "csDMARD within 6 months" 2 "csDMARD within 1 year" 3
>  "Delay >1 year")) title("Time to shared care csDMARD") saving("$projectdir/o
> utput/figures/regional_csdmard_bar.gph", replace) name(regional_csdmard_bar, 
> replace)
(note: file /workspace/output/figures/regional_csdmard_bar.gph not found)
(file /workspace/output/figures/regional_csdmard_bar.gph saved)

. graph export "$projectdir/output/figures/regional_csdmard_bar.svg", replace
(note: file /workspace/output/figures/regional_csdmard_bar.svg not found)
(file /workspace/output/figures/regional_csdmard_bar.svg written in SVG format)

. restore

. 
. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/box_plots.log
  log type:  text
 closed on:   6 Apr 2022, 15:59:01
-------------------------------------------------------------------------------
