----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:/Users/k1754142/OneDrive/PhD Project/OpenSAFELY/Github Practice/logs/cleaning_dataset.log
  log type:  text
 opened on:   9 Apr 2022, 18:09:26

. 
. di "$projectdir"
C:/Users/k1754142/OneDrive/PhD Project/OpenSAFELY/Github Practice

. di "$logdir"
C:/Users/k1754142/OneDrive/PhD Project/OpenSAFELY/Github Practice/logs

. 
. import delimited "$projectdir/output/input.csv", clear
(66 vars, 100,000 obs)

. 
. **Set Ado file path
. adopath + "$projectdir/analysis/extra_ados"
  [1]  (BASE)      "C:\Program Files\Stata17\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata17\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "C:\Users\k1754142\ado\personal/"
  [5]  (PLUS)      "C:\Users\k1754142\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "C:/Users/k1754142/OneDrive/PhD Project/OpenSAFELY/Github Practice/analysis/extra_ados"

. 
. **Set index dates ===========================================================*/
. global year_preceding = "01/03/2018"

. global start_date = "01/03/2019"

. global end_date = "01/03/2022"

. 
. **Rename variables (some are too long for Stata to handle) =======================================*/
. rename chronic_respiratory_disease chronic_resp_disease

. 
. **Convert date strings to dates ====================================================*/
. ***Some dates are given with month/year only, so adding day 15 to enable them to be processed as dates 
. 
. foreach var of varlist   hba1c_mmol_per_mol_date                        ///
>                                                  hba1c_percentage_date                          ///
>                                                  creatinine_date                                ///
>                                                  bmi_date_measured                          ///
>                                                  abatacept                                                      ///
>                                                  adalimumab                                                     ///     
>                                                  baricitinib                                            ///
>                                                  certolizumab                                           ///
>                                                  etanercept                                                     ///
>                                                  golimumab                                                      ///
>                                                  guselkumab                                                     ///     
>                                                  infliximab                                                     ///
>                                                  ixekizumab                                                     ///
>                                                  methotrexate_hcd                                       ///
>                                                  rituximab                                                      ///
>                                                  sarilumab                                                      ///
>                                                  secukinumab                                            ///     
>                                                  tocilizumab                                            ///
>                                                  tofacitinib                                            ///
>                                                  upadacitinib                                           ///
>                                                  ustekinumab                                            ///
>                                                  {
  2.                                                         
.                 capture confirm string variable `var'
  3.                 if _rc!=0 {
  4.                         assert `var'==.
  5.                         rename `var' `var'_date
  6.                 }
  7.         
.                 else {
  8.                                 replace `var' = `var' + "-15"
  9.                                 rename `var' `var'_dstr
 10.                                 replace `var'_dstr = " " if `var'_dstr == "-15"
 11.                                 gen `var'_date = date(`var'_dstr, "YMD") 
 12.                                 order `var'_date, after(`var'_dstr)
 13.                                 drop `var'_dstr
 14.                 }
 15.         
.         format `var'_date %td
 16. }
variable hba1c_mmol_per_mol_date was str7 now str10
(100,000 real changes made)
(5,000 real changes made)
(5,000 missing values generated)
variable hba1c_percentage_date was str7 now str10
(100,000 real changes made)
(5,000 real changes made)
(5,000 missing values generated)
variable creatinine_date was str7 now str10
(100,000 real changes made)
(5,000 real changes made)
(5,000 missing values generated)
variable bmi_date_measured was str7 now str10
(100,000 real changes made)
(40,000 real changes made)
(40,000 missing values generated)
variable abatacept was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable adalimumab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable baricitinib was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable certolizumab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable etanercept was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable golimumab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable guselkumab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable infliximab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable ixekizumab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable methotrexate_hcd was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable rituximab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable sarilumab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable secukinumab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable tocilizumab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable tofacitinib was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable upadacitinib was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable ustekinumab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)

. 
. **Conversion for dates with day already included ====================================================*/
. 
. foreach var of varlist   died_date_ons                                          ///
>                                              eia_code_date                                              ///
>                                                  rheum_appt_date                                        ///
>                                                  ortho_appt_date                                        ///
>                                                  tandortho_appt_date                            ///
>                                              ra_code_date                                               ///
>                                                  psa_code_date                                          ///
>                                                  anksp_code_date                                        ///
>                                                  last_gp_prerheum_date                          ///
>                                                  last_gp_precode_date                           ///     
>                                                  last_gp_refrheum_date                          ///
>                                                  last_gp_refcode_date                           ///
>                                                  referral_rheum_prerheum                        ///
>                                                  referral_rheum_precode                         ///     
>                                                  chronic_cardiac_disease                        ///
>                                                  diabetes                                                       ///
>                                                  hypertension                                           ///     
>                                                  chronic_resp_disease                           ///
>                                                  copd                                                           ///
>                                                  chronic_liver_disease                          ///
>                                                  stroke                                                         ///
>                                                  lung_cancer                                            ///
>                                                  haem_cancer                                            ///
>                                                  other_cancer                                           ///
>                                                  esrf                                                           ///
>                                                  organ_transplant                                       ///
>                                                  hydroxychloroquine                                     ///
>                                                  leflunomide                                            ///
>                                                  methotrexate                                           ///
>                                                  methotrexate_inj                                       ///
>                                                  sulfasalazine                                          ///
>                                                  {
  2.                                                                  
.                 capture confirm string variable `var'
  3.                 if _rc!=0 {
  4.                         assert `var'==.
  5.                         rename `var' `var'_date
  6.                 }
  7.         
.                 else {
  8.                                 rename `var' `var'_dstr
  9.                                 gen `var'_date = date(`var'_dstr, "YMD") 
 10.                                 order `var'_date, after(`var'_dstr)
 11.                                 drop `var'_dstr
 12.                                 gen `var'_date15 = `var'_date+15
 13.                                 order `var'_date15, after(`var'_date)
 14.                                 drop `var'_date
 15.                                 rename `var'_date15 `var'_date
 16.                 }
 17.         
.         format `var'_date %td
 18. }
(90,000 missing values generated)
(90,000 missing values generated)
(1,000 missing values generated)
(1,000 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(1,000 missing values generated)
(1,000 missing values generated)
(1,000 missing values generated)
(1,000 missing values generated)
(1,000 missing values generated)
(1,000 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(90,000 missing values generated)
(90,000 missing values generated)
(90,000 missing values generated)
(90,000 missing values generated)
(90,000 missing values generated)
(90,000 missing values generated)
(90,000 missing values generated)
(90,000 missing values generated)
(90,000 missing values generated)
(90,000 missing values generated)

.                                                  
. **Rename variables with extra 'date' added to the end of variable names===========================================================*/ 
. rename rheum_appt_date_date rheum_appt_date

. rename ortho_appt_date_date ortho_appt_date

. rename tandortho_appt_date_date tandortho_appt_date

. rename eia_code_date_date eia_code_date

. rename ra_code_date_date ra_code_date

. rename psa_code_date_date psa_code_date

. rename anksp_code_date_date anksp_code_date

. rename died_date_ons_date died_ons_date

. rename last_gp_prerheum_date_date last_gp_prerheum_date

. rename last_gp_refrheum_date_date last_gp_refrheum_date

. rename last_gp_refcode_date_date last_gp_refcode_date

. rename last_gp_precode_date_date last_gp_precode_date

. rename hba1c_mmol_per_mol_date_date hba1c_mmol_per_mol_date

. rename hba1c_percentage_date_date hba1c_percentage_date

. rename creatinine_date_date creatinine_date

. rename creatinine creatinine_value 

. rename bmi_date_measured_date bmi_date

. rename bmi bmi_value

. 
. **Create binary indicator variables for relevant conditions ====================================================*/
. 
. foreach var of varlist   eia_code_date                                          ///
>                                                  rheum_appt_date                                        ///
>                                                  ortho_appt_date                                        ///
>                                                  tandortho_appt_date                            ///
>                                              ra_code_date                                               ///
>                                                  psa_code_date                                          ///
>                                                  anksp_code_date                                        ///
>                                                  died_ons_date                                          ///
>                                                  last_gp_prerheum_date                          ///
>                                                  last_gp_precode_date                           ///     
>                                                  last_gp_refrheum_date                          ///
>                                                  last_gp_refcode_date                           ///
>                                                  referral_rheum_prerheum_date           ///
>                                                  referral_rheum_precode_date            ///     
>                                                  chronic_cardiac_disease_date           ///
>                                                  diabetes_date                                          ///
>                                                  hypertension_date                                      ///
>                                                  chronic_resp_disease_date                      ///
>                                                  copd_date                                                      ///
>                                                  chronic_liver_disease_date                     ///
>                                                  stroke_date                                            ///
>                                                  lung_cancer_date                                       ///
>                                                  haem_cancer_date                                       ///             
>                                                  other_cancer_date                                      ///
>                                                  esrf_date                                                      ///
>                                                  creatinine_date                                        ///
>                                                  organ_transplant_date                          ///
>                                                  hydroxychloroquine_date                        ///     
>                                                  leflunomide_date                                       ///
>                                                  methotrexate_date                                      ///
>                                                  methotrexate_inj_date                          ///             
>                                                  sulfasalazine_date                                     ///
>                                                  abatacept_date                                         ///
>                                                  adalimumab_date                                        ///
>                                                  baricitinib_date                                       ///
>                                                  certolizumab_date                                      ///
>                                                  etanercept_date                                        ///
>                                                  golimumab_date                                         ///
>                                                  guselkumab_date                                        ///
>                                                  infliximab_date                                        ///
>                                                  ixekizumab_date                                        ///
>                                                  methotrexate_hcd_date                          ///
>                                                  rituximab_date                                         ///             
>                                                  sarilumab_date                                         ///
>                                                  secukinumab_date                                       ///
>                                                  tocilizumab_date                                       ///             
>                                                  tofacitinib_date                                       ///
>                                                  upadacitinib_date                                      ///
>                                                  ustekinumab_date   {                           
  2.         /*date ranges are applied in python, so presence of date indicates presence of 
>           disease in the correct time frame*/ 
.         local newvar =  substr("`var'", 1, length("`var'") - 5)
  3.         gen `newvar' = (`var'!=. )
  4.         order `newvar', after(`var')
  5. }

. 
. **Create and label variables ===========================================================*/
. 
. **Demographics
. ***Sex
. gen male = 1 if sex == "M"
(50,852 missing values generated)

. replace male = 0 if sex == "F"
(50,852 real changes made)

. lab var male "Male"

. tab male, missing

       Male |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     50,852       50.85       50.85
          1 |     49,148       49.15      100.00
------------+-----------------------------------
      Total |    100,000      100.00

. 
. ***Ethnicity
. replace ethnicity = .u if ethnicity == .
(25,000 real changes made, 25,000 to missing)

. ****rearrange in order of prevalence
. recode ethnicity 2=6 /* mixed to 6 */
(14879 changes made to ethnicity)

. recode ethnicity 3=2 /* south asian to 2 */
(7402 changes made to ethnicity)

. recode ethnicity 4=3 /* black to 3 */
(7541 changes made to ethnicity)

. recode ethnicity 6=4 /* mixed to 4 */
(14879 changes made to ethnicity)

. recode ethnicity 5=4 /* other to 4 */
(7389 changes made to ethnicity)

. 
. label define ethnicity  1 "White"                                       ///
>                                                 2 "Asian/Asian British"         ///
>                                                 3 "Black"                                       ///
>                                                 4 "Mixed/Other"                         ///
>                                                 .u "Missing"

. label values ethnicity ethnicity

. lab var ethnicity "Ethnicity"

. tab ethnicity, missing

          Ethnicity |      Freq.     Percent        Cum.
--------------------+-----------------------------------
              White |     37,789       37.79       37.79
Asian/Asian British |      7,402        7.40       45.19
              Black |      7,541        7.54       52.73
        Mixed/Other |     22,268       22.27       75.00
            Missing |     25,000       25.00      100.00
--------------------+-----------------------------------
              Total |    100,000      100.00

. 
. ***STP 
. rename stp stp_old

. bysort stp_old: gen stp = 1 if _n==1
(99,998 missing values generated)

. replace stp = sum(stp) //
(99,999 real changes made)

. drop stp_old

. 
. ***Regions
. encode region, gen(nuts_region)

. tab region, missing

                  region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
           East Midlands |     10,083       10.08       10.08
         East of England |     10,092       10.09       20.18
                  London |     19,895       19.89       40.07
              North East |     10,115       10.12       50.19
              North West |      9,857        9.86       60.04
              South East |     19,799       19.80       79.84
           West Midlands |     10,085       10.09       89.93
Yorkshire and the Humber |     10,074       10.07      100.00
-------------------------+-----------------------------------
                   Total |    100,000      100.00

. 
. ***IMD
. /*
> *Group into 5 groups
> rename imd imd_o
> egen imd = cut(imd_o), group(5) icodes 
> *Add one to create groups 1-5 
> replace imd = imd + 1
> *-1 is missing, should be excluded from population 
> replace imd = .u if imd_o == -1
> drop imd_o
> *Reverse the order (so high is more deprived)
> recode imd 5 = 1 4 = 2 3 = 3 2 = 4 1 = 5 .u = .u
> label define imd 1 "1 least deprived" 2 "2" 3 "3" 4 "4" 5 "5 most deprived" .u "Missing"
> label values imd imd 
> lab var imd "Index of multiple deprivation"
> */
. tab imd, missing

        imd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,026        5.03        5.03
          1 |     18,917       18.92       23.94
          2 |     19,030       19.03       42.97
          3 |     19,036       19.04       62.01
          4 |     19,202       19.20       81.21
          5 |     18,789       18.79      100.00
------------+-----------------------------------
      Total |    100,000      100.00

. 
. ***Age variables
. *Nb. works if ages 18 and over
. *Create categorised age
. drop if age<18 & age !=.
(21,192 observations deleted)

. drop if age>109 & age !=.
(0 observations deleted)

. drop if age==.
(0 observations deleted)

. lab var age "Age"

. 
. recode age 18/39.9999 = 1 /// 
>            40/49.9999 = 2 ///
>                    50/59.9999 = 3 ///
>                60/69.9999 = 4 ///
>                    70/79.9999 = 5 ///
>                    80/max = 6, gen(agegroup) 
(78808 differences between age and agegroup)

. 
. label define agegroup   1 "18-39" ///
>                                                 2 "40-49" ///
>                                                 3 "50-59" ///
>                                                 4 "60-69" ///
>                                                 5 "70-79" ///
>                                                 6 "80+"

.                                                 
. label values agegroup agegroup

. lab var agegroup "Age group"

. tab agegroup, missing

  Age group |      Freq.     Percent        Cum.
------------+-----------------------------------
      18-39 |     28,614       36.31       36.31
      40-49 |     12,965       16.45       52.76
      50-59 |     13,637       17.30       70.06
      60-69 |     10,591       13.44       83.50
      70-79 |      8,164       10.36       93.86
        80+ |      4,837        6.14      100.00
------------+-----------------------------------
      Total |     78,808      100.00

. 
. *Create binary age
. recode age min/69.999 = 0 ///
>            70/max = 1, gen(age70)
(78808 differences between age and age70)

. 
. ***Body Mass Index
. *Recode strange values 
. replace bmi_value = . if bmi_value == 0 
(31,575 real changes made, 31,575 to missing)

. replace bmi_value = . if !inrange(bmi_value, 10, 80)
(280 real changes made, 280 to missing)

. 
. *Restrict to within 10 years of EIA diagnosis date and aged>16 
. gen bmi_time = (eia_code_date - bmi_date)/365.25
(32,024 missing values generated)

. gen bmi_age = age - bmi_time
(32,024 missing values generated)

. replace bmi_value = . if bmi_age < 16 
(33,330 real changes made, 33,330 to missing)

. replace bmi_value = . if bmi_time > 10 & bmi_time != . 
(8,900 real changes made, 8,900 to missing)

. 
. *Set to missing if no date, and vice versa 
. replace bmi_value = . if bmi_date == . 
(0 real changes made)

. replace bmi_date = . if bmi_value == . 
(42,510 real changes made, 42,510 to missing)

. replace bmi_time = . if bmi_value == . 
(42,508 real changes made, 42,508 to missing)

. replace bmi_age = . if bmi_value == . 
(42,508 real changes made, 42,508 to missing)

. 
. *Create BMI categories
. gen     bmicat = .
(78,808 missing values generated)

. recode  bmicat . = 1 if bmi_value < 18.5
(228 changes made to bmicat)

. recode  bmicat . = 2 if bmi_value < 25
(508 changes made to bmicat)

. recode  bmicat . = 3 if bmi_value < 30
(704 changes made to bmicat)

. recode  bmicat . = 4 if bmi_value < 35
(886 changes made to bmicat)

. recode  bmicat . = 5 if bmi_value < 40
(880 changes made to bmicat)

. recode  bmicat . = 6 if bmi_value < .
(1517 changes made to bmicat)

. replace bmicat = .u if bmi_value >= .
(74,085 real changes made, 74,085 to missing)

. 
. label define bmicat 1 "Underweight (<18.5)"     ///
>                                         2 "Normal (18.5-24.9)"          ///
>                                         3 "Overweight (25-29.9)"        ///
>                                         4 "Obese I (30-34.9)"           ///
>                                         5 "Obese II (35-39.9)"          ///
>                                         6 "Obese III (40+)"                     ///
>                                         .u "Missing"

.                                         
. label values bmicat bmicat

. lab var bmicat "BMI"

. tab bmicat, missing

                 BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |        228        0.29        0.29
  Normal (18.5-24.9) |        508        0.64        0.93
Overweight (25-29.9) |        704        0.89        1.83
   Obese I (30-34.9) |        886        1.12        2.95
  Obese II (35-39.9) |        880        1.12        4.07
     Obese III (40+) |      1,517        1.92        5.99
             Missing |     74,085       94.01      100.00
---------------------+-----------------------------------
               Total |     78,808      100.00

. 
. *Create less granular categorisation
. recode bmicat 1/3 .u = 1 4 = 2 5 = 3 6 = 4, gen(obese4cat)
(78580 differences between bmicat and obese4cat)

. 
. label define obese4cat  1 "No record of obesity"        ///
>                                                 2 "Obese I (30-34.9)"           ///
>                                                 3 "Obese II (35-39.9)"          ///
>                                                 4 "Obese III (40+)"             

. 
. label values obese4cat obese4cat

. order obese4cat, after(bmicat)

. 
. ***Smoking 
. label define smoke 1 "Never" 2 "Former" 3 "Current" .u "Missing"

. 
. gen     smoke = 1  if smoking_status == "N"
(70,889 missing values generated)

. replace smoke = 2  if smoking_status == "E"
(3,893 real changes made)

. replace smoke = 3  if smoking_status == "S"
(23,592 real changes made)

. replace smoke = .u if smoking_status == "M"
(3,964 real changes made, 3,964 to missing)

. replace smoke = .u if smoking_status == "" 
(39,440 real changes made, 39,440 to missing)

. 
. label values smoke smoke

. lab var smoke "Smoking status"

. drop smoking_status

. tab smoke, missing

    Smoking |
     status |      Freq.     Percent        Cum.
------------+-----------------------------------
      Never |      7,919       10.05       10.05
     Former |      3,893        4.94       14.99
    Current |     23,592       29.94       44.92
    Missing |     43,404       55.08      100.00
------------+-----------------------------------
      Total |     78,808      100.00

. 
. *Create non-missing 3-category variable for current smoking (assumes missing smoking is never smoking)
. recode smoke .u = 1, gen(smoke_nomiss)
(43404 differences between smoke and smoke_nomiss)

. order smoke_nomiss, after(smoke)

. label values smoke_nomiss smoke

. 
. **Clinical comorbidities
. ***eGFR
. *Set implausible creatinine values to missing (Note: zero changed to missing)
. replace creatinine_value = . if !inrange(creatinine_value, 20, 3000) 
(19,724 real changes made, 19,724 to missing)

. 
. *Remove creatinine dates if no measurements, and vice versa 
. replace creatinine_value = . if creatinine_date == . 
(0 real changes made)

. replace creatinine_date = . if creatinine_value == . 
(15,787 real changes made, 15,787 to missing)

. replace creatinine = . if creatinine_value == .
(19,724 real changes made, 19,724 to missing)

. recode creatinine .=0
(19724 changes made to creatinine)

. tab creatinine, missing

 creatinine |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     19,724       25.03       25.03
          1 |     59,084       74.97      100.00
------------+-----------------------------------
      Total |     78,808      100.00

. tabstat creatinine_value, stat(n mean p50)

    Variable |         N      Mean       p50
-------------+------------------------------
creatinin~ue |     59084  137.0227  127.1305
--------------------------------------------

. 
. *Divide by 88.4 (to convert umol/l to mg/dl) 
. gen SCr_adj = creatinine_value/88.4
(19,724 missing values generated)

. 
. gen min = .
(78,808 missing values generated)

. replace min = SCr_adj/0.7 if male==0
(30,000 real changes made)

. replace min = SCr_adj/0.9 if male==1
(29,084 real changes made)

. replace min = min^-0.329  if male==0
(30,000 real changes made)

. replace min = min^-0.411  if male==1
(29,084 real changes made)

. replace min = 1 if min<1
(46,256 real changes made)

. 
. gen max=.
(78,808 missing values generated)

. replace max=SCr_adj/0.7 if male==0
(30,000 real changes made)

. replace max=SCr_adj/0.9 if male==1
(29,084 real changes made)

. replace max=max^-1.209
(59,084 real changes made)

. replace max=1 if max>1
(32,552 real changes made)

. 
. gen egfr=min*max*141
(19,724 missing values generated)

. replace egfr=egfr*(0.993^age)
(59,084 real changes made)

. replace egfr=egfr*1.018 if male==0
(30,000 real changes made)

. label var egfr "egfr calculated using CKD-EPI formula with no ethnicity"

. 
. *Categorise into ckd stages
. egen egfr_cat_all = cut(egfr), at(0, 15, 30, 45, 60, 5000)
(19,724 missing values generated)

. recode egfr_cat_all 0 = 5 15 = 4 30 = 3 45 = 2 60 = 0, generate(ckd_egfr)
(59084 differences between egfr_cat_all and ckd_egfr)

. 
. gen egfr_cat = .
(78,808 missing values generated)

. recode egfr_cat . = 3 if egfr < 30
(13919 changes made to egfr_cat)

. recode egfr_cat . = 2 if egfr < 60
(20996 changes made to egfr_cat)

. recode egfr_cat . = 1 if egfr < .
(24169 changes made to egfr_cat)

. replace egfr_cat = .u if egfr >= .
(19,724 real changes made, 19,724 to missing)

. 
. label define egfr_cat   1 ">=60"                ///
>                                                 2 "30-59"               ///
>                                                 3 "<30"                 ///
>                                                 .u "Missing"

.                                         
. label values egfr_cat egfr_cat

. lab var egfr_cat "eGFR"

. tab egfr_cat, missing

       eGFR |      Freq.     Percent        Cum.
------------+-----------------------------------
       >=60 |     24,169       30.67       30.67
      30-59 |     20,996       26.64       57.31
        <30 |     13,919       17.66       74.97
    Missing |     19,724       25.03      100.00
------------+-----------------------------------
      Total |     78,808      100.00

. 
. *If missing eGFR, assume normal
. gen egfr_cat_nomiss = egfr_cat
(19,724 missing values generated)

. replace egfr_cat_nomiss = 1 if egfr_cat == .u
(19,724 real changes made)

. 
. label define egfr_cat_nomiss    1 ">=60/missing"        ///
>                                                                 2 "30-59"                       ///
>                                                                 3 "<30" 

. label values egfr_cat_nomiss egfr_cat_nomiss

. lab var egfr_cat_nomiss "eGFR"

. 
. gen egfr_date = creatinine_date
(19,724 missing values generated)

. format egfr_date %td

. 
. *Add in end stage renal failure and create a single CKD variable 
. *Missing assumed to not have CKD 
. gen ckd = 0

. replace ckd = 1 if ckd_egfr != . & ckd_egfr >= 1
(34,915 real changes made)

. replace ckd = 1 if esrf == 1
(8,762 real changes made)

. 
. label define ckd 0 "No CKD" 1 "CKD"

. label values ckd ckd

. label var ckd "Chronic kidney disease"

. tab ckd, missing

    Chronic |
     kidney |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
     No CKD |     35,131       44.58       44.58
        CKD |     43,677       55.42      100.00
------------+-----------------------------------
      Total |     78,808      100.00

. 
. *Create date (most recent measure prior to index)
. gen temp1_ckd_date = creatinine_date if ckd_egfr >=1
(43,893 missing values generated)

. gen temp2_ckd_date = esrf_date if esrf == 1
(63,035 missing values generated)

. gen ckd_date = max(temp1_ckd_date,temp2_ckd_date) 
(35,131 missing values generated)

. format ckd_date %td 

. 
. drop temp1_ckd_date temp2_ckd_date SCr_adj min max ckd_egfr egfr_cat_all

. 
. ***HbA1c
. *Set zero or negative to missing
. replace hba1c_percentage   = . if hba1c_percentage <= 0
(4,405 real changes made, 4,405 to missing)

. replace hba1c_mmol_per_mol = . if hba1c_mmol_per_mol <= 0
(5,654 real changes made, 5,654 to missing)

. 
. *Change implausible values to missing
. replace hba1c_percentage   = . if !inrange(hba1c_percentage, 1, 20)
(1,196 real changes made, 1,196 to missing)

. replace hba1c_mmol_per_mol = . if !inrange(hba1c_mmol_per_mol, 10, 200)
(3,220 real changes made, 3,220 to missing)

. 
. *Set most recent values of >24 months prior to EIA diagnosis date to missing
. replace hba1c_percentage   = . if (eia_code_date - hba1c_percentage_date) > 24*30 & hba1c_percentage_date != .
(70,862 real changes made, 70,862 to missing)

. replace hba1c_mmol_per_mol = . if (eia_code_date - hba1c_mmol_per_mol_date) > 24*30 & hba1c_mmol_per_mol_date != .
(67,737 real changes made, 67,737 to missing)

. 
. *Clean up dates
. replace hba1c_percentage_date = . if hba1c_percentage == .
(72,536 real changes made, 72,536 to missing)

. replace hba1c_mmol_per_mol_date = . if hba1c_mmol_per_mol == .
(72,672 real changes made, 72,672 to missing)

. 
. *Express  HbA1c as percentage
. *Express all values as perecentage 
. noi summ hba1c_percentage hba1c_mmol_per_mol 

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
hba1c_per~ge |      2,345    5.146496    1.884718   1.003478   11.68054
hba1c_mmol~l |      2,197    42.61599    17.26286   10.09229   102.1114

. gen     hba1c_pct = hba1c_percentage 
(76,463 missing values generated)

. replace hba1c_pct = (hba1c_mmol_per_mol/10.929)+2.15 if hba1c_mmol_per_mol<. 
(2,197 real changes made)

. 
. *Valid % range between 0-20  
. replace hba1c_pct = . if !inrange(hba1c_pct, 1, 20) 
(0 real changes made)

. replace hba1c_pct = round(hba1c_pct, 0.1)
(4,484 real changes made)

. 
. *Categorise HbA1c and diabetes
. *Group hba1c pct
. gen     hba1ccat = 0 if hba1c_pct <  6.5
(75,745 missing values generated)

. replace hba1ccat = 1 if hba1c_pct >= 6.5  & hba1c_pct < 7.5
(738 real changes made)

. replace hba1ccat = 2 if hba1c_pct >= 7.5  & hba1c_pct < 8
(228 real changes made)

. replace hba1ccat = 3 if hba1c_pct >= 8    & hba1c_pct < 9
(304 real changes made)

. replace hba1ccat = 4 if hba1c_pct >= 9    & hba1c_pct !=.
(151 real changes made)

. label define hba1ccat 0 "<6.5%" 1">=6.5-7.4" 2">=7.5-7.9" 3">=8-8.9" 4">=9"

. label values hba1ccat hba1ccat

. tab hba1ccat, missing

   hba1ccat |      Freq.     Percent        Cum.
------------+-----------------------------------
      <6.5% |      3,063        3.89        3.89
  >=6.5-7.4 |        738        0.94        4.82
  >=7.5-7.9 |        228        0.29        5.11
    >=8-8.9 |        304        0.39        5.50
        >=9 |        151        0.19        5.69
          . |     74,324       94.31      100.00
------------+-----------------------------------
      Total |     78,808      100.00

. 
. *Express all values as mmol
. gen hba1c_mmol = hba1c_mmol_per_mol
(76,611 missing values generated)

. replace hba1c_mmol = (hba1c_percentage*10.929)-23.5 if hba1c_percentage<. & hba1c_mmol==.
(2,287 real changes made)

. 
. *Group hba1c mmol
. gen     hba1ccatmm = 0 if hba1c_mmol < 58
(75,004 missing values generated)

. replace hba1ccatmm = 1 if hba1c_mmol >= 58 & hba1c_mmol !=.
(680 real changes made)

. replace hba1ccatmm =.u if hba1ccatmm==. 
(74,324 real changes made, 74,324 to missing)

. label define hba1ccatmm 0 "HbA1c <58mmol/mol" 1 "HbA1c >=58mmol/mol" .u "Missing"

. label values hba1ccatmm hba1ccatmm

. lab var hba1ccatmm "HbA1c"

. tab hba1ccatmm, missing

             HbA1c |      Freq.     Percent        Cum.
-------------------+-----------------------------------
 HbA1c <58mmol/mol |      3,804        4.83        4.83
HbA1c >=58mmol/mol |        680        0.86        5.69
           Missing |     74,324       94.31      100.00
-------------------+-----------------------------------
             Total |     78,808      100.00

. 
. *Create diabetes, split by control/not (assumes missing = no diabetes)
. gen     diabcat = 1 if diabetes==0
(15,795 missing values generated)

. replace diabcat = 2 if diabetes==1 & inlist(hba1ccat, 0, 1)
(767 real changes made)

. replace diabcat = 3 if diabetes==1 & inlist(hba1ccat, 2, 3, 4)
(130 real changes made)

. replace diabcat = 4 if diabetes==1 & !inlist(hba1ccat, 0, 1, 2, 3, 4)
(14,898 real changes made)

. 
. label define diabcat    1 "No diabetes"                         ///
>                                                 2 "Controlled diabetes"         ///
>                                                 3 "Uncontrolled diabetes"       ///
>                                                 4 "Diabetes, no hba1c measure"

. label values diabcat diabcat

. 
. *Create cancer variable 'other cancer currently', includes carcinoma of the head and neck - need to confirm if this excludes NMSC
. gen cancer =0

. replace cancer =1 if lung_cancer ==1 | haem_cancer ==1 | other_cancer ==1
(38,527 real changes made)

. lab var cancer "Cancer"

. tab cancer, missing

     Cancer |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     40,281       51.11       51.11
          1 |     38,527       48.89      100.00
------------+-----------------------------------
      Total |     78,808      100.00

. 
. *Create other comorbid variables
. gen combined_cv_comorbid =1 if chronic_cardiac_disease ==1 | stroke==1
(50,434 missing values generated)

. recode combined_cv_comorbid .=0
(50434 changes made to combined_cv_comorbid)

. 
. *Label variables
. lab var hypertension "Hypertension"

. lab var diabetes "Diabetes"

. lab var stroke "Stroke"

. lab var chronic_resp_disease "Chronic respiratory disease"

. lab var copd "COPD"

. lab var esrf "End-stage renal failure"

. lab var chronic_liver_disease "Chronic liver disease"

. lab var chronic_cardiac_disease "Chronic cardiac disease"

. 
. drop age

. 
. *Refine diagnostic window=============================================================*/
. 
. **All patients should have EIA code
. tab eia_code, missing

   eia_code |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        777        0.99        0.99
          1 |     78,031       99.01      100.00
------------+-----------------------------------
      Total |     78,808      100.00

. keep if eia_code==1
(777 observations deleted)

. 
. **Keep patients with first EIA code in GP record if code was after 1st March 2019
. keep if eia_code_date>=date("$start_date", "DMY") & eia_code_date!=. 
(18,245 observations deleted)

. tab eia_code

   eia_code |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     59,786      100.00      100.00
------------+-----------------------------------
      Total |     59,786      100.00

. 
. **Month/Year of EIA code
. gen year_diag=year(eia_code_date)

. format year_diag %ty

. gen month_diag=month(eia_code_date)

. gen mo_year_diagn=ym(year_diag, month_diag)

. format mo_year_diagn %tm

. 
. *Include only most recent EIA sub-diagnosis=============================================*/
. 
. replace ra_code =0 if psa_code_date >= ra_code_date & psa_code_date !=.
(29,343 real changes made)

. replace ra_code =0 if anksp_code_date >= ra_code_date & anksp_code_date !=.
(9,924 real changes made)

. replace psa_code =0 if ra_code_date >= psa_code_date & ra_code_date !=.
(29,302 real changes made)

. replace psa_code =0 if anksp_code_date >= psa_code_date & anksp_code_date !=.
(10,046 real changes made)

. replace anksp_code =0 if psa_code_date >= anksp_code_date & psa_code_date !=.
(29,200 real changes made)

. replace anksp_code =0 if ra_code_date >= anksp_code_date & ra_code_date !=.
(10,024 real changes made)

. gen eia_diagnosis=1 if ra_code==1
(39,871 missing values generated)

. replace eia_diagnosis=2 if psa_code==1
(19,859 real changes made)

. replace eia_diagnosis=3 if anksp_code==1
(19,955 real changes made)

. lab define eia_diagnosis 1 "RA" 2 "PsA" 3 "AxSpA", modify

. lab val eia_diagnosis eia_diagnosis

. tab eia_diagnosis, missing

eia_diagnos |
         is |      Freq.     Percent        Cum.
------------+-----------------------------------
         RA |     19,915       33.31       33.31
        PsA |     19,859       33.22       66.53
      AxSpA |     19,955       33.38       99.90
          . |         57        0.10      100.00
------------+-----------------------------------
      Total |     59,786      100.00

. drop if eia_diagnosis==. //should be ~none
(57 observations deleted)

. 
. *Define drugs and dates=====================================================*/
. 
. **csDMARDs (not including high cost MTX; wouldn't be shared care)
. gen csdmard=1 if hydroxychloroquine==1 | leflunomide==1 | methotrexate==1 | methotrexate_inj==1 | sulfasalazine==1
(35,283 missing values generated)

. recode csdmard .=0 
(35283 changes made to csdmard)

. tab csdmard, missing

    csdmard |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     35,283       59.07       59.07
          1 |     24,446       40.93      100.00
------------+-----------------------------------
      Total |     59,729      100.00

. bys eia_diagnosis: tab csdmard

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

    csdmard |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     11,761       59.06       59.06
          1 |      8,154       40.94      100.00
------------+-----------------------------------
      Total |     19,915      100.00

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    csdmard |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     11,681       58.82       58.82
          1 |      8,178       41.18      100.00
------------+-----------------------------------
      Total |     19,859      100.00

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    csdmard |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     11,841       59.34       59.34
          1 |      8,114       40.66      100.00
------------+-----------------------------------
      Total |     19,955      100.00


. 
. **csDMARDs (including high cost MTX)
. gen csdmard_hcd=1 if hydroxychloroquine==1 | leflunomide==1 | methotrexate==1 | methotrexate_inj==1 | methotrexate_hcd==1 | sulfasalazine==1
(31,766 missing values generated)

. recode csdmard_hcd .=0 
(31766 changes made to csdmard_hcd)

. tab csdmard_hcd, missing

csdmard_hcd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     31,766       53.18       53.18
          1 |     27,963       46.82      100.00
------------+-----------------------------------
      Total |     59,729      100.00

. bys eia_diagnosis: tab csdmard_hcd, missing

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

csdmard_hcd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,595       53.20       53.20
          1 |      9,320       46.80      100.00
------------+-----------------------------------
      Total |     19,915      100.00

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

csdmard_hcd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,496       52.85       52.85
          1 |      9,363       47.15      100.00
------------+-----------------------------------
      Total |     19,859      100.00

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

csdmard_hcd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,675       53.50       53.50
          1 |      9,280       46.50      100.00
------------+-----------------------------------
      Total |     19,955      100.00


. 
. **Date of first csDMARD script (not including high cost MTX prescriptions)
. gen csdmard_date=min(hydroxychloroquine_date, leflunomide_date, methotrexate_date, methotrexate_inj_date, sulfasalazine_date)
(35,283 missing values generated)

. format %td csdmard_date

. 
. **Date of first csDMARD script (including high cost MTX prescriptions)
. gen csdmard_hcd_date=min(hydroxychloroquine_date, leflunomide_date, methotrexate_date, methotrexate_inj_date, methotrexate_hcd_date, sulfasalazine_date)
(31,766 missing values generated)

. format %td csdmard_hcd_date

. 
. **Biologic use
. gen biologic=1 if abatacept==1 | adalimumab==1 | baricitinib==1 | certolizumab==1 | etanercept==1 | golimumab==1 | guselkumab==1 | infliximab==1 | ixekizumab==1 | rituximab==1 | sarilumab==1 | secukinumab==1 | to
> cilizumab==1 | tofacitinib==1 | upadacitinib==1 | ustekinumab==1 
(11,140 missing values generated)

. recode biologic .=0
(11140 changes made to biologic)

. tab biologic, missing

   biologic |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     11,140       18.65       18.65
          1 |     48,589       81.35      100.00
------------+-----------------------------------
      Total |     59,729      100.00

. bys eia_diagnosis: tab biologic, missing 

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

   biologic |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,735       18.75       18.75
          1 |     16,180       81.25      100.00
------------+-----------------------------------
      Total |     19,915      100.00

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

   biologic |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,711       18.69       18.69
          1 |     16,148       81.31      100.00
------------+-----------------------------------
      Total |     19,859      100.00

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

   biologic |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,694       18.51       18.51
          1 |     16,261       81.49      100.00
------------+-----------------------------------
      Total |     19,955      100.00


. 
. **Date of first biologic script
. gen biologic_date=min(abatacept_date, adalimumab_date, baricitinib_date, certolizumab_date, etanercept_date, golimumab_date, guselkumab_date, infliximab_date, ixekizumab_date, rituximab_date, sarilumab_date, secu
> kinumab_date, tocilizumab_date, tofacitinib_date, upadacitinib_date, ustekinumab_date)
(11,140 missing values generated)

. format %td biologic_date

. 
. **Exclude if first csdmard or biologic was before first rheum appt
. ***Nb. could introduce leeway e.g. 30 days?
. tab csdmard if rheum_appt_date!=. & csdmard_date!=. & csdmard_date<rheum_appt_date

    csdmard |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      9,027      100.00      100.00
------------+-----------------------------------
      Total |      9,027      100.00

. drop if rheum_appt_date!=. & csdmard_date!=. & csdmard_date<rheum_appt_date
(9,027 observations deleted)

. tab biologic if rheum_appt_date!=. & biologic_date!=. & biologic_date<rheum_appt_date 

   biologic |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     15,319      100.00      100.00
------------+-----------------------------------
      Total |     15,319      100.00

. drop if rheum_appt_date!=. & biologic_date!=. & biologic_date<rheum_appt_date 
(15,319 observations deleted)

. 
. *Number of EIA diagnoses in 1-year time windows=========================================*/
. 
. gen diagnosis_year=1 if eia_code_date>=td(01mar2019) & eia_code_date<td(01mar2020)
(24,161 missing values generated)

. replace diagnosis_year=2 if eia_code_date>=td(01mar2020) & eia_code_date<td(01mar2021)
(11,168 real changes made)

. replace diagnosis_year=3 if eia_code_date>=td(01mar2021) & eia_code_date<td(01mar2022)
(11,271 real changes made)

. lab define diagnosis_year 1 "March 2019-March 2020" 2 "March 2020-March 2021" 3 "March 2021-March 2022", modify

. lab val diagnosis_year diagnosis_year

. lab var diagnosis_year "Year of diagnosis"

. tab diagnosis_year, missing

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |     11,222       31.72       31.72
March 2020-March 2021 |     11,168       31.56       63.28
March 2021-March 2022 |     11,271       31.85       95.13
                    . |      1,722        4.87      100.00
----------------------+-----------------------------------
                Total |     35,383      100.00

. bys eia_diagnosis: tab diagnosis_year, missing

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |      3,796       31.98       31.98
March 2020-March 2021 |      3,724       31.38       63.36
March 2021-March 2022 |      3,746       31.56       94.92
                    . |        603        5.08      100.00
----------------------+-----------------------------------
                Total |     11,869      100.00

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |      3,691       31.40       31.40
March 2020-March 2021 |      3,758       31.97       63.37
March 2021-March 2022 |      3,787       32.22       95.59
                    . |        518        4.41      100.00
----------------------+-----------------------------------
                Total |     11,754      100.00

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |      3,735       31.76       31.76
March 2020-March 2021 |      3,686       31.34       63.10
March 2021-March 2022 |      3,738       31.79       94.89
                    . |        601        5.11      100.00
----------------------+-----------------------------------
                Total |     11,760      100.00


. 
. **Proportion of patients with at least 6 or 12 months of GP follow-up after EIA code
. tab has_6m_follow_up

has_6m_foll |
      ow_up |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,796        5.08        5.08
          1 |     33,587       94.92      100.00
------------+-----------------------------------
      Total |     35,383      100.00

. tab has_12m_follow_up

has_12m_fol |
     low_up |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,516        9.94        9.94
          1 |     31,867       90.06      100.00
------------+-----------------------------------
      Total |     35,383      100.00

. tab mo_year_diagn has_6m_follow_up

mo_year_di |   has_6m_follow_up
       agn |         0          1 |     Total
-----------+----------------------+----------
    2019m3 |        43        972 |     1,015 
    2019m4 |        51        926 |       977 
    2019m5 |        44        861 |       905 
    2019m6 |        46        898 |       944 
    2019m7 |        53        891 |       944 
    2019m8 |        44        883 |       927 
    2019m9 |        48        882 |       930 
   2019m10 |        34        945 |       979 
   2019m11 |        53        832 |       885 
   2019m12 |        50        876 |       926 
    2020m1 |        54        852 |       906 
    2020m2 |        52        832 |       884 
    2020m3 |        53        870 |       923 
    2020m4 |        44        854 |       898 
    2020m5 |        44        952 |       996 
    2020m6 |        42        839 |       881 
    2020m7 |        41        890 |       931 
    2020m8 |        55        894 |       949 
    2020m9 |        45        871 |       916 
   2020m10 |        49        935 |       984 
   2020m11 |        42        837 |       879 
   2020m12 |        38        946 |       984 
    2021m1 |        53        897 |       950 
    2021m2 |        46        831 |       877 
    2021m3 |        54        882 |       936 
    2021m4 |        48        891 |       939 
    2021m5 |        46        932 |       978 
    2021m6 |        44        848 |       892 
    2021m7 |        36        912 |       948 
    2021m8 |        49        904 |       953 
    2021m9 |        52        925 |       977 
   2021m10 |        48        888 |       936 
   2021m11 |        44        877 |       921 
   2021m12 |        48        914 |       962 
    2022m1 |        60        923 |       983 
    2022m2 |        45        801 |       846 
    2022m3 |        56        918 |       974 
    2022m4 |        42        706 |       748 
-----------+----------------------+----------
     Total |     1,796     33,587 |    35,383 

. tab mo_year_diagn has_12m_follow_up

mo_year_di |   has_12m_follow_up
       agn |         0          1 |     Total
-----------+----------------------+----------
    2019m3 |        97        918 |     1,015 
    2019m4 |        98        879 |       977 
    2019m5 |        87        818 |       905 
    2019m6 |        98        846 |       944 
    2019m7 |        81        863 |       944 
    2019m8 |       106        821 |       927 
    2019m9 |       103        827 |       930 
   2019m10 |        88        891 |       979 
   2019m11 |        81        804 |       885 
   2019m12 |       111        815 |       926 
    2020m1 |        80        826 |       906 
    2020m2 |        84        800 |       884 
    2020m3 |       113        810 |       923 
    2020m4 |        89        809 |       898 
    2020m5 |        81        915 |       996 
    2020m6 |        86        795 |       881 
    2020m7 |        90        841 |       931 
    2020m8 |        92        857 |       949 
    2020m9 |        89        827 |       916 
   2020m10 |        90        894 |       984 
   2020m11 |        94        785 |       879 
   2020m12 |        96        888 |       984 
    2021m1 |        92        858 |       950 
    2021m2 |        75        802 |       877 
    2021m3 |       101        835 |       936 
    2021m4 |        98        841 |       939 
    2021m5 |        87        891 |       978 
    2021m6 |       108        784 |       892 
    2021m7 |        93        855 |       948 
    2021m8 |        87        866 |       953 
    2021m9 |       103        874 |       977 
   2021m10 |        99        837 |       936 
   2021m11 |        88        833 |       921 
   2021m12 |        93        869 |       962 
    2022m1 |        92        891 |       983 
    2022m2 |        83        763 |       846 
    2022m3 |        98        876 |       974 
    2022m4 |        85        663 |       748 
-----------+----------------------+----------
     Total |     3,516     31,867 |    35,383 

. tab diagnosis_year if has_6m_follow_up==1, missing

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |     10,650       31.71       31.71
March 2020-March 2021 |     10,616       31.61       63.32
March 2021-March 2022 |     10,697       31.85       95.16
                    . |      1,624        4.84      100.00
----------------------+-----------------------------------
                Total |     33,587      100.00

. tab diagnosis_year if has_12m_follow_up==1, missing

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |     10,108       31.72       31.72
March 2020-March 2021 |     10,081       31.63       63.35
March 2021-March 2022 |     10,139       31.82       95.17
                    . |      1,539        4.83      100.00
----------------------+-----------------------------------
                Total |     31,867      100.00

. 
. *Define appointments and referrals======================================*/
. **Nb. not excluding those without 6m+ follow-up
. 
. **Rheumatology appt 
. tab rheum_appt, missing  //proportion with first rheum outpatient date in the year before EIA code appears in GP record (could change to two years)

 rheum_appt |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,055       17.11       17.11
          1 |     29,328       82.89      100.00
------------+-----------------------------------
      Total |     35,383      100.00

. tab rheum_appt if rheum_appt_date<eia_code_date & rheum_appt_date!=. //confirm proportion who had rheum appt (i.e. not missing) and appt before EIA code (should be accounted for by Python code)

 rheum_appt |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     23,670      100.00      100.00
------------+-----------------------------------
      Total |     23,670      100.00

. 
. **Ortho
. tab ortho_appt, missing

 ortho_appt |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,511        9.92        9.92
          1 |     31,872       90.08      100.00
------------+-----------------------------------
      Total |     35,383      100.00

. codebook ortho_appt_date

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
ortho_appt_date                                                                                                                                                                                            (unlabeled)
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

                  Type: Numeric daily date (float)

                 Range: [21260,22759]                 Units: 1
       Or equivalently: [17mar2018,24apr2022]         Units: days
         Unique values: 1,500                     Missing .: 3,511/35,383

                  Mean: 22008.6 = 03apr2020(+ 14 hours)
             Std. dev.: 433.333
           Percentiles:       10%        25%        50%        75%        90%
                            21409      21632      22008      22381      22612
                        13aug2018  24mar2019  03apr2020  11apr2021  28nov2021

. tab tandortho_appt, missing

tandortho_a |
        ppt |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,550       10.03       10.03
          1 |     31,833       89.97      100.00
------------+-----------------------------------
      Total |     35,383      100.00

. codebook tandortho_appt_date

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
tandortho_appt_date                                                                                                                                                                                        (unlabeled)
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

                  Type: Numeric daily date (float)

                 Range: [21260,22759]                 Units: 1
       Or equivalently: [17mar2018,24apr2022]         Units: days
         Unique values: 1,500                     Missing .: 3,550/35,383

                  Mean: 22009.2 = 04apr2020(+ 6 hours)
             Std. dev.: 434.789
           Percentiles:       10%        25%        50%        75%        90%
                            21406      21627      22013      22389      22607
                        10aug2018  19mar2019  08apr2020  19apr2021  23nov2021

. 
. **Rheumatology referrals
. tab referral_rheum_prerheum //last rheum referral in the year before rheumatology outpatient (requires rheum appt to have been present, and rheum appt to be before EIA code)

referral_rh |
eum_prerheu |
          m |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,604       10.19       10.19
          1 |     31,779       89.81      100.00
------------+-----------------------------------
      Total |     35,383      100.00

. tab referral_rheum_prerheum if rheum_appt!=0  //last rheum referral in the year before rheumatology outpatient if rheum appt date present

referral_rh |
eum_prerheu |
          m |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,983       10.17       10.17
          1 |     26,345       89.83      100.00
------------+-----------------------------------
      Total |     29,328      100.00

. tab referral_rheum_prerheum if rheum_appt!=0 & referral_rheum_prerheum_date<rheum_appt_date  //last rheum referral in the year before rheumatology outpatient, assuming ref date before rheum appt date (should be a
> ccounted for by Python code)

referral_rh |
eum_prerheu |
          m |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      8,632      100.00      100.00
------------+-----------------------------------
      Total |      8,632      100.00

. tab referral_rheum_precode //last rheum referral in the year before EIA code (could use if rheum appt missing)

referral_rh |
eum_precode |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,557       10.05       10.05
          1 |     31,826       89.95      100.00
------------+-----------------------------------
      Total |     35,383      100.00

. gen referral_rheum_comb_date = referral_rheum_prerheum_date if referral_rheum_prerheum_date!=.
(3,604 missing values generated)

. replace referral_rheum_comb_date = referral_rheum_precode_date if referral_rheum_prerheum_date==. & referral_rheum_precode_date!=.
(3,254 real changes made)

. format %td referral_rheum_comb_date

. codebook referral_rheum_comb_date

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
referral_rheum_comb_date                                                                                                                                                                                   (unlabeled)
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

                  Type: Numeric daily date (float)

                 Range: [21260,22759]                 Units: 1
       Or equivalently: [17mar2018,24apr2022]         Units: days
         Unique values: 1,500                     Missing .: 350/35,383

                  Mean: 22013.4 = 08apr2020(+ 9 hours)
             Std. dev.: 433.532
           Percentiles:       10%        25%        50%        75%        90%
                            21412      21637      22016      22389      22613
                        16aug2018  29mar2019  11apr2020  19apr2021  29nov2021

. 
. **GP appointments
. tab last_gp_refrheum //proportion with last GP appointment in year before rheum referral (pre-rheum appt); requires there to have been a rheum referral, before a rheum appt, before an EIA code

last_gp_ref |
      rheum |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,510        9.92        9.92
          1 |     31,873       90.08      100.00
------------+-----------------------------------
      Total |     35,383      100.00

. gen all_appts=1 if last_gp_refrheum==1 & referral_rheum_prerheum==1 & rheum_appt==1 & eia_code==1 & last_gp_refrheum_date<referral_rheum_prerheum_date & referral_rheum_prerheum_date<rheum_appt_date & rheum_appt_d
> ate<eia_code_date 
(34,398 missing values generated)

. recode all_appts .=0
(34398 changes made to all_appts)

. tab all_appts, missing //KEY - proportion who had a last gp appt, then rheum ref, then rheum appt, then EIA code 

  all_appts |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     34,398       97.22       97.22
          1 |        985        2.78      100.00
------------+-----------------------------------
      Total |     35,383      100.00

. tab last_gp_refcode //last GP appointment before rheum ref (i.e. pre-eia code ref); requires there to have been a rheum referral before an EIA code (i.e. rheum appt could have been missing)

last_gp_ref |
       code |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,558       10.06       10.06
          1 |     31,825       89.94      100.00
------------+-----------------------------------
      Total |     35,383      100.00

. tab last_gp_prerheum //last GP appointment before rheum appt; requires there to have been a rheum appt before and EIA code

last_gp_pre |
      rheum |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,599       10.17       10.17
          1 |     31,784       89.83      100.00
------------+-----------------------------------
      Total |     35,383      100.00

. tab last_gp_precode //last GP appointment before EIA code

last_gp_pre |
       code |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,538       10.00       10.00
          1 |     31,845       90.00      100.00
------------+-----------------------------------
      Total |     35,383      100.00

. 
. **For sensitivity analyses for those without rheum_appt, replace diagnosis date as EIA code date if rheum appt pre-code is missing or after
. gen eia_diagnosis_date_nomiss=rheum_appt_date if rheum_appt_date!=.
(6,055 missing values generated)

. format %td eia_diagnosis_date_nomiss

. replace eia_diagnosis_date_nomiss=eia_code_date if (rheum_appt_date==. | rheum_appt_date>eia_code_date) & eia_code_date!=.
(11,701 real changes made)

. gen eia_diagnosis_nomiss=1 if eia_diagnosis_date_nomiss!=.

. recode eia_diagnosis_nomiss .=0
(0 changes made to eia_diagnosis_nomiss)

. tab eia_diagnosis_nomiss

eia_diagnos |
  is_nomiss |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     35,383      100.00      100.00
------------+-----------------------------------
      Total |     35,383      100.00

. 
. *Time to referral, appointment and EIA code=============================================*/
. 
. **Time from last GP to rheum ref before rheum appt (i.e. if appts are present and in correct time order) //Note - referral could (in theory) be coded just before GP appt
. gen time_gp_rheum_ref_appt = (referral_rheum_prerheum_date - last_gp_refrheum_date) if referral_rheum_prerheum_date!=. & last_gp_refrheum_date!=. & rheum_appt_date!=. & referral_rheum_prerheum_date>last_gp_refrhe
> um_date & referral_rheum_prerheum_date<rheum_appt_date & rheum_appt_date<eia_code_date
(34,398 missing values generated)

. tabstat time_gp_rheum_ref_appt, stats (n mean p50 p25 p75) //all patients (should be same number as all_appts)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~t |       985  250.8731       204        88       352
----------------------------------------------------------------

. 
. gen gp_ref_cat=1 if time_gp_rheum_ref_appt<=3 & time_gp_rheum_ref_appt!=. 
(35,372 missing values generated)

. replace gp_ref_cat=2 if time_gp_rheum_ref_appt<=7 & time_gp_rheum_ref_appt!=. & gp_ref_cat==.
(19 real changes made)

. replace gp_ref_cat=3 if time_gp_rheum_ref_appt>7 & time_gp_rheum_ref_appt!=. & gp_ref_cat==.
(955 real changes made)

. lab define gp_ref_cat 1 "Referred within 3 days" 2 "Referred within 7 days" 3 "Referral delay >7 days", modify

. lab val gp_ref_cat gp_ref_cat

. lab var gp_ref_cat "Time to GP referral"

. tab gp_ref_cat, missing

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |         11        0.03        0.03
Referred within 7 days |         19        0.05        0.08
Referral delay >7 days |        955        2.70        2.78
                     . |     34,398       97.22      100.00
-----------------------+-----------------------------------
                 Total |     35,383      100.00

. 
. gen gp_ref_3d=1 if time_gp_rheum_ref_appt<=3 & time_gp_rheum_ref_appt!=. 
(35,372 missing values generated)

. replace gp_ref_3d=2 if time_gp_rheum_ref_appt>3 & time_gp_rheum_ref_appt!=.
(974 real changes made)

. lab define gp_ref_3d 1 "Referred within 3 days" 2 "Referral delay >3 days", modify

. lab val gp_ref_3d gp_ref_3d

. lab var gp_ref_3d "Time to GP referral"

. tab gp_ref_3d, missing

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |         11        0.03        0.03
Referral delay >3 days |        974        2.75        2.78
                     . |     34,398       97.22      100.00
-----------------------+-----------------------------------
                 Total |     35,383      100.00

. 
. **Time from last GP to rheum ref before eia code (sensitivity analysis; includes those with no rheum appt)
. gen time_gp_rheum_ref_code = (referral_rheum_precode_date - last_gp_refcode_date) if referral_rheum_precode_date!=. & last_gp_refcode_date!=. & referral_rheum_precode_date>last_gp_refcode_date & referral_rheum_pr
> ecode_date<eia_code_date
(29,271 missing values generated)

. tabstat time_gp_rheum_ref_code, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~e |      6112  383.6168       325       144       560
----------------------------------------------------------------

. 
. **Time from last GP to rheum ref (combined - sensitivity analysis; includes those with no rheum appt)
. gen time_gp_rheum_ref_comb = time_gp_rheum_ref_appt 
(34,398 missing values generated)

. replace time_gp_rheum_ref_comb = time_gp_rheum_ref_code if time_gp_rheum_ref_appt==. & time_gp_rheum_ref_code!=.
(5,867 real changes made)

. tabstat time_gp_rheum_ref_comb, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~b |      6852   363.258       298       134       528
----------------------------------------------------------------

. 
. **Time from last GP pre-rheum appt to first rheum appt (key sensitivity analysis; includes those with no rheum ref)
. gen time_gp_rheum_appt = (rheum_appt_date - last_gp_prerheum_date) if rheum_appt_date!=. & last_gp_prerheum_date!=. & rheum_appt_date>last_gp_prerheum_date & rheum_appt_date<eia_code_date
(29,914 missing values generated)

. tabstat time_gp_rheum_appt, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_~m_appt |      5469  292.0625       237       103       418
----------------------------------------------------------------

. 
. **Time from last GP pre-code to EIA code (sensitivity analysis; includes those with no rheum ref and/or no rheum appt)
. gen time_gp_eia_code = (eia_code_date - last_gp_precode_date) if eia_code_date!=. & last_gp_precode_date!=. & eia_code_date>last_gp_precode_date
(15,801 missing values generated)

. tabstat time_gp_eia_code, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_ei~e |     19582    520.82       469       232       768
----------------------------------------------------------------

. 
. **Time from last GP to EIA diagnosis (combined - sensitivity analysis; includes those with no rheum appt)
. gen time_gp_eia_diag = time_gp_rheum_appt
(29,914 missing values generated)

. replace time_gp_eia_diag = time_gp_eia_code if time_gp_rheum_appt==. & time_gp_eia_code!=.
(16,142 real changes made)

. tabstat time_gp_eia_diag, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_ei~g |     21611  455.5094       389       178       676
----------------------------------------------------------------

. 
. **Time from rheum ref to rheum appt (i.e. if appts are present and in correct time order)
. gen time_ref_rheum_appt = (rheum_appt_date - referral_rheum_prerheum_date) if rheum_appt_date!=. & referral_rheum_prerheum_date!=. & referral_rheum_prerheum_date<rheum_appt_date & rheum_appt_date<eia_code_date
(29,923 missing values generated)

. tabstat time_ref_rheum_appt, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~t |      5460  292.2342       230       103     420.5
----------------------------------------------------------------

. 
. gen ref_appt_cat=1 if time_ref_rheum_appt<=21 & time_ref_rheum_appt!=. 
(35,083 missing values generated)

. replace ref_appt_cat=2 if time_ref_rheum_appt<=42 & time_ref_rheum_appt!=. & ref_appt_cat==.
(293 real changes made)

. replace ref_appt_cat=3 if time_ref_rheum_appt>42 & time_ref_rheum_appt!=. & ref_appt_cat==.
(4,867 real changes made)

. lab define ref_appt_cat 1 "Seen within 3 weeks" 2 "Seen within 6 weeks" 3 "Assessment delay >6 weeks", modify

. lab val ref_appt_cat ref_appt_cat

. lab var ref_appt_cat "Time to rheumatology assessment"

. tab ref_appt_cat, missing

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |        300        0.85        0.85
      Seen within 6 weeks |        293        0.83        1.68
Assessment delay >6 weeks |      4,867       13.76       15.43
                        . |     29,923       84.57      100.00
--------------------------+-----------------------------------
                    Total |     35,383      100.00

. 
. gen ref_appt_3w=1 if time_ref_rheum_appt<=21 & time_ref_rheum_appt!=. 
(35,083 missing values generated)

. replace ref_appt_3w=2 if time_ref_rheum_appt>21 & time_ref_rheum_appt!=.
(5,160 real changes made)

. lab define ref_appt_3w 1 "Seen within 3 weeks" 2 "Assessment delay >3 weeks", modify

. lab val ref_appt_3w ref_appt_3w

. lab var ref_appt_3w "Time to rheumatology assessment"

. tab ref_appt_3w, missing

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |        300        0.85        0.85
Assessment delay >3 weeks |      5,160       14.58       15.43
                        . |     29,923       84.57      100.00
--------------------------+-----------------------------------
                    Total |     35,383      100.00

. 
. **Time from rheum ref or last GP to rheum appt (combined - sensitivity analysis; includes those with no rheum ref)
. gen time_refgp_rheum_appt = time_ref_rheum_appt
(29,923 missing values generated)

. replace time_refgp_rheum_appt = time_gp_rheum_appt if time_ref_rheum_appt==. & time_gp_rheum_appt!=.
(3,576 real changes made)

. tabstat time_refgp_rheum_appt, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_refgp~t |      9036  276.8617       219        97       400
----------------------------------------------------------------

. 
. **Time from rheum ref to EIA code (sensitivity analysis; includes those with no rheum appt)
. gen time_ref_rheum_eia = (eia_code_date - referral_rheum_precode_date) if eia_code_date!=. & referral_rheum_precode_date!=. & referral_rheum_precode_date<eia_code_date  
(15,680 missing values generated)

. tabstat time_ref_rheum_eia, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~a |     19703  521.4706       468       230       771
----------------------------------------------------------------

. 
. **Time from rheum ref to EIA diagnosis (combined - sensitivity analysis; includes those with no rheum appt)
. gen time_ref_rheum_eia_comb = time_ref_rheum_appt
(29,923 missing values generated)

. replace time_ref_rheum_eia_comb = time_ref_rheum_eia if time_ref_rheum_appt==. & time_ref_rheum_eia!=.
(16,253 real changes made)

. tabstat time_ref_rheum_eia_comb, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~b |     21713  457.0724       387       179       675
----------------------------------------------------------------

. 
. **Time from rheum appt to EIA code (i.e. if appts are present and in correct time order)
. gen time_rheum_eia_code = (eia_code_date - rheum_appt_date) if eia_code_date!=. & rheum_appt_date!=. & rheum_appt_date<eia_code_date 
(11,713 missing values generated)

. tabstat time_rheum_eia_code, stats (n mean p50 p25 p75) 

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_rheum~e |     23670  603.6015       575       313       873
----------------------------------------------------------------

. 
. *Time to first csDMARD prescriptions - all of the below are shared care prescriptions, aside from those with MTX_high cost drug data included======================================================================*
> /
. 
. *All patients below must have at least six months of GP registration after EIA code
. 
. **Time to first csDMARD script for RA patients, whereby first rheum appt is classed as diagnosis date (if rheum appt present and before csDMARD date; not including high cost MTX prescriptions)
. gen time_to_csdmard=(csdmard_date-rheum_appt_date) if csdmard==1 & rheum_appt_date!=. & csdmard_date>rheum_appt_date 
(25,328 missing values generated)

. tabstat time_to_csdmard if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_cs~d |      3211  558.0121       522       281       804
----------------------------------------------------------------

. 
. **Time to first csDMARD script for RA patients (including high cost MTX prescriptions)
. gen time_to_csdmard_hcd=(csdmard_hcd_date-rheum_appt_date) if csdmard_hcd==1 & rheum_appt_date!=. & csdmard_hcd_date>rheum_appt_date 
(23,945 missing values generated)

. tabstat time_to_csdmard_hcd if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) 

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_c~cd |      3637  555.6272       519       277       805
----------------------------------------------------------------

. 
. **Time to first csDMARD script for PsA patients (not including high cost MTX prescriptions)
. tabstat time_to_csdmard if psa_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_c~rd |      3184  571.6847       532       291       835
----------------------------------------------------------------

. 
. **Time to first csDMARD script for PsA patients (including high cost MTX prescriptions)
. tabstat time_to_csdmard_hcd if psa_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) 

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_c~cd |      3631  558.4307       516       281       811
----------------------------------------------------------------

. 
. **csDMARD time categories for RA patients (not including high cost MTX prescriptions)
. gen csdmard_3m=1 if time_to_csdmard<=90 & time_to_csdmard!=. 
(34,671 missing values generated)

. replace csdmard_3m=2 if time_to_csdmard>90 & time_to_csdmard!=.
(9,343 real changes made)

. lab define csdmard_3m 1 "Yes" 2 "No", modify

. lab val csdmard_3m csdmard_3m

. lab var csdmard_3m "csDMARD within 3 months" 

. tab csdmard_3m if ra_code==1 & has_6m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after csDMARD script

    csDMARD |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        243        2.16        2.16
         No |      2,968       26.34       28.50
          . |      8,056       71.50      100.00
------------+-----------------------------------
      Total |     11,267      100.00

. gen csdmard_6m=1 if time_to_csdmard<=180 & time_to_csdmard!=. 
(33,882 missing values generated)

. replace csdmard_6m=2 if time_to_csdmard>180 & time_to_csdmard!=.
(8,554 real changes made)

. lab define csdmard_6m 1 "Yes" 2 "No", modify

. lab val csdmard_6m csdmard_6m

. lab var csdmard_6m "csDMARD within 6 months" 

. tab csdmard_6m if ra_code==1 & has_6m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after csDMARD script

    csDMARD |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        518        4.60        4.60
         No |      2,693       23.90       28.50
          . |      8,056       71.50      100.00
------------+-----------------------------------
      Total |     11,267      100.00

. gen csdmard_12m=1 if time_to_csdmard<=365 & time_to_csdmard!=. 
(32,002 missing values generated)

. replace csdmard_12m=2 if time_to_csdmard>365 & time_to_csdmard!=.
(6,674 real changes made)

. lab define csdmard_12m 1 "Yes" 2 "No", modify

. lab val csdmard_12m csdmard_12m

. lab var csdmard_12m "csDMARD within 12 months" 

. tab csdmard_12m if ra_code==1 & has_12m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after csDMARD script

    csDMARD |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,058        9.88        9.88
         No |      1,996       18.63       28.51
          . |      7,659       71.49      100.00
------------+-----------------------------------
      Total |     10,713      100.00

. 
. **csDMARD time categories for RA patients (including high cost MTX prescriptions)
. gen csdmard_hcd_3m=1 if time_to_csdmard_hcd<=90 & time_to_csdmard_hcd!=. 
(34,549 missing values generated)

. replace csdmard_hcd_3m=2 if time_to_csdmard_hcd>90 & time_to_csdmard_hcd!=.
(10,604 real changes made)

. lab define csdmard_hcd_3m 1 "Yes" 2 "No", modify

. lab val csdmard_hcd_3m csdmard_hcd_3m

. lab var csdmard_hcd_3m "csDMARD within 3 months" 

. tab csdmard_hcd_3m if ra_code==1 & has_6m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after csDMARD script

    csDMARD |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        274        2.43        2.43
         No |      3,363       29.85       32.28
          . |      7,630       67.72      100.00
------------+-----------------------------------
      Total |     11,267      100.00

. gen csdmard_hcd_6m=1 if time_to_csdmard_hcd<=180 & time_to_csdmard_hcd!=. 
(33,629 missing values generated)

. replace csdmard_hcd_6m=2 if time_to_csdmard_hcd>180 & time_to_csdmard_hcd!=.
(9,684 real changes made)

. lab define csdmard_hcd_6m 1 "Yes" 2 "No", modify

. lab val csdmard_hcd_6m csdmard_hcd_6m

. lab var csdmard_hcd_6m "csDMARD within 6 months" 

. tab csdmard_hcd_6m if ra_code==1 & has_6m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after csDMARD script

    csDMARD |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        589        5.23        5.23
         No |      3,048       27.05       32.28
          . |      7,630       67.72      100.00
------------+-----------------------------------
      Total |     11,267      100.00

. gen csdmard_hcd_12m=1 if time_to_csdmard_hcd<=365 & time_to_csdmard_hcd!=. 
(31,451 missing values generated)

. replace csdmard_hcd_12m=2 if time_to_csdmard_hcd>365 & time_to_csdmard_hcd!=.
(7,506 real changes made)

. lab define csdmard_hcd_12m 1 "Yes" 2 "No", modify

. lab val csdmard_hcd_12m csdmard_hcd_12m

. lab var csdmard_hcd_12m "csDMARD within 12 months" 

. tab csdmard_hcd_12m if ra_code==1 & has_12m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after csDMARD script

    csDMARD |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,196       11.16       11.16
         No |      2,247       20.97       32.14
          . |      7,270       67.86      100.00
------------+-----------------------------------
      Total |     10,713      100.00

. 
. **csDMARD time categories for PsA patients (not including high cost MTX prescriptions)
. tab csdmard_3m if psa_code==1 & has_6m_follow_up==1, missing

    csDMARD |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        225        2.01        2.01
         No |      2,959       26.45       28.46
          . |      8,003       71.54      100.00
------------+-----------------------------------
      Total |     11,187      100.00

. tab csdmard_6m if psa_code==1 & has_6m_follow_up==1, missing

    csDMARD |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        461        4.12        4.12
         No |      2,723       24.34       28.46
          . |      8,003       71.54      100.00
------------+-----------------------------------
      Total |     11,187      100.00

. tab csdmard_12m if psa_code==1 & has_12m_follow_up==1, missing

    csDMARD |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        986        9.34        9.34
         No |      2,011       19.04       28.38
          . |      7,564       71.62      100.00
------------+-----------------------------------
      Total |     10,561      100.00

. 
. **csDMARD time categories for PsA patients (including high cost MTX prescriptions)
. tab csdmard_hcd_3m if psa_code==1 & has_6m_follow_up==1, missing

    csDMARD |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        268        2.40        2.40
         No |      3,363       30.06       32.46
          . |      7,556       67.54      100.00
------------+-----------------------------------
      Total |     11,187      100.00

. tab csdmard_hcd_6m if psa_code==1 & has_6m_follow_up==1, missing

    csDMARD |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        549        4.91        4.91
         No |      3,082       27.55       32.46
          . |      7,556       67.54      100.00
------------+-----------------------------------
      Total |     11,187      100.00

. tab csdmard_hcd_12m if psa_code==1 & has_12m_follow_up==1, missing

    csDMARD |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,153       10.92       10.92
         No |      2,260       21.40       32.32
          . |      7,148       67.68      100.00
------------+-----------------------------------
      Total |     10,561      100.00

. 
. **What was first shared care csDMARD (not including high cost MTX prescriptions)
. gen first_csD=""
(35,383 missing values generated)

. foreach var of varlist hydroxychloroquine_date leflunomide_date methotrexate_date methotrexate_inj_date sulfasalazine_date {
  2.         replace first_csD="`var'" if csdmard_date==`var' & csdmard_date!=.
  3.         }
variable first_csD was str1 now str23
(2,555 real changes made)
(2,527 real changes made)
(2,502 real changes made)
(2,489 real changes made)
(2,468 real changes made)

. gen first_csDMARD = substr(first_csD, 1, length(first_csD) - 5) if first_csD!=""
(22,844 missing values generated)

. drop first_csD

. tab first_csDMARD if ra_code==1 & has_6m_follow_up==1 //for RA patients

     first_csDMARD |      Freq.     Percent        Cum.
-------------------+-----------------------------------
hydroxychloroquine |        840       20.83       20.83
       leflunomide |        779       19.32       40.15
      methotrexate |        822       20.39       60.54
  methotrexate_inj |        810       20.09       80.63
     sulfasalazine |        781       19.37      100.00
-------------------+-----------------------------------
             Total |      4,032      100.00

. tab first_csDMARD if psa_code==1 & has_6m_follow_up==1 //for PsA patients

     first_csDMARD |      Freq.     Percent        Cum.
-------------------+-----------------------------------
hydroxychloroquine |        818       20.50       20.50
       leflunomide |        801       20.08       40.58
      methotrexate |        804       20.15       60.73
  methotrexate_inj |        814       20.40       81.13
     sulfasalazine |        753       18.87      100.00
-------------------+-----------------------------------
             Total |      3,990      100.00

. 
. **What was first csDMARD (including high cost MTX prescriptions)
. gen first_csD_hcd=""
(35,383 missing values generated)

. foreach var of varlist hydroxychloroquine_date leflunomide_date methotrexate_date methotrexate_inj_date methotrexate_hcd_date sulfasalazine_date {
  2.         replace first_csD_hcd="`var'" if csdmard_hcd_date==`var' & csdmard_hcd_date!=.
  3.         }
variable first_csD_hcd was str1 now str23
(2,412 real changes made)
(2,389 real changes made)
(2,373 real changes made)
(2,363 real changes made)
(2,934 real changes made)
(2,360 real changes made)

. gen first_csDMARD_hcd = substr(first_csD_hcd, 1, length(first_csD_hcd) - 5) if first_csD_hcd!=""
(20,555 missing values generated)

. drop first_csD_hcd

. tab first_csDMARD_hcd if ra_code==1 & has_6m_follow_up==1 //for RA patients

 first_csDMARD_hcd |      Freq.     Percent        Cum.
-------------------+-----------------------------------
hydroxychloroquine |        796       16.68       16.68
       leflunomide |        726       15.21       31.89
      methotrexate |        774       16.22       48.11
  methotrexate_hcd |        950       19.91       68.02
  methotrexate_inj |        767       16.07       84.09
     sulfasalazine |        759       15.91      100.00
-------------------+-----------------------------------
             Total |      4,772      100.00

. tab first_csDMARD_hcd if psa_code==1 & has_6m_follow_up==1 //for PsA patients

 first_csDMARD_hcd |      Freq.     Percent        Cum.
-------------------+-----------------------------------
hydroxychloroquine |        768       16.26       16.26
       leflunomide |        761       16.11       32.37
      methotrexate |        767       16.24       48.61
  methotrexate_hcd |        944       19.99       68.60
  methotrexate_inj |        774       16.39       84.99
     sulfasalazine |        709       15.01      100.00
-------------------+-----------------------------------
             Total |      4,723      100.00

.  
. **Methotrexate use (not including high cost MTX prescriptions)
. gen mtx=1 if methotrexate==1 | methotrexate_inj==1
(29,691 missing values generated)

. recode mtx .=0 
(29691 changes made to mtx)

. tab mtx if ra_code==1 & has_6m_follow_up==1 //for RA patients; Nb. this is just a check; need time-to-MTX instead (below)

        mtx |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      9,424       83.64       83.64
          1 |      1,843       16.36      100.00
------------+-----------------------------------
      Total |     11,267      100.00

. tab mtx if psa_code==1 & has_6m_follow_up==1 //for PsA patients

        mtx |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      9,348       83.56       83.56
          1 |      1,839       16.44      100.00
------------+-----------------------------------
      Total |     11,187      100.00

. 
. **Methotrexate use (including high cost MTX prescriptions)
. gen mtx_hcd=1 if methotrexate==1 | methotrexate_inj==1 | methotrexate_hcd==1
(26,705 missing values generated)

. recode mtx_hcd .=0 
(26705 changes made to mtx_hcd)

. tab mtx_hcd if ra_code==1 & has_6m_follow_up==1 //for RA patients

    mtx_hcd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,465       75.13       75.13
          1 |      2,802       24.87      100.00
------------+-----------------------------------
      Total |     11,267      100.00

. tab mtx_hcd if psa_code==1 & has_6m_follow_up==1 //for PsA patients

    mtx_hcd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,385       74.95       74.95
          1 |      2,802       25.05      100.00
------------+-----------------------------------
      Total |     11,187      100.00

. 
. **Date of first methotrexate script (not including high cost MTX prescriptions)
. gen mtx_date=min(methotrexate_date, methotrexate_inj_date)
(29,691 missing values generated)

. format %td mtx_date

. 
. **Date of first methotrexate script (including high cost MTX prescriptions)
. gen mtx_hcd_date=min(methotrexate_date, methotrexate_inj_date, methotrexate_hcd_date)
(26,705 missing values generated)

. format %td mtx_hcd_date

. 
. **Time to first methotrexate script for RA patients (not including high cost MTX prescriptions)
. gen time_to_mtx=(mtx_date-rheum_appt_date) if mtx==1 & rheum_appt_date!=. & mtx_date>rheum_appt_date 
(30,841 missing values generated)

. tabstat time_to_mtx if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |      1475  593.5424       555       316       848
----------------------------------------------------------------

. 
. **Time to first methotrexate script for RA patients (including high cost MTX prescriptions)
. gen time_to_mtx_hcd=(mtx_hcd_date-rheum_appt_date) if mtx_hcd==1 & rheum_appt_date!=. & mtx_hcd_date>rheum_appt_date 
(28,893 missing values generated)

. tabstat time_to_mtx_hcd if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_mt~d |      2081  589.6064       558       305       846
----------------------------------------------------------------

. 
. **Time to first methotrexate script for PsA patients (not including high cost MTX prescriptions)
. tabstat time_to_mtx if psa_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |      1451  590.1502       562       299       872
----------------------------------------------------------------

. 
. **Time to first methotrexate script for PsA patients (including high cost MTX prescriptions)
. tabstat time_to_mtx_hcd if psa_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_mt~d |      2084  574.1233       544     291.5       830
----------------------------------------------------------------

. 
. **Methotrexate time categories for RA patients (not including high-cost MTX) //Nb. this is time period from rheum appt (i.e. diagnosis) to shared care, not from referral to first script 
. gen mtx_3m=1 if time_to_mtx<=90 & time_to_mtx!=. 
(35,088 missing values generated)

. replace mtx_3m=2 if time_to_mtx>90 & time_to_mtx!=.
(4,247 real changes made)

. lab define mtx_3m 1 "Yes" 2 "No", modify

. lab val mtx_3m mtx_3m

. lab var mtx_3m "Methotrexate within 3 months" 

. tab mtx_3m if ra_code==1 & has_6m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after csDMARD script

Methotrexat |
 e within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         94        0.83        0.83
         No |      1,381       12.26       13.09
          . |      9,792       86.91      100.00
------------+-----------------------------------
      Total |     11,267      100.00

. gen mtx_6m=1 if time_to_mtx<=180 & time_to_mtx!=. 
(34,754 missing values generated)

. replace mtx_6m=2 if time_to_mtx>180 & time_to_mtx!=.
(3,913 real changes made)

. lab define mtx_6m 1 "Yes" 2 "No", modify

. lab val mtx_6m mtx_6m

. lab var mtx_6m "Methotrexate within 6 months" 

. tab mtx_6m if ra_code==1 & has_6m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after csDMARD script

Methotrexat |
 e within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        201        1.78        1.78
         No |      1,274       11.31       13.09
          . |      9,792       86.91      100.00
------------+-----------------------------------
      Total |     11,267      100.00

. gen mtx_12m=1 if time_to_mtx<=365 & time_to_mtx!=. 
(33,969 missing values generated)

. replace mtx_12m=2 if time_to_mtx>365 & time_to_mtx!=.
(3,128 real changes made)

. lab define mtx_12m 1 "Yes" 2 "No", modify

. lab val mtx_12m mtx_12m

. lab var mtx_12m "Methotrexate within 12 months" 

. tab mtx_12m if ra_code==1 & has_12m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after mtx script

Methotrexat |
e within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        426        3.98        3.98
         No |        987        9.21       13.19
          . |      9,300       86.81      100.00
------------+-----------------------------------
      Total |     10,713      100.00

. 
. **Methotrexate time categories for RA patients (including high-cost MTX)
. gen mtx_hcd_3m=1 if time_to_mtx_hcd<=90 & time_to_mtx_hcd!=. 
(34,951 missing values generated)

. replace mtx_hcd_3m=2 if time_to_mtx_hcd>90 & time_to_mtx_hcd!=.
(6,058 real changes made)

. lab define mtx_hcd_3m 1 "Yes" 2 "No", modify

. lab val mtx_hcd_3m mtx_hcd_3m

. lab var mtx_hcd_3m "Methotrexate within 3 months" 

. tab mtx_hcd_3m if ra_code==1 & has_6m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after csDMARD script

Methotrexat |
 e within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        128        1.14        1.14
         No |      1,953       17.33       18.47
          . |      9,186       81.53      100.00
------------+-----------------------------------
      Total |     11,267      100.00

. gen mtx_hcd_6m=1 if time_to_mtx_hcd<=180 & time_to_mtx_hcd!=. 
(34,462 missing values generated)

. replace mtx_hcd_6m=2 if time_to_mtx_hcd>180 & time_to_mtx_hcd!=.
(5,569 real changes made)

. lab define mtx_hcd_6m 1 "Yes" 2 "No", modify

. lab val mtx_hcd_6m mtx_hcd_6m

. lab var mtx_hcd_6m "Methotrexate within 6 months" 

. tab mtx_hcd_6m if ra_code==1 & has_6m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after csDMARD script

Methotrexat |
 e within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        286        2.54        2.54
         No |      1,795       15.93       18.47
          . |      9,186       81.53      100.00
------------+-----------------------------------
      Total |     11,267      100.00

. gen mtx_hcd_12m=1 if time_to_mtx_hcd<=365 & time_to_mtx_hcd!=. 
(33,313 missing values generated)

. replace mtx_hcd_12m=2 if time_to_mtx_hcd>365 & time_to_mtx_hcd!=.
(4,420 real changes made)

. lab define mtx_hcd_12m 1 "Yes" 2 "No", modify

. lab val mtx_hcd_12m mtx_hcd_12m

. lab var mtx_hcd_12m "Methotrexate within 12 months" 

. tab mtx_hcd_12m if ra_code==1 & has_12m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after csDMARD script

Methotrexat |
e within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        604        5.64        5.64
         No |      1,369       12.78       18.42
          . |      8,740       81.58      100.00
------------+-----------------------------------
      Total |     10,713      100.00

. 
. **Methotrexate time categories for PsA patients (not including high-cost MTX)
. tab mtx_3m if psa_code==1 & has_6m_follow_up==1, missing

Methotrexat |
 e within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        104        0.93        0.93
         No |      1,347       12.04       12.97
          . |      9,736       87.03      100.00
------------+-----------------------------------
      Total |     11,187      100.00

. tab mtx_6m if psa_code==1 & has_6m_follow_up==1, missing

Methotrexat |
 e within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        210        1.88        1.88
         No |      1,241       11.09       12.97
          . |      9,736       87.03      100.00
------------+-----------------------------------
      Total |     11,187      100.00

. tab mtx_12m if psa_code==1 & has_12m_follow_up==1, missing //with a least 12m registration

Methotrexat |
e within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        422        4.00        4.00
         No |        949        8.99       12.98
          . |      9,190       87.02      100.00
------------+-----------------------------------
      Total |     10,561      100.00

. 
. **Methotrexate time categories for PsA patients (including high-cost MTX)
. tab mtx_hcd_3m if psa_code==1 & has_6m_follow_up==1, missing

Methotrexat |
 e within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        153        1.37        1.37
         No |      1,931       17.26       18.63
          . |      9,103       81.37      100.00
------------+-----------------------------------
      Total |     11,187      100.00

. tab mtx_hcd_6m if psa_code==1 & has_6m_follow_up==1, missing

Methotrexat |
 e within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        312        2.79        2.79
         No |      1,772       15.84       18.63
          . |      9,103       81.37      100.00
------------+-----------------------------------
      Total |     11,187      100.00

. tab mtx_hcd_12m if psa_code==1 & has_12m_follow_up==1, missing //with a least 12m registration

Methotrexat |
e within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        620        5.87        5.87
         No |      1,342       12.71       18.58
          . |      8,599       81.42      100.00
------------+-----------------------------------
      Total |     10,561      100.00

. 
. **Sulfasalazine use
. gen time_to_ssz=(sulfasalazine_date-rheum_appt_date) if sulfasalazine==1 & rheum_appt_date!=. & sulfasalazine_date>rheum_appt_date 
(32,983 missing values generated)

. tabstat time_to_ssz if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |       747  561.0629       526       282       796
----------------------------------------------------------------

. 
. **Sulfasalazine time categories for RA patients //Nb. this is time period from rheum appt (i.e. diagnosis) to shared care, not from referral to first script 
. gen ssz_3m=1 if time_to_ssz<=90 & time_to_ssz!=. 
(35,251 missing values generated)

. replace ssz_3m=2 if time_to_ssz>90 & time_to_ssz!=.
(2,268 real changes made)

. lab define ssz_3m 1 "Yes" 2 "No", modify

. lab val ssz_3m ssz_3m

. lab var ssz_3m "Sulfasalazine within 3 months" 

. tab ssz_3m if ra_code==1 & has_6m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after csDMARD script

Sulfasalazi |
ne within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         49        0.43        0.43
         No |        698        6.20        6.63
          . |     10,520       93.37      100.00
------------+-----------------------------------
      Total |     11,267      100.00

. gen ssz_6m=1 if time_to_ssz<=180 & time_to_ssz!=. 
(35,080 missing values generated)

. replace ssz_6m=2 if time_to_ssz>180 & time_to_ssz!=.
(2,097 real changes made)

. lab define ssz_6m 1 "Yes" 2 "No", modify

. lab val ssz_6m ssz_6m

. lab var ssz_6m "Sulfasalazine within 6 months" 

. tab ssz_6m if ra_code==1 & has_6m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after csDMARD script

Sulfasalazi |
ne within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        119        1.06        1.06
         No |        628        5.57        6.63
          . |     10,520       93.37      100.00
------------+-----------------------------------
      Total |     11,267      100.00

. gen ssz_12m=1 if time_to_ssz<=365 & time_to_ssz!=. 
(34,656 missing values generated)

. replace ssz_12m=2 if time_to_ssz>365 & time_to_ssz!=.
(1,673 real changes made)

. lab define ssz_12m 1 "Yes" 2 "No", modify

. lab val ssz_12m ssz_12m

. lab var ssz_12m "Sulfasalazine within 12 months" 

. tab ssz_12m if ra_code==1 & has_12m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after ssz script

Sulfasalazi |
  ne within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        237        2.21        2.21
         No |        455        4.25        6.46
          . |     10,021       93.54      100.00
------------+-----------------------------------
      Total |     10,713      100.00

. 
. **Sulfasalazine time categories for PsA patients
. tab ssz_3m if psa_code==1 & has_6m_follow_up==1, missing

Sulfasalazi |
ne within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         44        0.39        0.39
         No |        676        6.04        6.44
          . |     10,467       93.56      100.00
------------+-----------------------------------
      Total |     11,187      100.00

. tab ssz_6m if psa_code==1 & has_6m_follow_up==1, missing

Sulfasalazi |
ne within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         90        0.80        0.80
         No |        630        5.63        6.44
          . |     10,467       93.56      100.00
------------+-----------------------------------
      Total |     11,187      100.00

. tab ssz_12m if psa_code==1 & has_12m_follow_up==1, missing //with a least 12m registration

Sulfasalazi |
  ne within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        210        1.99        1.99
         No |        473        4.48        6.47
          . |      9,878       93.53      100.00
------------+-----------------------------------
      Total |     10,561      100.00

. 
. **Hydroxychloroquine use
. gen time_to_hcq=(hydroxychloroquine_date-rheum_appt_date) if hydroxychloroquine==1 & rheum_appt_date!=. & hydroxychloroquine_date>rheum_appt_date 
(32,952 missing values generated)

. tabstat time_to_hcq if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |       795  613.1874       588       337       875
----------------------------------------------------------------

. 
. **Hydroxychloroquine time categories for RA patients //Nb. this is time period from rheum appt (i.e. diagnosis) to shared care, not from referral to first script 
. gen hcq_3m=1 if time_to_hcq<=90 & time_to_hcq!=. 
(35,237 missing values generated)

. replace hcq_3m=2 if time_to_hcq>90 & time_to_hcq!=.
(2,285 real changes made)

. lab define hcq_3m 1 "Yes" 2 "No", modify

. lab val hcq_3m hcq_3m

. lab var hcq_3m "Hydroxychloroquine within 3 months" 

. tab hcq_3m if ra_code==1 & has_6m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after csDMARD script

Hydroxychlo |
    roquine |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         53        0.47        0.47
         No |        742        6.59        7.06
          . |     10,472       92.94      100.00
------------+-----------------------------------
      Total |     11,267      100.00

. gen hcq_6m=1 if time_to_hcq<=180 & time_to_hcq!=. 
(35,075 missing values generated)

. replace hcq_6m=2 if time_to_hcq>180 & time_to_hcq!=.
(2,123 real changes made)

. lab define hcq_6m 1 "Yes" 2 "No", modify

. lab val hcq_6m hcq_6m

. lab var hcq_6m "Hydroxychloroquine within 6 months" 

. tab hcq_6m if ra_code==1 & has_6m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after csDMARD script

Hydroxychlo |
    roquine |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        110        0.98        0.98
         No |        685        6.08        7.06
          . |     10,472       92.94      100.00
------------+-----------------------------------
      Total |     11,267      100.00

. gen hcq_12m=1 if time_to_hcq<=365 & time_to_hcq!=. 
(34,698 missing values generated)

. replace hcq_12m=2 if time_to_hcq>365 & time_to_hcq!=.
(1,746 real changes made)

. lab define hcq_12m 1 "Yes" 2 "No", modify

. lab val hcq_12m hcq_12m

. lab var hcq_12m "Hydroxychloroquine within 12 months" 

. tab hcq_12m if ra_code==1 & has_12m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after hcq script

Hydroxychlo |
    roquine |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        228        2.13        2.13
         No |        531        4.96        7.08
          . |      9,954       92.92      100.00
------------+-----------------------------------
      Total |     10,713      100.00

. 
. **Hydroxychloroquine time categories for PsA patients
. tab hcq_3m if psa_code==1 & has_6m_follow_up==1, missing

Hydroxychlo |
    roquine |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         40        0.36        0.36
         No |        746        6.67        7.03
          . |     10,401       92.97      100.00
------------+-----------------------------------
      Total |     11,187      100.00

. tab hcq_6m if psa_code==1 & has_6m_follow_up==1, missing

Hydroxychlo |
    roquine |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         88        0.79        0.79
         No |        698        6.24        7.03
          . |     10,401       92.97      100.00
------------+-----------------------------------
      Total |     11,187      100.00

. tab hcq_12m if psa_code==1 & has_12m_follow_up==1, missing //with a least 12m registration

Hydroxychlo |
    roquine |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        193        1.83        1.83
         No |        536        5.08        6.90
          . |      9,832       93.10      100.00
------------+-----------------------------------
      Total |     10,561      100.00

. 
. **Leflunomide use
. gen time_to_lef=(leflunomide_date-rheum_appt_date) if leflunomide==1 & rheum_appt_date!=. & leflunomide_date>rheum_appt_date 
(33,020 missing values generated)

. tabstat time_to_lef if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |       715  593.4601       571       299       882
----------------------------------------------------------------

. 
. **Leflunomide time categories for RA patients //Nb. this is time period from rheum appt (i.e. diagnosis) to shared care, not from referral to first script 
. gen lef_3m=1 if time_to_lef<=90 & time_to_lef!=. 
(35,229 missing values generated)

. replace lef_3m=2 if time_to_lef>90 & time_to_lef!=.
(2,209 real changes made)

. lab define lef_3m 1 "Yes" 2 "No", modify

. lab val lef_3m lef_3m

. lab var lef_3m "Leflunomide within 3 months" 

. tab lef_3m if ra_code==1 & has_6m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after csDMARD script

Leflunomide |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         49        0.43        0.43
         No |        666        5.91        6.35
          . |     10,552       93.65      100.00
------------+-----------------------------------
      Total |     11,267      100.00

. gen lef_6m=1 if time_to_lef<=180 & time_to_lef!=. 
(35,079 missing values generated)

. replace lef_6m=2 if time_to_lef>180 & time_to_lef!=.
(2,059 real changes made)

. lab define lef_6m 1 "Yes" 2 "No", modify

. lab val lef_6m lef_6m

. lab var lef_6m "Leflunomide within 6 months" 

. tab lef_6m if ra_code==1 & has_6m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after csDMARD script

Leflunomide |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         99        0.88        0.88
         No |        616        5.47        6.35
          . |     10,552       93.65      100.00
------------+-----------------------------------
      Total |     11,267      100.00

. gen lef_12m=1 if time_to_lef<=365 & time_to_lef!=. 
(34,655 missing values generated)

. replace lef_12m=2 if time_to_lef>365 & time_to_lef!=.
(1,635 real changes made)

. lab define lef_12m 1 "Yes" 2 "No", modify

. lab val lef_12m lef_12m

. lab var lef_12m "Leflunomide within 12 months" 

. tab lef_12m if ra_code==1 & has_12m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after lef script

Leflunomide |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        220        2.05        2.05
         No |        467        4.36        6.41
          . |     10,026       93.59      100.00
------------+-----------------------------------
      Total |     10,713      100.00

. 
. **Leflunomide time categories for PsA patients
. tab lef_3m if psa_code==1 & has_6m_follow_up==1, missing

Leflunomide |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         44        0.39        0.39
         No |        723        6.46        6.86
          . |     10,420       93.14      100.00
------------+-----------------------------------
      Total |     11,187      100.00

. tab lef_6m if psa_code==1 & has_6m_follow_up==1, missing

Leflunomide |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         88        0.79        0.79
         No |        679        6.07        6.86
          . |     10,420       93.14      100.00
------------+-----------------------------------
      Total |     11,187      100.00

. tab lef_12m if psa_code==1 & has_12m_follow_up==1, missing //with a least 12m registration

Leflunomide |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        213        2.02        2.02
         No |        507        4.80        6.82
          . |      9,841       93.18      100.00
------------+-----------------------------------
      Total |     10,561      100.00

. 
. **Time to first biologic script, whereby first rheum appt is classed as diagnosis date (assumes rheum appt present); high_cost drug data available to Nov 2020======================================================
> ================*/
. 
. *Below analyses are only for patients with at least 12 months of follow-up available after EIA code
. gen time_to_biologic=(biologic_date-rheum_appt_date) if biologic==1 & rheum_appt_date!=. & biologic_date>rheum_appt_date 
(14,402 missing values generated)

. tabstat time_to_biologic if has_12m_follow_up==1, stats (n mean p50 p25 p75) //for all EIA patients

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_bi~c |     18832  458.9226       399       203       665
----------------------------------------------------------------

. 
. **What was first biologic
. gen first_bio=""
(35,383 missing values generated)

. foreach var of varlist abatacept_date adalimumab_date baricitinib_date certolizumab_date etanercept_date golimumab_date guselkumab_date infliximab_date ixekizumab_date rituximab_date sarilumab_date secukinumab_da
> te tocilizumab_date tofacitinib_date upadacitinib_date ustekinumab_date {
  2.         replace first_bio="`var'" if biologic_date==`var' & biologic_date!=.
  3.         }
variable first_bio was str1 now str14
(1,692 real changes made)
variable first_bio was str14 now str15
(1,637 real changes made)
variable first_bio was str15 now str16
(1,649 real changes made)
variable first_bio was str16 now str17
(1,698 real changes made)
(1,616 real changes made)
(1,615 real changes made)
(1,633 real changes made)
(1,626 real changes made)
(1,698 real changes made)
(1,707 real changes made)
(1,609 real changes made)
(1,719 real changes made)
(1,711 real changes made)
(1,640 real changes made)
(1,586 real changes made)
(1,636 real changes made)

. gen first_biologic = substr(first_bio, 1, length(first_bio) - 5)        
(9,463 missing values generated)

. drop first_bio

. tab first_biologic if has_12m_follow_up==1 //for all EIA patients

first_biolog |
          ic |      Freq.     Percent        Cum.
-------------+-----------------------------------
   abatacept |      1,440        6.18        6.18
  adalimumab |      1,416        6.08       12.27
 baricitinib |      1,446        6.21       18.48
certolizumab |      1,488        6.39       24.87
  etanercept |      1,409        6.05       30.92
   golimumab |      1,419        6.09       37.01
  guselkumab |      1,447        6.21       43.23
  infliximab |      1,415        6.08       49.31
  ixekizumab |      1,478        6.35       55.65
   rituximab |      1,516        6.51       62.17
   sarilumab |      1,420        6.10       68.26
 secukinumab |      1,510        6.49       74.75
 tocilizumab |      1,545        6.64       81.39
 tofacitinib |      1,464        6.29       87.67
upadacitinib |      1,404        6.03       93.70
 ustekinumab |      1,466        6.30      100.00
-------------+-----------------------------------
       Total |     23,283      100.00

. 
. **Biologic time categories (for all patients)
. gen biologic_3m=1 if time_to_biologic<=90 & time_to_biologic!=. 
(33,103 missing values generated)

. replace biologic_3m=2 if time_to_biologic>90 & time_to_biologic!=.
(18,701 real changes made)

. lab define biologic_3m 1 "Yes" 2 "No", modify

. lab val biologic_3m biologic_3m

. lab var biologic_3m "bDMARD/tsDMARD within 3 months" 

. tab biologic_3m if has_6m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after bDMARD/tsDMARD script

bDMARD/tsDM |
 ARD within |
   3 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      2,153        6.41        6.41
         No |     17,727       52.78       59.19
          . |     13,707       40.81      100.00
------------+-----------------------------------
      Total |     33,587      100.00

. gen biologic_6m=1 if time_to_biologic<=180 & time_to_biologic!=. 
(30,750 missing values generated)

. replace biologic_6m=2 if time_to_biologic>180 & time_to_biologic!=.
(16,348 real changes made)

. lab define biologic_6m 1 "Yes" 2 "No", modify

. lab val biologic_6m biologic_6m

. lab var biologic_6m "bDMARD/tsDMARD within 6 months" 

. tab biologic_6m if has_6m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after bDMARD/tsDMARD script

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      4,385       13.06       13.06
         No |     15,495       46.13       59.19
          . |     13,707       40.81      100.00
------------+-----------------------------------
      Total |     33,587      100.00

. gen biologic_12m=1 if time_to_biologic<=365 & time_to_biologic!=. 
(25,767 missing values generated)

. replace biologic_12m=2 if time_to_biologic>365 & time_to_biologic!=.
(11,365 real changes made)

. lab define biologic_12m 1 "Yes" 2 "No", modify

. lab val biologic_12m biologic_12m

. lab var biologic_12m "bDMARD/tsDMARD within 12 months" 

. tab biologic_12m if has_12m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after bDMARD/tsDMARD script

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      8,617       27.04       27.04
         No |     10,215       32.06       59.10
          . |     13,035       40.90      100.00
------------+-----------------------------------
      Total |     31,867      100.00

. 
. **Biologic time categories (by year)
. bys diagnosis_year: tab biologic_6m if has_6m_follow_up==1, missing //for all EIA patients with at least 6m follow-up

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,397       13.12       13.12
         No |      4,935       46.34       59.46
          . |      4,318       40.54      100.00
------------+-----------------------------------
      Total |     10,650      100.00

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,346       12.68       12.68
         No |      4,883       46.00       58.68
          . |      4,387       41.32      100.00
------------+-----------------------------------
      Total |     10,616      100.00

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,436       13.42       13.42
         No |      4,959       46.36       59.78
          . |      4,302       40.22      100.00
------------+-----------------------------------
      Total |     10,697      100.00

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        206       12.68       12.68
         No |        718       44.21       56.90
          . |        700       43.10      100.00
------------+-----------------------------------
      Total |      1,624      100.00


. bys diagnosis_year: tab biologic_12m if has_12m_follow_up==1, missing //for all EIA patients

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      2,777       27.47       27.47
         No |      3,240       32.05       59.53
          . |      4,091       40.47      100.00
------------+-----------------------------------
      Total |     10,108      100.00

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      2,630       26.09       26.09
         No |      3,264       32.38       58.47
          . |      4,187       41.53      100.00
------------+-----------------------------------
      Total |     10,081      100.00

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      2,792       27.54       27.54
         No |      3,258       32.13       59.67
          . |      4,089       40.33      100.00
------------+-----------------------------------
      Total |     10,139      100.00

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        418       27.16       27.16
         No |        453       29.43       56.60
          . |        668       43.40      100.00
------------+-----------------------------------
      Total |      1,539      100.00


. 
. save "$projectdir/output/data/file_eia_all", replace
(file C:/Users/k1754142/OneDrive/PhD Project/OpenSAFELY/Github Practice/output/data/file_eia_all.dta not found)
file C:/Users/k1754142/OneDrive/PhD Project/OpenSAFELY/Github Practice/output/data/file_eia_all.dta saved

. 
. log close
      name:  <unnamed>
       log:  C:/Users/k1754142/OneDrive/PhD Project/OpenSAFELY/Github Practice/logs/cleaning_dataset.log
  log type:  text
 closed on:   9 Apr 2022, 18:09:40
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
