-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/cleaning_dataset.log
  log type:  text
 opened on:   8 Apr 2022, 12:20:58

. 
. di "$projectdir"
/workspace

. di "$logdir"
/workspace/logs

. 
. import delimited "$projectdir/output/input.csv", clear
(64 vars, 100,000 obs)

. 
. **Set Ado file path
. adopath + "$projectdir/analysis/extra_ados"
  [1]  (BASE)      "/usr/local/stata/ado/base/"
  [2]  (SITE)      "/usr/local/ado/"
  [3]              "."
  [4]  (PERSONAL)  "~/ado/personal/"
  [5]  (PLUS)      "~/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "/workspace/analysis/extra_ados"

. 
. **Set index dates ===========================================================
> */
. global year_preceding = "01/03/2018"

. global start_date = "01/03/2019"

. global end_date = "01/03/2022"

. 
. **Rename variables (some are too long for Stata to handle) ==================
> =====================*/
. rename chronic_respiratory_disease chronic_resp_disease

. 
. **Convert date strings to dates =============================================
> =======*/
. ***Some dates are given with month/year only, so adding day 15 to enable them
>  to be processed as dates 
. 
. foreach var of varlist   hba1c_mmol_per_mol_date                        ///
>                                                  hba1c_percentage_date       
>                    ///
>                                                  creatinine_date             
>                    ///
>                                                  bmi_date_measured           
>                ///
>                                                  abatacept                   
>                                    ///
>                                                  adalimumab                  
>                                    ///     
>                                                  baricitinib                 
>                            ///
>                                                  certolizumab                
>                            ///
>                                                  etanercept                  
>                                    ///
>                                                  golimumab                   
>                                    ///
>                                                  guselkumab                  
>                                    ///     
>                                                  infliximab                  
>                                    ///
>                                                  ixekizumab                  
>                                    ///
>                                                  methotrexate_hcd            
>                            ///
>                                                  rituximab                   
>                                    ///
>                                                  sarilumab                   
>                                    ///
>                                                  secukinumab                 
>                            ///     
>                                                  tocilizumab                 
>                            ///
>                                                  tofacitinib                 
>                            ///
>                                                  upadacitinib                
>                            ///
>                                                  ustekinumab                 
>                            ///
>                                                  {
  2.                                                         
.                 capture confirm string variable `var'
  3.                 if _rc!=0 {
  4.                         assert `var'==.
  5.                         rename `var' `var'_date
  6.                 }
  7.         
.                 else {
  8.                                 replace `var' = `var' + "-15"
  9.                                 rename `var' `var'_dstr
 10.                                 replace `var'_dstr = " " if `var'_dstr == 
> "-15"
 11.                                 gen `var'_date = date(`var'_dstr, "YMD") 
 12.                                 order `var'_date, after(`var'_dstr)
 13.                                 drop `var'_dstr
 14.                 }
 15.         
.         format `var'_date %td
 16. }
variable hba1c_mmol_per_mol_date was str7 now str10
(100,000 real changes made)
(5,000 real changes made)
(5,000 missing values generated)
variable hba1c_percentage_date was str7 now str10
(100,000 real changes made)
(5,000 real changes made)
(5,000 missing values generated)
variable creatinine_date was str7 now str10
(100,000 real changes made)
(5,000 real changes made)
(5,000 missing values generated)
variable bmi_date_measured was str7 now str10
(100,000 real changes made)
(40,000 real changes made)
(40,000 missing values generated)
variable abatacept was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable adalimumab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable baricitinib was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable certolizumab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable etanercept was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable golimumab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable guselkumab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable infliximab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable ixekizumab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable methotrexate_hcd was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable rituximab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable sarilumab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable secukinumab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable tocilizumab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable tofacitinib was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable upadacitinib was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable ustekinumab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)

. 
. **Conversion for dates with day already included ============================
> ========================*/
. 
. foreach var of varlist   died_date_ons                                       
>    ///
>                                              eia_code_date                   
>                            ///
>                                                  rheum_appt_date             
>                            ///
>                                              ra_code_date                    
>                            ///
>                                                  psa_code_date               
>                            ///
>                                                  anksp_code_date             
>                            ///
>                                                  last_gp_prerheum_date       
>                    ///
>                                                  last_gp_precode_date        
>                    ///     
>                                                  last_gp_refrheum_date       
>                    ///
>                                                  last_gp_refcode_date        
>                    ///
>                                                  referral_rheum_prerheum     
>                    ///
>                                                  referral_rheum_precode      
>                    ///     
>                                                  chronic_cardiac_disease     
>                    ///
>                                                  diabetes                    
>                                    ///
>                                                  hypertension                
>                            ///     
>                                                  chronic_resp_disease        
>                    ///
>                                                  copd                        
>                                    ///
>                                                  chronic_liver_disease       
>                    ///
>                                                  stroke                      
>                                    ///
>                                                  lung_cancer                 
>                            ///
>                                                  haem_cancer                 
>                            ///
>                                                  other_cancer                
>                            ///
>                                                  esrf                        
>                                    ///
>                                                  organ_transplant            
>                            ///
>                                                  hydroxychloroquine          
>                            ///
>                                                  leflunomide                 
>                            ///
>                                                  methotrexate                
>                            ///
>                                                  methotrexate_inj            
>                            ///
>                                                  sulfasalazine               
>                            ///
>                                                  {
  2.                                                                  
.                 capture confirm string variable `var'
  3.                 if _rc!=0 {
  4.                         assert `var'==.
  5.                         rename `var' `var'_date
  6.                 }
  7.         
.                 else {
  8.                                 rename `var' `var'_dstr
  9.                                 gen `var'_date = date(`var'_dstr, "YMD") 
 10.                                 order `var'_date, after(`var'_dstr)
 11.                                 drop `var'_dstr
 12.                                 gen `var'_date15 = `var'_date+15
 13.                                 order `var'_date15, after(`var'_date)
 14.                                 drop `var'_date
 15.                                 rename `var'_date15 `var'_date
 16.                 }
 17.         
.         format `var'_date %td
 18. }
(90,000 missing values generated)
(90,000 missing values generated)
(1,000 missing values generated)
(1,000 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(1,000 missing values generated)
(1,000 missing values generated)
(1,000 missing values generated)
(1,000 missing values generated)
(1,000 missing values generated)
(1,000 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(90,000 missing values generated)
(90,000 missing values generated)
(90,000 missing values generated)
(90,000 missing values generated)
(90,000 missing values generated)
(90,000 missing values generated)
(90,000 missing values generated)
(90,000 missing values generated)
(90,000 missing values generated)
(90,000 missing values generated)

.                                                  
. **Rename variables with extra 'date' added to the end of variable names======
> =====================================================*/ 
. rename rheum_appt_date_date rheum_appt_date

. rename eia_code_date_date eia_code_date

. rename ra_code_date_date ra_code_date

. rename psa_code_date_date psa_code_date

. rename anksp_code_date_date anksp_code_date

. rename died_date_ons_date died_ons_date

. rename last_gp_prerheum_date_date last_gp_prerheum_date

. rename last_gp_refrheum_date_date last_gp_refrheum_date

. rename last_gp_refcode_date_date last_gp_refcode_date

. rename last_gp_precode_date_date last_gp_precode_date

. rename hba1c_mmol_per_mol_date_date hba1c_mmol_per_mol_date

. rename hba1c_percentage_date_date hba1c_percentage_date

. rename creatinine_date_date creatinine_date

. rename creatinine creatinine_value 

. rename bmi_date_measured_date bmi_date

. rename bmi bmi_value

. 
. **Create binary indicator variables for relevant conditions =================
> ===================================*/
. 
. foreach var of varlist   eia_code_date                                       
>    ///
>                                                  rheum_appt_date             
>                            ///
>                                              ra_code_date                    
>                            ///
>                                                  psa_code_date               
>                            ///
>                                                  anksp_code_date             
>                            ///
>                                                  died_ons_date               
>                            ///
>                                                  last_gp_prerheum_date       
>                    ///
>                                                  last_gp_precode_date        
>                    ///     
>                                                  last_gp_refrheum_date       
>                    ///
>                                                  last_gp_refcode_date        
>                    ///
>                                                  referral_rheum_prerheum_date
>            ///
>                                                  referral_rheum_precode_date 
>            ///     
>                                                  chronic_cardiac_disease_date
>            ///
>                                                  diabetes_date               
>                            ///
>                                                  hypertension_date           
>                            ///
>                                                  chronic_resp_disease_date   
>                    ///
>                                                  copd_date                   
>                                    ///
>                                                  chronic_liver_disease_date  
>                    ///
>                                                  stroke_date                 
>                            ///
>                                                  lung_cancer_date            
>                            ///
>                                                  haem_cancer_date            
>                            ///             
>                                                  other_cancer_date           
>                            ///
>                                                  esrf_date                   
>                                    ///
>                                                  creatinine_date             
>                            ///
>                                                  organ_transplant_date       
>                    ///
>                                                  hydroxychloroquine_date     
>                    ///     
>                                                  leflunomide_date            
>                            ///
>                                                  methotrexate_date           
>                            ///
>                                                  methotrexate_inj_date       
>                    ///             
>                                                  sulfasalazine_date          
>                            ///
>                                                  abatacept_date              
>                            ///
>                                                  adalimumab_date             
>                            ///
>                                                  baricitinib_date            
>                            ///
>                                                  certolizumab_date           
>                            ///
>                                                  etanercept_date             
>                            ///
>                                                  golimumab_date              
>                            ///
>                                                  guselkumab_date             
>                            ///
>                                                  infliximab_date             
>                            ///
>                                                  ixekizumab_date             
>                            ///
>                                                  methotrexate_hcd_date       
>                    ///
>                                                  rituximab_date              
>                            ///             
>                                                  sarilumab_date              
>                            ///
>                                                  secukinumab_date            
>                            ///
>                                                  tocilizumab_date            
>                            ///             
>                                                  tofacitinib_date            
>                            ///
>                                                  upadacitinib_date           
>                            ///
>                                                  ustekinumab_date   {        
>                    
  2.         /*date ranges are applied in python, so presence of date indicates
>  presence of 
>           disease in the correct time frame*/ 
.         local newvar =  substr("`var'", 1, length("`var'") - 5)
  3.         gen `newvar' = (`var'!=. )
  4.         order `newvar', after(`var')
  5. }

. 
. **Create and label variables ================================================
> ===========*/
. 
. **Demographics
. ***Sex
. gen male = 1 if sex == "M"
(50,878 missing values generated)

. replace male = 0 if sex == "F"
(50,878 real changes made)

. lab var male "Male"

. tab male, missing

       Male |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     50,878       50.88       50.88
          1 |     49,122       49.12      100.00
------------+-----------------------------------
      Total |    100,000      100.00

. 
. ***Ethnicity
. replace ethnicity = .u if ethnicity == .
(25,000 real changes made, 25,000 to missing)

. ****rearrange in order of prevalence
. recode ethnicity 2=6 /* mixed to 6 */
(ethnicity: 15007 changes made)

. recode ethnicity 3=2 /* south asian to 2 */
(ethnicity: 7465 changes made)

. recode ethnicity 4=3 /* black to 3 */
(ethnicity: 7475 changes made)

. recode ethnicity 6=4 /* mixed to 4 */
(ethnicity: 15007 changes made)

. recode ethnicity 5=4 /* other to 4 */
(ethnicity: 7623 changes made)

. 
. label define ethnicity  1 "White"                                       ///
>                                                 2 "Asian/Asian British"      
>    ///
>                                                 3 "Black"                    
>                    ///
>                                                 4 "Mixed/Other"              
>            ///
>                                                 .u "Missing"

. label values ethnicity ethnicity

. lab var ethnicity "Ethnicity"

. tab ethnicity, missing

          Ethnicity |      Freq.     Percent        Cum.
--------------------+-----------------------------------
              White |     37,430       37.43       37.43
Asian/Asian British |      7,465        7.46       44.89
              Black |      7,475        7.47       52.37
        Mixed/Other |     22,630       22.63       75.00
            Missing |     25,000       25.00      100.00
--------------------+-----------------------------------
              Total |    100,000      100.00

. 
. ***STP 
. rename stp stp_old

. bysort stp_old: gen stp = 1 if _n==1
(99,998 missing values generated)

. replace stp = sum(stp) //
(99,999 real changes made)

. drop stp_old

. 
. ***Regions
. encode region, gen(nuts_region)

. tab region, missing

                  region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
           East Midlands |     10,092       10.09       10.09
         East of England |      9,824        9.82       19.92
                  London |     20,359       20.36       40.28
              North East |      9,687        9.69       49.96
              North West |      9,890        9.89       59.85
              South East |     19,872       19.87       79.72
           West Midlands |     10,085       10.09       89.81
Yorkshire and the Humber |     10,191       10.19      100.00
-------------------------+-----------------------------------
                   Total |    100,000      100.00

. 
. ***IMD
. /*
> *Group into 5 groups
> rename imd imd_o
> egen imd = cut(imd_o), group(5) icodes 
> *Add one to create groups 1-5 
> replace imd = imd + 1
> *-1 is missing, should be excluded from population 
> replace imd = .u if imd_o == -1
> drop imd_o
> *Reverse the order (so high is more deprived)
> recode imd 5 = 1 4 = 2 3 = 3 2 = 4 1 = 5 .u = .u
> label define imd 1 "1 least deprived" 2 "2" 3 "3" 4 "4" 5 "5 most deprived" .
> u "Missing"
> label values imd imd 
> lab var imd "Index of multiple deprivation"
> */
. tab imd, missing

        imd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,075        5.08        5.08
          1 |     19,000       19.00       24.07
          2 |     19,208       19.21       43.28
          3 |     18,854       18.85       62.14
          4 |     19,007       19.01       81.14
          5 |     18,856       18.86      100.00
------------+-----------------------------------
      Total |    100,000      100.00

. 
. ***Age variables
. *Nb. works if ages 18 and over
. *Create categorised age
. drop if age<18 & age !=.
(21,096 observations deleted)

. drop if age>109 & age !=.
(0 observations deleted)

. drop if age==.
(0 observations deleted)

. lab var age "Age"

. 
. recode age 18/39.9999 = 1 /// 
>            40/49.9999 = 2 ///
>                    50/59.9999 = 3 ///
>                60/69.9999 = 4 ///
>                    70/79.9999 = 5 ///
>                    80/max = 6, gen(agegroup) 
(78904 differences between age and agegroup)

. 
. label define agegroup   1 "18-39" ///
>                                                 2 "40-49" ///
>                                                 3 "50-59" ///
>                                                 4 "60-69" ///
>                                                 5 "70-79" ///
>                                                 6 "80+"

.                                                 
. label values agegroup agegroup

. lab var agegroup "Age group"

. tab agegroup, missing

  Age group |      Freq.     Percent        Cum.
------------+-----------------------------------
      18-39 |     28,695       36.37       36.37
      40-49 |     12,918       16.37       52.74
      50-59 |     13,586       17.22       69.96
      60-69 |     10,478       13.28       83.24
      70-79 |      8,195       10.39       93.62
        80+ |      5,032        6.38      100.00
------------+-----------------------------------
      Total |     78,904      100.00

. 
. *Create binary age
. recode age min/69.999 = 0 ///
>            70/max = 1, gen(age70)
(78904 differences between age and age70)

. 
. ***Body Mass Index
. *Recode strange values 
. replace bmi_value = . if bmi_value == 0 
(31,483 real changes made, 31,483 to missing)

. replace bmi_value = . if !inrange(bmi_value, 10, 80)
(307 real changes made, 307 to missing)

. 
. *Restrict to within 10 years of EIA diagnosis date and aged>16 
. gen bmi_time = (eia_code_date - bmi_date)/365.25
(31,947 missing values generated)

. gen bmi_age = age - bmi_time
(31,947 missing values generated)

. replace bmi_value = . if bmi_age < 16 
(33,526 real changes made, 33,526 to missing)

. replace bmi_value = . if bmi_time > 10 & bmi_time != . 
(8,781 real changes made, 8,781 to missing)

. 
. *Set to missing if no date, and vice versa 
. replace bmi_value = . if bmi_date == . 
(0 real changes made)

. replace bmi_date = . if bmi_value == . 
(42,614 real changes made, 42,614 to missing)

. replace bmi_time = . if bmi_value == . 
(42,609 real changes made, 42,609 to missing)

. replace bmi_age = . if bmi_value == . 
(42,609 real changes made, 42,609 to missing)

. 
. *Create BMI categories
. gen     bmicat = .
(78,904 missing values generated)

. recode  bmicat . = 1 if bmi_value < 18.5
(bmicat: 194 changes made)

. recode  bmicat . = 2 if bmi_value < 25
(bmicat: 504 changes made)

. recode  bmicat . = 3 if bmi_value < 30
(bmicat: 721 changes made)

. recode  bmicat . = 4 if bmi_value < 35
(bmicat: 893 changes made)

. recode  bmicat . = 5 if bmi_value < 40
(bmicat: 977 changes made)

. recode  bmicat . = 6 if bmi_value < .
(bmicat: 1518 changes made)

. replace bmicat = .u if bmi_value >= .
(74,097 real changes made, 74,097 to missing)

. 
. label define bmicat 1 "Underweight (<18.5)"     ///
>                                         2 "Normal (18.5-24.9)"          ///
>                                         3 "Overweight (25-29.9)"        ///
>                                         4 "Obese I (30-34.9)"           ///
>                                         5 "Obese II (35-39.9)"          ///
>                                         6 "Obese III (40+)"                  
>    ///
>                                         .u "Missing"

.                                         
. label values bmicat bmicat

. lab var bmicat "BMI"

. tab bmicat, missing

                 BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |        194        0.25        0.25
  Normal (18.5-24.9) |        504        0.64        0.88
Overweight (25-29.9) |        721        0.91        1.80
   Obese I (30-34.9) |        893        1.13        2.93
  Obese II (35-39.9) |        977        1.24        4.17
     Obese III (40+) |      1,518        1.92        6.09
             Missing |     74,097       93.91      100.00
---------------------+-----------------------------------
               Total |     78,904      100.00

. 
. *Create less granular categorisation
. recode bmicat 1/3 .u = 1 4 = 2 5 = 3 6 = 4, gen(obese4cat)
(78710 differences between bmicat and obese4cat)

. 
. label define obese4cat  1 "No record of obesity"        ///
>                                                 2 "Obese I (30-34.9)"        
>    ///
>                                                 3 "Obese II (35-39.9)"       
>    ///
>                                                 4 "Obese III (40+)"          
>    

. 
. label values obese4cat obese4cat

. order obese4cat, after(bmicat)

. 
. ***Smoking 
. label define smoke 1 "Never" 2 "Former" 3 "Current" .u "Missing"

. 
. gen     smoke = 1  if smoking_status == "N"
(70,939 missing values generated)

. replace smoke = 2  if smoking_status == "E"
(3,945 real changes made)

. replace smoke = 3  if smoking_status == "S"
(23,761 real changes made)

. replace smoke = .u if smoking_status == "M"
(3,899 real changes made, 3,899 to missing)

. replace smoke = .u if smoking_status == "" 
(39,334 real changes made, 39,334 to missing)

. 
. label values smoke smoke

. lab var smoke "Smoking status"

. drop smoking_status

. tab smoke, missing

    Smoking |
     status |      Freq.     Percent        Cum.
------------+-----------------------------------
      Never |      7,965       10.09       10.09
     Former |      3,945        5.00       15.09
    Current |     23,761       30.11       45.21
    Missing |     43,233       54.79      100.00
------------+-----------------------------------
      Total |     78,904      100.00

. 
. *Create non-missing 3-category variable for current smoking (assumes missing 
> smoking is never smoking)
. recode smoke .u = 1, gen(smoke_nomiss)
(43233 differences between smoke and smoke_nomiss)

. order smoke_nomiss, after(smoke)

. label values smoke_nomiss smoke

. 
. **Clinical comorbidities
. ***eGFR
. *Set implausible creatinine values to missing (Note: zero changed to missing)
. replace creatinine_value = . if !inrange(creatinine_value, 20, 3000) 
(20,108 real changes made, 20,108 to missing)

. 
. *Remove creatinine dates if no measurements, and vice versa 
. replace creatinine_value = . if creatinine_date == . 
(0 real changes made)

. replace creatinine_date = . if creatinine_value == . 
(16,128 real changes made, 16,128 to missing)

. replace creatinine = . if creatinine_value == .
(20,108 real changes made, 20,108 to missing)

. recode creatinine .=0
(creatinine: 20108 changes made)

. tab creatinine, missing

 creatinine |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     20,108       25.48       25.48
          1 |     58,796       74.52      100.00
------------+-----------------------------------
      Total |     78,904      100.00

. tabstat creatinine_value, stat(n mean p50)

    variable |         N      mean       p50
-------------+------------------------------
creatinin~ue |     58796  136.0384  126.5278
--------------------------------------------

. 
. *Divide by 88.4 (to convert umol/l to mg/dl) 
. gen SCr_adj = creatinine_value/88.4
(20,108 missing values generated)

. 
. gen min = .
(78,904 missing values generated)

. replace min = SCr_adj/0.7 if male==0
(29,911 real changes made)

. replace min = SCr_adj/0.9 if male==1
(28,885 real changes made)

. replace min = min^-0.329  if male==0
(29,911 real changes made)

. replace min = min^-0.411  if male==1
(28,885 real changes made)

. replace min = 1 if min<1
(45,897 real changes made)

. 
. gen max=.
(78,904 missing values generated)

. replace max=SCr_adj/0.7 if male==0
(29,911 real changes made)

. replace max=SCr_adj/0.9 if male==1
(28,885 real changes made)

. replace max=max^-1.209
(58,796 real changes made)

. replace max=1 if max>1
(33,007 real changes made)

. 
. gen egfr=min*max*141
(20,108 missing values generated)

. replace egfr=egfr*(0.993^age)
(58,796 real changes made)

. replace egfr=egfr*1.018 if male==0
(29,911 real changes made)

. label var egfr "egfr calculated using CKD-EPI formula with no ethnicity"

. 
. *Categorise into ckd stages
. egen egfr_cat_all = cut(egfr), at(0, 15, 30, 45, 60, 5000)
(20108 missing values generated)

. recode egfr_cat_all 0 = 5 15 = 4 30 = 3 45 = 2 60 = 0, generate(ckd_egfr)
(58796 differences between egfr_cat_all and ckd_egfr)

. 
. gen egfr_cat = .
(78,904 missing values generated)

. recode egfr_cat . = 3 if egfr < 30
(egfr_cat: 13681 changes made)

. recode egfr_cat . = 2 if egfr < 60
(egfr_cat: 20971 changes made)

. recode egfr_cat . = 1 if egfr < .
(egfr_cat: 24144 changes made)

. replace egfr_cat = .u if egfr >= .
(20,108 real changes made, 20,108 to missing)

. 
. label define egfr_cat   1 ">=60"                ///
>                                                 2 "30-59"               ///
>                                                 3 "<30"                 ///
>                                                 .u "Missing"

.                                         
. label values egfr_cat egfr_cat

. lab var egfr_cat "eGFR"

. tab egfr_cat, missing

       eGFR |      Freq.     Percent        Cum.
------------+-----------------------------------
       >=60 |     24,144       30.60       30.60
      30-59 |     20,971       26.58       57.18
        <30 |     13,681       17.34       74.52
    Missing |     20,108       25.48      100.00
------------+-----------------------------------
      Total |     78,904      100.00

. 
. *If missing eGFR, assume normal
. gen egfr_cat_nomiss = egfr_cat
(20,108 missing values generated)

. replace egfr_cat_nomiss = 1 if egfr_cat == .u
(20,108 real changes made)

. 
. label define egfr_cat_nomiss    1 ">=60/missing"        ///
>                                                                 2 "30-59"    
>                    ///
>                                                                 3 "<30" 

. label values egfr_cat_nomiss egfr_cat_nomiss

. lab var egfr_cat_nomiss "eGFR"

. 
. gen egfr_date = creatinine_date
(20,108 missing values generated)

. format egfr_date %td

. 
. *Add in end stage renal failure and create a single CKD variable 
. *Missing assumed to not have CKD 
. gen ckd = 0

. replace ckd = 1 if ckd_egfr != . & ckd_egfr >= 1
(34,652 real changes made)

. replace ckd = 1 if esrf == 1
(8,802 real changes made)

. 
. label define ckd 0 "No CKD" 1 "CKD"

. label values ckd ckd

. label var ckd "Chronic kidney disease"

. tab ckd, missing

    Chronic |
     kidney |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
     No CKD |     35,450       44.93       44.93
        CKD |     43,454       55.07      100.00
------------+-----------------------------------
      Total |     78,904      100.00

. 
. *Create date (most recent measure prior to index)
. gen temp1_ckd_date = creatinine_date if ckd_egfr >=1
(44,252 missing values generated)

. gen temp2_ckd_date = esrf_date if esrf == 1
(63,160 missing values generated)

. gen ckd_date = max(temp1_ckd_date,temp2_ckd_date) 
(35,450 missing values generated)

. format ckd_date %td 

. 
. drop temp1_ckd_date temp2_ckd_date SCr_adj min max ckd_egfr egfr_cat_all

. 
. ***HbA1c
. *Set zero or negative to missing
. replace hba1c_percentage   = . if hba1c_percentage <= 0
(4,437 real changes made, 4,437 to missing)

. replace hba1c_mmol_per_mol = . if hba1c_mmol_per_mol <= 0
(5,570 real changes made, 5,570 to missing)

. 
. *Change implausible values to missing
. replace hba1c_percentage   = . if !inrange(hba1c_percentage, 1, 20)
(1,245 real changes made, 1,245 to missing)

. replace hba1c_mmol_per_mol = . if !inrange(hba1c_mmol_per_mol, 10, 200)
(3,305 real changes made, 3,305 to missing)

. 
. *Set most recent values of >24 months prior to EIA diagnosis date to missing
. replace hba1c_percentage   = . if (eia_code_date - hba1c_percentage_date) > 2
> 4*30 & hba1c_percentage_date != .
(70,827 real changes made, 70,827 to missing)

. replace hba1c_mmol_per_mol = . if (eia_code_date - hba1c_mmol_per_mol_date) >
>  24*30 & hba1c_mmol_per_mol_date != .
(67,731 real changes made, 67,731 to missing)

. 
. *Clean up dates
. replace hba1c_percentage_date = . if hba1c_percentage == .
(72,561 real changes made, 72,561 to missing)

. replace hba1c_mmol_per_mol_date = . if hba1c_mmol_per_mol == .
(72,684 real changes made, 72,684 to missing)

. 
. *Express  HbA1c as percentage
. *Express all values as perecentage 
. noi summ hba1c_percentage hba1c_mmol_per_mol 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hba1c_per~ge |      2,395    5.138215     1.91455   1.001054   11.86399
hba1c_mmol~l |      2,298    42.42106    17.38222   10.01369   115.4745

. gen     hba1c_pct = hba1c_percentage 
(76,509 missing values generated)

. replace hba1c_pct = (hba1c_mmol_per_mol/10.929)+2.15 if hba1c_mmol_per_mol<. 
(2,298 real changes made)

. 
. *Valid % range between 0-20  
. replace hba1c_pct = . if !inrange(hba1c_pct, 1, 20) 
(0 real changes made)

. replace hba1c_pct = round(hba1c_pct, 0.1)
(4,627 real changes made)

. 
. *Categorise HbA1c and diabetes
. *Group hba1c pct
. gen     hba1ccat = 0 if hba1c_pct <  6.5
(75,719 missing values generated)

. replace hba1ccat = 1 if hba1c_pct >= 6.5  & hba1c_pct < 7.5
(736 real changes made)

. replace hba1ccat = 2 if hba1c_pct >= 7.5  & hba1c_pct < 8
(238 real changes made)

. replace hba1ccat = 3 if hba1c_pct >= 8    & hba1c_pct < 9
(310 real changes made)

. replace hba1ccat = 4 if hba1c_pct >= 9    & hba1c_pct !=.
(158 real changes made)

. label define hba1ccat 0 "<6.5%" 1">=6.5-7.4" 2">=7.5-7.9" 3">=8-8.9" 4">=9"

. label values hba1ccat hba1ccat

. tab hba1ccat, missing

   hba1ccat |      Freq.     Percent        Cum.
------------+-----------------------------------
      <6.5% |      3,185        4.04        4.04
  >=6.5-7.4 |        736        0.93        4.97
  >=7.5-7.9 |        238        0.30        5.27
    >=8-8.9 |        310        0.39        5.66
        >=9 |        158        0.20        5.86
          . |     74,277       94.14      100.00
------------+-----------------------------------
      Total |     78,904      100.00

. 
. *Express all values as mmol
. gen hba1c_mmol = hba1c_mmol_per_mol
(76,606 missing values generated)

. replace hba1c_mmol = (hba1c_percentage*10.929)-23.5 if hba1c_percentage<. & h
> ba1c_mmol==.
(2,329 real changes made)

. 
. *Group hba1c mmol
. gen     hba1ccatmm = 0 if hba1c_mmol < 58
(74,976 missing values generated)

. replace hba1ccatmm = 1 if hba1c_mmol >= 58 & hba1c_mmol !=.
(699 real changes made)

. replace hba1ccatmm =.u if hba1ccatmm==. 
(74,277 real changes made, 74,277 to missing)

. label define hba1ccatmm 0 "HbA1c <58mmol/mol" 1 "HbA1c >=58mmol/mol" .u "Miss
> ing"

. label values hba1ccatmm hba1ccatmm

. lab var hba1ccatmm "HbA1c"

. tab hba1ccatmm, missing

             HbA1c |      Freq.     Percent        Cum.
-------------------+-----------------------------------
 HbA1c <58mmol/mol |      3,928        4.98        4.98
HbA1c >=58mmol/mol |        699        0.89        5.86
           Missing |     74,277       94.14      100.00
-------------------+-----------------------------------
             Total |     78,904      100.00

. 
. *Create diabetes, split by control/not (assumes missing = no diabetes)
. gen     diabcat = 1 if diabetes==0
(15,808 missing values generated)

. replace diabcat = 2 if diabetes==1 & inlist(hba1ccat, 0, 1)
(787 real changes made)

. replace diabcat = 3 if diabetes==1 & inlist(hba1ccat, 2, 3, 4)
(128 real changes made)

. replace diabcat = 4 if diabetes==1 & !inlist(hba1ccat, 0, 1, 2, 3, 4)
(14,893 real changes made)

. 
. label define diabcat    1 "No diabetes"                         ///
>                                                 2 "Controlled diabetes"      
>    ///
>                                                 3 "Uncontrolled diabetes"    
>    ///
>                                                 4 "Diabetes, no hba1c measure
> "

. label values diabcat diabcat

. 
. *Create cancer variable 'other cancer currently', includes carcinoma of the h
> ead and neck - need to confirm if this excludes NMSC
. gen cancer =0

. replace cancer =1 if lung_cancer ==1 | haem_cancer ==1 | other_cancer ==1
(38,594 real changes made)

. lab var cancer "Cancer"

. tab cancer, missing

     Cancer |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     40,310       51.09       51.09
          1 |     38,594       48.91      100.00
------------+-----------------------------------
      Total |     78,904      100.00

. 
. *Create other comorbid variables
. gen combined_cv_comorbid =1 if chronic_cardiac_disease ==1 | stroke==1
(50,512 missing values generated)

. recode combined_cv_comorbid .=0
(combined_cv_comorbid: 50512 changes made)

. 
. *Label variables
. lab var hypertension "Hypertension"

. lab var diabetes "Diabetes"

. lab var stroke "Stroke"

. lab var chronic_resp_disease "Chronic respiratory disease"

. lab var copd "COPD"

. lab var esrf "End-stage renal failure"

. lab var chronic_liver_disease "Chronic liver disease"

. lab var chronic_cardiac_disease "Chronic cardiac disease"

. 
. drop age

. 
. *Refine diagnostic window====================================================
> =========*/
. 
. **All patients should have EIA code
. tab eia_code, missing

   eia_code |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        776        0.98        0.98
          1 |     78,128       99.02      100.00
------------+-----------------------------------
      Total |     78,904      100.00

. keep if eia_code==1
(776 observations deleted)

. 
. **Keep patients with first EIA code in GP record if code was after 1st March 
> 2019
. keep if eia_code_date>=date("$start_date", "DMY") & eia_code_date!=. 
(18,399 observations deleted)

. tab eia_code

   eia_code |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     59,729      100.00      100.00
------------+-----------------------------------
      Total |     59,729      100.00

. 
. **Month/Year of EIA code
. gen year_diag=year(eia_code_date)

. format year_diag %ty

. gen month_diag=month(eia_code_date)

. gen mo_year_diagn=ym(year_diag, month_diag)

. format mo_year_diagn %tm

. 
. *Include only most recent EIA sub-diagnosis==================================
> ===========*/
. 
. replace ra_code =0 if psa_code_date >= ra_code_date & psa_code_date !=.
(29,224 real changes made)

. replace ra_code =0 if anksp_code_date >= ra_code_date & anksp_code_date !=.
(10,005 real changes made)

. replace psa_code =0 if ra_code_date >= psa_code_date & ra_code_date !=.
(29,317 real changes made)

. replace psa_code =0 if anksp_code_date >= psa_code_date & anksp_code_date !=.
(9,991 real changes made)

. replace anksp_code =0 if psa_code_date >= anksp_code_date & psa_code_date !=.
(29,222 real changes made)

. replace anksp_code =0 if ra_code_date >= anksp_code_date & ra_code_date !=.
(9,931 real changes made)

. gen eia_diagnosis=1 if ra_code==1
(39,828 missing values generated)

. replace eia_diagnosis=2 if psa_code==1
(19,795 real changes made)

. replace eia_diagnosis=3 if anksp_code==1
(19,978 real changes made)

. lab define eia_diagnosis 1 "RA" 2 "PsA" 3 "AxSpA", modify

. lab val eia_diagnosis eia_diagnosis

. tab eia_diagnosis, missing

eia_diagnos |
         is |      Freq.     Percent        Cum.
------------+-----------------------------------
         RA |     19,901       33.32       33.32
        PsA |     19,795       33.14       66.46
      AxSpA |     19,978       33.45       99.91
          . |         55        0.09      100.00
------------+-----------------------------------
      Total |     59,729      100.00

. drop if eia_diagnosis==. //should be ~none
(55 observations deleted)

. 
. *Define drugs and dates=====================================================*
> /
. 
. **csDMARDs (not including high cost MTX; wouldn't be shared care)
. gen csdmard=1 if hydroxychloroquine==1 | leflunomide==1 | methotrexate==1 | m
> ethotrexate_inj==1 | sulfasalazine==1
(35,216 missing values generated)

. recode csdmard .=0 
(csdmard: 35216 changes made)

. tab csdmard, missing

    csdmard |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     35,216       59.01       59.01
          1 |     24,458       40.99      100.00
------------+-----------------------------------
      Total |     59,674      100.00

. bys eia_diagnosis: tab csdmard

-------------------------------------------------------------------------------
-> eia_diagnosis = RA

    csdmard |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     11,808       59.33       59.33
          1 |      8,093       40.67      100.00
------------+-----------------------------------
      Total |     19,901      100.00

-------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    csdmard |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     11,669       58.95       58.95
          1 |      8,126       41.05      100.00
------------+-----------------------------------
      Total |     19,795      100.00

-------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    csdmard |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     11,739       58.76       58.76
          1 |      8,239       41.24      100.00
------------+-----------------------------------
      Total |     19,978      100.00


. 
. **csDMARDs (including high cost MTX)
. gen csdmard_hcd=1 if hydroxychloroquine==1 | leflunomide==1 | methotrexate==1
>  | methotrexate_inj==1 | methotrexate_hcd==1 | sulfasalazine==1
(31,673 missing values generated)

. recode csdmard_hcd .=0 
(csdmard_hcd: 31673 changes made)

. tab csdmard_hcd, missing

csdmard_hcd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     31,673       53.08       53.08
          1 |     28,001       46.92      100.00
------------+-----------------------------------
      Total |     59,674      100.00

. bys eia_diagnosis: tab csdmard_hcd, missing

-------------------------------------------------------------------------------
-> eia_diagnosis = RA

csdmard_hcd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,633       53.43       53.43
          1 |      9,268       46.57      100.00
------------+-----------------------------------
      Total |     19,901      100.00

-------------------------------------------------------------------------------
-> eia_diagnosis = PsA

csdmard_hcd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,509       53.09       53.09
          1 |      9,286       46.91      100.00
------------+-----------------------------------
      Total |     19,795      100.00

-------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

csdmard_hcd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,531       52.71       52.71
          1 |      9,447       47.29      100.00
------------+-----------------------------------
      Total |     19,978      100.00


. 
. **Date of first csDMARD script (not including high cost MTX prescriptions)
. gen csdmard_date=min(hydroxychloroquine_date, leflunomide_date, methotrexate_
> date, methotrexate_inj_date, sulfasalazine_date)
(35,216 missing values generated)

. format %td csdmard_date

. 
. **Date of first csDMARD script (including high cost MTX prescriptions)
. gen csdmard_hcd_date=min(hydroxychloroquine_date, leflunomide_date, methotrex
> ate_date, methotrexate_inj_date, methotrexate_hcd_date, sulfasalazine_date)
(31,673 missing values generated)

. format %td csdmard_hcd_date

. 
. **Biologic use
. gen biologic=1 if abatacept==1 | adalimumab==1 | baricitinib==1 | certolizuma
> b==1 | etanercept==1 | golimumab==1 | guselkumab==1 | infliximab==1 | ixekizu
> mab==1 | rituximab==1 | sarilumab==1 | secukinumab==1 | tocilizumab==1 | tofa
> citinib==1 | upadacitinib==1 | ustekinumab==1 
(11,138 missing values generated)

. recode biologic .=0
(biologic: 11138 changes made)

. tab biologic, missing

   biologic |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     11,138       18.66       18.66
          1 |     48,536       81.34      100.00
------------+-----------------------------------
      Total |     59,674      100.00

. bys eia_diagnosis: tab biologic, missing 

-------------------------------------------------------------------------------
-> eia_diagnosis = RA

   biologic |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,710       18.64       18.64
          1 |     16,191       81.36      100.00
------------+-----------------------------------
      Total |     19,901      100.00

-------------------------------------------------------------------------------
-> eia_diagnosis = PsA

   biologic |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,655       18.46       18.46
          1 |     16,140       81.54      100.00
------------+-----------------------------------
      Total |     19,795      100.00

-------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

   biologic |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,773       18.89       18.89
          1 |     16,205       81.11      100.00
------------+-----------------------------------
      Total |     19,978      100.00


. 
. **Date of first biologic script
. gen biologic_date=min(abatacept_date, adalimumab_date, baricitinib_date, cert
> olizumab_date, etanercept_date, golimumab_date, guselkumab_date, infliximab_d
> ate, ixekizumab_date, rituximab_date, sarilumab_date, secukinumab_date, tocil
> izumab_date, tofacitinib_date, upadacitinib_date, ustekinumab_date)
(11,138 missing values generated)

. format %td biologic_date

. 
. **Exclude if first csdmard or biologic was before first rheum appt
. ***Nb. could introduce leeway e.g. 30 days?
. tab csdmard if rheum_appt_date!=. & csdmard_date!=. & csdmard_date<rheum_appt
> _date

    csdmard |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      8,866      100.00      100.00
------------+-----------------------------------
      Total |      8,866      100.00

. drop if rheum_appt_date!=. & csdmard_date!=. & csdmard_date<rheum_appt_date
(8,866 observations deleted)

. tab biologic if rheum_appt_date!=. & biologic_date!=. & biologic_date<rheum_a
> ppt_date 

   biologic |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     15,360      100.00      100.00
------------+-----------------------------------
      Total |     15,360      100.00

. drop if rheum_appt_date!=. & biologic_date!=. & biologic_date<rheum_appt_date
>  
(15,360 observations deleted)

. 
. *Number of EIA diagnoses in 1-year time windows==============================
> ===========*/
. 
. gen diagnosis_year=1 if eia_code_date>=td(01mar2019) & eia_code_date<td(01mar
> 2020)
(24,125 missing values generated)

. replace diagnosis_year=2 if eia_code_date>=td(01mar2020) & eia_code_date<td(0
> 1mar2021)
(11,346 real changes made)

. replace diagnosis_year=3 if eia_code_date>=td(01mar2021) & eia_code_date<td(0
> 1mar2022)
(11,140 real changes made)

. lab define diagnosis_year 1 "March 2019-March 2020" 2 "March 2020-March 2021"
>  3 "March 2021-March 2022", modify

. lab val diagnosis_year diagnosis_year

. lab var diagnosis_year "Year of diagnosis"

. tab diagnosis_year, missing

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |     11,323       31.94       31.94
March 2020-March 2021 |     11,346       32.01       63.95
March 2021-March 2022 |     11,140       31.43       95.38
                    . |      1,639        4.62      100.00
----------------------+-----------------------------------
                Total |     35,448      100.00

. bys eia_diagnosis: tab diagnosis_year, missing

-------------------------------------------------------------------------------
-> eia_diagnosis = RA

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |      3,776       31.72       31.72
March 2020-March 2021 |      3,879       32.59       64.31
March 2021-March 2022 |      3,698       31.07       95.38
                    . |        550        4.62      100.00
----------------------+-----------------------------------
                Total |     11,903      100.00

-------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |      3,759       32.03       32.03
March 2020-March 2021 |      3,729       31.77       63.80
March 2021-March 2022 |      3,692       31.46       95.26
                    . |        556        4.74      100.00
----------------------+-----------------------------------
                Total |     11,736      100.00

-------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |      3,788       32.08       32.08
March 2020-March 2021 |      3,738       31.65       63.73
March 2021-March 2022 |      3,750       31.76       95.49
                    . |        533        4.51      100.00
----------------------+-----------------------------------
                Total |     11,809      100.00


. 
. **Proportion of patients with at least 6 or 12 months of GP follow-up after E
> IA code
. tab has_6m_follow_up

has_6m_foll |
      ow_up |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,747        4.93        4.93
          1 |     33,701       95.07      100.00
------------+-----------------------------------
      Total |     35,448      100.00

. tab has_12m_follow_up

has_12m_fol |
     low_up |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,553       10.02       10.02
          1 |     31,895       89.98      100.00
------------+-----------------------------------
      Total |     35,448      100.00

. tab mo_year_diagn has_6m_follow_up

mo_year_di |   has_6m_follow_up
       agn |         0          1 |     Total
-----------+----------------------+----------
    2019m3 |        52        924 |       976 
    2019m4 |        40        834 |       874 
    2019m5 |        49        948 |       997 
    2019m6 |        53        879 |       932 
    2019m7 |        46        923 |       969 
    2019m8 |        60        944 |     1,004 
    2019m9 |        47        893 |       940 
   2019m10 |        36        858 |       894 
   2019m11 |        31        882 |       913 
   2019m12 |        47        930 |       977 
    2020m1 |        44        903 |       947 
    2020m2 |        43        857 |       900 
    2020m3 |        42        898 |       940 
    2020m4 |        49        886 |       935 
    2020m5 |        49        960 |     1,009 
    2020m6 |        41        901 |       942 
    2020m7 |        44        939 |       983 
    2020m8 |        45        849 |       894 
    2020m9 |        39        889 |       928 
   2020m10 |        51        966 |     1,017 
   2020m11 |        35        858 |       893 
   2020m12 |        48        929 |       977 
    2021m1 |        55        873 |       928 
    2021m2 |        44        856 |       900 
    2021m3 |        55        889 |       944 
    2021m4 |        51        817 |       868 
    2021m5 |        43        916 |       959 
    2021m6 |        54        879 |       933 
    2021m7 |        52        869 |       921 
    2021m8 |        42        911 |       953 
    2021m9 |        42        849 |       891 
   2021m10 |        54        896 |       950 
   2021m11 |        50        913 |       963 
   2021m12 |        54        905 |       959 
    2022m1 |        55        901 |       956 
    2022m2 |        44        799 |       843 
    2022m3 |        32        876 |       908 
    2022m4 |        29        702 |       731 
-----------+----------------------+----------
     Total |     1,747     33,701 |    35,448 

. tab mo_year_diagn has_12m_follow_up

mo_year_di |   has_12m_follow_up
       agn |         0          1 |     Total
-----------+----------------------+----------
    2019m3 |        80        896 |       976 
    2019m4 |        94        780 |       874 
    2019m5 |       106        891 |       997 
    2019m6 |        84        848 |       932 
    2019m7 |        97        872 |       969 
    2019m8 |        96        908 |     1,004 
    2019m9 |        92        848 |       940 
   2019m10 |        87        807 |       894 
   2019m11 |       110        803 |       913 
   2019m12 |       106        871 |       977 
    2020m1 |       107        840 |       947 
    2020m2 |       108        792 |       900 
    2020m3 |        93        847 |       940 
    2020m4 |        90        845 |       935 
    2020m5 |        98        911 |     1,009 
    2020m6 |       109        833 |       942 
    2020m7 |        80        903 |       983 
    2020m8 |        74        820 |       894 
    2020m9 |        74        854 |       928 
   2020m10 |        87        930 |     1,017 
   2020m11 |       112        781 |       893 
   2020m12 |        84        893 |       977 
    2021m1 |        90        838 |       928 
    2021m2 |        97        803 |       900 
    2021m3 |        93        851 |       944 
    2021m4 |        92        776 |       868 
    2021m5 |       110        849 |       959 
    2021m6 |        87        846 |       933 
    2021m7 |        87        834 |       921 
    2021m8 |        91        862 |       953 
    2021m9 |        97        794 |       891 
   2021m10 |        96        854 |       950 
   2021m11 |       100        863 |       963 
   2021m12 |        77        882 |       959 
    2022m1 |       106        850 |       956 
    2022m2 |        82        761 |       843 
    2022m3 |       107        801 |       908 
    2022m4 |        73        658 |       731 
-----------+----------------------+----------
     Total |     3,553     31,895 |    35,448 

. tab diagnosis_year if has_6m_follow_up==1, missing

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |     10,775       31.97       31.97
March 2020-March 2021 |     10,804       32.06       64.03
March 2021-March 2022 |     10,544       31.29       95.32
                    . |      1,578        4.68      100.00
----------------------+-----------------------------------
                Total |     33,701      100.00

. tab diagnosis_year if has_12m_follow_up==1, missing

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |     10,156       31.84       31.84
March 2020-March 2021 |     10,258       32.16       64.00
March 2021-March 2022 |     10,022       31.42       95.43
                    . |      1,459        4.57      100.00
----------------------+-----------------------------------
                Total |     31,895      100.00

. 
. *Define appointments and referrals======================================*/
. **Nb. not excluding those without 6m+ follow-up
. 
. **Rheumatology appt 
. tab rheum_appt  //proportion with first rheum outpatient date in the year bef
> ore EIA code appears in GP record (could change to two years)

 rheum_appt |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,885       16.60       16.60
          1 |     29,563       83.40      100.00
------------+-----------------------------------
      Total |     35,448      100.00

. tab rheum_appt if rheum_appt_date<eia_code_date & rheum_appt_date!=. //confir
> m proportion who had rheum appt (i.e. not missing) and appt before EIA code (
> should be accounted for by Python code)

 rheum_appt |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     24,007      100.00      100.00
------------+-----------------------------------
      Total |     24,007      100.00

. 
. **Rheumatology referrals
. tab referral_rheum_prerheum //last rheum referral in the year before rheumato
> logy outpatient (requires rheum appt to have been present, and rheum appt to 
> be before EIA code)

referral_rh |
eum_prerheu |
          m |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,582       10.10       10.10
          1 |     31,866       89.90      100.00
------------+-----------------------------------
      Total |     35,448      100.00

. tab referral_rheum_prerheum if rheum_appt!=0  //last rheum referral in the ye
> ar before rheumatology outpatient if rheum appt date present

referral_rh |
eum_prerheu |
          m |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,948        9.97        9.97
          1 |     26,615       90.03      100.00
------------+-----------------------------------
      Total |     29,563      100.00

. tab referral_rheum_prerheum if rheum_appt!=0 & referral_rheum_prerheum_date<r
> heum_appt_date  //last rheum referral in the year before rheumatology outpati
> ent, assuming ref date before rheum appt date (should be accounted for by Pyt
> hon code)

referral_rh |
eum_prerheu |
          m |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      8,782      100.00      100.00
------------+-----------------------------------
      Total |      8,782      100.00

. tab referral_rheum_precode //last rheum referral in the year before EIA code 
> (could use if rheum appt missing)

referral_rh |
eum_precode |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,600       10.16       10.16
          1 |     31,848       89.84      100.00
------------+-----------------------------------
      Total |     35,448      100.00

. gen referral_rheum_comb_date = referral_rheum_prerheum_date if referral_rheum
> _prerheum_date!=.
(3,582 missing values generated)

. replace referral_rheum_comb_date = referral_rheum_precode_date if referral_rh
> eum_prerheum_date==. & referral_rheum_precode_date!=.
(3,189 real changes made)

. format %td referral_rheum_comb_date

. codebook referral_rheum_comb_date

-------------------------------------------------------------------------------
referral_rheum_comb_date                                            (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric daily date (float)

                 range:  [21260,22758]                units:  1
       or equivalently:  [17mar2018,23apr2022]        units:  days
         unique values:  1,499                    missing .:  393/35,448

                  mean:   22008.6 = 03apr2020 (+ 15 hours)
              std. dev:   432.848

           percentiles:        10%       25%       50%       75%       90%
                             21413     21634     22005     22384     22612
                         17aug2018 26mar2019 31mar2020 14apr2021 28nov2021

. 
. **GP appointments
. tab last_gp_refrheum //proportion with last GP appointment in year before rhe
> um referral (pre-rheum appt); requires there to have been a rheum referral, b
> efore a rheum appt, before an EIA code

last_gp_ref |
      rheum |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,519        9.93        9.93
          1 |     31,929       90.07      100.00
------------+-----------------------------------
      Total |     35,448      100.00

. gen all_appts=1 if last_gp_refrheum==1 & referral_rheum_prerheum==1 & rheum_a
> ppt==1 & eia_code==1 & last_gp_refrheum_date<referral_rheum_prerheum_date & r
> eferral_rheum_prerheum_date<rheum_appt_date & rheum_appt_date<eia_code_date 
(34,469 missing values generated)

. recode all_appts .=0
(all_appts: 34469 changes made)

. tab all_appts, missing //KEY - proportion who had a last gp appt, then rheum 
> ref, then rheum appt, then EIA code 

  all_appts |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     34,469       97.24       97.24
          1 |        979        2.76      100.00
------------+-----------------------------------
      Total |     35,448      100.00

. tab last_gp_refcode //last GP appointment before rheum ref (i.e. pre-eia code
>  ref); requires there to have been a rheum referral before an EIA code (i.e. 
> rheum appt could have been missing)

last_gp_ref |
       code |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,527        9.95        9.95
          1 |     31,921       90.05      100.00
------------+-----------------------------------
      Total |     35,448      100.00

. tab last_gp_prerheum //last GP appointment before rheum appt; requires there 
> to have been a rheum appt before and EIA code

last_gp_pre |
      rheum |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,516        9.92        9.92
          1 |     31,932       90.08      100.00
------------+-----------------------------------
      Total |     35,448      100.00

. tab last_gp_precode //last GP appointment before EIA code

last_gp_pre |
       code |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,476        9.81        9.81
          1 |     31,972       90.19      100.00
------------+-----------------------------------
      Total |     35,448      100.00

. 
. **For sensitivity analyses for those without rheum_appt, replace diagnosis da
> te as EIA code date if rheum appt pre-code is missing or after
. gen eia_diagnosis_date_nomiss=rheum_appt_date if rheum_appt_date!=.
(5,885 missing values generated)

. format %td eia_diagnosis_date_nomiss

. replace eia_diagnosis_date_nomiss=eia_code_date if (rheum_appt_date==. | rheu
> m_appt_date>eia_code_date) & eia_code_date!=.
(11,429 real changes made)

. gen eia_diagnosis_nomiss=1 if eia_diagnosis_date_nomiss!=.

. recode eia_diagnosis_nomiss .=0
(eia_diagnosis_nomiss: 0 changes made)

. tab eia_diagnosis_nomiss

eia_diagnos |
  is_nomiss |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     35,448      100.00      100.00
------------+-----------------------------------
      Total |     35,448      100.00

. 
. *Time to referral, appointment and EIA code==================================
> ===========*/
. 
. **Time from last GP to rheum ref before rheum appt (i.e. if appts are present
>  and in correct time order) //Note - referral could (in theory) be coded just
>  before GP appt
. gen time_gp_rheum_ref_appt = (referral_rheum_prerheum_date - last_gp_refrheum
> _date) if referral_rheum_prerheum_date!=. & last_gp_refrheum_date!=. & rheum_
> appt_date!=. & referral_rheum_prerheum_date>last_gp_refrheum_date & referral_
> rheum_prerheum_date<rheum_appt_date & rheum_appt_date<eia_code_date
(34,469 missing values generated)

. tabstat time_gp_rheum_ref_appt, stats (n mean p50 p25 p75) //all patients (sh
> ould be same number as all_appts)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~t |       979  242.1399       175        84       341
----------------------------------------------------------------

. 
. gen gp_ref_cat=1 if time_gp_rheum_ref_appt<=3 & time_gp_rheum_ref_appt!=. 
(35,438 missing values generated)

. replace gp_ref_cat=2 if time_gp_rheum_ref_appt<=7 & time_gp_rheum_ref_appt!=.
>  & gp_ref_cat==.
(12 real changes made)

. replace gp_ref_cat=3 if time_gp_rheum_ref_appt>7 & time_gp_rheum_ref_appt!=. 
> & gp_ref_cat==.
(957 real changes made)

. lab define gp_ref_cat 1 "Referred within 3 days" 2 "Referred within 7 days" 3
>  "Referral delay >7 days", modify

. lab val gp_ref_cat gp_ref_cat

. lab var gp_ref_cat "Time to GP referral"

. tab gp_ref_cat, missing

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |         10        0.03        0.03
Referred within 7 days |         12        0.03        0.06
Referral delay >7 days |        957        2.70        2.76
                     . |     34,469       97.24      100.00
-----------------------+-----------------------------------
                 Total |     35,448      100.00

. 
. gen gp_ref_3d=1 if time_gp_rheum_ref_appt<=3 & time_gp_rheum_ref_appt!=. 
(35,438 missing values generated)

. replace gp_ref_3d=2 if time_gp_rheum_ref_appt>3 & time_gp_rheum_ref_appt!=.
(969 real changes made)

. lab define gp_ref_3d 1 "Referred within 3 days" 2 "Referral delay >3 days", m
> odify

. lab val gp_ref_3d gp_ref_3d

. lab var gp_ref_3d "Time to GP referral"

. tab gp_ref_3d, missing

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |         10        0.03        0.03
Referral delay >3 days |        969        2.73        2.76
                     . |     34,469       97.24      100.00
-----------------------+-----------------------------------
                 Total |     35,448      100.00

. 
. **Time from last GP to rheum ref before eia code (sensitivity analysis; inclu
> des those with no rheum appt)
. gen time_gp_rheum_ref_code = (referral_rheum_precode_date - last_gp_refcode_d
> ate) if referral_rheum_precode_date!=. & last_gp_refcode_date!=. & referral_r
> heum_precode_date>last_gp_refcode_date & referral_rheum_precode_date<eia_code
> _date
(29,252 missing values generated)

. tabstat time_gp_rheum_ref_code, stats (n mean p50 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~e |      6196  374.1444       311       139       551
----------------------------------------------------------------

. 
. **Time from last GP to rheum ref (combined - sensitivity analysis; includes t
> hose with no rheum appt)
. gen time_gp_rheum_ref_comb = time_gp_rheum_ref_appt 
(34,469 missing values generated)

. replace time_gp_rheum_ref_comb = time_gp_rheum_ref_code if time_gp_rheum_ref_
> appt==. & time_gp_rheum_ref_code!=.
(5,938 real changes made)

. tabstat time_gp_rheum_ref_comb, stats (n mean p50 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~b |      6917  355.0944       289       128       522
----------------------------------------------------------------

. 
. **Time from last GP pre-rheum appt to first rheum appt (key sensitivity analy
> sis; includes those with no rheum ref)
. gen time_gp_rheum_appt = (rheum_appt_date - last_gp_prerheum_date) if rheum_a
> ppt_date!=. & last_gp_prerheum_date!=. & rheum_appt_date>last_gp_prerheum_dat
> e & rheum_appt_date<eia_code_date
(29,905 missing values generated)

. tabstat time_gp_rheum_appt, stats (n mean p50 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_~m_appt |      5543  293.4323       233       105       424
----------------------------------------------------------------

. 
. **Time from last GP pre-code to EIA code (sensitivity analysis; includes thos
> e with no rheum ref and/or no rheum appt)
. gen time_gp_eia_code = (eia_code_date - last_gp_precode_date) if eia_code_dat
> e!=. & last_gp_precode_date!=. & eia_code_date>last_gp_precode_date
(15,766 missing values generated)

. tabstat time_gp_eia_code, stats (n mean p50 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_ei~e |     19682   516.415       462       225       762
----------------------------------------------------------------

. 
. **Time from last GP to EIA diagnosis (combined - sensitivity analysis; includ
> es those with no rheum appt)
. gen time_gp_eia_diag = time_gp_rheum_appt
(29,905 missing values generated)

. replace time_gp_eia_diag = time_gp_eia_code if time_gp_rheum_appt==. & time_g
> p_eia_code!=.
(16,133 real changes made)

. tabstat time_gp_eia_diag, stats (n mean p50 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_ei~g |     21676  452.2542       379       176       671
----------------------------------------------------------------

. 
. **Time from rheum ref to rheum appt (i.e. if appts are present and in correct
>  time order)
. gen time_ref_rheum_appt = (rheum_appt_date - referral_rheum_prerheum_date) if
>  rheum_appt_date!=. & referral_rheum_prerheum_date!=. & referral_rheum_prerhe
> um_date<rheum_appt_date & rheum_appt_date<eia_code_date
(29,874 missing values generated)

. tabstat time_ref_rheum_appt, stats (n mean p50 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~t |      5574  292.8193       239       103       427
----------------------------------------------------------------

. 
. gen ref_appt_cat=1 if time_ref_rheum_appt<=21 & time_ref_rheum_appt!=. 
(35,115 missing values generated)

. replace ref_appt_cat=2 if time_ref_rheum_appt<=42 & time_ref_rheum_appt!=. & 
> ref_appt_cat==.
(283 real changes made)

. replace ref_appt_cat=3 if time_ref_rheum_appt>42 & time_ref_rheum_appt!=. & r
> ef_appt_cat==.
(4,958 real changes made)

. lab define ref_appt_cat 1 "Seen within 3 weeks" 2 "Seen within 6 weeks" 3 "As
> sessment delay >6 weeks", modify

. lab val ref_appt_cat ref_appt_cat

. lab var ref_appt_cat "Time to rheumatology assessment"

. tab ref_appt_cat, missing

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |        333        0.94        0.94
      Seen within 6 weeks |        283        0.80        1.74
Assessment delay >6 weeks |      4,958       13.99       15.72
                        . |     29,874       84.28      100.00
--------------------------+-----------------------------------
                    Total |     35,448      100.00

. 
. gen ref_appt_3w=1 if time_ref_rheum_appt<=21 & time_ref_rheum_appt!=. 
(35,115 missing values generated)

. replace ref_appt_3w=2 if time_ref_rheum_appt>21 & time_ref_rheum_appt!=.
(5,241 real changes made)

. lab define ref_appt_3w 1 "Seen within 3 weeks" 2 "Assessment delay >3 weeks",
>  modify

. lab val ref_appt_3w ref_appt_3w

. lab var ref_appt_3w "Time to rheumatology assessment"

. tab ref_appt_3w, missing

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |        333        0.94        0.94
Assessment delay >3 weeks |      5,241       14.79       15.72
                        . |     29,874       84.28      100.00
--------------------------+-----------------------------------
                    Total |     35,448      100.00

. 
. **Time from rheum ref or last GP to rheum appt (combined - sensitivity analys
> is; includes those with no rheum ref)
. gen time_refgp_rheum_appt = time_ref_rheum_appt
(29,874 missing values generated)

. replace time_refgp_rheum_appt = time_gp_rheum_appt if time_ref_rheum_appt==. 
> & time_gp_rheum_appt!=.
(3,546 real changes made)

. tabstat time_refgp_rheum_appt, stats (n mean p50 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_refgp~t |      9120  276.7583       223        98       399
----------------------------------------------------------------

. 
. **Time from rheum ref to EIA code (sensitivity analysis; includes those with 
> no rheum appt)
. gen time_ref_rheum_eia = (eia_code_date - referral_rheum_precode_date) if eia
> _code_date!=. & referral_rheum_precode_date!=. & referral_rheum_precode_date<
> eia_code_date  
(15,884 missing values generated)

. tabstat time_ref_rheum_eia, stats (n mean p50 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~a |     19564  523.0653       470       235       771
----------------------------------------------------------------

. 
. **Time from rheum ref to EIA diagnosis (combined - sensitivity analysis; incl
> udes those with no rheum appt)
. gen time_ref_rheum_eia_comb = time_ref_rheum_appt
(29,874 missing values generated)

. replace time_ref_rheum_eia_comb = time_ref_rheum_eia if time_ref_rheum_appt==
> . & time_ref_rheum_eia!=.
(15,999 real changes made)

. tabstat time_ref_rheum_eia_comb, stats (n mean p50 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~b |     21573  454.6834       385       177       672
----------------------------------------------------------------

. 
. **Time from rheum appt to EIA code (i.e. if appts are present and in correct 
> time order)
. gen time_rheum_eia_code = (eia_code_date - rheum_appt_date) if eia_code_date!
> =. & rheum_appt_date!=. & rheum_appt_date<eia_code_date 
(11,441 missing values generated)

. tabstat time_rheum_eia_code, stats (n mean p50 p25 p75) 

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_rheum~e |     24007  599.5126       570       310       865
----------------------------------------------------------------

. 
. *Time to first csDMARD prescriptions - all of the below are shared care presc
> riptions, aside from those with MTX_high cost drug data included=============
> =========================================================*/
. 
. *All patients below must have at least six months of GP registration after EI
> A code
. 
. **Time to first csDMARD script for RA patients, whereby first rheum appt is c
> lassed as diagnosis date (if rheum appt present and before csDMARD date; not 
> including high cost MTX prescriptions)
. gen time_to_csdmard=(csdmard_date-rheum_appt_date) if csdmard==1 & rheum_appt
> _date!=. & csdmard_date>rheum_appt_date 
(25,210 missing values generated)

. tabstat time_to_csdmard if ra_code==1 & has_6m_follow_up==1, stats (n mean p5
> 0 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_cs~d |      3288   557.135     522.5       285       801
----------------------------------------------------------------

. 
. **Time to first csDMARD script for RA patients (including high cost MTX presc
> riptions)
. gen time_to_csdmard_hcd=(csdmard_hcd_date-rheum_appt_date) if csdmard_hcd==1 
> & rheum_appt_date!=. & csdmard_hcd_date>rheum_appt_date 
(23,854 missing values generated)

. tabstat time_to_csdmard_hcd if ra_code==1 & has_6m_follow_up==1, stats (n mea
> n p50 p25 p75) 

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_c~cd |      3735  551.6806       514       278       795
----------------------------------------------------------------

. 
. **Time to first csDMARD script for PsA patients (not including high cost MTX 
> prescriptions)
. tabstat time_to_csdmard if psa_code==1 & has_6m_follow_up==1, stats (n mean p
> 50 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_c~rd |      3221  558.6852       516       278       806
----------------------------------------------------------------

. 
. **Time to first csDMARD script for PsA patients (including high cost MTX pres
> criptions)
. tabstat time_to_csdmard_hcd if psa_code==1 & has_6m_follow_up==1, stats (n me
> an p50 p25 p75) 

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_c~cd |      3623   549.716       507       273       792
----------------------------------------------------------------

. 
. **csDMARD time categories for RA patients (not including high cost MTX prescr
> iptions)
. gen csdmard_3m=1 if time_to_csdmard<=90 & time_to_csdmard!=. 
(34,760 missing values generated)

. replace csdmard_3m=2 if time_to_csdmard>90 & time_to_csdmard!=.
(9,550 real changes made)

. lab define csdmard_3m 1 "Yes" 2 "No", modify

. lab val csdmard_3m csdmard_3m

. lab var csdmard_3m "csDMARD within 3 months" 

. tab csdmard_3m if ra_code==1 & has_6m_follow_up==1, missing //missing will be
>  patients with no rheum appt and/or rheum appt after csDMARD script

    csDMARD |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        235        2.08        2.08
         No |      3,053       27.01       29.08
          . |      8,017       70.92      100.00
------------+-----------------------------------
      Total |     11,305      100.00

. gen csdmard_6m=1 if time_to_csdmard<=180 & time_to_csdmard!=. 
(33,938 missing values generated)

. replace csdmard_6m=2 if time_to_csdmard>180 & time_to_csdmard!=.
(8,728 real changes made)

. lab define csdmard_6m 1 "Yes" 2 "No", modify

. lab val csdmard_6m csdmard_6m

. lab var csdmard_6m "csDMARD within 6 months" 

. tab csdmard_6m if ra_code==1 & has_6m_follow_up==1, missing //missing will be
>  patients with no rheum appt and/or rheum appt after csDMARD script

    csDMARD |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        502        4.44        4.44
         No |      2,786       24.64       29.08
          . |      8,017       70.92      100.00
------------+-----------------------------------
      Total |     11,305      100.00

. gen csdmard_12m=1 if time_to_csdmard<=365 & time_to_csdmard!=. 
(31,997 missing values generated)

. replace csdmard_12m=2 if time_to_csdmard>365 & time_to_csdmard!=.
(6,787 real changes made)

. lab define csdmard_12m 1 "Yes" 2 "No", modify

. lab val csdmard_12m csdmard_12m

. lab var csdmard_12m "csDMARD within 12 months" 

. tab csdmard_12m if ra_code==1 & has_12m_follow_up==1, missing //missing will 
> be patients with no rheum appt and/or rheum appt after csDMARD script

    csDMARD |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,018        9.47        9.47
         No |      2,081       19.37       28.84
          . |      7,647       71.16      100.00
------------+-----------------------------------
      Total |     10,746      100.00

. 
. **csDMARD time categories for RA patients (including high cost MTX prescripti
> ons)
. gen csdmard_hcd_3m=1 if time_to_csdmard_hcd<=90 & time_to_csdmard_hcd!=. 
(34,637 missing values generated)

. replace csdmard_hcd_3m=2 if time_to_csdmard_hcd>90 & time_to_csdmard_hcd!=.
(10,783 real changes made)

. lab define csdmard_hcd_3m 1 "Yes" 2 "No", modify

. lab val csdmard_hcd_3m csdmard_hcd_3m

. lab var csdmard_hcd_3m "csDMARD within 3 months" 

. tab csdmard_hcd_3m if ra_code==1 & has_6m_follow_up==1, missing //missing wil
> l be patients with no rheum appt and/or rheum appt after csDMARD script

    csDMARD |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        276        2.44        2.44
         No |      3,459       30.60       33.04
          . |      7,570       66.96      100.00
------------+-----------------------------------
      Total |     11,305      100.00

. gen csdmard_hcd_6m=1 if time_to_csdmard_hcd<=180 & time_to_csdmard_hcd!=. 
(33,686 missing values generated)

. replace csdmard_hcd_6m=2 if time_to_csdmard_hcd>180 & time_to_csdmard_hcd!=.
(9,832 real changes made)

. lab define csdmard_hcd_6m 1 "Yes" 2 "No", modify

. lab val csdmard_hcd_6m csdmard_hcd_6m

. lab var csdmard_hcd_6m "csDMARD within 6 months" 

. tab csdmard_hcd_6m if ra_code==1 & has_6m_follow_up==1, missing //missing wil
> l be patients with no rheum appt and/or rheum appt after csDMARD script

    csDMARD |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        586        5.18        5.18
         No |      3,149       27.85       33.04
          . |      7,570       66.96      100.00
------------+-----------------------------------
      Total |     11,305      100.00

. gen csdmard_hcd_12m=1 if time_to_csdmard_hcd<=365 & time_to_csdmard_hcd!=. 
(31,441 missing values generated)

. replace csdmard_hcd_12m=2 if time_to_csdmard_hcd>365 & time_to_csdmard_hcd!=.
(7,587 real changes made)

. lab define csdmard_hcd_12m 1 "Yes" 2 "No", modify

. lab val csdmard_hcd_12m csdmard_hcd_12m

. lab var csdmard_hcd_12m "csDMARD within 12 months" 

. tab csdmard_hcd_12m if ra_code==1 & has_12m_follow_up==1, missing //missing w
> ill be patients with no rheum appt and/or rheum appt after csDMARD script

    csDMARD |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,198       11.15       11.15
         No |      2,324       21.63       32.77
          . |      7,224       67.23      100.00
------------+-----------------------------------
      Total |     10,746      100.00

. 
. **csDMARD time categories for PsA patients (not including high cost MTX presc
> riptions)
. tab csdmard_3m if psa_code==1 & has_6m_follow_up==1, missing

    csDMARD |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        197        1.77        1.77
         No |      3,024       27.10       28.86
          . |      7,938       71.14      100.00
------------+-----------------------------------
      Total |     11,159      100.00

. tab csdmard_6m if psa_code==1 & has_6m_follow_up==1, missing

    csDMARD |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        460        4.12        4.12
         No |      2,761       24.74       28.86
          . |      7,938       71.14      100.00
------------+-----------------------------------
      Total |     11,159      100.00

. tab csdmard_12m if psa_code==1 & has_12m_follow_up==1, missing

    csDMARD |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,046        9.93        9.93
         No |      2,006       19.04       28.97
          . |      7,484       71.03      100.00
------------+-----------------------------------
      Total |     10,536      100.00

. 
. **csDMARD time categories for PsA patients (including high cost MTX prescript
> ions)
. tab csdmard_hcd_3m if psa_code==1 & has_6m_follow_up==1, missing

    csDMARD |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        230        2.06        2.06
         No |      3,393       30.41       32.47
          . |      7,536       67.53      100.00
------------+-----------------------------------
      Total |     11,159      100.00

. tab csdmard_hcd_6m if psa_code==1 & has_6m_follow_up==1, missing

    csDMARD |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        530        4.75        4.75
         No |      3,093       27.72       32.47
          . |      7,536       67.53      100.00
------------+-----------------------------------
      Total |     11,159      100.00

. tab csdmard_hcd_12m if psa_code==1 & has_12m_follow_up==1, missing

    csDMARD |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,199       11.38       11.38
         No |      2,229       21.16       32.54
          . |      7,108       67.46      100.00
------------+-----------------------------------
      Total |     10,536      100.00

. 
. **What was first shared care csDMARD (not including high cost MTX prescriptio
> ns)
. gen first_csD=""
(35,448 missing values generated)

. foreach var of varlist hydroxychloroquine_date leflunomide_date methotrexate_
> date methotrexate_inj_date sulfasalazine_date {
  2.         replace first_csD="`var'" if csdmard_date==`var' & csdmard_date!=.
  3.         }
variable first_csD was str1 now str23
(2,476 real changes made)
(2,563 real changes made)
(2,533 real changes made)
(2,500 real changes made)
(2,571 real changes made)

. gen first_csDMARD = substr(first_csD, 1, length(first_csD) - 5) if first_csD!
> =""
(22,807 missing values generated)

. drop first_csD

. tab first_csDMARD if ra_code==1 & has_6m_follow_up==1 //for RA patients

     first_csDMARD |      Freq.     Percent        Cum.
-------------------+-----------------------------------
hydroxychloroquine |        797       19.74       19.74
       leflunomide |        801       19.84       39.58
      methotrexate |        843       20.88       60.47
  methotrexate_inj |        794       19.67       80.13
     sulfasalazine |        802       19.87      100.00
-------------------+-----------------------------------
             Total |      4,037      100.00

. tab first_csDMARD if psa_code==1 & has_6m_follow_up==1 //for PsA patients

     first_csDMARD |      Freq.     Percent        Cum.
-------------------+-----------------------------------
hydroxychloroquine |        744       18.60       18.60
       leflunomide |        851       21.27       39.87
      methotrexate |        785       19.62       59.49
  methotrexate_inj |        787       19.67       79.16
     sulfasalazine |        834       20.84      100.00
-------------------+-----------------------------------
             Total |      4,001      100.00

. 
. **What was first csDMARD (including high cost MTX prescriptions)
. gen first_csD_hcd=""
(35,448 missing values generated)

. foreach var of varlist hydroxychloroquine_date leflunomide_date methotrexate_
> date methotrexate_inj_date methotrexate_hcd_date sulfasalazine_date {
  2.         replace first_csD_hcd="`var'" if csdmard_hcd_date==`var' & csdmard
> _hcd_date!=.
  3.         }
variable first_csD_hcd was str1 now str23
(2,354 real changes made)
(2,432 real changes made)
(2,393 real changes made)
(2,365 real changes made)
(2,979 real changes made)
(2,432 real changes made)

. gen first_csDMARD_hcd = substr(first_csD_hcd, 1, length(first_csD_hcd) - 5) i
> f first_csD_hcd!=""
(20,495 missing values generated)

. drop first_csD_hcd

. tab first_csDMARD_hcd if ra_code==1 & has_6m_follow_up==1 //for RA patients

 first_csDMARD_hcd |      Freq.     Percent        Cum.
-------------------+-----------------------------------
hydroxychloroquine |        752       15.73       15.73
       leflunomide |        757       15.83       31.56
      methotrexate |        794       16.60       48.16
  methotrexate_hcd |        957       20.01       68.17
  methotrexate_inj |        758       15.85       84.02
     sulfasalazine |        764       15.98      100.00
-------------------+-----------------------------------
             Total |      4,782      100.00

. tab first_csDMARD_hcd if psa_code==1 & has_6m_follow_up==1 //for PsA patients

 first_csDMARD_hcd |      Freq.     Percent        Cum.
-------------------+-----------------------------------
hydroxychloroquine |        709       15.12       15.12
       leflunomide |        817       17.42       32.54
      methotrexate |        749       15.97       48.51
  methotrexate_hcd |        885       18.87       67.38
  methotrexate_inj |        742       15.82       83.20
     sulfasalazine |        788       16.80      100.00
-------------------+-----------------------------------
             Total |      4,690      100.00

.  
. **Methotrexate use (not including high cost MTX prescriptions)
. gen mtx=1 if methotrexate==1 | methotrexate_inj==1
(29,682 missing values generated)

. recode mtx .=0 
(mtx: 29682 changes made)

. tab mtx if ra_code==1 & has_6m_follow_up==1 //for RA patients; Nb. this is ju
> st a check; need time-to-MTX instead (below)

        mtx |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      9,437       83.48       83.48
          1 |      1,868       16.52      100.00
------------+-----------------------------------
      Total |     11,305      100.00

. tab mtx if psa_code==1 & has_6m_follow_up==1 //for PsA patients

        mtx |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      9,356       83.84       83.84
          1 |      1,803       16.16      100.00
------------+-----------------------------------
      Total |     11,159      100.00

. 
. **Methotrexate use (including high cost MTX prescriptions)
. gen mtx_hcd=1 if methotrexate==1 | methotrexate_inj==1 | methotrexate_hcd==1
(26,682 missing values generated)

. recode mtx_hcd .=0 
(mtx_hcd: 26682 changes made)

. tab mtx_hcd if ra_code==1 & has_6m_follow_up==1 //for RA patients

    mtx_hcd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,452       74.76       74.76
          1 |      2,853       25.24      100.00
------------+-----------------------------------
      Total |     11,305      100.00

. tab mtx_hcd if psa_code==1 & has_6m_follow_up==1 //for PsA patients

    mtx_hcd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,456       75.78       75.78
          1 |      2,703       24.22      100.00
------------+-----------------------------------
      Total |     11,159      100.00

. 
. **Date of first methotrexate script (not including high cost MTX prescription
> s)
. gen mtx_date=min(methotrexate_date, methotrexate_inj_date)
(29,682 missing values generated)

. format %td mtx_date

. 
. **Date of first methotrexate script (including high cost MTX prescriptions)
. gen mtx_hcd_date=min(methotrexate_date, methotrexate_inj_date, methotrexate_h
> cd_date)
(26,682 missing values generated)

. format %td mtx_hcd_date

. 
. **Time to first methotrexate script for RA patients (not including high cost 
> MTX prescriptions)
. gen time_to_mtx=(mtx_date-rheum_appt_date) if mtx==1 & rheum_appt_date!=. & m
> tx_date>rheum_appt_date 
(30,842 missing values generated)

. tabstat time_to_mtx if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p2
> 5 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |      1507  581.9715       546       302       828
----------------------------------------------------------------

. 
. **Time to first methotrexate script for RA patients (including high cost MTX 
> prescriptions)
. gen time_to_mtx_hcd=(mtx_hcd_date-rheum_appt_date) if mtx_hcd==1 & rheum_appt
> _date!=. & mtx_hcd_date>rheum_appt_date 
(28,917 missing values generated)

. tabstat time_to_mtx_hcd if ra_code==1 & has_6m_follow_up==1, stats (n mean p5
> 0 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_mt~d |      2154  577.0269       542       294       826
----------------------------------------------------------------

. 
. **Time to first methotrexate script for PsA patients (not including high cost
>  MTX prescriptions)
. tabstat time_to_mtx if psa_code==1 & has_6m_follow_up==1, stats (n mean p50 p
> 25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |      1426  589.9327       556       301       857
----------------------------------------------------------------

. 
. **Time to first methotrexate script for PsA patients (including high cost MTX
>  prescriptions)
. tabstat time_to_mtx_hcd if psa_code==1 & has_6m_follow_up==1, stats (n mean p
> 50 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_mt~d |      2003  580.7559       548       298       842
----------------------------------------------------------------

. 
. **Methotrexate time categories for RA patients (not including high-cost MTX) 
> //Nb. this is time period from rheum appt (i.e. diagnosis) to shared care, no
> t from referral to first script 
. gen mtx_3m=1 if time_to_mtx<=90 & time_to_mtx!=. 
(35,187 missing values generated)

. replace mtx_3m=2 if time_to_mtx>90 & time_to_mtx!=.
(4,345 real changes made)

. lab define mtx_3m 1 "Yes" 2 "No", modify

. lab val mtx_3m mtx_3m

. lab var mtx_3m "Methotrexate within 3 months" 

. tab mtx_3m if ra_code==1 & has_6m_follow_up==1, missing //missing will be pat
> ients with no rheum appt and/or rheum appt after csDMARD script

Methotrexat |
 e within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         87        0.77        0.77
         No |      1,420       12.56       13.33
          . |      9,798       86.67      100.00
------------+-----------------------------------
      Total |     11,305      100.00

. gen mtx_6m=1 if time_to_mtx<=180 & time_to_mtx!=. 
(34,849 missing values generated)

. replace mtx_6m=2 if time_to_mtx>180 & time_to_mtx!=.
(4,007 real changes made)

. lab define mtx_6m 1 "Yes" 2 "No", modify

. lab val mtx_6m mtx_6m

. lab var mtx_6m "Methotrexate within 6 months" 

. tab mtx_6m if ra_code==1 & has_6m_follow_up==1, missing //missing will be pat
> ients with no rheum appt and/or rheum appt after csDMARD script

Methotrexat |
 e within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        197        1.74        1.74
         No |      1,310       11.59       13.33
          . |      9,798       86.67      100.00
------------+-----------------------------------
      Total |     11,305      100.00

. gen mtx_12m=1 if time_to_mtx<=365 & time_to_mtx!=. 
(34,026 missing values generated)

. replace mtx_12m=2 if time_to_mtx>365 & time_to_mtx!=.
(3,184 real changes made)

. lab define mtx_12m 1 "Yes" 2 "No", modify

. lab val mtx_12m mtx_12m

. lab var mtx_12m "Methotrexate within 12 months" 

. tab mtx_12m if ra_code==1 & has_12m_follow_up==1, missing //missing will be p
> atients with no rheum appt and/or rheum appt after mtx script

Methotrexat |
e within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        420        3.91        3.91
         No |        988        9.19       13.10
          . |      9,338       86.90      100.00
------------+-----------------------------------
      Total |     10,746      100.00

. 
. **Methotrexate time categories for RA patients (including high-cost MTX)
. gen mtx_hcd_3m=1 if time_to_mtx_hcd<=90 & time_to_mtx_hcd!=. 
(35,045 missing values generated)

. replace mtx_hcd_3m=2 if time_to_mtx_hcd>90 & time_to_mtx_hcd!=.
(6,128 real changes made)

. lab define mtx_hcd_3m 1 "Yes" 2 "No", modify

. lab val mtx_hcd_3m mtx_hcd_3m

. lab var mtx_hcd_3m "Methotrexate within 3 months" 

. tab mtx_hcd_3m if ra_code==1 & has_6m_follow_up==1, missing //missing will be
>  patients with no rheum appt and/or rheum appt after csDMARD script

Methotrexat |
 e within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        136        1.20        1.20
         No |      2,018       17.85       19.05
          . |      9,151       80.95      100.00
------------+-----------------------------------
      Total |     11,305      100.00

. gen mtx_hcd_6m=1 if time_to_mtx_hcd<=180 & time_to_mtx_hcd!=. 
(34,557 missing values generated)

. replace mtx_hcd_6m=2 if time_to_mtx_hcd>180 & time_to_mtx_hcd!=.
(5,640 real changes made)

. lab define mtx_hcd_6m 1 "Yes" 2 "No", modify

. lab val mtx_hcd_6m mtx_hcd_6m

. lab var mtx_hcd_6m "Methotrexate within 6 months" 

. tab mtx_hcd_6m if ra_code==1 & has_6m_follow_up==1, missing //missing will be
>  patients with no rheum appt and/or rheum appt after csDMARD script

Methotrexat |
 e within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        296        2.62        2.62
         No |      1,858       16.44       19.05
          . |      9,151       80.95      100.00
------------+-----------------------------------
      Total |     11,305      100.00

. gen mtx_hcd_12m=1 if time_to_mtx_hcd<=365 & time_to_mtx_hcd!=. 
(33,377 missing values generated)

. replace mtx_hcd_12m=2 if time_to_mtx_hcd>365 & time_to_mtx_hcd!=.
(4,460 real changes made)

. lab define mtx_hcd_12m 1 "Yes" 2 "No", modify

. lab val mtx_hcd_12m mtx_hcd_12m

. lab var mtx_hcd_12m "Methotrexate within 12 months" 

. tab mtx_hcd_12m if ra_code==1 & has_12m_follow_up==1, missing //missing will 
> be patients with no rheum appt and/or rheum appt after csDMARD script

Methotrexat |
e within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        637        5.93        5.93
         No |      1,388       12.92       18.84
          . |      8,721       81.16      100.00
------------+-----------------------------------
      Total |     10,746      100.00

. 
. **Methotrexate time categories for PsA patients (not including high-cost MTX)
. tab mtx_3m if psa_code==1 & has_6m_follow_up==1, missing

Methotrexat |
 e within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         75        0.67        0.67
         No |      1,351       12.11       12.78
          . |      9,733       87.22      100.00
------------+-----------------------------------
      Total |     11,159      100.00

. tab mtx_6m if psa_code==1 & has_6m_follow_up==1, missing

Methotrexat |
 e within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        185        1.66        1.66
         No |      1,241       11.12       12.78
          . |      9,733       87.22      100.00
------------+-----------------------------------
      Total |     11,159      100.00

. tab mtx_12m if psa_code==1 & has_12m_follow_up==1, missing //with a least 12m
>  registration

Methotrexat |
e within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        420        3.99        3.99
         No |        931        8.84       12.82
          . |      9,185       87.18      100.00
------------+-----------------------------------
      Total |     10,536      100.00

. 
. **Methotrexate time categories for PsA patients (including high-cost MTX)
. tab mtx_hcd_3m if psa_code==1 & has_6m_follow_up==1, missing

Methotrexat |
 e within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        111        0.99        0.99
         No |      1,892       16.95       17.95
          . |      9,156       82.05      100.00
------------+-----------------------------------
      Total |     11,159      100.00

. tab mtx_hcd_6m if psa_code==1 & has_6m_follow_up==1, missing

Methotrexat |
 e within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        265        2.37        2.37
         No |      1,738       15.57       17.95
          . |      9,156       82.05      100.00
------------+-----------------------------------
      Total |     11,159      100.00

. tab mtx_hcd_12m if psa_code==1 & has_12m_follow_up==1, missing //with a least
>  12m registration

Methotrexat |
e within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        597        5.67        5.67
         No |      1,299       12.33       18.00
          . |      8,640       82.00      100.00
------------+-----------------------------------
      Total |     10,536      100.00

. 
. **Sulfasalazine use
. gen time_to_ssz=(sulfasalazine_date-rheum_appt_date) if sulfasalazine==1 & rh
> eum_appt_date!=. & sulfasalazine_date>rheum_appt_date 
(33,003 missing values generated)

. tabstat time_to_ssz if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p2
> 5 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |       773  603.5847       580       324       860
----------------------------------------------------------------

. 
. **Sulfasalazine time categories for RA patients //Nb. this is time period fro
> m rheum appt (i.e. diagnosis) to shared care, not from referral to first scri
> pt 
. gen ssz_3m=1 if time_to_ssz<=90 & time_to_ssz!=. 
(35,290 missing values generated)

. replace ssz_3m=2 if time_to_ssz>90 & time_to_ssz!=.
(2,287 real changes made)

. lab define ssz_3m 1 "Yes" 2 "No", modify

. lab val ssz_3m ssz_3m

. lab var ssz_3m "Sulfasalazine within 3 months" 

. tab ssz_3m if ra_code==1 & has_6m_follow_up==1, missing //missing will be pat
> ients with no rheum appt and/or rheum appt after csDMARD script

Sulfasalazi |
ne within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         53        0.47        0.47
         No |        720        6.37        6.84
          . |     10,532       93.16      100.00
------------+-----------------------------------
      Total |     11,305      100.00

. gen ssz_6m=1 if time_to_ssz<=180 & time_to_ssz!=. 
(35,140 missing values generated)

. replace ssz_6m=2 if time_to_ssz>180 & time_to_ssz!=.
(2,137 real changes made)

. lab define ssz_6m 1 "Yes" 2 "No", modify

. lab val ssz_6m ssz_6m

. lab var ssz_6m "Sulfasalazine within 6 months" 

. tab ssz_6m if ra_code==1 & has_6m_follow_up==1, missing //missing will be pat
> ients with no rheum appt and/or rheum appt after csDMARD script

Sulfasalazi |
ne within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        107        0.95        0.95
         No |        666        5.89        6.84
          . |     10,532       93.16      100.00
------------+-----------------------------------
      Total |     11,305      100.00

. gen ssz_12m=1 if time_to_ssz<=365 & time_to_ssz!=. 
(34,750 missing values generated)

. replace ssz_12m=2 if time_to_ssz>365 & time_to_ssz!=.
(1,747 real changes made)

. lab define ssz_12m 1 "Yes" 2 "No", modify

. lab val ssz_12m ssz_12m

. lab var ssz_12m "Sulfasalazine within 12 months" 

. tab ssz_12m if ra_code==1 & has_12m_follow_up==1, missing //missing will be p
> atients with no rheum appt and/or rheum appt after ssz script

Sulfasalazi |
  ne within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        219        2.04        2.04
         No |        510        4.75        6.78
          . |     10,017       93.22      100.00
------------+-----------------------------------
      Total |     10,746      100.00

. 
. **Sulfasalazine time categories for PsA patients
. tab ssz_3m if psa_code==1 & has_6m_follow_up==1, missing

Sulfasalazi |
ne within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         46        0.41        0.41
         No |        746        6.69        7.10
          . |     10,367       92.90      100.00
------------+-----------------------------------
      Total |     11,159      100.00

. tab ssz_6m if psa_code==1 & has_6m_follow_up==1, missing

Sulfasalazi |
ne within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         91        0.82        0.82
         No |        701        6.28        7.10
          . |     10,367       92.90      100.00
------------+-----------------------------------
      Total |     11,159      100.00

. tab ssz_12m if psa_code==1 & has_12m_follow_up==1, missing //with a least 12m
>  registration

Sulfasalazi |
  ne within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        211        2.00        2.00
         No |        551        5.23        7.23
          . |      9,774       92.77      100.00
------------+-----------------------------------
      Total |     10,536      100.00

. 
. **Hydroxychloroquine use
. gen time_to_hcq=(hydroxychloroquine_date-rheum_appt_date) if hydroxychloroqui
> ne==1 & rheum_appt_date!=. & hydroxychloroquine_date>rheum_appt_date 
(33,008 missing values generated)

. tabstat time_to_hcq if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p2
> 5 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |       793  606.3077       579       329       862
----------------------------------------------------------------

. 
. **Hydroxychloroquine time categories for RA patients //Nb. this is time perio
> d from rheum appt (i.e. diagnosis) to shared care, not from referral to first
>  script 
. gen hcq_3m=1 if time_to_hcq<=90 & time_to_hcq!=. 
(35,315 missing values generated)

. replace hcq_3m=2 if time_to_hcq>90 & time_to_hcq!=.
(2,307 real changes made)

. lab define hcq_3m 1 "Yes" 2 "No", modify

. lab val hcq_3m hcq_3m

. lab var hcq_3m "Hydroxychloroquine within 3 months" 

. tab hcq_3m if ra_code==1 & has_6m_follow_up==1, missing //missing will be pat
> ients with no rheum appt and/or rheum appt after csDMARD script

Hydroxychlo |
    roquine |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         45        0.40        0.40
         No |        748        6.62        7.01
          . |     10,512       92.99      100.00
------------+-----------------------------------
      Total |     11,305      100.00

. gen hcq_6m=1 if time_to_hcq<=180 & time_to_hcq!=. 
(35,147 missing values generated)

. replace hcq_6m=2 if time_to_hcq>180 & time_to_hcq!=.
(2,139 real changes made)

. lab define hcq_6m 1 "Yes" 2 "No", modify

. lab val hcq_6m hcq_6m

. lab var hcq_6m "Hydroxychloroquine within 6 months" 

. tab hcq_6m if ra_code==1 & has_6m_follow_up==1, missing //missing will be pat
> ients with no rheum appt and/or rheum appt after csDMARD script

Hydroxychlo |
    roquine |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        100        0.88        0.88
         No |        693        6.13        7.01
          . |     10,512       92.99      100.00
------------+-----------------------------------
      Total |     11,305      100.00

. gen hcq_12m=1 if time_to_hcq<=365 & time_to_hcq!=. 
(34,713 missing values generated)

. replace hcq_12m=2 if time_to_hcq>365 & time_to_hcq!=.
(1,705 real changes made)

. lab define hcq_12m 1 "Yes" 2 "No", modify

. lab val hcq_12m hcq_12m

. lab var hcq_12m "Hydroxychloroquine within 12 months" 

. tab hcq_12m if ra_code==1 & has_12m_follow_up==1, missing //missing will be p
> atients with no rheum appt and/or rheum appt after hcq script

Hydroxychlo |
    roquine |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        212        1.97        1.97
         No |        547        5.09        7.06
          . |      9,987       92.94      100.00
------------+-----------------------------------
      Total |     10,746      100.00

. 
. **Hydroxychloroquine time categories for PsA patients
. tab hcq_3m if psa_code==1 & has_6m_follow_up==1, missing

Hydroxychlo |
    roquine |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         39        0.35        0.35
         No |        693        6.21        6.56
          . |     10,427       93.44      100.00
------------+-----------------------------------
      Total |     11,159      100.00

. tab hcq_6m if psa_code==1 & has_6m_follow_up==1, missing

Hydroxychlo |
    roquine |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         88        0.79        0.79
         No |        644        5.77        6.56
          . |     10,427       93.44      100.00
------------+-----------------------------------
      Total |     11,159      100.00

. tab hcq_12m if psa_code==1 & has_12m_follow_up==1, missing //with a least 12m
>  registration

Hydroxychlo |
    roquine |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        224        2.13        2.13
         No |        478        4.54        6.66
          . |      9,834       93.34      100.00
------------+-----------------------------------
      Total |     10,536      100.00

. 
. **Leflunomide use
. gen time_to_lef=(leflunomide_date-rheum_appt_date) if leflunomide==1 & rheum_
> appt_date!=. & leflunomide_date>rheum_appt_date 
(32,921 missing values generated)

. tabstat time_to_lef if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p2
> 5 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |       791  588.8382       570       319       847
----------------------------------------------------------------

. 
. **Leflunomide time categories for RA patients //Nb. this is time period from 
> rheum appt (i.e. diagnosis) to shared care, not from referral to first script
>  
. gen lef_3m=1 if time_to_lef<=90 & time_to_lef!=. 
(35,296 missing values generated)

. replace lef_3m=2 if time_to_lef>90 & time_to_lef!=.
(2,375 real changes made)

. lab define lef_3m 1 "Yes" 2 "No", modify

. lab val lef_3m lef_3m

. lab var lef_3m "Leflunomide within 3 months" 

. tab lef_3m if ra_code==1 & has_6m_follow_up==1, missing //missing will be pat
> ients with no rheum appt and/or rheum appt after csDMARD script

Leflunomide |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         52        0.46        0.46
         No |        739        6.54        7.00
          . |     10,514       93.00      100.00
------------+-----------------------------------
      Total |     11,305      100.00

. gen lef_6m=1 if time_to_lef<=180 & time_to_lef!=. 
(35,104 missing values generated)

. replace lef_6m=2 if time_to_lef>180 & time_to_lef!=.
(2,183 real changes made)

. lab define lef_6m 1 "Yes" 2 "No", modify

. lab val lef_6m lef_6m

. lab var lef_6m "Leflunomide within 6 months" 

. tab lef_6m if ra_code==1 & has_6m_follow_up==1, missing //missing will be pat
> ients with no rheum appt and/or rheum appt after csDMARD script

Leflunomide |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        111        0.98        0.98
         No |        680        6.02        7.00
          . |     10,514       93.00      100.00
------------+-----------------------------------
      Total |     11,305      100.00

. gen lef_12m=1 if time_to_lef<=365 & time_to_lef!=. 
(34,685 missing values generated)

. replace lef_12m=2 if time_to_lef>365 & time_to_lef!=.
(1,764 real changes made)

. lab define lef_12m 1 "Yes" 2 "No", modify

. lab val lef_12m lef_12m

. lab var lef_12m "Leflunomide within 12 months" 

. tab lef_12m if ra_code==1 & has_12m_follow_up==1, missing //missing will be p
> atients with no rheum appt and/or rheum appt after lef script

Leflunomide |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        217        2.02        2.02
         No |        533        4.96        6.98
          . |      9,996       93.02      100.00
------------+-----------------------------------
      Total |     10,746      100.00

. 
. **Leflunomide time categories for PsA patients
. tab lef_3m if psa_code==1 & has_6m_follow_up==1, missing

Leflunomide |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         41        0.37        0.37
         No |        787        7.05        7.42
          . |     10,331       92.58      100.00
------------+-----------------------------------
      Total |     11,159      100.00

. tab lef_6m if psa_code==1 & has_6m_follow_up==1, missing

Leflunomide |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        110        0.99        0.99
         No |        718        6.43        7.42
          . |     10,331       92.58      100.00
------------+-----------------------------------
      Total |     11,159      100.00

. tab lef_12m if psa_code==1 & has_12m_follow_up==1, missing //with a least 12m
>  registration

Leflunomide |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        244        2.32        2.32
         No |        535        5.08        7.39
          . |      9,757       92.61      100.00
------------+-----------------------------------
      Total |     10,536      100.00

. 
. **Time to first biologic script, whereby first rheum appt is classed as diagn
> osis date (assumes rheum appt present); high_cost drug data available to Nov 
> 2020======================================================================*/
. 
. *Below analyses are only for patients with at least 12 months of follow-up av
> ailable after EIA code
. gen time_to_biologic=(biologic_date-rheum_appt_date) if biologic==1 & rheum_a
> ppt_date!=. & biologic_date>rheum_appt_date 
(14,321 missing values generated)

. tabstat time_to_biologic if has_12m_follow_up==1, stats (n mean p50 p25 p75) 
> //for all EIA patients

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_bi~c |     18984  461.1792       405       205       666
----------------------------------------------------------------

. 
. **What was first biologic
. gen first_bio=""
(35,448 missing values generated)

. foreach var of varlist abatacept_date adalimumab_date baricitinib_date certol
> izumab_date etanercept_date golimumab_date guselkumab_date infliximab_date ix
> ekizumab_date rituximab_date sarilumab_date secukinumab_date tocilizumab_date
>  tofacitinib_date upadacitinib_date ustekinumab_date {
  2.         replace first_bio="`var'" if biologic_date==`var' & biologic_date!
> =.
  3.         }
variable first_bio was str1 now str14
(1,597 real changes made)
variable first_bio was str14 now str15
(1,606 real changes made)
variable first_bio was str15 now str16
(1,655 real changes made)
variable first_bio was str16 now str17
(1,658 real changes made)
(1,610 real changes made)
(1,650 real changes made)
(1,610 real changes made)
(1,698 real changes made)
(1,673 real changes made)
(1,695 real changes made)
(1,736 real changes made)
(1,711 real changes made)
(1,630 real changes made)
(1,677 real changes made)
(1,651 real changes made)
(1,663 real changes made)

. gen first_biologic = substr(first_bio, 1, length(first_bio) - 5)        
(9,494 missing values generated)

. drop first_bio

. tab first_biologic if has_12m_follow_up==1 //for all EIA patients

first_biolog |
          ic |      Freq.     Percent        Cum.
-------------+-----------------------------------
   abatacept |      1,357        5.82        5.82
  adalimumab |      1,389        5.96       11.77
 baricitinib |      1,438        6.17       17.94
certolizumab |      1,408        6.04       23.98
  etanercept |      1,408        6.04       30.01
   golimumab |      1,467        6.29       36.30
  guselkumab |      1,414        6.06       42.37
  infliximab |      1,490        6.39       48.76
  ixekizumab |      1,470        6.30       55.06
   rituximab |      1,476        6.33       61.39
   sarilumab |      1,524        6.53       67.92
 secukinumab |      1,521        6.52       74.44
 tocilizumab |      1,463        6.27       80.72
 tofacitinib |      1,500        6.43       87.15
upadacitinib |      1,491        6.39       93.54
 ustekinumab |      1,506        6.46      100.00
-------------+-----------------------------------
       Total |     23,322      100.00

. 
. **Biologic time categories (for all patients)
. gen biologic_3m=1 if time_to_biologic<=90 & time_to_biologic!=. 
(33,252 missing values generated)

. replace biologic_3m=2 if time_to_biologic>90 & time_to_biologic!=.
(18,931 real changes made)

. lab define biologic_3m 1 "Yes" 2 "No", modify

. lab val biologic_3m biologic_3m

. lab var biologic_3m "bDMARD/tsDMARD within 3 months" 

. tab biologic_3m if has_6m_follow_up==1, missing //missing will be patients wi
> th no rheum appt and/or rheum appt after bDMARD/tsDMARD script

bDMARD/tsDM |
 ARD within |
   3 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      2,095        6.22        6.22
         No |     18,011       53.44       59.66
          . |     13,595       40.34      100.00
------------+-----------------------------------
      Total |     33,701      100.00

. gen biologic_6m=1 if time_to_biologic<=180 & time_to_biologic!=. 
(30,895 missing values generated)

. replace biologic_6m=2 if time_to_biologic>180 & time_to_biologic!=.
(16,574 real changes made)

. lab define biologic_6m 1 "Yes" 2 "No", modify

. lab val biologic_6m biologic_6m

. lab var biologic_6m "bDMARD/tsDMARD within 6 months" 

. tab biologic_6m if has_6m_follow_up==1, missing //missing will be patients wi
> th no rheum appt and/or rheum appt after bDMARD/tsDMARD script

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      4,345       12.89       12.89
         No |     15,761       46.77       59.66
          . |     13,595       40.34      100.00
------------+-----------------------------------
      Total |     33,701      100.00

. gen biologic_12m=1 if time_to_biologic<=365 & time_to_biologic!=. 
(25,934 missing values generated)

. replace biologic_12m=2 if time_to_biologic>365 & time_to_biologic!=.
(11,613 real changes made)

. lab define biologic_12m 1 "Yes" 2 "No", modify

. lab val biologic_12m biologic_12m

. lab var biologic_12m "bDMARD/tsDMARD within 12 months" 

. tab biologic_12m if has_12m_follow_up==1, missing //missing will be patients 
> with no rheum appt and/or rheum appt after bDMARD/tsDMARD script

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      8,557       26.83       26.83
         No |     10,427       32.69       59.52
          . |     12,911       40.48      100.00
------------+-----------------------------------
      Total |     31,895      100.00

. 
. **Biologic time categories (by year)
. bys diagnosis_year: tab biologic_6m if has_6m_follow_up==1, missing //for all
>  EIA patients with at least 6m follow-up

-------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,371       12.72       12.72
         No |      5,108       47.41       60.13
          . |      4,296       39.87      100.00
------------+-----------------------------------
      Total |     10,775      100.00

-------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,411       13.06       13.06
         No |      4,965       45.96       59.02
          . |      4,428       40.98      100.00
------------+-----------------------------------
      Total |     10,804      100.00

-------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,368       12.97       12.97
         No |      4,968       47.12       60.09
          . |      4,208       39.91      100.00
------------+-----------------------------------
      Total |     10,544      100.00

-------------------------------------------------------------------------------
-> diagnosis_year = .

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        195       12.36       12.36
         No |        720       45.63       57.98
          . |        663       42.02      100.00
------------+-----------------------------------
      Total |      1,578      100.00


. bys diagnosis_year: tab biologic_12m if has_12m_follow_up==1, missing //for a
> ll EIA patients

-------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      2,720       26.78       26.78
         No |      3,367       33.15       59.94
          . |      4,069       40.06      100.00
------------+-----------------------------------
      Total |     10,156      100.00

-------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      2,737       26.68       26.68
         No |      3,289       32.06       58.74
          . |      4,232       41.26      100.00
------------+-----------------------------------
      Total |     10,258      100.00

-------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      2,708       27.02       27.02
         No |      3,320       33.13       60.15
          . |      3,994       39.85      100.00
------------+-----------------------------------
      Total |     10,022      100.00

-------------------------------------------------------------------------------
-> diagnosis_year = .

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        392       26.87       26.87
         No |        451       30.91       57.78
          . |        616       42.22      100.00
------------+-----------------------------------
      Total |      1,459      100.00


. 
. save "$projectdir/output/data/file_eia_all", replace
(note: file /workspace/output/data/file_eia_all.dta not found)
file /workspace/output/data/file_eia_all.dta saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/cleaning_dataset.log
  log type:  text
 closed on:   8 Apr 2022, 12:21:08
-------------------------------------------------------------------------------
