-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:/Users/k1754142/OneDrive/PhD Project/OpenSAFELY/Github Practice/logs/cleaning_dataset.log
  log type:  text
 opened on:   6 Apr 2022, 14:11:55

. 
. di "$projectdir"
C:/Users/k1754142/OneDrive/PhD Project/OpenSAFELY/Github Practice

. di "$logdir"
C:/Users/k1754142/OneDrive/PhD Project/OpenSAFELY/Github Practice/logs

. 
. import delimited "$projectdir/output/input.csv", clear
(65 vars, 100,000 obs)

. 
. **Set Ado file path
. adopath + "$projectdir/analysis/extra_ados"
  [1]  (BASE)      "C:\Program Files\Stata17\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata17\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "C:\Users\k1754142\ado\personal/"
  [5]  (PLUS)      "C:\Users\k1754142\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "C:/Users/k1754142/OneDrive/PhD Project/OpenSAFELY/Github Practice/analysis/extra_ados"

. 
. **Set index dates ===========================================================*/
. global year_preceding = "01/03/2018"

. global start_date = "01/03/2019"

. global end_date = "01/03/2022"

. 
. **Rename variables (some are too long for Stata to handle) =======================================*/
. rename chronic_respiratory_disease chronic_resp_disease

. 
. **Convert date strings to dates ====================================================*/
. ***Some dates are given with month/year only, so adding day 15 to enable them to be processed as dates 
. 
. foreach var of varlist   hba1c_mmol_per_mol_date                        ///
>                                                  hba1c_percentage_date                          ///
>                                                  creatinine_date                                ///
>                                                  bmi_date_measured                          ///
>                                                  abatacept                                                      ///
>                                                  adalimumab                                                     ///     
>                                                  baricitinib                                            ///
>                                                  certolizumab                                           ///
>                                                  etanercept                                                     ///
>                                                  golimumab                                                      ///
>                                                  guselkumab                                                     ///     
>                                                  infliximab                                                     ///
>                                                  ixekizumab                                                     ///
>                                                  methotrexate_hcd                                       ///
>                                                  rituximab                                                      ///
>                                                  sarilumab                                                      ///
>                                                  secukinumab                                            ///     
>                                                  tocilizumab                                            ///
>                                                  tofacitinib                                            ///
>                                                  upadacitinib                                           ///
>                                                  ustekinumab                                            ///
>                                                  {
  2.                                                         
.                 capture confirm string variable `var'
  3.                 if _rc!=0 {
  4.                         assert `var'==.
  5.                         rename `var' `var'_date
  6.                 }
  7.         
.                 else {
  8.                                 replace `var' = `var' + "-15"
  9.                                 rename `var' `var'_dstr
 10.                                 replace `var'_dstr = " " if `var'_dstr == "-15"
 11.                                 gen `var'_date = date(`var'_dstr, "YMD") 
 12.                                 order `var'_date, after(`var'_dstr)
 13.                                 drop `var'_dstr
 14.                 }
 15.         
.         format `var'_date %td
 16. }
variable hba1c_mmol_per_mol_date was str7 now str10
(100,000 real changes made)
(5,000 real changes made)
(5,000 missing values generated)
variable hba1c_percentage_date was str7 now str10
(100,000 real changes made)
(5,000 real changes made)
(5,000 missing values generated)
variable creatinine_date was str7 now str10
(100,000 real changes made)
(5,000 real changes made)
(5,000 missing values generated)
variable bmi_date_measured was str7 now str10
(100,000 real changes made)
(40,000 real changes made)
(40,000 missing values generated)
variable abatacept was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable adalimumab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable baricitinib was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable certolizumab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable etanercept was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable golimumab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable guselkumab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable infliximab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable ixekizumab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable methotrexate_hcd was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable rituximab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable sarilumab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable secukinumab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable tocilizumab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable tofacitinib was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable upadacitinib was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable ustekinumab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)

. 
. **Conversion for dates with day already included ====================================================*/
. 
. foreach var of varlist   died_date_ons                                          ///
>                                              eia_code_date                                              ///
>                                                  rheum_appt_date                                        ///
>                                              ra_code_date                                               ///
>                                                  psa_code_date                                          ///
>                                                  anksp_code_date                                        ///
>                                                  last_gp_prerheum_date                          ///
>                                                  last_gp_precode_date                           ///     
>                                                  last_gp_refrheum_date                          ///
>                                                  last_gp_refcode_date                           ///
>                                                  referral_rheum_prerheum                        ///
>                                                  referral_rheum_precode                         ///     
>                                                  chronic_cardiac_disease                        ///
>                                                  diabetes                                                       ///
>                                                  hypertension                                           ///     
>                                                  chronic_resp_disease                           ///
>                                                  copd                                                           ///
>                                                  chronic_liver_disease                          ///
>                                                  stroke                                                         ///
>                                                  lung_cancer                                            ///
>                                                  haem_cancer                                            ///
>                                                  other_cancer                                           ///
>                                                  esrf                                                           ///
>                                                  organ_transplant                                       ///
>                                                  hydroxychloroquine                                     ///
>                                                  leflunomide                                            ///
>                                                  methotrexate                                           ///
>                                                  methotrexate_inj                                       ///
>                                                  sulfasalazine                                          ///
>                                                  {
  2.                                                                  
.                 capture confirm string variable `var'
  3.                 if _rc!=0 {
  4.                         assert `var'==.
  5.                         rename `var' `var'_date
  6.                 }
  7.         
.                 else {
  8.                                 rename `var' `var'_dstr
  9.                                 gen `var'_date = date(`var'_dstr, "YMD") 
 10.                                 order `var'_date, after(`var'_dstr)
 11.                                 drop `var'_dstr
 12.                                 gen `var'_date15 = `var'_date+15
 13.                                 order `var'_date15, after(`var'_date)
 14.                                 drop `var'_date
 15.                                 rename `var'_date15 `var'_date
 16.                 }
 17.         
.         format `var'_date %td
 18. }
(90,000 missing values generated)
(90,000 missing values generated)
(1,000 missing values generated)
(1,000 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(1,000 missing values generated)
(1,000 missing values generated)
(1,000 missing values generated)
(1,000 missing values generated)
(1,000 missing values generated)
(1,000 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(90,000 missing values generated)
(90,000 missing values generated)
(90,000 missing values generated)
(90,000 missing values generated)
(90,000 missing values generated)
(90,000 missing values generated)
(90,000 missing values generated)
(90,000 missing values generated)
(90,000 missing values generated)
(90,000 missing values generated)

.                                                  
. **Rename variables with extra 'date' added to the end of variable names===========================================================*/ 
. rename rheum_appt_date_date rheum_appt_date

. rename eia_code_date_date eia_code_date

. rename ra_code_date_date ra_code_date

. rename psa_code_date_date psa_code_date

. rename anksp_code_date_date anksp_code_date

. rename died_date_ons_date died_ons_date

. rename last_gp_prerheum_date_date last_gp_prerheum_date

. rename last_gp_refrheum_date_date last_gp_refrheum_date

. rename last_gp_refcode_date_date last_gp_refcode_date

. rename last_gp_precode_date_date last_gp_precode_date

. rename hba1c_mmol_per_mol_date_date hba1c_mmol_per_mol_date

. rename hba1c_percentage_date_date hba1c_percentage_date

. rename creatinine_date_date creatinine_date

. rename creatinine creatinine_value 

. rename bmi_date_measured_date bmi_date

. rename bmi bmi_value

. 
. **Create binary indicator variables for relevant conditions ====================================================*/
. 
. foreach var of varlist   eia_code_date                                          ///
>                                                  rheum_appt_date                                        ///
>                                              ra_code_date                                               ///
>                                                  psa_code_date                                          ///
>                                                  anksp_code_date                                        ///
>                                                  died_ons_date                                          ///
>                                                  last_gp_prerheum_date                          ///
>                                                  last_gp_precode_date                           ///     
>                                                  last_gp_refrheum_date                          ///
>                                                  last_gp_refcode_date                           ///
>                                                  referral_rheum_prerheum_date           ///
>                                                  referral_rheum_precode_date            ///     
>                                                  chronic_cardiac_disease_date           ///
>                                                  diabetes_date                                          ///
>                                                  hypertension_date                                      ///
>                                                  chronic_resp_disease_date                      ///
>                                                  copd_date                                                      ///
>                                                  chronic_liver_disease_date                     ///
>                                                  stroke_date                                            ///
>                                                  lung_cancer_date                                       ///
>                                                  haem_cancer_date                                       ///             
>                                                  other_cancer_date                                      ///
>                                                  esrf_date                                                      ///
>                                                  creatinine_date                                        ///
>                                                  organ_transplant_date                          ///
>                                                  hydroxychloroquine_date                        ///     
>                                                  leflunomide_date                                       ///
>                                                  methotrexate_date                                      ///
>                                                  methotrexate_inj_date                          ///             
>                                                  sulfasalazine_date                                     ///
>                                                  abatacept_date                                         ///
>                                                  adalimumab_date                                        ///
>                                                  baricitinib_date                                       ///
>                                                  certolizumab_date                                      ///
>                                                  etanercept_date                                        ///
>                                                  golimumab_date                                         ///
>                                                  guselkumab_date                                        ///
>                                                  infliximab_date                                        ///
>                                                  ixekizumab_date                                        ///
>                                                  methotrexate_hcd_date                          ///
>                                                  rituximab_date                                         ///             
>                                                  sarilumab_date                                         ///
>                                                  secukinumab_date                                       ///
>                                                  tocilizumab_date                                       ///             
>                                                  tofacitinib_date                                       ///
>                                                  upadacitinib_date                                      ///
>                                                  ustekinumab_date   {                           
  2.         /*date ranges are applied in python, so presence of date indicates presence of 
>           disease in the correct time frame*/ 
.         local newvar =  substr("`var'", 1, length("`var'") - 5)
  3.         gen `newvar' = (`var'!=. )
  4.         order `newvar', after(`var')
  5. }

. 
. **Create and label variables ===========================================================*/
. 
. **Demographics
. ***Sex
. gen male = 1 if sex == "M"
(50,731 missing values generated)

. replace male = 0 if sex == "F"
(50,731 real changes made)

. lab var male "Male"

. tab male, missing

       Male |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     50,731       50.73       50.73
          1 |     49,269       49.27      100.00
------------+-----------------------------------
      Total |    100,000      100.00

. 
. ***Ethnicity
. replace ethnicity = .u if ethnicity == .
(25,000 real changes made, 25,000 to missing)

. ****rearrange in order of prevalence
. recode ethnicity 2=6 /* mixed to 6 */
(14931 changes made to ethnicity)

. recode ethnicity 3=2 /* south asian to 2 */
(7578 changes made to ethnicity)

. recode ethnicity 4=3 /* black to 3 */
(7490 changes made to ethnicity)

. recode ethnicity 6=4 /* mixed to 4 */
(14931 changes made to ethnicity)

. recode ethnicity 5=4 /* other to 4 */
(7483 changes made to ethnicity)

. 
. label define ethnicity  1 "White"                                       ///
>                                                 2 "Asian/Asian British"         ///
>                                                 3 "Black"                                       ///
>                                                 4 "Mixed/Other"                         ///
>                                                 .u "Missing"

. label values ethnicity ethnicity

. lab var ethnicity "Ethnicity"

. tab ethnicity, missing

          Ethnicity |      Freq.     Percent        Cum.
--------------------+-----------------------------------
              White |     37,518       37.52       37.52
Asian/Asian British |      7,578        7.58       45.10
              Black |      7,490        7.49       52.59
        Mixed/Other |     22,414       22.41       75.00
            Missing |     25,000       25.00      100.00
--------------------+-----------------------------------
              Total |    100,000      100.00

. 
. ***STP 
. rename stp stp_old

. bysort stp_old: gen stp = 1 if _n==1
(99,998 missing values generated)

. replace stp = sum(stp) //
(99,999 real changes made)

. drop stp_old

. 
. ***Regions
. encode region, gen(nuts_region)

. tab region, missing

                  region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
           East Midlands |      9,992        9.99        9.99
         East of England |     10,010       10.01       20.00
                  London |     19,833       19.83       39.84
              North East |     10,090       10.09       49.92
              North West |      9,988        9.99       59.91
              South East |     20,143       20.14       80.06
           West Midlands |      9,813        9.81       89.87
Yorkshire and the Humber |     10,131       10.13      100.00
-------------------------+-----------------------------------
                   Total |    100,000      100.00

. 
. ***IMD
. *Group into 5 groups
. rename imd imd_o

. egen imd = cut(imd_o), group(5) icodes 

. *Add one to create groups 1-5 
. replace imd = imd + 1
(100,000 real changes made)

. *-1 is missing, should be excluded from population 
. replace imd = .u if imd_o == -1
(0 real changes made)

. drop imd_o

. *Reverse the order (so high is more deprived)
. recode imd 5 = 1 4 = 2 3 = 3 2 = 4 1 = 5 .u = .u
(100000 changes made to imd)

. label define imd 1 "1 least deprived" 2 "2" 3 "3" 4 "4" 5 "5 most deprived" .u "Missing"

. label values imd imd 

. lab var imd "Index of multiple deprivation"

. tab imd, missing

        Index of |
        multiple |
     deprivation |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |     70,035       70.03       70.03
               4 |     20,019       20.02       90.05
 5 most deprived |      9,946        9.95      100.00
-----------------+-----------------------------------
           Total |    100,000      100.00

. 
. ***Age variables
. *Nb. works if ages 18 and over
. *Create categorised age
. drop if age<18 & age !=.
(21,194 observations deleted)

. drop if age>109 & age !=.
(0 observations deleted)

. drop if age==.
(0 observations deleted)

. lab var age "Age"

. 
. recode age 18/39.9999 = 1 /// 
>            40/49.9999 = 2 ///
>                    50/59.9999 = 3 ///
>                60/69.9999 = 4 ///
>                    70/79.9999 = 5 ///
>                    80/max = 6, gen(agegroup) 
(78806 differences between age and agegroup)

. 
. label define agegroup   1 "18-39" ///
>                                                 2 "40-49" ///
>                                                 3 "50-59" ///
>                                                 4 "60-69" ///
>                                                 5 "70-79" ///
>                                                 6 "80+"

.                                                 
. label values agegroup agegroup

. lab var agegroup "Age group"

. tab agegroup, missing

  Age group |      Freq.     Percent        Cum.
------------+-----------------------------------
      18-39 |     28,708       36.43       36.43
      40-49 |     12,778       16.21       52.64
      50-59 |     13,510       17.14       69.79
      60-69 |     10,680       13.55       83.34
      70-79 |      8,295       10.53       93.86
        80+ |      4,835        6.14      100.00
------------+-----------------------------------
      Total |     78,806      100.00

. 
. *Create binary age
. recode age min/69.999 = 0 ///
>            70/max = 1, gen(age70)
(78806 differences between age and age70)

. 
. *Create restricted cubic splines for age
. mkspline age = age, cubic nknots(4)

. 
. ***Body Mass Index
. *Recode strange values 
. replace bmi_value = . if bmi_value == 0 
(31,577 real changes made, 31,577 to missing)

. replace bmi_value = . if !inrange(bmi_value, 10, 80)
(297 real changes made, 297 to missing)

. 
. *Restrict to within 10 years of EIA diagnosis date and aged>16 
. gen bmi_time = (eia_code_date - bmi_date)/365.25
(32,044 missing values generated)

. gen bmi_age = age - bmi_time
(32,044 missing values generated)

. replace bmi_value = . if bmi_age < 16 
(33,254 real changes made, 33,254 to missing)

. replace bmi_value = . if bmi_time > 10 & bmi_time != . 
(8,867 real changes made, 8,867 to missing)

. 
. *Set to missing if no date, and vice versa 
. replace bmi_value = . if bmi_date == . 
(0 real changes made)

. replace bmi_date = . if bmi_value == . 
(42,418 real changes made, 42,418 to missing)

. replace bmi_time = . if bmi_value == . 
(42,415 real changes made, 42,415 to missing)

. replace bmi_age = . if bmi_value == . 
(42,415 real changes made, 42,415 to missing)

. 
. *Create BMI categories
. gen     bmicat = .
(78,806 missing values generated)

. recode  bmicat . = 1 if bmi_value < 18.5
(208 changes made to bmicat)

. recode  bmicat . = 2 if bmi_value < 25
(518 changes made to bmicat)

. recode  bmicat . = 3 if bmi_value < 30
(795 changes made to bmicat)

. recode  bmicat . = 4 if bmi_value < 35
(942 changes made to bmicat)

. recode  bmicat . = 5 if bmi_value < 40
(926 changes made to bmicat)

. recode  bmicat . = 6 if bmi_value < .
(1422 changes made to bmicat)

. replace bmicat = .u if bmi_value >= .
(73,995 real changes made, 73,995 to missing)

. 
. label define bmicat 1 "Underweight (<18.5)"     ///
>                                         2 "Normal (18.5-24.9)"          ///
>                                         3 "Overweight (25-29.9)"        ///
>                                         4 "Obese I (30-34.9)"           ///
>                                         5 "Obese II (35-39.9)"          ///
>                                         6 "Obese III (40+)"                     ///
>                                         .u "Missing"

.                                         
. label values bmicat bmicat

. lab var bmicat "BMI"

. tab bmicat, missing

                 BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |        208        0.26        0.26
  Normal (18.5-24.9) |        518        0.66        0.92
Overweight (25-29.9) |        795        1.01        1.93
   Obese I (30-34.9) |        942        1.20        3.13
  Obese II (35-39.9) |        926        1.18        4.30
     Obese III (40+) |      1,422        1.80        6.10
             Missing |     73,995       93.90      100.00
---------------------+-----------------------------------
               Total |     78,806      100.00

. 
. *Create less granular categorisation
. recode bmicat 1/3 .u = 1 4 = 2 5 = 3 6 = 4, gen(obese4cat)
(78598 differences between bmicat and obese4cat)

. 
. label define obese4cat  1 "No record of obesity"        ///
>                                                 2 "Obese I (30-34.9)"           ///
>                                                 3 "Obese II (35-39.9)"          ///
>                                                 4 "Obese III (40+)"             

. 
. label values obese4cat obese4cat

. order obese4cat, after(bmicat)

. 
. ***Smoking 
. label define smoke 1 "Never" 2 "Former" 3 "Current" .u "Missing"

. 
. gen     smoke = 1  if smoking_status == "N"
(71,050 missing values generated)

. replace smoke = 2  if smoking_status == "E"
(4,026 real changes made)

. replace smoke = 3  if smoking_status == "S"
(23,643 real changes made)

. replace smoke = .u if smoking_status == "M"
(3,995 real changes made, 3,995 to missing)

. replace smoke = .u if smoking_status == "" 
(39,386 real changes made, 39,386 to missing)

. 
. label values smoke smoke

. lab var smoke "Smoking status"

. drop smoking_status

. tab smoke, missing

    Smoking |
     status |      Freq.     Percent        Cum.
------------+-----------------------------------
      Never |      7,756        9.84        9.84
     Former |      4,026        5.11       14.95
    Current |     23,643       30.00       44.95
    Missing |     43,381       55.05      100.00
------------+-----------------------------------
      Total |     78,806      100.00

. 
. *Create non-missing 3-category variable for current smoking (assumes missing smoking is never smoking)
. recode smoke .u = 1, gen(smoke_nomiss)
(43381 differences between smoke and smoke_nomiss)

. order smoke_nomiss, after(smoke)

. label values smoke_nomiss smoke

. 
. **Clinical comorbidities
. ***eGFR
. *Set implausible creatinine values to missing (Note: zero changed to missing)
. replace creatinine_value = . if !inrange(creatinine_value, 20, 3000) 
(19,890 real changes made, 19,890 to missing)

. 
. *Remove creatinine dates if no measurements, and vice versa 
. replace creatinine_value = . if creatinine_date == . 
(0 real changes made)

. replace creatinine_date = . if creatinine_value == . 
(15,928 real changes made, 15,928 to missing)

. replace creatinine = . if creatinine_value == .
(19,890 real changes made, 19,890 to missing)

. recode creatinine .=0
(19890 changes made to creatinine)

. tab creatinine, missing

 creatinine |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     19,890       25.24       25.24
          1 |     58,916       74.76      100.00
------------+-----------------------------------
      Total |     78,806      100.00

. tabstat creatinine_value, stat(n mean p50)

    Variable |         N      Mean       p50
-------------+------------------------------
creatinin~ue |     58916  136.6727  126.2268
--------------------------------------------

. 
. *Divide by 88.4 (to convert umol/l to mg/dl) 
. gen SCr_adj = creatinine_value/88.4
(19,890 missing values generated)

. 
. gen min = .
(78,806 missing values generated)

. replace min = SCr_adj/0.7 if male==0
(29,894 real changes made)

. replace min = SCr_adj/0.9 if male==1
(29,022 real changes made)

. replace min = min^-0.329  if male==0
(29,894 real changes made)

. replace min = min^-0.411  if male==1
(29,022 real changes made)

. replace min = 1 if min<1
(46,040 real changes made)

. 
. gen max=.
(78,806 missing values generated)

. replace max=SCr_adj/0.7 if male==0
(29,894 real changes made)

. replace max=SCr_adj/0.9 if male==1
(29,022 real changes made)

. replace max=max^-1.209
(58,916 real changes made)

. replace max=1 if max>1
(32,766 real changes made)

. 
. gen egfr=min*max*141
(19,890 missing values generated)

. replace egfr=egfr*(0.993^age)
(58,916 real changes made)

. replace egfr=egfr*1.018 if male==0
(29,894 real changes made)

. label var egfr "egfr calculated using CKD-EPI formula with no ethnicity"

. 
. *Categorise into ckd stages
. egen egfr_cat_all = cut(egfr), at(0, 15, 30, 45, 60, 5000)
(19,890 missing values generated)

. recode egfr_cat_all 0 = 5 15 = 4 30 = 3 45 = 2 60 = 0, generate(ckd_egfr)
(58916 differences between egfr_cat_all and ckd_egfr)

. 
. gen egfr_cat = .
(78,806 missing values generated)

. recode egfr_cat . = 3 if egfr < 30
(13919 changes made to egfr_cat)

. recode egfr_cat . = 2 if egfr < 60
(20750 changes made to egfr_cat)

. recode egfr_cat . = 1 if egfr < .
(24247 changes made to egfr_cat)

. replace egfr_cat = .u if egfr >= .
(19,890 real changes made, 19,890 to missing)

. 
. label define egfr_cat   1 ">=60"                ///
>                                                 2 "30-59"               ///
>                                                 3 "<30"                 ///
>                                                 .u "Missing"

.                                         
. label values egfr_cat egfr_cat

. lab var egfr_cat "eGFR"

. tab egfr_cat, missing

       eGFR |      Freq.     Percent        Cum.
------------+-----------------------------------
       >=60 |     24,247       30.77       30.77
      30-59 |     20,750       26.33       57.10
        <30 |     13,919       17.66       74.76
    Missing |     19,890       25.24      100.00
------------+-----------------------------------
      Total |     78,806      100.00

. 
. *If missing eGFR, assume normal
. gen egfr_cat_nomiss = egfr_cat
(19,890 missing values generated)

. replace egfr_cat_nomiss = 1 if egfr_cat == .u
(19,890 real changes made)

. 
. label define egfr_cat_nomiss    1 ">=60/missing"        ///
>                                                                 2 "30-59"                       ///
>                                                                 3 "<30" 

. label values egfr_cat_nomiss egfr_cat_nomiss

. lab var egfr_cat_nomiss "eGFR"

. 
. gen egfr_date = creatinine_date
(19,890 missing values generated)

. format egfr_date %td

. 
. *Add in end stage renal failure and create a single CKD variable 
. *Missing assumed to not have CKD 
. gen ckd = 0

. replace ckd = 1 if ckd_egfr != . & ckd_egfr >= 1
(34,669 real changes made)

. replace ckd = 1 if esrf == 1
(8,774 real changes made)

. 
. label define ckd 0 "No CKD" 1 "CKD"

. label values ckd ckd

. label var ckd "Chronic kidney disease"

. tab ckd, missing

    Chronic |
     kidney |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
     No CKD |     35,363       44.87       44.87
        CKD |     43,443       55.13      100.00
------------+-----------------------------------
      Total |     78,806      100.00

. 
. *Create date (most recent measure prior to index)
. gen temp1_ckd_date = creatinine_date if ckd_egfr >=1
(44,137 missing values generated)

. gen temp2_ckd_date = esrf_date if esrf == 1
(63,008 missing values generated)

. gen ckd_date = max(temp1_ckd_date,temp2_ckd_date) 
(35,363 missing values generated)

. format ckd_date %td 

. 
. drop temp1_ckd_date temp2_ckd_date SCr_adj min max ckd_egfr egfr_cat_all

. 
. ***HbA1c
. *Set zero or negative to missing
. replace hba1c_percentage   = . if hba1c_percentage <= 0
(4,415 real changes made, 4,415 to missing)

. replace hba1c_mmol_per_mol = . if hba1c_mmol_per_mol <= 0
(5,683 real changes made, 5,683 to missing)

. 
. *Change implausible values to missing
. replace hba1c_percentage   = . if !inrange(hba1c_percentage, 1, 20)
(1,206 real changes made, 1,206 to missing)

. replace hba1c_mmol_per_mol = . if !inrange(hba1c_mmol_per_mol, 10, 200)
(3,348 real changes made, 3,348 to missing)

. 
. *Set most recent values of >24 months prior to EIA diagnosis date to missing
. replace hba1c_percentage   = . if (eia_code_date - hba1c_percentage_date) > 24*30 & hba1c_percentage_date != .
(70,891 real changes made, 70,891 to missing)

. replace hba1c_mmol_per_mol = . if (eia_code_date - hba1c_mmol_per_mol_date) > 24*30 & hba1c_mmol_per_mol_date != .
(67,565 real changes made, 67,565 to missing)

. 
. *Clean up dates
. replace hba1c_percentage_date = . if hba1c_percentage == .
(72,581 real changes made, 72,581 to missing)

. replace hba1c_mmol_per_mol_date = . if hba1c_mmol_per_mol == .
(72,689 real changes made, 72,689 to missing)

. 
. *Express  HbA1c as percentage
. *Express all values as perecentage 
. noi summ hba1c_percentage hba1c_mmol_per_mol 

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
hba1c_per~ge |      2,294    5.083642    1.883738    1.00184   11.19714
hba1c_mmol~l |      2,210    42.45799    17.59521   10.03409   109.4381

. gen     hba1c_pct = hba1c_percentage 
(76,512 missing values generated)

. replace hba1c_pct = (hba1c_mmol_per_mol/10.929)+2.15 if hba1c_mmol_per_mol<. 
(2,210 real changes made)

. 
. *Valid % range between 0-20  
. replace hba1c_pct = . if !inrange(hba1c_pct, 1, 20) 
(0 real changes made)

. replace hba1c_pct = round(hba1c_pct, 0.1)
(4,430 real changes made)

. 
. *Categorise HbA1c and diabetes
. *Group hba1c pct
. gen     hba1ccat = 0 if hba1c_pct <  6.5
(75,770 missing values generated)

. replace hba1ccat = 1 if hba1c_pct >= 6.5  & hba1c_pct < 7.5
(736 real changes made)

. replace hba1ccat = 2 if hba1c_pct >= 7.5  & hba1c_pct < 8
(223 real changes made)

. replace hba1ccat = 3 if hba1c_pct >= 8    & hba1c_pct < 9
(287 real changes made)

. replace hba1ccat = 4 if hba1c_pct >= 9    & hba1c_pct !=.
(148 real changes made)

. label define hba1ccat 0 "<6.5%" 1">=6.5-7.4" 2">=7.5-7.9" 3">=8-8.9" 4">=9"

. label values hba1ccat hba1ccat

. tab hba1ccat, missing

   hba1ccat |      Freq.     Percent        Cum.
------------+-----------------------------------
      <6.5% |      3,036        3.85        3.85
  >=6.5-7.4 |        736        0.93        4.79
  >=7.5-7.9 |        223        0.28        5.07
    >=8-8.9 |        287        0.36        5.43
        >=9 |        148        0.19        5.62
          . |     74,376       94.38      100.00
------------+-----------------------------------
      Total |     78,806      100.00

. 
. *Express all values as mmol
. gen hba1c_mmol = hba1c_mmol_per_mol
(76,596 missing values generated)

. replace hba1c_mmol = (hba1c_percentage*10.929)-23.5 if hba1c_percentage<. & hba1c_mmol==.
(2,220 real changes made)

. 
. *Group hba1c mmol
. gen     hba1ccatmm = 0 if hba1c_mmol < 58
(75,030 missing values generated)

. replace hba1ccatmm = 1 if hba1c_mmol >= 58 & hba1c_mmol !=.
(654 real changes made)

. replace hba1ccatmm =.u if hba1ccatmm==. 
(74,376 real changes made, 74,376 to missing)

. label define hba1ccatmm 0 "HbA1c <58mmol/mol" 1 "HbA1c >=58mmol/mol" .u "Missing"

. label values hba1ccatmm hba1ccatmm

. lab var hba1ccatmm "HbA1c"

. tab hba1ccatmm, missing

             HbA1c |      Freq.     Percent        Cum.
-------------------+-----------------------------------
 HbA1c <58mmol/mol |      3,776        4.79        4.79
HbA1c >=58mmol/mol |        654        0.83        5.62
           Missing |     74,376       94.38      100.00
-------------------+-----------------------------------
             Total |     78,806      100.00

. 
. *Create diabetes, split by control/not (assumes missing = no diabetes)
. gen     diabcat = 1 if diabetes==0
(15,729 missing values generated)

. replace diabcat = 2 if diabetes==1 & inlist(hba1ccat, 0, 1)
(751 real changes made)

. replace diabcat = 3 if diabetes==1 & inlist(hba1ccat, 2, 3, 4)
(135 real changes made)

. replace diabcat = 4 if diabetes==1 & !inlist(hba1ccat, 0, 1, 2, 3, 4)
(14,843 real changes made)

. 
. label define diabcat    1 "No diabetes"                         ///
>                                                 2 "Controlled diabetes"         ///
>                                                 3 "Uncontrolled diabetes"       ///
>                                                 4 "Diabetes, no hba1c measure"

. label values diabcat diabcat

. 
. *Create cancer variable 'other cancer currently', includes carcinoma of the head and neck - need to confirm if this excludes NMSC
. gen cancer =0

. replace cancer =1 if lung_cancer ==1 | haem_cancer ==1 | other_cancer ==1
(38,502 real changes made)

. lab var cancer "Cancer"

. tab cancer, missing

     Cancer |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     40,304       51.14       51.14
          1 |     38,502       48.86      100.00
------------+-----------------------------------
      Total |     78,806      100.00

. 
. *Create other comorbid variables
. gen combined_cv_comorbid =1 if chronic_cardiac_disease ==1 | stroke==1
(50,522 missing values generated)

. recode combined_cv_comorbid .=0
(50522 changes made to combined_cv_comorbid)

. 
. *Delete unneeded variables
. drop hba1c_pct hba1c_percentage hba1c_mmol_per_mol

. 
. *Label variables
. lab var hypertension "Hypertension"

. lab var diabetes "Diabetes"

. lab var stroke "Stroke"

. lab var chronic_resp_disease "Chronic respiratory disease"

. lab var copd "COPD"

. lab var esrf "End-stage renal failure"

. lab var chronic_liver_disease "Chronic liver disease"

. lab var chronic_cardiac_disease "Chronic cardiac disease"

. 
. *Refine diagnostic window=============================================================*/
. 
. **All patients should have EIA code
. tab eia_code, missing

   eia_code |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        770        0.98        0.98
          1 |     78,036       99.02      100.00
------------+-----------------------------------
      Total |     78,806      100.00

. keep if eia_code==1
(770 observations deleted)

. 
. **Keep patients with first EIA code in GP record if code was after 1st March 2019
. keep if eia_code_date>=date("$start_date", "DMY") & eia_code_date!=. 
(18,131 observations deleted)

. tab eia_code

   eia_code |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     59,905      100.00      100.00
------------+-----------------------------------
      Total |     59,905      100.00

. 
. **Month/Year of EIA code
. gen year_diag=year(eia_code_date)

. format year_diag %ty

. gen month_diag=month(eia_code_date)

. gen mo_year_diagn=ym(year_diag, month_diag)

. format mo_year_diagn %tm

. 
. *Include only most recent EIA sub-diagnosis=============================================*/
. 
. replace ra_code =0 if psa_code_date >= ra_code_date & psa_code_date !=.
(29,464 real changes made)

. replace ra_code =0 if anksp_code_date >= ra_code_date & anksp_code_date !=.
(10,038 real changes made)

. replace psa_code =0 if ra_code_date >= psa_code_date & ra_code_date !=.
(29,255 real changes made)

. replace psa_code =0 if anksp_code_date >= psa_code_date & anksp_code_date !=.
(9,942 real changes made)

. replace anksp_code =0 if psa_code_date >= anksp_code_date & psa_code_date !=.
(29,373 real changes made)

. replace anksp_code =0 if ra_code_date >= anksp_code_date & ra_code_date !=.
(9,952 real changes made)

. gen eia_diagnosis=1 if ra_code==1
(40,128 missing values generated)

. replace eia_diagnosis=2 if psa_code==1
(20,094 real changes made)

. replace eia_diagnosis=3 if anksp_code==1
(19,959 real changes made)

. lab define eia_diagnosis 1 "RA" 2 "PsA" 3 "AxSpA", modify

. lab val eia_diagnosis eia_diagnosis

. tab eia_diagnosis, missing

eia_diagnos |
         is |      Freq.     Percent        Cum.
------------+-----------------------------------
         RA |     19,777       33.01       33.01
        PsA |     20,094       33.54       66.56
      AxSpA |     19,959       33.32       99.87
          . |         75        0.13      100.00
------------+-----------------------------------
      Total |     59,905      100.00

. drop if eia_diagnosis==.
(75 observations deleted)

. 
. *Define drugs and dates=====================================================*/
. 
. **csDMARDs (not including high cost MTX; wouldn't be shared care)
. gen csdmard=1 if hydroxychloroquine==1 | leflunomide==1 | methotrexate==1 | methotrexate_inj==1 | sulfasalazine==1
(35,259 missing values generated)

. recode csdmard .=0 
(35259 changes made to csdmard)

. tab csdmard, missing

    csdmard |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     35,259       58.93       58.93
          1 |     24,571       41.07      100.00
------------+-----------------------------------
      Total |     59,830      100.00

. bys eia_diagnosis: tab csdmard

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

    csdmard |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     11,601       58.66       58.66
          1 |      8,176       41.34      100.00
------------+-----------------------------------
      Total |     19,777      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    csdmard |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     11,856       59.00       59.00
          1 |      8,238       41.00      100.00
------------+-----------------------------------
      Total |     20,094      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    csdmard |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     11,802       59.13       59.13
          1 |      8,157       40.87      100.00
------------+-----------------------------------
      Total |     19,959      100.00


. 
. **csDMARDs (including high cost MTX)
. gen csdmard_hcd=1 if hydroxychloroquine==1 | leflunomide==1 | methotrexate==1 | methotrexate_inj==1 | methotrexate_hcd==1 | sulfasalazine==1
(31,701 missing values generated)

. recode csdmard_hcd .=0 
(31701 changes made to csdmard_hcd)

. tab csdmard_hcd, missing

csdmard_hcd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     31,701       52.99       52.99
          1 |     28,129       47.01      100.00
------------+-----------------------------------
      Total |     59,830      100.00

. bys eia_diagnosis: tab csdmard_hcd, missing

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

csdmard_hcd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,413       52.65       52.65
          1 |      9,364       47.35      100.00
------------+-----------------------------------
      Total |     19,777      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

csdmard_hcd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,697       53.23       53.23
          1 |      9,397       46.77      100.00
------------+-----------------------------------
      Total |     20,094      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

csdmard_hcd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,591       53.06       53.06
          1 |      9,368       46.94      100.00
------------+-----------------------------------
      Total |     19,959      100.00


. 
. **Date of first csDMARD script (not including high cost MTX prescriptions)
. gen csdmard_date=min(hydroxychloroquine_date, leflunomide_date, methotrexate_date, methotrexate_inj_date, sulfasalazine_date)
(35,259 missing values generated)

. format %td csdmard_date

. 
. **Date of first csDMARD script (including high cost MTX prescriptions)
. gen csdmard_hcd_date=min(hydroxychloroquine_date, leflunomide_date, methotrexate_date, methotrexate_inj_date, methotrexate_hcd_date, sulfasalazine_date)
(31,701 missing values generated)

. format %td csdmard_hcd_date

. 
. **Biologic use
. gen biologic=1 if abatacept==1 | adalimumab==1 | baricitinib==1 | certolizumab==1 | etanercept==1 | golimumab==1 | guselkumab==1 | infliximab==1 | ixekizumab==1 | rituximab==1 | sarilumab==1 | secukinumab==1 | tocilizumab
> ==1 | tofacitinib==1 | upadacitinib==1 | ustekinumab==1 
(10,977 missing values generated)

. recode biologic .=0
(10977 changes made to biologic)

. tab biologic, missing

   biologic |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,977       18.35       18.35
          1 |     48,853       81.65      100.00
------------+-----------------------------------
      Total |     59,830      100.00

. bys eia_diagnosis: tab biologic, missing 

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

   biologic |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,608       18.24       18.24
          1 |     16,169       81.76      100.00
------------+-----------------------------------
      Total |     19,777      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

   biologic |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,696       18.39       18.39
          1 |     16,398       81.61      100.00
------------+-----------------------------------
      Total |     20,094      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

   biologic |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,673       18.40       18.40
          1 |     16,286       81.60      100.00
------------+-----------------------------------
      Total |     19,959      100.00


. 
. **Date of first biologic script
. gen biologic_date=min(abatacept_date, adalimumab_date, baricitinib_date, certolizumab_date, etanercept_date, golimumab_date, guselkumab_date, infliximab_date, ixekizumab_date, rituximab_date, sarilumab_date, secukinumab_d
> ate, tocilizumab_date, tofacitinib_date, upadacitinib_date, ustekinumab_date)
(10,977 missing values generated)

. format %td biologic_date

. 
. **Exclude if first csdmard or biologic was before first rheum appt
. ***Nb. could introduce leeway e.g. 30 days?
. tab csdmard if rheum_appt_date!=. & csdmard_date!=. & csdmard_date<rheum_appt_date

    csdmard |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      8,956      100.00      100.00
------------+-----------------------------------
      Total |      8,956      100.00

. drop if rheum_appt_date!=. & csdmard_date!=. & csdmard_date<rheum_appt_date
(8,956 observations deleted)

. tab biologic if rheum_appt_date!=. & biologic_date!=. & biologic_date<rheum_appt_date 

   biologic |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     15,727      100.00      100.00
------------+-----------------------------------
      Total |     15,727      100.00

. drop if rheum_appt_date!=. & biologic_date!=. & biologic_date<rheum_appt_date 
(15,727 observations deleted)

. 
. *Number of EIA diagnoses in 1-year time windows=========================================*/
. 
. gen diagnosis_year=1 if eia_code_date>=td(01mar2019) & eia_code_date<td(01mar2020)
(23,817 missing values generated)

. replace diagnosis_year=2 if eia_code_date>=td(01mar2020) & eia_code_date<td(01mar2021)
(11,023 real changes made)

. replace diagnosis_year=3 if eia_code_date>=td(01mar2021) & eia_code_date<td(01mar2022)
(11,260 real changes made)

. lab define diagnosis_year 1 "March 2019-March 2020" 2 "March 2020-March 2021" 3 "March 2021-March 2022", modify

. lab val diagnosis_year diagnosis_year

. lab var diagnosis_year "Year of diagnosis"

. tab diagnosis_year, missing

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |     11,330       32.24       32.24
March 2020-March 2021 |     11,023       31.36       63.60
March 2021-March 2022 |     11,260       32.04       95.64
                    . |      1,534        4.36      100.00
----------------------+-----------------------------------
                Total |     35,147      100.00

. bys eia_diagnosis: tab diagnosis_year, missing

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |      3,781       32.71       32.71
March 2020-March 2021 |      3,589       31.05       63.75
March 2021-March 2022 |      3,688       31.90       95.66
                    . |        502        4.34      100.00
----------------------+-----------------------------------
                Total |     11,560      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |      3,805       32.19       32.19
March 2020-March 2021 |      3,682       31.15       63.33
March 2021-March 2022 |      3,810       32.23       95.56
                    . |        525        4.44      100.00
----------------------+-----------------------------------
                Total |     11,822      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |      3,744       31.82       31.82
March 2020-March 2021 |      3,752       31.89       63.71
March 2021-March 2022 |      3,762       31.98       95.69
                    . |        507        4.31      100.00
----------------------+-----------------------------------
                Total |     11,765      100.00


. 
. **Proportion of patients with at least 6 or 12 months of GP follow-up after EIA code
. tab has_6m_follow_up

has_6m_foll |
      ow_up |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,811        5.15        5.15
          1 |     33,336       94.85      100.00
------------+-----------------------------------
      Total |     35,147      100.00

. tab has_12m_follow_up

has_12m_fol |
     low_up |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,487        9.92        9.92
          1 |     31,660       90.08      100.00
------------+-----------------------------------
      Total |     35,147      100.00

. tab mo_year_diagn has_6m_follow_up

mo_year_di |   has_6m_follow_up
       agn |         0          1 |     Total
-----------+----------------------+----------
    2019m3 |        51        948 |       999 
    2019m4 |        44        903 |       947 
    2019m5 |        55        912 |       967 
    2019m6 |        40        911 |       951 
    2019m7 |        43        889 |       932 
    2019m8 |        41        899 |       940 
    2019m9 |        42        832 |       874 
   2019m10 |        46        906 |       952 
   2019m11 |        66        897 |       963 
   2019m12 |        45        900 |       945 
    2020m1 |        52        900 |       952 
    2020m2 |        44        864 |       908 
    2020m3 |        44        888 |       932 
    2020m4 |        55        834 |       889 
    2020m5 |        53        873 |       926 
    2020m6 |        43        903 |       946 
    2020m7 |        39        876 |       915 
    2020m8 |        50        853 |       903 
    2020m9 |        44        842 |       886 
   2020m10 |        51        947 |       998 
   2020m11 |        50        868 |       918 
   2020m12 |        63        886 |       949 
    2021m1 |        47        879 |       926 
    2021m2 |        36        799 |       835 
    2021m3 |        54        842 |       896 
    2021m4 |        47        946 |       993 
    2021m5 |        47        848 |       895 
    2021m6 |        44        910 |       954 
    2021m7 |        47        894 |       941 
    2021m8 |        41        905 |       946 
    2021m9 |        66        937 |     1,003 
   2021m10 |        43        916 |       959 
   2021m11 |        36        894 |       930 
   2021m12 |        54        903 |       957 
    2022m1 |        55        870 |       925 
    2022m2 |        41        820 |       861 
    2022m3 |        56        857 |       913 
    2022m4 |        36        585 |       621 
-----------+----------------------+----------
     Total |     1,811     33,336 |    35,147 

. tab mo_year_diagn has_12m_follow_up

mo_year_di |   has_12m_follow_up
       agn |         0          1 |     Total
-----------+----------------------+----------
    2019m3 |        93        906 |       999 
    2019m4 |        73        874 |       947 
    2019m5 |        84        883 |       967 
    2019m6 |       102        849 |       951 
    2019m7 |        92        840 |       932 
    2019m8 |        86        854 |       940 
    2019m9 |        83        791 |       874 
   2019m10 |       100        852 |       952 
   2019m11 |       110        853 |       963 
   2019m12 |        89        856 |       945 
    2020m1 |       102        850 |       952 
    2020m2 |        84        824 |       908 
    2020m3 |        93        839 |       932 
    2020m4 |        79        810 |       889 
    2020m5 |       105        821 |       926 
    2020m6 |        82        864 |       946 
    2020m7 |        85        830 |       915 
    2020m8 |        77        826 |       903 
    2020m9 |       100        786 |       886 
   2020m10 |       108        890 |       998 
   2020m11 |       100        818 |       918 
   2020m12 |        92        857 |       949 
    2021m1 |        97        829 |       926 
    2021m2 |        73        762 |       835 
    2021m3 |        87        809 |       896 
    2021m4 |       106        887 |       993 
    2021m5 |        85        810 |       895 
    2021m6 |        98        856 |       954 
    2021m7 |        90        851 |       941 
    2021m8 |        95        851 |       946 
    2021m9 |       109        894 |     1,003 
   2021m10 |       111        848 |       959 
   2021m11 |        95        835 |       930 
   2021m12 |       115        842 |       957 
    2022m1 |        89        836 |       925 
    2022m2 |        74        787 |       861 
    2022m3 |        89        824 |       913 
    2022m4 |        55        566 |       621 
-----------+----------------------+----------
     Total |     3,487     31,660 |    35,147 

. tab diagnosis_year if has_6m_follow_up==1, missing

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |     10,761       32.28       32.28
March 2020-March 2021 |     10,448       31.34       63.62
March 2021-March 2022 |     10,685       32.05       95.67
                    . |      1,442        4.33      100.00
----------------------+-----------------------------------
                Total |     33,336      100.00

. bys eia_diagnosis: tab diagnosis_year if has_6m_follow_up==1, missing

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |      3,593       32.79       32.79
March 2020-March 2021 |      3,400       31.03       63.82
March 2021-March 2022 |      3,490       31.85       95.67
                    . |        475        4.33      100.00
----------------------+-----------------------------------
                Total |     10,958      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |      3,625       32.29       32.29
March 2020-March 2021 |      3,490       31.09       63.39
March 2021-March 2022 |      3,616       32.21       95.60
                    . |        494        4.40      100.00
----------------------+-----------------------------------
                Total |     11,225      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |      3,543       31.77       31.77
March 2020-March 2021 |      3,558       31.90       63.67
March 2021-March 2022 |      3,579       32.09       95.76
                    . |        473        4.24      100.00
----------------------+-----------------------------------
                Total |     11,153      100.00


. tab diagnosis_year if has_12m_follow_up==1, missing

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |     10,232       32.32       32.32
March 2020-March 2021 |      9,932       31.37       63.69
March 2021-March 2022 |     10,106       31.92       95.61
                    . |      1,390        4.39      100.00
----------------------+-----------------------------------
                Total |     31,660      100.00

. bys eia_diagnosis: tab diagnosis_year if has_12m_follow_up==1, missing

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |      3,430       32.86       32.86
March 2020-March 2021 |      3,231       30.96       63.82
March 2021-March 2022 |      3,322       31.83       95.65
                    . |        454        4.35      100.00
----------------------+-----------------------------------
                Total |     10,437      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |      3,464       32.46       32.46
March 2020-March 2021 |      3,321       31.12       63.58
March 2021-March 2022 |      3,406       31.92       95.49
                    . |        481        4.51      100.00
----------------------+-----------------------------------
                Total |     10,672      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |      3,338       31.64       31.64
March 2020-March 2021 |      3,380       32.03       63.67
March 2021-March 2022 |      3,378       32.02       95.69
                    . |        455        4.31      100.00
----------------------+-----------------------------------
                Total |     10,551      100.00


. 
. *Define appointments and referrals======================================*/
. **Nb. not excluding those without 6m+ follow-up
. 
. **Rheumatology appt 
. tab rheum_appt  //proportion with first rheum outpatient date in the year before EIA code appears in GP record (could change to two years)

 rheum_appt |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,947       16.92       16.92
          1 |     29,200       83.08      100.00
------------+-----------------------------------
      Total |     35,147      100.00

. tab rheum_appt if rheum_appt_date<eia_code_date & rheum_appt_date!=. //confirm proportion who had rheum appt (i.e. not missing) and appt before EIA code (should be accounted for by Python code)

 rheum_appt |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     23,664      100.00      100.00
------------+-----------------------------------
      Total |     23,664      100.00

. 
. **Rheumatology referrals
. tab referral_rheum_prerheum //last rheum referral in the year before rheumatology outpatient (requires rheum appt to have been present, and rheum appt to be before EIA code)

referral_rh |
eum_prerheu |
          m |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,544       10.08       10.08
          1 |     31,603       89.92      100.00
------------+-----------------------------------
      Total |     35,147      100.00

. tab referral_rheum_prerheum if rheum_appt!=0  //last rheum referral in the year before rheumatology outpatient if rheum appt date present

referral_rh |
eum_prerheu |
          m |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,952       10.11       10.11
          1 |     26,248       89.89      100.00
------------+-----------------------------------
      Total |     29,200      100.00

. tab referral_rheum_prerheum if rheum_appt!=0 & referral_rheum_prerheum_date<rheum_appt_date  //last rheum referral in the year before rheumatology outpatient, assuming ref date before rheum appt date (should be accounted 
> for by Python code)

referral_rh |
eum_prerheu |
          m |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      8,498      100.00      100.00
------------+-----------------------------------
      Total |      8,498      100.00

. tab referral_rheum_precode //last rheum referral in the year before EIA code (could use if rheum appt missing)

referral_rh |
eum_precode |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,502        9.96        9.96
          1 |     31,645       90.04      100.00
------------+-----------------------------------
      Total |     35,147      100.00

. gen referral_rheum_comb_date = referral_rheum_prerheum_date if referral_rheum_prerheum_date!=.
(3,544 missing values generated)

. replace referral_rheum_comb_date = referral_rheum_precode_date if referral_rheum_prerheum_date==. & referral_rheum_precode_date!=.
(3,196 real changes made)

. format %td referral_rheum_comb_date

. codebook referral_rheum_comb_date

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
referral_rheum_comb_date                                                                                                                                                                                            (unlabeled)
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

                  Type: Numeric daily date (float)

                 Range: [21260,22756]                 Units: 1
       Or equivalently: [17mar2018,21apr2022]         Units: days
         Unique values: 1,497                     Missing .: 348/35,147

                  Mean: 22009.9 = 04apr2020(+ 21 hours)
             Std. dev.: 432.044
           Percentiles:       10%        25%        50%        75%        90%
                            21410      21636      22014      22383      22605
                        14aug2018  28mar2019  09apr2020  13apr2021  21nov2021

. 
. **GP appointments
. tab last_gp_refrheum //proportion with last GP appointment in year before rheum referral (pre-rheum appt); requires there to have been a rheum referral, before a rheum appt, before an EIA code

last_gp_ref |
      rheum |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,515       10.00       10.00
          1 |     31,632       90.00      100.00
------------+-----------------------------------
      Total |     35,147      100.00

. gen all_appts=1 if last_gp_refrheum==1 & referral_rheum_prerheum==1 & rheum_appt==1 & eia_code==1 & last_gp_refrheum_date<referral_rheum_prerheum_date & referral_rheum_prerheum_date<rheum_appt_date & rheum_appt_date<eia_c
> ode_date 
(34,200 missing values generated)

. recode all_appts .=0
(34200 changes made to all_appts)

. tab all_appts, missing //KEY - proportion who had a last gp appt, then rheum ref, then rheum appt, then EIA code 

  all_appts |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     34,200       97.31       97.31
          1 |        947        2.69      100.00
------------+-----------------------------------
      Total |     35,147      100.00

. tab last_gp_refcode //last GP appointment before rheum ref (i.e. pre-eia code ref); requires there to have been a rheum referral before an EIA code (i.e. rheum appt could have been missing)

last_gp_ref |
       code |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,538       10.07       10.07
          1 |     31,609       89.93      100.00
------------+-----------------------------------
      Total |     35,147      100.00

. tab last_gp_prerheum //last GP appointment before rheum appt; requires there to have been a rheum appt before and EIA code

last_gp_pre |
      rheum |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,565       10.14       10.14
          1 |     31,582       89.86      100.00
------------+-----------------------------------
      Total |     35,147      100.00

. tab last_gp_precode //last GP appointment before EIA code

last_gp_pre |
       code |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,498        9.95        9.95
          1 |     31,649       90.05      100.00
------------+-----------------------------------
      Total |     35,147      100.00

. 
. **For sensitivity analyses for those without rheum_appt, replace diagnosis date as EIA code date if rheum appt pre-code is missing or after
. gen eia_diagnosis_date_nomiss=rheum_appt_date if rheum_appt_date!=.
(5,947 missing values generated)

. format %td eia_diagnosis_date_nomiss

. replace eia_diagnosis_date_nomiss=eia_code_date if (rheum_appt_date==. | rheum_appt_date>eia_code_date) & eia_code_date!=.
(11,462 real changes made)

. gen eia_diagnosis_nomiss=1 if eia_diagnosis_date_nomiss!=.

. recode eia_diagnosis_nomiss .=0
(0 changes made to eia_diagnosis_nomiss)

. tab eia_diagnosis_nomiss

eia_diagnos |
  is_nomiss |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     35,147      100.00      100.00
------------+-----------------------------------
      Total |     35,147      100.00

. 
. *Time to referral, appointment and EIA code=============================================*/
. 
. **Time from last GP to rheum ref before rheum appt (i.e. if appts are present and in correct time order) //Note - referral could (in theory) be coded just before GP appt
. gen time_gp_rheum_ref_appt = (referral_rheum_prerheum_date - last_gp_refrheum_date) if referral_rheum_prerheum_date!=. & last_gp_refrheum_date!=. & rheum_appt_date!=. & referral_rheum_prerheum_date>last_gp_refrheum_date &
>  referral_rheum_prerheum_date<rheum_appt_date & rheum_appt_date<eia_code_date
(34,200 missing values generated)

. tabstat time_gp_rheum_ref_appt, stats (n mean p50 p25 p75) //all patients (should be same number as all_appts)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~t |       947  245.0813       179        86       345
----------------------------------------------------------------

. bys eia_diagnosis: tabstat time_gp_rheum_ref_appt, stats (n mean p50 p25 p75) //by eia diagnosis

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~t |       328  239.8689     179.5        90     329.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~t |       310  237.6516       159        78       361
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~t |       309   258.068       205        96       339
----------------------------------------------------------------

. bys diagnosis_year: tabstat time_gp_rheum_ref_appt, stats (n mean p50 p25 p75) //by diagnosis year

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~t |       116  149.8879       117      59.5       220
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~t |       275  204.9855       150        68       305
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~t |       482  271.8195       205       100       393
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~t |        74  369.1486     281.5       129       606
----------------------------------------------------------------

. bys nuts_region: tabstat time_gp_rheum_ref_appt, stats (n mean p50 p25 p75) //by region

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~t |        96  240.6146       188        83     320.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~t |        87  271.4138       189       131       383
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~t |       179  259.1788       199        99       377
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~t |       100    202.13       159      62.5     272.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~t |        90  254.7111       181        77       338
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~t |       223  235.5291       161        70       329
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~t |        78  249.2051     175.5        97       359
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~t |        94  254.1383     212.5        91       327
----------------------------------------------------------------

. 
. gen gp_ref_cat=1 if time_gp_rheum_ref_appt<=3 & time_gp_rheum_ref_appt!=. 
(35,143 missing values generated)

. replace gp_ref_cat=2 if time_gp_rheum_ref_appt<=7 & time_gp_rheum_ref_appt!=. & gp_ref_cat==.
(18 real changes made)

. replace gp_ref_cat=3 if time_gp_rheum_ref_appt>7 & time_gp_rheum_ref_appt!=. & gp_ref_cat==.
(925 real changes made)

. lab define gp_ref_cat 1 "Referred within 3 days" 2 "Referred within 7 days" 3 "Referral delay >7 days", modify

. lab val gp_ref_cat gp_ref_cat

. lab var gp_ref_cat "Time to GP referral"

. tab gp_ref_cat, missing

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          4        0.01        0.01
Referred within 7 days |         18        0.05        0.06
Referral delay >7 days |        925        2.63        2.69
                     . |     34,200       97.31      100.00
-----------------------+-----------------------------------
                 Total |     35,147      100.00

. tab gp_ref_cat

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          4        0.42        0.42
Referred within 7 days |         18        1.90        2.32
Referral delay >7 days |        925       97.68      100.00
-----------------------+-----------------------------------
                 Total |        947      100.00

. bys eia_diagnosis: tab gp_ref_cat, missing

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          2        0.02        0.02
Referred within 7 days |          7        0.06        0.08
Referral delay >7 days |        319        2.76        2.84
                     . |     11,232       97.16      100.00
-----------------------+-----------------------------------
                 Total |     11,560      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 7 days |          6        0.05        0.05
Referral delay >7 days |        304        2.57        2.62
                     . |     11,512       97.38      100.00
-----------------------+-----------------------------------
                 Total |     11,822      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          2        0.02        0.02
Referred within 7 days |          5        0.04        0.06
Referral delay >7 days |        302        2.57        2.63
                     . |     11,456       97.37      100.00
-----------------------+-----------------------------------
                 Total |     11,765      100.00


. bys eia_diagnosis: tab gp_ref_cat

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          2        0.61        0.61
Referred within 7 days |          7        2.13        2.74
Referral delay >7 days |        319       97.26      100.00
-----------------------+-----------------------------------
                 Total |        328      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 7 days |          6        1.94        1.94
Referral delay >7 days |        304       98.06      100.00
-----------------------+-----------------------------------
                 Total |        310      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          2        0.65        0.65
Referred within 7 days |          5        1.62        2.27
Referral delay >7 days |        302       97.73      100.00
-----------------------+-----------------------------------
                 Total |        309      100.00


. bys diagnosis_year: tab gp_ref_cat, missing

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        0.01        0.01
Referred within 7 days |          3        0.03        0.04
Referral delay >7 days |        112        0.99        1.02
                     . |     11,214       98.98      100.00
-----------------------+-----------------------------------
                 Total |     11,330      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        0.01        0.01
Referred within 7 days |          8        0.07        0.08
Referral delay >7 days |        266        2.41        2.49
                     . |     10,748       97.51      100.00
-----------------------+-----------------------------------
                 Total |     11,023      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          2        0.02        0.02
Referred within 7 days |          4        0.04        0.05
Referral delay >7 days |        476        4.23        4.28
                     . |     10,778       95.72      100.00
-----------------------+-----------------------------------
                 Total |     11,260      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 7 days |          3        0.20        0.20
Referral delay >7 days |         71        4.63        4.82
                     . |      1,460       95.18      100.00
-----------------------+-----------------------------------
                 Total |      1,534      100.00


. bys diagnosis_year: tab gp_ref_cat

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        0.86        0.86
Referred within 7 days |          3        2.59        3.45
Referral delay >7 days |        112       96.55      100.00
-----------------------+-----------------------------------
                 Total |        116      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        0.36        0.36
Referred within 7 days |          8        2.91        3.27
Referral delay >7 days |        266       96.73      100.00
-----------------------+-----------------------------------
                 Total |        275      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          2        0.41        0.41
Referred within 7 days |          4        0.83        1.24
Referral delay >7 days |        476       98.76      100.00
-----------------------+-----------------------------------
                 Total |        482      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 7 days |          3        4.05        4.05
Referral delay >7 days |         71       95.95      100.00
-----------------------+-----------------------------------
                 Total |         74      100.00


. bys nuts_region: tab gp_ref_cat, missing

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 7 days |          1        0.03        0.03
Referral delay >7 days |         95        2.70        2.73
                     . |      3,422       97.27      100.00
-----------------------+-----------------------------------
                 Total |      3,518      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          2        0.06        0.06
Referral delay >7 days |         85        2.42        2.48
                     . |      3,427       97.52      100.00
-----------------------+-----------------------------------
                 Total |      3,514      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        0.01        0.01
Referred within 7 days |          2        0.03        0.04
Referral delay >7 days |        176        2.53        2.57
                     . |      6,775       97.43      100.00
-----------------------+-----------------------------------
                 Total |      6,954      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 7 days |          3        0.08        0.08
Referral delay >7 days |         97        2.71        2.80
                     . |      3,477       97.20      100.00
-----------------------+-----------------------------------
                 Total |      3,577      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 7 days |          2        0.06        0.06
Referral delay >7 days |         88        2.55        2.61
                     . |      3,361       97.39      100.00
-----------------------+-----------------------------------
                 Total |      3,451      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 7 days |          6        0.08        0.08
Referral delay >7 days |        217        3.05        3.13
                     . |      6,895       96.87      100.00
-----------------------+-----------------------------------
                 Total |      7,118      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        0.03        0.03
Referred within 7 days |          2        0.06        0.09
Referral delay >7 days |         75        2.18        2.27
                     . |      3,363       97.73      100.00
-----------------------+-----------------------------------
                 Total |      3,441      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 7 days |          2        0.06        0.06
Referral delay >7 days |         92        2.57        2.63
                     . |      3,480       97.37      100.00
-----------------------+-----------------------------------
                 Total |      3,574      100.00


. bys nuts_region: tab gp_ref_cat

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 7 days |          1        1.04        1.04
Referral delay >7 days |         95       98.96      100.00
-----------------------+-----------------------------------
                 Total |         96      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          2        2.30        2.30
Referral delay >7 days |         85       97.70      100.00
-----------------------+-----------------------------------
                 Total |         87      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        0.56        0.56
Referred within 7 days |          2        1.12        1.68
Referral delay >7 days |        176       98.32      100.00
-----------------------+-----------------------------------
                 Total |        179      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 7 days |          3        3.00        3.00
Referral delay >7 days |         97       97.00      100.00
-----------------------+-----------------------------------
                 Total |        100      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 7 days |          2        2.22        2.22
Referral delay >7 days |         88       97.78      100.00
-----------------------+-----------------------------------
                 Total |         90      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 7 days |          6        2.69        2.69
Referral delay >7 days |        217       97.31      100.00
-----------------------+-----------------------------------
                 Total |        223      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        1.28        1.28
Referred within 7 days |          2        2.56        3.85
Referral delay >7 days |         75       96.15      100.00
-----------------------+-----------------------------------
                 Total |         78      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 7 days |          2        2.13        2.13
Referral delay >7 days |         92       97.87      100.00
-----------------------+-----------------------------------
                 Total |         94      100.00


. 
. gen gp_ref_3d=1 if time_gp_rheum_ref_appt<=3 & time_gp_rheum_ref_appt!=. 
(35,143 missing values generated)

. replace gp_ref_3d=2 if time_gp_rheum_ref_appt>3 & time_gp_rheum_ref_appt!=.
(943 real changes made)

. lab define gp_ref_3d 1 "Referred within 3 days" 2 "Referral delay >3 days", modify

. lab val gp_ref_3d gp_ref_3d

. lab var gp_ref_3d "Time to GP referral"

. tab gp_ref_3d, missing

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          4        0.01        0.01
Referral delay >3 days |        943        2.68        2.69
                     . |     34,200       97.31      100.00
-----------------------+-----------------------------------
                 Total |     35,147      100.00

. tab gp_ref_3d

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          4        0.42        0.42
Referral delay >3 days |        943       99.58      100.00
-----------------------+-----------------------------------
                 Total |        947      100.00

. bys eia_diagnosis: tab gp_ref_3d, missing

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          2        0.02        0.02
Referral delay >3 days |        326        2.82        2.84
                     . |     11,232       97.16      100.00
-----------------------+-----------------------------------
                 Total |     11,560      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referral delay >3 days |        310        2.62        2.62
                     . |     11,512       97.38      100.00
-----------------------+-----------------------------------
                 Total |     11,822      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          2        0.02        0.02
Referral delay >3 days |        307        2.61        2.63
                     . |     11,456       97.37      100.00
-----------------------+-----------------------------------
                 Total |     11,765      100.00


. bys eia_diagnosis: tab gp_ref_3d

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          2        0.61        0.61
Referral delay >3 days |        326       99.39      100.00
-----------------------+-----------------------------------
                 Total |        328      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referral delay >3 days |        310      100.00      100.00
-----------------------+-----------------------------------
                 Total |        310      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          2        0.65        0.65
Referral delay >3 days |        307       99.35      100.00
-----------------------+-----------------------------------
                 Total |        309      100.00


. bys diagnosis_year: tab gp_ref_3d, missing

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        0.01        0.01
Referral delay >3 days |        115        1.02        1.02
                     . |     11,214       98.98      100.00
-----------------------+-----------------------------------
                 Total |     11,330      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        0.01        0.01
Referral delay >3 days |        274        2.49        2.49
                     . |     10,748       97.51      100.00
-----------------------+-----------------------------------
                 Total |     11,023      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          2        0.02        0.02
Referral delay >3 days |        480        4.26        4.28
                     . |     10,778       95.72      100.00
-----------------------+-----------------------------------
                 Total |     11,260      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referral delay >3 days |         74        4.82        4.82
                     . |      1,460       95.18      100.00
-----------------------+-----------------------------------
                 Total |      1,534      100.00


. bys diagnosis_year: tab gp_ref_3d

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        0.86        0.86
Referral delay >3 days |        115       99.14      100.00
-----------------------+-----------------------------------
                 Total |        116      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        0.36        0.36
Referral delay >3 days |        274       99.64      100.00
-----------------------+-----------------------------------
                 Total |        275      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          2        0.41        0.41
Referral delay >3 days |        480       99.59      100.00
-----------------------+-----------------------------------
                 Total |        482      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referral delay >3 days |         74      100.00      100.00
-----------------------+-----------------------------------
                 Total |         74      100.00


. bys nuts_region: tab gp_ref_3d, missing

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referral delay >3 days |         96        2.73        2.73
                     . |      3,422       97.27      100.00
-----------------------+-----------------------------------
                 Total |      3,518      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          2        0.06        0.06
Referral delay >3 days |         85        2.42        2.48
                     . |      3,427       97.52      100.00
-----------------------+-----------------------------------
                 Total |      3,514      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        0.01        0.01
Referral delay >3 days |        178        2.56        2.57
                     . |      6,775       97.43      100.00
-----------------------+-----------------------------------
                 Total |      6,954      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referral delay >3 days |        100        2.80        2.80
                     . |      3,477       97.20      100.00
-----------------------+-----------------------------------
                 Total |      3,577      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referral delay >3 days |         90        2.61        2.61
                     . |      3,361       97.39      100.00
-----------------------+-----------------------------------
                 Total |      3,451      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referral delay >3 days |        223        3.13        3.13
                     . |      6,895       96.87      100.00
-----------------------+-----------------------------------
                 Total |      7,118      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        0.03        0.03
Referral delay >3 days |         77        2.24        2.27
                     . |      3,363       97.73      100.00
-----------------------+-----------------------------------
                 Total |      3,441      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referral delay >3 days |         94        2.63        2.63
                     . |      3,480       97.37      100.00
-----------------------+-----------------------------------
                 Total |      3,574      100.00


. bys nuts_region: tab gp_ref_3d

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referral delay >3 days |         96      100.00      100.00
-----------------------+-----------------------------------
                 Total |         96      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          2        2.30        2.30
Referral delay >3 days |         85       97.70      100.00
-----------------------+-----------------------------------
                 Total |         87      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        0.56        0.56
Referral delay >3 days |        178       99.44      100.00
-----------------------+-----------------------------------
                 Total |        179      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referral delay >3 days |        100      100.00      100.00
-----------------------+-----------------------------------
                 Total |        100      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referral delay >3 days |         90      100.00      100.00
-----------------------+-----------------------------------
                 Total |         90      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referral delay >3 days |        223      100.00      100.00
-----------------------+-----------------------------------
                 Total |        223      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        1.28        1.28
Referral delay >3 days |         77       98.72      100.00
-----------------------+-----------------------------------
                 Total |         78      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referral delay >3 days |         94      100.00      100.00
-----------------------+-----------------------------------
                 Total |         94      100.00


. 
. **Time from last GP to rheum ref before eia code (sensitivity analysis; includes those with no rheum appt)
. gen time_gp_rheum_ref_code = (referral_rheum_precode_date - last_gp_refcode_date) if referral_rheum_precode_date!=. & last_gp_refcode_date!=. & referral_rheum_precode_date>last_gp_refcode_date & referral_rheum_precode_dat
> e<eia_code_date
(29,103 missing values generated)

. tabstat time_gp_rheum_ref_code, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~e |      6044  375.5177       312       143       556
----------------------------------------------------------------

. bys eia_diagnosis: tabstat time_gp_rheum_ref_code, stats (n mean p50 p25 p75)

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~e |      1987  378.4258       321       147       567
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~e |      2066  376.8025       314       140       551
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~e |      1991  371.2823       300       142       552
----------------------------------------------------------------

. 
. **Time from last GP to rheum ref (combined - sensitivity analysis; includes those with no rheum appt)
. gen time_gp_rheum_ref_comb = time_gp_rheum_ref_appt 
(34,200 missing values generated)

. replace time_gp_rheum_ref_comb = time_gp_rheum_ref_code if time_gp_rheum_ref_appt==. & time_gp_rheum_ref_code!=.
(5,818 real changes made)

. tabstat time_gp_rheum_ref_comb, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~b |      6765  355.9833       287       129       524
----------------------------------------------------------------

. bys eia_diagnosis: tabstat time_gp_rheum_ref_comb, stats (n mean p50 p25 p75)

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~b |      2237  355.1712       288       132       526
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~b |      2304  358.2083       295       127     522.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~b |      2224  354.4951       281       128       522
----------------------------------------------------------------

. 
. **Time from last GP pre-rheum appt to first rheum appt (key sensitivity analysis; includes those with no rheum ref)
. gen time_gp_rheum_appt = (rheum_appt_date - last_gp_prerheum_date) if rheum_appt_date!=. & last_gp_prerheum_date!=. & rheum_appt_date>last_gp_prerheum_date & rheum_appt_date<eia_code_date
(29,837 missing values generated)

. tabstat time_gp_rheum_appt, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_~m_appt |      5310  291.0759       229       103       419
----------------------------------------------------------------

. bys eia_diagnosis: tabstat time_gp_rheum_appt, stats (n mean p50 p25 p75)

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_~m_appt |      1712  291.0754     221.5       101     418.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_~m_appt |      1773  293.0739       232       108       430
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_~m_appt |      1825  289.1353       231       104       406
----------------------------------------------------------------

. bys diagnosis_year: tabstat time_gp_rheum_appt, stats (n mean p50 p25 p75) //by diagnosis year

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_~m_appt |       887  176.4814       150        66       261
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_~m_appt |      1668  274.3831     229.5     109.5       405
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_~m_appt |      2401  330.9921       263       120       484
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_~m_appt |       354  386.1328       319       151       571
----------------------------------------------------------------

. bys nuts_region: tabstat time_gp_rheum_appt, stats (n mean p50 p25 p75) //by region

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_~m_appt |       548  294.6332     241.5       101     429.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_~m_appt |       522  299.2529       227       101       434
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_~m_appt |      1052  303.4097     246.5       115       429
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_~m_appt |       533  283.6717       215       103       417
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_~m_appt |       506  286.9565       236       114       392
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_~m_appt |      1115  283.5964       226        99       401
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_~m_appt |       491  284.8982       215        98       426
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_~m_appt |       543  287.7808       224        98       425
----------------------------------------------------------------

. 
. **Time from last GP pre-code to EIA code (sensitivity analysis; includes those with no rheum ref and/or no rheum appt)
. gen time_gp_eia_code = (eia_code_date - last_gp_precode_date) if eia_code_date!=. & last_gp_precode_date!=. & eia_code_date>last_gp_precode_date
(15,521 missing values generated)

. tabstat time_gp_eia_code, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_ei~e |     19626  520.9663       474       235       764
----------------------------------------------------------------

. bys eia_diagnosis: tabstat time_gp_eia_code, stats (n mean p50 p25 p75)

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_ei~e |      6430  519.7858       472       236       766
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_ei~e |      6644  521.6522       475       235       758
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_ei~e |      6552  521.4292       474       234     765.5
----------------------------------------------------------------

. 
. **Time from last GP to EIA diagnosis (combined - sensitivity analysis; includes those with no rheum appt)
. gen time_gp_eia_diag = time_gp_rheum_appt
(29,837 missing values generated)

. replace time_gp_eia_diag = time_gp_eia_code if time_gp_rheum_appt==. & time_gp_eia_code!=.
(16,204 real changes made)

. tabstat time_gp_eia_diag, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_ei~g |     21514   456.256       388       181       672
----------------------------------------------------------------

. bys eia_diagnosis: tabstat time_gp_eia_diag, stats (n mean p50 p25 p75)

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_ei~g |      7026  455.6537       386       177       672
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_ei~g |      7285  458.4154       395       184       674
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_ei~g |      7203  454.6594       381       181       669
----------------------------------------------------------------

. 
. **Time from rheum ref to rheum appt (i.e. if appts are present and in correct time order)
. gen time_ref_rheum_appt = (rheum_appt_date - referral_rheum_prerheum_date) if rheum_appt_date!=. & referral_rheum_prerheum_date!=. & referral_rheum_prerheum_date<rheum_appt_date & rheum_appt_date<eia_code_date
(29,792 missing values generated)

. tabstat time_ref_rheum_appt, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~t |      5355  286.5664       227       102       411
----------------------------------------------------------------

. bys eia_diagnosis: tabstat time_ref_rheum_appt, stats (n mean p50 p25 p75)

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~t |      1807  282.5744       219       103       406
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~t |      1756   291.967     240.5       104       411
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~t |      1792  285.2997       222       100       413
----------------------------------------------------------------

. bys diagnosis_year: tabstat time_ref_rheum_appt, stats (n mean p50 p25 p75) //all patients by diagnosis year

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~t |       851  181.4195       155        71       271
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~t |      1701  259.3604       223        96       380
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~t |      2426   330.824     257.5       118       486
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~t |       377  361.8674       279       116       526
----------------------------------------------------------------

. bys nuts_region: tabstat time_ref_rheum_appt, stats (n mean p50 p25 p75) //by region

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~t |       564   292.266       234     102.5     404.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~t |       537  309.9181       230       105       466
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~t |      1042  278.8004     226.5       105       395
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~t |       552  260.1902       196        92       377
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~t |       503  300.7177       248       101       433
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~t |      1083  287.0683       230       101       412
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~t |       516  288.4593     231.5        92       426
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~t |       558  283.4462     215.5       108       402
----------------------------------------------------------------

. 
. gen ref_appt_cat=1 if time_ref_rheum_appt<=21 & time_ref_rheum_appt!=. 
(34,862 missing values generated)

. replace ref_appt_cat=2 if time_ref_rheum_appt<=42 & time_ref_rheum_appt!=. & ref_appt_cat==.
(297 real changes made)

. replace ref_appt_cat=3 if time_ref_rheum_appt>42 & time_ref_rheum_appt!=. & ref_appt_cat==.
(4,773 real changes made)

. lab define ref_appt_cat 1 "Seen within 3 weeks" 2 "Seen within 6 weeks" 3 "Assessment delay >6 weeks", modify

. lab val ref_appt_cat ref_appt_cat

. lab var ref_appt_cat "Time to rheumatology assessment"

. tab ref_appt_cat, missing

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |        285        0.81        0.81
      Seen within 6 weeks |        297        0.85        1.66
Assessment delay >6 weeks |      4,773       13.58       15.24
                        . |     29,792       84.76      100.00
--------------------------+-----------------------------------
                    Total |     35,147      100.00

. tab ref_appt_cat

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |        285        5.32        5.32
      Seen within 6 weeks |        297        5.55       10.87
Assessment delay >6 weeks |      4,773       89.13      100.00
--------------------------+-----------------------------------
                    Total |      5,355      100.00

. bys eia_diagnosis: tab ref_appt_cat, missing

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         86        0.74        0.74
      Seen within 6 weeks |        101        0.87        1.62
Assessment delay >6 weeks |      1,620       14.01       15.63
                        . |      9,753       84.37      100.00
--------------------------+-----------------------------------
                    Total |     11,560      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         90        0.76        0.76
      Seen within 6 weeks |        101        0.85        1.62
Assessment delay >6 weeks |      1,565       13.24       14.85
                        . |     10,066       85.15      100.00
--------------------------+-----------------------------------
                    Total |     11,822      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |        109        0.93        0.93
      Seen within 6 weeks |         95        0.81        1.73
Assessment delay >6 weeks |      1,588       13.50       15.23
                        . |      9,973       84.77      100.00
--------------------------+-----------------------------------
                    Total |     11,765      100.00


. bys eia_diagnosis: tab ref_appt_cat

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         86        4.76        4.76
      Seen within 6 weeks |        101        5.59       10.35
Assessment delay >6 weeks |      1,620       89.65      100.00
--------------------------+-----------------------------------
                    Total |      1,807      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         90        5.13        5.13
      Seen within 6 weeks |        101        5.75       10.88
Assessment delay >6 weeks |      1,565       89.12      100.00
--------------------------+-----------------------------------
                    Total |      1,756      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |        109        6.08        6.08
      Seen within 6 weeks |         95        5.30       11.38
Assessment delay >6 weeks |      1,588       88.62      100.00
--------------------------+-----------------------------------
                    Total |      1,792      100.00


. bys diagnosis_year: tab ref_appt_cat, missing

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         65        0.57        0.57
      Seen within 6 weeks |         67        0.59        1.17
Assessment delay >6 weeks |        719        6.35        7.51
                        . |     10,479       92.49      100.00
--------------------------+-----------------------------------
                    Total |     11,330      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         95        0.86        0.86
      Seen within 6 weeks |         89        0.81        1.67
Assessment delay >6 weeks |      1,517       13.76       15.43
                        . |      9,322       84.57      100.00
--------------------------+-----------------------------------
                    Total |     11,023      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |        106        0.94        0.94
      Seen within 6 weeks |        127        1.13        2.07
Assessment delay >6 weeks |      2,193       19.48       21.55
                        . |      8,834       78.45      100.00
--------------------------+-----------------------------------
                    Total |     11,260      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         19        1.24        1.24
      Seen within 6 weeks |         14        0.91        2.15
Assessment delay >6 weeks |        344       22.43       24.58
                        . |      1,157       75.42      100.00
--------------------------+-----------------------------------
                    Total |      1,534      100.00


. bys diagnosis_year: tab ref_appt_cat

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         65        7.64        7.64
      Seen within 6 weeks |         67        7.87       15.51
Assessment delay >6 weeks |        719       84.49      100.00
--------------------------+-----------------------------------
                    Total |        851      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         95        5.58        5.58
      Seen within 6 weeks |         89        5.23       10.82
Assessment delay >6 weeks |      1,517       89.18      100.00
--------------------------+-----------------------------------
                    Total |      1,701      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |        106        4.37        4.37
      Seen within 6 weeks |        127        5.23        9.60
Assessment delay >6 weeks |      2,193       90.40      100.00
--------------------------+-----------------------------------
                    Total |      2,426      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         19        5.04        5.04
      Seen within 6 weeks |         14        3.71        8.75
Assessment delay >6 weeks |        344       91.25      100.00
--------------------------+-----------------------------------
                    Total |        377      100.00


. bys nuts_region: tab ref_appt_cat, missing

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         32        0.91        0.91
      Seen within 6 weeks |         27        0.77        1.68
Assessment delay >6 weeks |        505       14.35       16.03
                        . |      2,954       83.97      100.00
--------------------------+-----------------------------------
                    Total |      3,518      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         28        0.80        0.80
      Seen within 6 weeks |         27        0.77        1.57
Assessment delay >6 weeks |        482       13.72       15.28
                        . |      2,977       84.72      100.00
--------------------------+-----------------------------------
                    Total |      3,514      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         55        0.79        0.79
      Seen within 6 weeks |         59        0.85        1.64
Assessment delay >6 weeks |        928       13.34       14.98
                        . |      5,912       85.02      100.00
--------------------------+-----------------------------------
                    Total |      6,954      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         27        0.75        0.75
      Seen within 6 weeks |         34        0.95        1.71
Assessment delay >6 weeks |        491       13.73       15.43
                        . |      3,025       84.57      100.00
--------------------------+-----------------------------------
                    Total |      3,577      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         24        0.70        0.70
      Seen within 6 weeks |         29        0.84        1.54
Assessment delay >6 weeks |        450       13.04       14.58
                        . |      2,948       85.42      100.00
--------------------------+-----------------------------------
                    Total |      3,451      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         55        0.77        0.77
      Seen within 6 weeks |         62        0.87        1.64
Assessment delay >6 weeks |        966       13.57       15.21
                        . |      6,035       84.79      100.00
--------------------------+-----------------------------------
                    Total |      7,118      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         28        0.81        0.81
      Seen within 6 weeks |         36        1.05        1.86
Assessment delay >6 weeks |        452       13.14       15.00
                        . |      2,925       85.00      100.00
--------------------------+-----------------------------------
                    Total |      3,441      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         36        1.01        1.01
      Seen within 6 weeks |         23        0.64        1.65
Assessment delay >6 weeks |        499       13.96       15.61
                        . |      3,016       84.39      100.00
--------------------------+-----------------------------------
                    Total |      3,574      100.00


. bys nuts_region: tab ref_appt_cat

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         32        5.67        5.67
      Seen within 6 weeks |         27        4.79       10.46
Assessment delay >6 weeks |        505       89.54      100.00
--------------------------+-----------------------------------
                    Total |        564      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         28        5.21        5.21
      Seen within 6 weeks |         27        5.03       10.24
Assessment delay >6 weeks |        482       89.76      100.00
--------------------------+-----------------------------------
                    Total |        537      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         55        5.28        5.28
      Seen within 6 weeks |         59        5.66       10.94
Assessment delay >6 weeks |        928       89.06      100.00
--------------------------+-----------------------------------
                    Total |      1,042      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         27        4.89        4.89
      Seen within 6 weeks |         34        6.16       11.05
Assessment delay >6 weeks |        491       88.95      100.00
--------------------------+-----------------------------------
                    Total |        552      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         24        4.77        4.77
      Seen within 6 weeks |         29        5.77       10.54
Assessment delay >6 weeks |        450       89.46      100.00
--------------------------+-----------------------------------
                    Total |        503      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         55        5.08        5.08
      Seen within 6 weeks |         62        5.72       10.80
Assessment delay >6 weeks |        966       89.20      100.00
--------------------------+-----------------------------------
                    Total |      1,083      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         28        5.43        5.43
      Seen within 6 weeks |         36        6.98       12.40
Assessment delay >6 weeks |        452       87.60      100.00
--------------------------+-----------------------------------
                    Total |        516      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         36        6.45        6.45
      Seen within 6 weeks |         23        4.12       10.57
Assessment delay >6 weeks |        499       89.43      100.00
--------------------------+-----------------------------------
                    Total |        558      100.00


. 
. gen ref_appt_3w=1 if time_ref_rheum_appt<=21 & time_ref_rheum_appt!=. 
(34,862 missing values generated)

. replace ref_appt_3w=2 if time_ref_rheum_appt>21 & time_ref_rheum_appt!=.
(5,070 real changes made)

. lab define ref_appt_3w 1 "Seen within 3 weeks" 2 "Assessment delay >3 weeks", modify

. lab val ref_appt_3w ref_appt_3w

. lab var ref_appt_3w "Time to rheumatology assessment"

. tab ref_appt_3w, missing

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |        285        0.81        0.81
Assessment delay >3 weeks |      5,070       14.43       15.24
                        . |     29,792       84.76      100.00
--------------------------+-----------------------------------
                    Total |     35,147      100.00

. tab ref_appt_3w

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |        285        5.32        5.32
Assessment delay >3 weeks |      5,070       94.68      100.00
--------------------------+-----------------------------------
                    Total |      5,355      100.00

. bys eia_diagnosis: tab ref_appt_3w, missing

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         86        0.74        0.74
Assessment delay >3 weeks |      1,721       14.89       15.63
                        . |      9,753       84.37      100.00
--------------------------+-----------------------------------
                    Total |     11,560      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         90        0.76        0.76
Assessment delay >3 weeks |      1,666       14.09       14.85
                        . |     10,066       85.15      100.00
--------------------------+-----------------------------------
                    Total |     11,822      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |        109        0.93        0.93
Assessment delay >3 weeks |      1,683       14.31       15.23
                        . |      9,973       84.77      100.00
--------------------------+-----------------------------------
                    Total |     11,765      100.00


. bys eia_diagnosis: tab ref_appt_3w

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         86        4.76        4.76
Assessment delay >3 weeks |      1,721       95.24      100.00
--------------------------+-----------------------------------
                    Total |      1,807      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         90        5.13        5.13
Assessment delay >3 weeks |      1,666       94.87      100.00
--------------------------+-----------------------------------
                    Total |      1,756      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |        109        6.08        6.08
Assessment delay >3 weeks |      1,683       93.92      100.00
--------------------------+-----------------------------------
                    Total |      1,792      100.00


. bys diagnosis_year: tab ref_appt_3w, missing

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         65        0.57        0.57
Assessment delay >3 weeks |        786        6.94        7.51
                        . |     10,479       92.49      100.00
--------------------------+-----------------------------------
                    Total |     11,330      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         95        0.86        0.86
Assessment delay >3 weeks |      1,606       14.57       15.43
                        . |      9,322       84.57      100.00
--------------------------+-----------------------------------
                    Total |     11,023      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |        106        0.94        0.94
Assessment delay >3 weeks |      2,320       20.60       21.55
                        . |      8,834       78.45      100.00
--------------------------+-----------------------------------
                    Total |     11,260      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         19        1.24        1.24
Assessment delay >3 weeks |        358       23.34       24.58
                        . |      1,157       75.42      100.00
--------------------------+-----------------------------------
                    Total |      1,534      100.00


. bys diagnosis_year: tab ref_appt_3w

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         65        7.64        7.64
Assessment delay >3 weeks |        786       92.36      100.00
--------------------------+-----------------------------------
                    Total |        851      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         95        5.58        5.58
Assessment delay >3 weeks |      1,606       94.42      100.00
--------------------------+-----------------------------------
                    Total |      1,701      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |        106        4.37        4.37
Assessment delay >3 weeks |      2,320       95.63      100.00
--------------------------+-----------------------------------
                    Total |      2,426      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         19        5.04        5.04
Assessment delay >3 weeks |        358       94.96      100.00
--------------------------+-----------------------------------
                    Total |        377      100.00


. bys nuts_region: tab ref_appt_3w, missing

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         32        0.91        0.91
Assessment delay >3 weeks |        532       15.12       16.03
                        . |      2,954       83.97      100.00
--------------------------+-----------------------------------
                    Total |      3,518      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         28        0.80        0.80
Assessment delay >3 weeks |        509       14.48       15.28
                        . |      2,977       84.72      100.00
--------------------------+-----------------------------------
                    Total |      3,514      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         55        0.79        0.79
Assessment delay >3 weeks |        987       14.19       14.98
                        . |      5,912       85.02      100.00
--------------------------+-----------------------------------
                    Total |      6,954      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         27        0.75        0.75
Assessment delay >3 weeks |        525       14.68       15.43
                        . |      3,025       84.57      100.00
--------------------------+-----------------------------------
                    Total |      3,577      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         24        0.70        0.70
Assessment delay >3 weeks |        479       13.88       14.58
                        . |      2,948       85.42      100.00
--------------------------+-----------------------------------
                    Total |      3,451      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         55        0.77        0.77
Assessment delay >3 weeks |      1,028       14.44       15.21
                        . |      6,035       84.79      100.00
--------------------------+-----------------------------------
                    Total |      7,118      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         28        0.81        0.81
Assessment delay >3 weeks |        488       14.18       15.00
                        . |      2,925       85.00      100.00
--------------------------+-----------------------------------
                    Total |      3,441      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         36        1.01        1.01
Assessment delay >3 weeks |        522       14.61       15.61
                        . |      3,016       84.39      100.00
--------------------------+-----------------------------------
                    Total |      3,574      100.00


. bys nuts_region: tab ref_appt_3w

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         32        5.67        5.67
Assessment delay >3 weeks |        532       94.33      100.00
--------------------------+-----------------------------------
                    Total |        564      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         28        5.21        5.21
Assessment delay >3 weeks |        509       94.79      100.00
--------------------------+-----------------------------------
                    Total |        537      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         55        5.28        5.28
Assessment delay >3 weeks |        987       94.72      100.00
--------------------------+-----------------------------------
                    Total |      1,042      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         27        4.89        4.89
Assessment delay >3 weeks |        525       95.11      100.00
--------------------------+-----------------------------------
                    Total |        552      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         24        4.77        4.77
Assessment delay >3 weeks |        479       95.23      100.00
--------------------------+-----------------------------------
                    Total |        503      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         55        5.08        5.08
Assessment delay >3 weeks |      1,028       94.92      100.00
--------------------------+-----------------------------------
                    Total |      1,083      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         28        5.43        5.43
Assessment delay >3 weeks |        488       94.57      100.00
--------------------------+-----------------------------------
                    Total |        516      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         36        6.45        6.45
Assessment delay >3 weeks |        522       93.55      100.00
--------------------------+-----------------------------------
                    Total |        558      100.00


. 
. **Time from rheum ref or last GP to rheum appt (combined - sensitivity analysis; includes those with no rheum ref)
. gen time_refgp_rheum_appt = time_ref_rheum_appt
(29,792 missing values generated)

. replace time_refgp_rheum_appt = time_gp_rheum_appt if time_ref_rheum_appt==. & time_gp_rheum_appt!=.
(3,482 real changes made)

. bys eia_diagnosis: tabstat time_refgp_rheum_appt, stats (n mean p50 p25 p75)

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_refgp~t |      2914  272.7289       211        97       389
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_refgp~t |      2934  278.4782       226       100       399
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_refgp~t |      2989  270.3436       211        95       382
----------------------------------------------------------------

. bys diagnosis_year: tabstat time_refgp_rheum_appt, stats (n mean p50 p25 p75) //all patients by diagnosis year

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_refgp~t |      1551  175.5435       149        65       264
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_refgp~t |      2833  258.0279       218       100       379
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_refgp~t |      3884  314.5283       243       111       461
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_refgp~t |       569  342.6274       269       122       511
----------------------------------------------------------------

. bys nuts_region: tabstat time_refgp_rheum_appt, stats (n mean p50 p25 p75) //by region

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_refgp~t |       937  277.4141       224        94       395
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_refgp~t |       862  294.2158       218       100       431
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_refgp~t |      1747  273.5238       219       104       381
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_refgp~t |       902  258.2284       196        91       373
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_refgp~t |       827   279.023       237       106       396
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_refgp~t |      1811  271.0464       217        94       389
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_refgp~t |       837  275.2939       215        92       407
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_refgp~t |       914  266.3972       204        98       377
----------------------------------------------------------------

. 
. **Time from rheum ref to EIA code (sensitivity analysis; includes those with no rheum appt)
. gen time_ref_rheum_eia = (eia_code_date - referral_rheum_precode_date) if eia_code_date!=. & referral_rheum_precode_date!=. & referral_rheum_precode_date<eia_code_date  
(15,791 missing values generated)

. tabstat time_ref_rheum_eia, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~a |     19356  522.6104       470       230       773
----------------------------------------------------------------

. bys eia_diagnosis: tabstat time_ref_rheum_eia, stats (n mean p50 p25 p75)

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~a |      6353  523.5163       470       234       771
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~a |      6497   519.939       466       230       764
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~a |      6506  524.3933     474.5       227       779
----------------------------------------------------------------

. 
. **Time from rheum ref to EIA diagnosis (combined - sensitivity analysis; includes those with no rheum appt)
. gen time_ref_rheum_eia_comb = time_ref_rheum_appt
(29,792 missing values generated)

. replace time_ref_rheum_eia_comb = time_ref_rheum_eia if time_ref_rheum_appt==. & time_ref_rheum_eia!=.
(15,969 real changes made)

. tabstat time_ref_rheum_eia_comb, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~b |     21324   456.054       384       178       677
----------------------------------------------------------------

. bys eia_diagnosis: tabstat time_ref_rheum_eia_comb, stats (n mean p50 p25 p75)

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~b |      6996  453.9275       379       177       674
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~b |      7138  455.7219       382       181       667
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~b |      7190  458.4529       391       177       689
----------------------------------------------------------------

. 
. **Time from rheum appt to EIA code (i.e. if appts are present and in correct time order)
. gen time_rheum_eia_code = (eia_code_date - rheum_appt_date) if eia_code_date!=. & rheum_appt_date!=. & rheum_appt_date<eia_code_date 
(11,483 missing values generated)

. tabstat time_rheum_eia_code, stats (n mean p50 p25 p75) 

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_rheum~e |     23664  605.1504       576       315       873
----------------------------------------------------------------

. bys eia_diagnosis: tabstat time_rheum_eia_code, stats (n mean p50 p25 p75) 

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_rheum~e |      7787  604.8066       572       316       874
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_rheum~e |      7940  607.6344       576       320       874
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_rheum~e |      7937  603.0028       580       308       870
----------------------------------------------------------------

. 
. *Time to first csDMARD prescriptions - all of the below are shared care prescriptions, aside from those with MTX_high cost drug data included======================================================================*/
. 
. *All patients below must have at least six months of GP registration after EIA code
. 
. **Time to first csDMARD script for RA patients, whereby first rheum appt is classed as diagnosis date (if rheum appt present and before csDMARD date; not including high cost MTX prescriptions)
. gen time_to_csdmard=(csdmard_date-rheum_appt_date) if csdmard==1 & rheum_appt_date!=. & csdmard_date>rheum_appt_date 
(24,979 missing values generated)

. tabstat time_to_csdmard if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_cs~d |      3228  566.5917     522.5       284       824
----------------------------------------------------------------

. bys diagnosis_year: tabstat time_to_csdmard if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by diagnosis year

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_cs~d |      1072  554.2612     486.5     266.5       825
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_cs~d |       991  578.8981       555       306       829
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_cs~d |      1027  566.0759       521       288       815
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_cs~d |       138  577.8406       575       290       836
----------------------------------------------------------------

. bys nuts_region: tabstat time_to_csdmard if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by region

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_cs~d |       317  539.8233       500       243       810
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_cs~d |       326  539.9724     505.5       229       795
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_cs~d |       619  553.6042       499       283       820
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_cs~d |       308  585.8636     545.5     289.5       880
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_cs~d |       314  577.4777       538       307       833
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_cs~d |       662  572.4894     544.5       303       806
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_cs~d |       336  577.7173       541       290     817.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_cs~d |       346  590.3092     543.5       297       834
----------------------------------------------------------------

. 
. **Time to first csDMARD script for RA patients (including high cost MTX prescriptions)
. gen time_to_csdmard_hcd=(csdmard_hcd_date-rheum_appt_date) if csdmard_hcd==1 & rheum_appt_date!=. & csdmard_hcd_date>rheum_appt_date 
(23,577 missing values generated)

. tabstat time_to_csdmard_hcd if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) 

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_c~cd |      3684  561.9658       520       283     815.5
----------------------------------------------------------------

. 
. **Time to first csDMARD script for PsA patients (not including high cost MTX prescriptions)
. tabstat time_to_csdmard if psa_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_c~rd |      3231  562.0015       522       279       815
----------------------------------------------------------------

. bys diagnosis_year: tabstat time_to_csdmard if psa_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by diagnosis year

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_c~rd |      1018  554.9646     517.5       266       810
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_c~rd |      1006   575.993       544       295       831
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_c~rd |      1071  548.9944       494       269       790
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_c~rd |       136  613.6103     579.5     327.5       873
----------------------------------------------------------------

. bys nuts_region: tabstat time_to_csdmard if psa_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by region

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_c~rd |       314  536.6688       490       263       789
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_c~rd |       329    575.69       524       285       846
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_c~rd |       611  571.2029       547       273       830
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_c~rd |       323  576.7152       537       297       838
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_c~rd |       310  529.9871       517       272       748
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_c~rd |       656  548.8948     496.5       276       786
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_c~rd |       341  590.3431       567       290       873
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_c~rd |       347  567.5764       518       269       817
----------------------------------------------------------------

. 
. **Time to first csDMARD script for PsA patients (including high cost MTX prescriptions)
. tabstat time_to_csdmard_hcd if psa_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) 

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_c~cd |      3690  558.8407     515.5       275       815
----------------------------------------------------------------

. 
. **csDMARD time categories for RA patients (not including high cost MTX prescriptions)
. gen csdmard_3m=1 if time_to_csdmard<=90 & time_to_csdmard!=. 
(34,432 missing values generated)

. replace csdmard_3m=2 if time_to_csdmard>90 & time_to_csdmard!=.
(9,453 real changes made)

. lab define csdmard_3m 1 "Yes" 2 "No", modify

. lab val csdmard_3m csdmard_3m

. lab var csdmard_3m "csDMARD within 3 months" 

. tab csdmard_3m if ra_code==1 & has_6m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after csDMARD script

    csDMARD |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        227        2.07        2.07
         No |      3,001       27.39       29.46
          . |      7,730       70.54      100.00
------------+-----------------------------------
      Total |     10,958      100.00

. tab csdmard_3m if ra_code==1 & has_6m_follow_up==1

    csDMARD |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        227        7.03        7.03
         No |      3,001       92.97      100.00
------------+-----------------------------------
      Total |      3,228      100.00

. gen csdmard_6m=1 if time_to_csdmard<=180 & time_to_csdmard!=. 
(33,631 missing values generated)

. replace csdmard_6m=2 if time_to_csdmard>180 & time_to_csdmard!=.
(8,652 real changes made)

. lab define csdmard_6m 1 "Yes" 2 "No", modify

. lab val csdmard_6m csdmard_6m

. lab var csdmard_6m "csDMARD within 6 months" 

. tab csdmard_6m if ra_code==1 & has_6m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after csDMARD script

    csDMARD |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        498        4.54        4.54
         No |      2,730       24.91       29.46
          . |      7,730       70.54      100.00
------------+-----------------------------------
      Total |     10,958      100.00

. tab csdmard_6m if ra_code==1 & has_6m_follow_up==1

    csDMARD |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        498       15.43       15.43
         No |      2,730       84.57      100.00
------------+-----------------------------------
      Total |      3,228      100.00

. gen csdmard_12m=1 if time_to_csdmard<=365 & time_to_csdmard!=. 
(31,755 missing values generated)

. replace csdmard_12m=2 if time_to_csdmard>365 & time_to_csdmard!=.
(6,776 real changes made)

. lab define csdmard_12m 1 "Yes" 2 "No", modify

. lab val csdmard_12m csdmard_12m

. lab var csdmard_12m "csDMARD within 12 months" 

. tab csdmard_12m if ra_code==1 & has_12m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after csDMARD script

    csDMARD |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,018        9.75        9.75
         No |      2,044       19.58       29.34
          . |      7,375       70.66      100.00
------------+-----------------------------------
      Total |     10,437      100.00

. tab csdmard_12m if ra_code==1 & has_12m_follow_up==1 //for patients with at least 12m registration

    csDMARD |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,018       33.25       33.25
         No |      2,044       66.75      100.00
------------+-----------------------------------
      Total |      3,062      100.00

. 
. **csDMARD time categories for RA patients (including high cost MTX prescriptions)
. gen csdmard_hcd_3m=1 if time_to_csdmard_hcd<=90 & time_to_csdmard_hcd!=. 
(34,327 missing values generated)

. replace csdmard_hcd_3m=2 if time_to_csdmard_hcd>90 & time_to_csdmard_hcd!=.
(10,750 real changes made)

. lab define csdmard_hcd_3m 1 "Yes" 2 "No", modify

. lab val csdmard_hcd_3m csdmard_hcd_3m

. lab var csdmard_hcd_3m "csDMARD within 3 months" 

. tab csdmard_hcd_3m if ra_code==1 & has_6m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after csDMARD script

    csDMARD |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        260        2.37        2.37
         No |      3,424       31.25       33.62
          . |      7,274       66.38      100.00
------------+-----------------------------------
      Total |     10,958      100.00

. tab csdmard_hcd_3m if ra_code==1 & has_6m_follow_up==1

    csDMARD |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        260        7.06        7.06
         No |      3,424       92.94      100.00
------------+-----------------------------------
      Total |      3,684      100.00

. gen csdmard_hcd_6m=1 if time_to_csdmard_hcd<=180 & time_to_csdmard_hcd!=. 
(33,400 missing values generated)

. replace csdmard_hcd_6m=2 if time_to_csdmard_hcd>180 & time_to_csdmard_hcd!=.
(9,823 real changes made)

. lab define csdmard_hcd_6m 1 "Yes" 2 "No", modify

. lab val csdmard_hcd_6m csdmard_hcd_6m

. lab var csdmard_hcd_6m "csDMARD within 6 months" 

. tab csdmard_hcd_6m if ra_code==1 & has_6m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after csDMARD script

    csDMARD |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        573        5.23        5.23
         No |      3,111       28.39       33.62
          . |      7,274       66.38      100.00
------------+-----------------------------------
      Total |     10,958      100.00

. tab csdmard_hcd_6m if ra_code==1 & has_6m_follow_up==1

    csDMARD |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        573       15.55       15.55
         No |      3,111       84.45      100.00
------------+-----------------------------------
      Total |      3,684      100.00

. gen csdmard_hcd_12m=1 if time_to_csdmard_hcd<=365 & time_to_csdmard_hcd!=. 
(31,221 missing values generated)

. replace csdmard_hcd_12m=2 if time_to_csdmard_hcd>365 & time_to_csdmard_hcd!=.
(7,644 real changes made)

. lab define csdmard_hcd_12m 1 "Yes" 2 "No", modify

. lab val csdmard_hcd_12m csdmard_hcd_12m

. lab var csdmard_hcd_12m "csDMARD within 12 months" 

. tab csdmard_hcd_12m if ra_code==1 & has_12m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after csDMARD script

    csDMARD |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,176       11.27       11.27
         No |      2,325       22.28       33.54
          . |      6,936       66.46      100.00
------------+-----------------------------------
      Total |     10,437      100.00

. tab csdmard_hcd_12m if ra_code==1 & has_12m_follow_up==1 //for patients with at least 12m registration

    csDMARD |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,176       33.59       33.59
         No |      2,325       66.41      100.00
------------+-----------------------------------
      Total |      3,501      100.00

. 
. **csDMARD time categories for PsA patients (not including high cost MTX prescriptions)
. tab csdmard_3m if psa_code==1 & has_6m_follow_up==1, missing

    csDMARD |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        231        2.06        2.06
         No |      3,000       26.73       28.78
          . |      7,994       71.22      100.00
------------+-----------------------------------
      Total |     11,225      100.00

. tab csdmard_6m if psa_code==1 & has_6m_follow_up==1, missing

    csDMARD |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        507        4.52        4.52
         No |      2,724       24.27       28.78
          . |      7,994       71.22      100.00
------------+-----------------------------------
      Total |     11,225      100.00

. tab csdmard_12m if psa_code==1 & has_12m_follow_up==1, missing

    csDMARD |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,067       10.00       10.00
         No |      2,024       18.97       28.96
          . |      7,581       71.04      100.00
------------+-----------------------------------
      Total |     10,672      100.00

. 
. **csDMARD time categories for PsA patients (including high cost MTX prescriptions)
. tab csdmard_hcd_3m if psa_code==1 & has_6m_follow_up==1, missing

    csDMARD |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        258        2.30        2.30
         No |      3,432       30.57       32.87
          . |      7,535       67.13      100.00
------------+-----------------------------------
      Total |     11,225      100.00

. tab csdmard_hcd_6m if psa_code==1 & has_6m_follow_up==1, missing

    csDMARD |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        583        5.19        5.19
         No |      3,107       27.68       32.87
          . |      7,535       67.13      100.00
------------+-----------------------------------
      Total |     11,225      100.00

. tab csdmard_hcd_12m if psa_code==1 & has_12m_follow_up==1, missing

    csDMARD |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,237       11.59       11.59
         No |      2,278       21.35       32.94
          . |      7,157       67.06      100.00
------------+-----------------------------------
      Total |     10,672      100.00

. 
. **What was first shared care csDMARD (not including high cost MTX prescriptions)
. gen first_csD=""
(35,147 missing values generated)

. foreach var of varlist hydroxychloroquine_date leflunomide_date methotrexate_date methotrexate_inj_date sulfasalazine_date {
  2.         replace first_csD="`var'" if csdmard_date==`var' & csdmard_date!=.
  3.         }
variable first_csD was str1 now str23
(2,582 real changes made)
(2,422 real changes made)
(2,538 real changes made)
(2,532 real changes made)
(2,554 real changes made)

. gen first_csDMARD = substr(first_csD, 1, length(first_csD) - 5) if first_csD!=""
(22,522 missing values generated)

. drop first_csD

. tab first_csDMARD if ra_code==1 & has_6m_follow_up==1 //for RA patients

     first_csDMARD |      Freq.     Percent        Cum.
-------------------+-----------------------------------
hydroxychloroquine |        831       20.81       20.81
       leflunomide |        755       18.91       39.72
      methotrexate |        765       19.16       58.88
  methotrexate_inj |        825       20.66       79.54
     sulfasalazine |        817       20.46      100.00
-------------------+-----------------------------------
             Total |      3,993      100.00

. tab first_csDMARD if psa_code==1 & has_6m_follow_up==1 //for PsA patients

     first_csDMARD |      Freq.     Percent        Cum.
-------------------+-----------------------------------
hydroxychloroquine |        854       21.40       21.40
       leflunomide |        761       19.07       40.47
      methotrexate |        802       20.10       60.56
  methotrexate_inj |        789       19.77       80.33
     sulfasalazine |        785       19.67      100.00
-------------------+-----------------------------------
             Total |      3,991      100.00

. 
. **What was first csDMARD (including high cost MTX prescriptions)
. gen first_csD_hcd=""
(35,147 missing values generated)

. foreach var of varlist hydroxychloroquine_date leflunomide_date methotrexate_date methotrexate_inj_date methotrexate_hcd_date sulfasalazine_date {
  2.         replace first_csD_hcd="`var'" if csdmard_hcd_date==`var' & csdmard_hcd_date!=.
  3.         }
variable first_csD_hcd was str1 now str23
(2,462 real changes made)
(2,317 real changes made)
(2,399 real changes made)
(2,410 real changes made)
(2,899 real changes made)
(2,423 real changes made)

. gen first_csDMARD_hcd = substr(first_csD_hcd, 1, length(first_csD_hcd) - 5) if first_csD_hcd!=""
(20,241 missing values generated)

. drop first_csD_hcd

. tab first_csDMARD_hcd if ra_code==1 & has_6m_follow_up==1 //for RA patients

 first_csDMARD_hcd |      Freq.     Percent        Cum.
-------------------+-----------------------------------
hydroxychloroquine |        788       16.67       16.67
       leflunomide |        723       15.30       31.97
      methotrexate |        712       15.06       47.03
  methotrexate_hcd |        941       19.91       66.93
  methotrexate_inj |        786       16.63       83.56
     sulfasalazine |        777       16.44      100.00
-------------------+-----------------------------------
             Total |      4,727      100.00

. tab first_csDMARD_hcd if psa_code==1 & has_6m_follow_up==1 //for PsA patients

 first_csDMARD_hcd |      Freq.     Percent        Cum.
-------------------+-----------------------------------
hydroxychloroquine |        819       17.41       17.41
       leflunomide |        727       15.45       32.86
      methotrexate |        761       16.17       49.03
  methotrexate_hcd |        902       19.17       68.20
  methotrexate_inj |        752       15.98       84.19
     sulfasalazine |        744       15.81      100.00
-------------------+-----------------------------------
             Total |      4,705      100.00

.  
. **Methotrexate use (not including high cost MTX prescriptions)
. gen mtx=1 if methotrexate==1 | methotrexate_inj==1
(29,394 missing values generated)

. recode mtx .=0 
(29394 changes made to mtx)

. tab mtx if ra_code==1 & has_6m_follow_up==1 //for RA patients; Nb. this is just a check; need time-to-MTX instead (below)

        mtx |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      9,152       83.52       83.52
          1 |      1,806       16.48      100.00
------------+-----------------------------------
      Total |     10,958      100.00

. tab mtx if psa_code==1 & has_6m_follow_up==1 //for PsA patients

        mtx |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      9,424       83.96       83.96
          1 |      1,801       16.04      100.00
------------+-----------------------------------
      Total |     11,225      100.00

. 
. **Methotrexate use (including high cost MTX prescriptions)
. gen mtx_hcd=1 if methotrexate==1 | methotrexate_inj==1 | methotrexate_hcd==1
(26,454 missing values generated)

. recode mtx_hcd .=0 
(26454 changes made to mtx_hcd)

. tab mtx_hcd if ra_code==1 & has_6m_follow_up==1 //for RA patients

    mtx_hcd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,207       74.90       74.90
          1 |      2,751       25.10      100.00
------------+-----------------------------------
      Total |     10,958      100.00

. tab mtx_hcd if psa_code==1 & has_6m_follow_up==1 //for PsA patients

    mtx_hcd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,505       75.77       75.77
          1 |      2,720       24.23      100.00
------------+-----------------------------------
      Total |     11,225      100.00

. 
. **Date of first methotrexate script (not including high cost MTX prescriptions)
. gen mtx_date=min(methotrexate_date, methotrexate_inj_date)
(29,394 missing values generated)

. format %td mtx_date

. 
. **Date of first methotrexate script (including high cost MTX prescriptions)
. gen mtx_hcd_date=min(methotrexate_date, methotrexate_inj_date, methotrexate_hcd_date)
(26,454 missing values generated)

. format %td mtx_hcd_date

. 
. **Time to first methotrexate script for RA patients (not including high cost MTX prescriptions)
. gen time_to_mtx=(mtx_date-rheum_appt_date) if mtx==1 & rheum_appt_date!=. & mtx_date>rheum_appt_date 
(30,528 missing values generated)

. tabstat time_to_mtx if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |      1454  585.0688       553       304       842
----------------------------------------------------------------

. bys diagnosis_year: tabstat time_to_mtx if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by diagnosis year

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       479  570.8747       528       290       833
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       435  590.7425       556       325       844
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       479  590.7683       559       304       849
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |        61  611.3115       658       314       865
----------------------------------------------------------------

. bys nuts_region: tabstat time_to_mtx if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by region

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       141  563.5177       519       245       819
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       149  528.9933       465       224       795
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       285  596.8105       550       307       891
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       127  625.3622       579       333       881
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       157  594.0701       558       340       858
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       284  596.5669       577     314.5     850.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       153  595.9477       559       333       829
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       158  563.4684     539.5       325       778
----------------------------------------------------------------

. 
. **Time to first methotrexate script for RA patients (including high cost MTX prescriptions)
. gen time_to_mtx_hcd=(mtx_hcd_date-rheum_appt_date) if mtx_hcd==1 & rheum_appt_date!=. & mtx_hcd_date>rheum_appt_date 
(28,596 missing values generated)

. tabstat time_to_mtx_hcd if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_mt~d |      2071   584.507       558       304       837
----------------------------------------------------------------

. 
. **Time to first methotrexate script for PsA patients (not including high cost MTX prescriptions)
. tabstat time_to_mtx if psa_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |      1454   601.608     574.5       316       870
----------------------------------------------------------------

. bys diagnosis_year: tabstat time_to_mtx if psa_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by diagnosis year

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       438   601.137       581       304       866
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       465  600.9484       568       316       855
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       489  595.7812       573       308       873
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |        62  655.8387     632.5       344       994
----------------------------------------------------------------

. bys nuts_region: tabstat time_to_mtx if psa_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by region

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       148  568.3784       551     283.5     845.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       141  606.0071       573       320       859
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       291   600.189       566       304       869
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       138  604.2609     567.5       315       930
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       129  599.9922       568       346       841
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       289  594.5398       583       298       866
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       157  604.8662       576       316       884
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       161  639.3975       638       341       901
----------------------------------------------------------------

. 
. **Time to first methotrexate script for PsA patients (including high cost MTX prescriptions)
. tabstat time_to_mtx_hcd if psa_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_mt~d |      2079  597.8062       571       305       871
----------------------------------------------------------------

. 
. **Methotrexate time categories for RA patients (not including high-cost MTX) //Nb. this is time period from rheum appt (i.e. diagnosis) to shared care, not from referral to first script 
. gen mtx_3m=1 if time_to_mtx<=90 & time_to_mtx!=. 
(34,869 missing values generated)

. replace mtx_3m=2 if time_to_mtx>90 & time_to_mtx!=.
(4,341 real changes made)

. lab define mtx_3m 1 "Yes" 2 "No", modify

. lab val mtx_3m mtx_3m

. lab var mtx_3m "Methotrexate within 3 months" 

. tab mtx_3m if ra_code==1 & has_6m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after csDMARD script

Methotrexat |
 e within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         76        0.69        0.69
         No |      1,378       12.58       13.27
          . |      9,504       86.73      100.00
------------+-----------------------------------
      Total |     10,958      100.00

. tab mtx_3m if ra_code==1 & has_6m_follow_up==1

Methotrexat |
 e within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         76        5.23        5.23
         No |      1,378       94.77      100.00
------------+-----------------------------------
      Total |      1,454      100.00

. gen mtx_6m=1 if time_to_mtx<=180 & time_to_mtx!=. 
(34,544 missing values generated)

. replace mtx_6m=2 if time_to_mtx>180 & time_to_mtx!=.
(4,016 real changes made)

. lab define mtx_6m 1 "Yes" 2 "No", modify

. lab val mtx_6m mtx_6m

. lab var mtx_6m "Methotrexate within 6 months" 

. tab mtx_6m if ra_code==1 & has_6m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after csDMARD script

Methotrexat |
 e within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        196        1.79        1.79
         No |      1,258       11.48       13.27
          . |      9,504       86.73      100.00
------------+-----------------------------------
      Total |     10,958      100.00

. tab mtx_6m if ra_code==1 & has_6m_follow_up==1

Methotrexat |
 e within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        196       13.48       13.48
         No |      1,258       86.52      100.00
------------+-----------------------------------
      Total |      1,454      100.00

. gen mtx_12m=1 if time_to_mtx<=365 & time_to_mtx!=. 
(33,737 missing values generated)

. replace mtx_12m=2 if time_to_mtx>365 & time_to_mtx!=.
(3,209 real changes made)

. lab define mtx_12m 1 "Yes" 2 "No", modify

. lab val mtx_12m mtx_12m

. lab var mtx_12m "Methotrexate within 12 months" 

. tab mtx_12m if ra_code==1 & has_12m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after mtx script

Methotrexat |
e within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        440        4.22        4.22
         No |        954        9.14       13.36
          . |      9,043       86.64      100.00
------------+-----------------------------------
      Total |     10,437      100.00

. tab mtx_12m if ra_code==1 & has_12m_follow_up==1 //for patients with at least 12m registration

Methotrexat |
e within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        440       31.56       31.56
         No |        954       68.44      100.00
------------+-----------------------------------
      Total |      1,394      100.00

. 
. **Methotrexate time categories for RA patients (including high-cost MTX)
. gen mtx_hcd_3m=1 if time_to_mtx_hcd<=90 & time_to_mtx_hcd!=. 
(34,743 missing values generated)

. replace mtx_hcd_3m=2 if time_to_mtx_hcd>90 & time_to_mtx_hcd!=.
(6,147 real changes made)

. lab define mtx_hcd_3m 1 "Yes" 2 "No", modify

. lab val mtx_hcd_3m mtx_hcd_3m

. lab var mtx_hcd_3m "Methotrexate within 3 months" 

. tab mtx_hcd_3m if ra_code==1 & has_6m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after csDMARD script

Methotrexat |
 e within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        117        1.07        1.07
         No |      1,954       17.83       18.90
          . |      8,887       81.10      100.00
------------+-----------------------------------
      Total |     10,958      100.00

. tab mtx_hcd_3m if ra_code==1 & has_6m_follow_up==1

Methotrexat |
 e within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        117        5.65        5.65
         No |      1,954       94.35      100.00
------------+-----------------------------------
      Total |      2,071      100.00

. gen mtx_hcd_6m=1 if time_to_mtx_hcd<=180 & time_to_mtx_hcd!=. 
(34,278 missing values generated)

. replace mtx_hcd_6m=2 if time_to_mtx_hcd>180 & time_to_mtx_hcd!=.
(5,682 real changes made)

. lab define mtx_hcd_6m 1 "Yes" 2 "No", modify

. lab val mtx_hcd_6m mtx_hcd_6m

. lab var mtx_hcd_6m "Methotrexate within 6 months" 

. tab mtx_hcd_6m if ra_code==1 & has_6m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after csDMARD script

Methotrexat |
 e within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        286        2.61        2.61
         No |      1,785       16.29       18.90
          . |      8,887       81.10      100.00
------------+-----------------------------------
      Total |     10,958      100.00

. tab mtx_hcd_6m if ra_code==1 & has_6m_follow_up==1

Methotrexat |
 e within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        286       13.81       13.81
         No |      1,785       86.19      100.00
------------+-----------------------------------
      Total |      2,071      100.00

. gen mtx_hcd_12m=1 if time_to_mtx_hcd<=365 & time_to_mtx_hcd!=. 
(33,118 missing values generated)

. replace mtx_hcd_12m=2 if time_to_mtx_hcd>365 & time_to_mtx_hcd!=.
(4,522 real changes made)

. lab define mtx_hcd_12m 1 "Yes" 2 "No", modify

. lab val mtx_hcd_12m mtx_hcd_12m

. lab var mtx_hcd_12m "Methotrexate within 12 months" 

. tab mtx_hcd_12m if ra_code==1 & has_12m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after csDMARD script

Methotrexat |
e within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        621        5.95        5.95
         No |      1,368       13.11       19.06
          . |      8,448       80.94      100.00
------------+-----------------------------------
      Total |     10,437      100.00

. tab mtx_hcd_12m if ra_code==1 & has_12m_follow_up==1 //for patients with at least 12m registration

Methotrexat |
e within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        621       31.22       31.22
         No |      1,368       68.78      100.00
------------+-----------------------------------
      Total |      1,989      100.00

. 
. **Methotrexate time categories for PsA patients (not including high-cost MTX)
. tab mtx_3m if psa_code==1 & has_6m_follow_up==1, missing

Methotrexat |
 e within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        100        0.89        0.89
         No |      1,354       12.06       12.95
          . |      9,771       87.05      100.00
------------+-----------------------------------
      Total |     11,225      100.00

. tab mtx_6m if psa_code==1 & has_6m_follow_up==1, missing

Methotrexat |
 e within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        194        1.73        1.73
         No |      1,260       11.22       12.95
          . |      9,771       87.05      100.00
------------+-----------------------------------
      Total |     11,225      100.00

. tab mtx_12m if psa_code==1 & has_12m_follow_up==1, missing //with a least 12m registration

Methotrexat |
e within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        426        3.99        3.99
         No |        972        9.11       13.10
          . |      9,274       86.90      100.00
------------+-----------------------------------
      Total |     10,672      100.00

. 
. **Methotrexate time categories for PsA patients (including high-cost MTX)
. tab mtx_hcd_3m if psa_code==1 & has_6m_follow_up==1, missing

Methotrexat |
 e within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        134        1.19        1.19
         No |      1,945       17.33       18.52
          . |      9,146       81.48      100.00
------------+-----------------------------------
      Total |     11,225      100.00

. tab mtx_hcd_6m if psa_code==1 & has_6m_follow_up==1, missing

Methotrexat |
 e within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        281        2.50        2.50
         No |      1,798       16.02       18.52
          . |      9,146       81.48      100.00
------------+-----------------------------------
      Total |     11,225      100.00

. tab mtx_hcd_12m if psa_code==1 & has_12m_follow_up==1, missing //with a least 12m registration

Methotrexat |
e within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        621        5.82        5.82
         No |      1,362       12.76       18.58
          . |      8,689       81.42      100.00
------------+-----------------------------------
      Total |     10,672      100.00

. 
. **Sulfasalazine use
. gen time_to_ssz=(sulfasalazine_date-rheum_appt_date) if sulfasalazine==1 & rheum_appt_date!=. & sulfasalazine_date>rheum_appt_date 
(32,705 missing values generated)

. tabstat time_to_ssz if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |       783  613.6679       583       313       884
----------------------------------------------------------------

. bys diagnosis_year: tabstat time_to_ssz if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by diagnosis year for RA

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |       274  609.4745     581.5       300       883
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |       251  615.2669       600       313       886
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |       232   620.194     575.5     333.5       918
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |        26  584.1923       633       313       836
----------------------------------------------------------------

. bys diagnosis_year: tabstat time_to_ssz if psa_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by diagnosis year for PsA

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |       249  563.2691       528       271       809
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |       215  621.9023       608       324       908
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |       250   565.728       507       281       817
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |        29  703.1379       764       482       866
----------------------------------------------------------------

. bys nuts_region: tabstat time_to_ssz if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by region for RA

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |        85     575.8       479       255       874
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |        74  656.3784     660.5       399       899
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |       163  569.9877       502       292       835
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |        80    624.45       583       242    1000.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |        74  606.6351       567       373       865
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |       158   635.519       625       350       914
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |        81   605.321       583       278       817
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |        68  673.3676       701       354     967.5
----------------------------------------------------------------

. bys nuts_region: tabstat time_to_ssz if psa_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by region for PsA

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |        71  654.9437       645       342       864
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |        82  567.7439     501.5       282       809
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |       133  538.2256       530       251       749
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |        72  598.0417       489       343       869
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |        66  558.6667     542.5       231       840
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |       166  604.7108       604       302       860
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |        82  626.2073       622       352       941
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |        71  556.1127       489       256       847
----------------------------------------------------------------

. 
. **Sulfasalazine time categories for RA patients //Nb. this is time period from rheum appt (i.e. diagnosis) to shared care, not from referral to first script 
. gen ssz_3m=1 if time_to_ssz<=90 & time_to_ssz!=. 
(34,994 missing values generated)

. replace ssz_3m=2 if time_to_ssz>90 & time_to_ssz!=.
(2,289 real changes made)

. lab define ssz_3m 1 "Yes" 2 "No", modify

. lab val ssz_3m ssz_3m

. lab var ssz_3m "Sulfasalazine within 3 months" 

. tab ssz_3m if ra_code==1 & has_6m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after csDMARD script

Sulfasalazi |
ne within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         55        0.50        0.50
         No |        728        6.64        7.15
          . |     10,175       92.85      100.00
------------+-----------------------------------
      Total |     10,958      100.00

. tab ssz_3m if ra_code==1 & has_6m_follow_up==1

Sulfasalazi |
ne within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         55        7.02        7.02
         No |        728       92.98      100.00
------------+-----------------------------------
      Total |        783      100.00

. gen ssz_6m=1 if time_to_ssz<=180 & time_to_ssz!=. 
(34,828 missing values generated)

. replace ssz_6m=2 if time_to_ssz>180 & time_to_ssz!=.
(2,123 real changes made)

. lab define ssz_6m 1 "Yes" 2 "No", modify

. lab val ssz_6m ssz_6m

. lab var ssz_6m "Sulfasalazine within 6 months" 

. tab ssz_6m if ra_code==1 & has_6m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after csDMARD script

Sulfasalazi |
ne within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        104        0.95        0.95
         No |        679        6.20        7.15
          . |     10,175       92.85      100.00
------------+-----------------------------------
      Total |     10,958      100.00

. tab ssz_6m if ra_code==1 & has_6m_follow_up==1

Sulfasalazi |
ne within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        104       13.28       13.28
         No |        679       86.72      100.00
------------+-----------------------------------
      Total |        783      100.00

. gen ssz_12m=1 if time_to_ssz<=365 & time_to_ssz!=. 
(34,425 missing values generated)

. replace ssz_12m=2 if time_to_ssz>365 & time_to_ssz!=.
(1,720 real changes made)

. lab define ssz_12m 1 "Yes" 2 "No", modify

. lab val ssz_12m ssz_12m

. lab var ssz_12m "Sulfasalazine within 12 months" 

. tab ssz_12m if ra_code==1 & has_12m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after ssz script

Sulfasalazi |
  ne within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        207        1.98        1.98
         No |        501        4.80        6.78
          . |      9,729       93.22      100.00
------------+-----------------------------------
      Total |     10,437      100.00

. tab ssz_12m if ra_code==1 & has_12m_follow_up==1 //for patients with at least 12m registration

Sulfasalazi |
  ne within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        207       29.24       29.24
         No |        501       70.76      100.00
------------+-----------------------------------
      Total |        708      100.00

. 
. **Sulfasalazine time categories for PsA patients
. tab ssz_3m if psa_code==1 & has_6m_follow_up==1, missing

Sulfasalazi |
ne within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         40        0.36        0.36
         No |        703        6.26        6.62
          . |     10,482       93.38      100.00
------------+-----------------------------------
      Total |     11,225      100.00

. tab ssz_6m if psa_code==1 & has_6m_follow_up==1, missing

Sulfasalazi |
ne within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        110        0.98        0.98
         No |        633        5.64        6.62
          . |     10,482       93.38      100.00
------------+-----------------------------------
      Total |     11,225      100.00

. tab ssz_12m if psa_code==1 & has_12m_follow_up==1, missing //with a least 12m registration

Sulfasalazi |
  ne within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        223        2.09        2.09
         No |        502        4.70        6.79
          . |      9,947       93.21      100.00
------------+-----------------------------------
      Total |     10,672      100.00

. 
. **Hydroxychloroquine use
. gen time_to_hcq=(hydroxychloroquine_date-rheum_appt_date) if hydroxychloroquine==1 & rheum_appt_date!=. & hydroxychloroquine_date>rheum_appt_date 
(32,683 missing values generated)

. tabstat time_to_hcq if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |       801  607.5668       581       323       861
----------------------------------------------------------------

. bys diagnosis_year: tabstat time_to_hcq if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by diagnosis year for RA

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |       274  609.2956     571.5       289       900
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |       229  616.2882       603       368       884
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |       260  595.9654       568     348.5     821.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |        38  621.9211     558.5       294       883
----------------------------------------------------------------

. bys diagnosis_year: tabstat time_to_hcq if psa_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by diagnosis year for PsA

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |       247   599.247       537       315       891
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |       257  589.9261       551       299       909
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |       267  606.1498       599       306       877
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |        35     547.6       545       275       854
----------------------------------------------------------------

. bys nuts_region: tabstat time_to_hcq if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by region for RA

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |        76  525.4605     518.5     279.5       782
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |        82  635.9024       623       385       955
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |       159  620.5283       543       346       907
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |        73  643.7671       702       336       901
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |        72  660.4167       661       393       920
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |       165  593.4788       567       326       829
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |        86  589.4884     565.5       239       880
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |        88  599.4659       583       292     844.5
----------------------------------------------------------------

. bys nuts_region: tabstat time_to_hcq if psa_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by region for PsA

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |        80  554.3125       475     276.5     864.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |        83  638.4458       598       381       921
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |       129  622.2636       592       322       951
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |        87  601.5172       551       293       880
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |        85  540.3765       477       243       783
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |       166  587.6807     546.5       299       840
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |        78  635.6667       601       325       964
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |        98       588     553.5       303       829
----------------------------------------------------------------

. 
. **Hydroxychloroquine time categories for RA patients //Nb. this is time period from rheum appt (i.e. diagnosis) to shared care, not from referral to first script 
. gen hcq_3m=1 if time_to_hcq<=90 & time_to_hcq!=. 
(34,986 missing values generated)

. replace hcq_3m=2 if time_to_hcq>90 & time_to_hcq!=.
(2,303 real changes made)

. lab define hcq_3m 1 "Yes" 2 "No", modify

. lab val hcq_3m hcq_3m

. lab var hcq_3m "Hydroxychloroquine within 3 months" 

. tab hcq_3m if ra_code==1 & has_6m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after csDMARD script

Hydroxychlo |
    roquine |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         50        0.46        0.46
         No |        751        6.85        7.31
          . |     10,157       92.69      100.00
------------+-----------------------------------
      Total |     10,958      100.00

. tab hcq_3m if ra_code==1 & has_6m_follow_up==1

Hydroxychlo |
    roquine |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         50        6.24        6.24
         No |        751       93.76      100.00
------------+-----------------------------------
      Total |        801      100.00

. gen hcq_6m=1 if time_to_hcq<=180 & time_to_hcq!=. 
(34,811 missing values generated)

. replace hcq_6m=2 if time_to_hcq>180 & time_to_hcq!=.
(2,128 real changes made)

. lab define hcq_6m 1 "Yes" 2 "No", modify

. lab val hcq_6m hcq_6m

. lab var hcq_6m "Hydroxychloroquine within 6 months" 

. tab hcq_6m if ra_code==1 & has_6m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after csDMARD script

Hydroxychlo |
    roquine |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        113        1.03        1.03
         No |        688        6.28        7.31
          . |     10,157       92.69      100.00
------------+-----------------------------------
      Total |     10,958      100.00

. tab hcq_6m if ra_code==1 & has_6m_follow_up==1

Hydroxychlo |
    roquine |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        113       14.11       14.11
         No |        688       85.89      100.00
------------+-----------------------------------
      Total |        801      100.00

. gen hcq_12m=1 if time_to_hcq<=365 & time_to_hcq!=. 
(34,393 missing values generated)

. replace hcq_12m=2 if time_to_hcq>365 & time_to_hcq!=.
(1,710 real changes made)

. lab define hcq_12m 1 "Yes" 2 "No", modify

. lab val hcq_12m hcq_12m

. lab var hcq_12m "Hydroxychloroquine within 12 months" 

. tab hcq_12m if ra_code==1 & has_12m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after hcq script

Hydroxychlo |
    roquine |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        214        2.05        2.05
         No |        540        5.17        7.22
          . |      9,683       92.78      100.00
------------+-----------------------------------
      Total |     10,437      100.00

. tab hcq_12m if ra_code==1 & has_12m_follow_up==1 //for patients with at least 12m registration

Hydroxychlo |
    roquine |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        214       28.38       28.38
         No |        540       71.62      100.00
------------+-----------------------------------
      Total |        754      100.00

. 
. **Hydroxychloroquine time categories for PsA patients
. tab hcq_3m if psa_code==1 & has_6m_follow_up==1, missing

Hydroxychlo |
    roquine |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         57        0.51        0.51
         No |        749        6.67        7.18
          . |     10,419       92.82      100.00
------------+-----------------------------------
      Total |     11,225      100.00

. tab hcq_6m if psa_code==1 & has_6m_follow_up==1, missing

Hydroxychlo |
    roquine |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        117        1.04        1.04
         No |        689        6.14        7.18
          . |     10,419       92.82      100.00
------------+-----------------------------------
      Total |     11,225      100.00

. tab hcq_12m if psa_code==1 & has_12m_follow_up==1, missing //with a least 12m registration

Hydroxychlo |
    roquine |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        254        2.38        2.38
         No |        513        4.81        7.19
          . |      9,905       92.81      100.00
------------+-----------------------------------
      Total |     10,672      100.00

. 
. **Leflunomide use
. gen time_to_lef=(leflunomide_date-rheum_appt_date) if leflunomide==1 & rheum_appt_date!=. & leflunomide_date>rheum_appt_date 
(32,811 missing values generated)

. tabstat time_to_lef if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |       719  604.6606       577       320       872
----------------------------------------------------------------

. bys diagnosis_year: tabstat time_to_lef if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by diagnosis year for RA

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |       231  581.8139       546       292       818
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |       226  632.0398     616.5       344       908
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |       232  595.6767     547.5       310     896.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |        30     643.8       613       498       858
----------------------------------------------------------------

. bys diagnosis_year: tabstat time_to_lef if psa_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by diagnosis year for PsA

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |       247  571.3887       535       273       800
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |       219  611.5753       585       340       834
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |       249  586.0763       536       304       821
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |        29  592.1724       633       331       819
----------------------------------------------------------------

. bys nuts_region: tabstat time_to_lef if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by region for RA

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |        69  627.4348       664       323       923
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |        64  525.0938     506.5     236.5     763.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |       137  617.2847       570       309       912
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |        72  576.8472       523       330       874
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |        73  587.1507       593       287       851
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |       161  628.9255       603       415       839
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |        59  596.4746       590       326       798
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |        84  624.2857     550.5     377.5     907.5
----------------------------------------------------------------

. bys nuts_region: tabstat time_to_lef if psa_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by region for PsA

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |        83  570.0964       492       277       844
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |        67  546.5224       523       282       800
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |       145  617.4483       614       303       830
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |        70  589.5429     607.5       333       780
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |        73  586.7534       624       335       782
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |       152  585.6053     510.5     315.5     818.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |        84  609.7381     610.5       316     898.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |        70  576.8286       574       282       811
----------------------------------------------------------------

. 
. **Leflunomide time categories for RA patients //Nb. this is time period from rheum appt (i.e. diagnosis) to shared care, not from referral to first script 
. gen lef_3m=1 if time_to_lef<=90 & time_to_lef!=. 
(35,015 missing values generated)

. replace lef_3m=2 if time_to_lef>90 & time_to_lef!=.
(2,204 real changes made)

. lab define lef_3m 1 "Yes" 2 "No", modify

. lab val lef_3m lef_3m

. lab var lef_3m "Leflunomide within 3 months" 

. tab lef_3m if ra_code==1 & has_6m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after csDMARD script

Leflunomide |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         47        0.43        0.43
         No |        672        6.13        6.56
          . |     10,239       93.44      100.00
------------+-----------------------------------
      Total |     10,958      100.00

. tab lef_3m if ra_code==1 & has_6m_follow_up==1

Leflunomide |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         47        6.54        6.54
         No |        672       93.46      100.00
------------+-----------------------------------
      Total |        719      100.00

. gen lef_6m=1 if time_to_lef<=180 & time_to_lef!=. 
(34,857 missing values generated)

. replace lef_6m=2 if time_to_lef>180 & time_to_lef!=.
(2,046 real changes made)

. lab define lef_6m 1 "Yes" 2 "No", modify

. lab val lef_6m lef_6m

. lab var lef_6m "Leflunomide within 6 months" 

. tab lef_6m if ra_code==1 & has_6m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after csDMARD script

Leflunomide |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         97        0.89        0.89
         No |        622        5.68        6.56
          . |     10,239       93.44      100.00
------------+-----------------------------------
      Total |     10,958      100.00

. tab lef_6m if ra_code==1 & has_6m_follow_up==1

Leflunomide |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         97       13.49       13.49
         No |        622       86.51      100.00
------------+-----------------------------------
      Total |        719      100.00

. gen lef_12m=1 if time_to_lef<=365 & time_to_lef!=. 
(34,480 missing values generated)

. replace lef_12m=2 if time_to_lef>365 & time_to_lef!=.
(1,669 real changes made)

. lab define lef_12m 1 "Yes" 2 "No", modify

. lab val lef_12m lef_12m

. lab var lef_12m "Leflunomide within 12 months" 

. tab lef_12m if ra_code==1 & has_12m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after lef script

Leflunomide |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        200        1.92        1.92
         No |        495        4.74        6.66
          . |      9,742       93.34      100.00
------------+-----------------------------------
      Total |     10,437      100.00

. tab lef_12m if ra_code==1 & has_12m_follow_up==1 //for patients with at least 12m registration

Leflunomide |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        200       28.78       28.78
         No |        495       71.22      100.00
------------+-----------------------------------
      Total |        695      100.00

. 
. **Leflunomide time categories for PsA patients
. tab lef_3m if psa_code==1 & has_6m_follow_up==1, missing

Leflunomide |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         38        0.34        0.34
         No |        706        6.29        6.63
          . |     10,481       93.37      100.00
------------+-----------------------------------
      Total |     11,225      100.00

. tab lef_6m if psa_code==1 & has_6m_follow_up==1, missing

Leflunomide |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         94        0.84        0.84
         No |        650        5.79        6.63
          . |     10,481       93.37      100.00
------------+-----------------------------------
      Total |     11,225      100.00

. tab lef_12m if psa_code==1 & has_12m_follow_up==1, missing //with a least 12m registration

Leflunomide |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        207        1.94        1.94
         No |        486        4.55        6.49
          . |      9,979       93.51      100.00
------------+-----------------------------------
      Total |     10,672      100.00

. 
. **Time to first biologic script, whereby first rheum appt is classed as diagnosis date (assumes rheum appt present); high_cost drug data available to Nov 2020===============================================================
> =======*/
. 
. *Below analyses are only for patients with at least 12 months of follow-up available after EIA code
. gen time_to_biologic=(biologic_date-rheum_appt_date) if biologic==1 & rheum_appt_date!=. & biologic_date>rheum_appt_date 
(14,209 missing values generated)

. tabstat time_to_biologic if has_12m_follow_up==1, stats (n mean p50 p25 p75) //for all EIA patients

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_bi~c |     18856  462.0258       402       205       670
----------------------------------------------------------------

. bys eia_diagnosis: tabstat time_to_biologic if has_12m_follow_up==1, stats (n mean p50 p25 p75) 

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_bi~c |      6188  465.3282       407       207       674
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_bi~c |      6405   459.929       401       203       670
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_bi~c |      6263  460.9072       400       204       666
----------------------------------------------------------------

. bys diagnosis_year: tabstat time_to_biologic if ra_code==1 & has_12m_follow_up==1, stats (n mean p50 p25 p75) //by diagnosis year

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_bi~c |      1997  462.2659       410       210       666
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_bi~c |      1947  459.7175       393       203       670
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_bi~c |      1976  476.5759       422       212       690
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_bi~c |       268  445.9776       391       210     652.5
----------------------------------------------------------------

. bys nuts_region: tabstat time_to_biologic if ra_code==1 & has_12m_follow_up==1, stats (n mean p50 p25 p75) //by region

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_bi~c |       639  479.2191       408       212       700
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_bi~c |       616  474.2581       407     209.5       685
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_bi~c |      1217  452.9852       389       194       656
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_bi~c |       653  487.2374       430       224       698
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_bi~c |       595  459.3328       397       200       666
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_bi~c |      1224  453.3415     404.5       205     649.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_bi~c |       608  481.8569       436     221.5     705.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_bi~c |       636  456.7233     397.5     223.5       655
----------------------------------------------------------------

. 
. **What was first biologic
. gen first_bio=""
(35,147 missing values generated)

. foreach var of varlist abatacept_date adalimumab_date baricitinib_date certolizumab_date etanercept_date golimumab_date guselkumab_date infliximab_date ixekizumab_date rituximab_date sarilumab_date secukinumab_date tocili
> zumab_date tofacitinib_date upadacitinib_date ustekinumab_date {
  2.         replace first_bio="`var'" if biologic_date==`var' & biologic_date!=.
  3.         }
variable first_bio was str1 now str14
(1,697 real changes made)
variable first_bio was str14 now str15
(1,631 real changes made)
variable first_bio was str15 now str16
(1,606 real changes made)
variable first_bio was str16 now str17
(1,658 real changes made)
(1,584 real changes made)
(1,662 real changes made)
(1,696 real changes made)
(1,684 real changes made)
(1,650 real changes made)
(1,674 real changes made)
(1,651 real changes made)
(1,696 real changes made)
(1,643 real changes made)
(1,583 real changes made)
(1,615 real changes made)
(1,632 real changes made)

. gen first_biologic = substr(first_bio, 1, length(first_bio) - 5)        
(9,353 missing values generated)

. drop first_bio

. tab first_biologic if has_12m_follow_up==1 //for all EIA patients

first_biolog |
          ic |      Freq.     Percent        Cum.
-------------+-----------------------------------
   abatacept |      1,476        6.35        6.35
  adalimumab |      1,427        6.14       12.50
 baricitinib |      1,362        5.86       18.36
certolizumab |      1,465        6.31       24.66
  etanercept |      1,374        5.91       30.58
   golimumab |      1,465        6.31       36.88
  guselkumab |      1,480        6.37       43.25
  infliximab |      1,478        6.36       49.62
  ixekizumab |      1,435        6.18       55.79
   rituximab |      1,503        6.47       62.26
   sarilumab |      1,462        6.29       68.56
 secukinumab |      1,504        6.47       75.03
 tocilizumab |      1,473        6.34       81.37
 tofacitinib |      1,425        6.13       87.50
upadacitinib |      1,441        6.20       93.71
 ustekinumab |      1,462        6.29      100.00
-------------+-----------------------------------
       Total |     23,232      100.00

. bys eia_diagnosis: tab first_biologic if has_12m_follow_up==1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

first_biolog |
          ic |      Freq.     Percent        Cum.
-------------+-----------------------------------
   abatacept |        487        6.36        6.36
  adalimumab |        486        6.34       12.70
 baricitinib |        447        5.83       18.53
certolizumab |        491        6.41       24.94
  etanercept |        445        5.81       30.75
   golimumab |        503        6.56       37.31
  guselkumab |        497        6.49       43.80
  infliximab |        487        6.36       50.16
  ixekizumab |        452        5.90       56.06
   rituximab |        506        6.60       62.66
   sarilumab |        457        5.96       68.62
 secukinumab |        494        6.45       75.07
 tocilizumab |        472        6.16       81.23
 tofacitinib |        491        6.41       87.64
upadacitinib |        486        6.34       93.98
 ustekinumab |        461        6.02      100.00
-------------+-----------------------------------
       Total |      7,662      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

first_biolog |
          ic |      Freq.     Percent        Cum.
-------------+-----------------------------------
   abatacept |        521        6.64        6.64
  adalimumab |        482        6.14       12.79
 baricitinib |        451        5.75       18.53
certolizumab |        480        6.12       24.65
  etanercept |        461        5.88       30.53
   golimumab |        508        6.48       37.00
  guselkumab |        483        6.16       43.16
  infliximab |        519        6.62       49.78
  ixekizumab |        499        6.36       56.14
   rituximab |        478        6.09       62.23
   sarilumab |        499        6.36       68.59
 secukinumab |        509        6.49       75.08
 tocilizumab |        494        6.30       81.38
 tofacitinib |        490        6.25       87.62
upadacitinib |        483        6.16       93.78
 ustekinumab |        488        6.22      100.00
-------------+-----------------------------------
       Total |      7,845      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

first_biolog |
          ic |      Freq.     Percent        Cum.
-------------+-----------------------------------
   abatacept |        468        6.06        6.06
  adalimumab |        459        5.94       12.00
 baricitinib |        464        6.01       18.01
certolizumab |        494        6.39       24.40
  etanercept |        468        6.06       30.46
   golimumab |        454        5.88       36.34
  guselkumab |        500        6.47       42.81
  infliximab |        472        6.11       48.92
  ixekizumab |        484        6.27       55.18
   rituximab |        519        6.72       61.90
   sarilumab |        506        6.55       68.45
 secukinumab |        501        6.49       74.94
 tocilizumab |        507        6.56       81.50
 tofacitinib |        444        5.75       87.25
upadacitinib |        472        6.11       93.36
 ustekinumab |        513        6.64      100.00
-------------+-----------------------------------
       Total |      7,725      100.00


. 
. **Biologic time categories (for all patients)
. gen biologic_3m=1 if time_to_biologic<=90 & time_to_biologic!=. 
(32,844 missing values generated)

. replace biologic_3m=2 if time_to_biologic>90 & time_to_biologic!=.
(18,635 real changes made)

. lab define biologic_3m 1 "Yes" 2 "No", modify

. lab val biologic_3m biologic_3m

. lab var biologic_3m "bDMARD/tsDMARD within 3 months" 

. bys eia_diagnosis: tab biologic_3m if has_6m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after bDMARD/tsDMARD script

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

bDMARD/tsDM |
 ARD within |
   3 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        717        6.54        6.54
         No |      5,788       52.82       59.36
          . |      4,453       40.64      100.00
------------+-----------------------------------
      Total |     10,958      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

bDMARD/tsDM |
 ARD within |
   3 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        749        6.67        6.67
         No |      6,005       53.50       60.17
          . |      4,471       39.83      100.00
------------+-----------------------------------
      Total |     11,225      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

bDMARD/tsDM |
 ARD within |
   3 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        714        6.40        6.40
         No |      5,915       53.04       59.44
          . |      4,524       40.56      100.00
------------+-----------------------------------
      Total |     11,153      100.00


. bys eia_diagnosis: tab biologic_3m if has_6m_follow_up==1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

bDMARD/tsDM |
 ARD within |
   3 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        717       11.02       11.02
         No |      5,788       88.98      100.00
------------+-----------------------------------
      Total |      6,505      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

bDMARD/tsDM |
 ARD within |
   3 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        749       11.09       11.09
         No |      6,005       88.91      100.00
------------+-----------------------------------
      Total |      6,754      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

bDMARD/tsDM |
 ARD within |
   3 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        714       10.77       10.77
         No |      5,915       89.23      100.00
------------+-----------------------------------
      Total |      6,629      100.00


. gen biologic_6m=1 if time_to_biologic<=180 & time_to_biologic!=. 
(30,513 missing values generated)

. replace biologic_6m=2 if time_to_biologic>180 & time_to_biologic!=.
(16,304 real changes made)

. lab define biologic_6m 1 "Yes" 2 "No", modify

. lab val biologic_6m biologic_6m

. lab var biologic_6m "bDMARD/tsDMARD within 6 months" 

. bys eia_diagnosis: tab biologic_6m if has_6m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after bDMARD/tsDMARD script

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,441       13.15       13.15
         No |      5,064       46.21       59.36
          . |      4,453       40.64      100.00
------------+-----------------------------------
      Total |     10,958      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,518       13.52       13.52
         No |      5,236       46.65       60.17
          . |      4,471       39.83      100.00
------------+-----------------------------------
      Total |     11,225      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,447       12.97       12.97
         No |      5,182       46.46       59.44
          . |      4,524       40.56      100.00
------------+-----------------------------------
      Total |     11,153      100.00


. bys eia_diagnosis: tab biologic_6m if has_6m_follow_up==1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,441       22.15       22.15
         No |      5,064       77.85      100.00
------------+-----------------------------------
      Total |      6,505      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,518       22.48       22.48
         No |      5,236       77.52      100.00
------------+-----------------------------------
      Total |      6,754      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,447       21.83       21.83
         No |      5,182       78.17      100.00
------------+-----------------------------------
      Total |      6,629      100.00


. gen biologic_12m=1 if time_to_biologic<=365 & time_to_biologic!=. 
(25,582 missing values generated)

. replace biologic_12m=2 if time_to_biologic>365 & time_to_biologic!=.
(11,373 real changes made)

. lab define biologic_12m 1 "Yes" 2 "No", modify

. lab val biologic_12m biologic_12m

. lab var biologic_12m "bDMARD/tsDMARD within 12 months" 

. bys eia_diagnosis: tab biologic_12m if has_12m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after bDMARD/tsDMARD script

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      2,806       26.89       26.89
         No |      3,382       32.40       59.29
          . |      4,249       40.71      100.00
------------+-----------------------------------
      Total |     10,437      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      2,934       27.49       27.49
         No |      3,471       32.52       60.02
          . |      4,267       39.98      100.00
------------+-----------------------------------
      Total |     10,672      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      2,871       27.21       27.21
         No |      3,392       32.15       59.36
          . |      4,288       40.64      100.00
------------+-----------------------------------
      Total |     10,551      100.00


. bys eia_diagnosis: tab biologic_12m if has_12m_follow_up==1 //for patients with at least 12m registration

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      2,806       45.35       45.35
         No |      3,382       54.65      100.00
------------+-----------------------------------
      Total |      6,188      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      2,934       45.81       45.81
         No |      3,471       54.19      100.00
------------+-----------------------------------
      Total |      6,405      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      2,871       45.84       45.84
         No |      3,392       54.16      100.00
------------+-----------------------------------
      Total |      6,263      100.00


. 
. **Biologic time categories (by year)
. bys diagnosis_year: tab biologic_6m if has_6m_follow_up==1, missing //for all EIA patients with at least 6m follow-up

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,440       13.38       13.38
         No |      4,926       45.78       59.16
          . |      4,395       40.84      100.00
------------+-----------------------------------
      Total |     10,761      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,345       12.87       12.87
         No |      4,848       46.40       59.27
          . |      4,255       40.73      100.00
------------+-----------------------------------
      Total |     10,448      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,427       13.36       13.36
         No |      5,018       46.96       60.32
          . |      4,240       39.68      100.00
------------+-----------------------------------
      Total |     10,685      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        194       13.45       13.45
         No |        690       47.85       61.30
          . |        558       38.70      100.00
------------+-----------------------------------
      Total |      1,442      100.00


. bys diagnosis_year eia_diagnosis: tab biologic_6m if has_6m_follow_up==1, missing //for each diagnosis with at least 6m follow-up

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020, eia_diagnosis = RA

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        479       13.33       13.33
         No |      1,614       44.92       58.25
          . |      1,500       41.75      100.00
------------+-----------------------------------
      Total |      3,593      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020, eia_diagnosis = PsA

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        497       13.71       13.71
         No |      1,662       45.85       59.56
          . |      1,466       40.44      100.00
------------+-----------------------------------
      Total |      3,625      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020, eia_diagnosis = AxSpA

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        464       13.10       13.10
         No |      1,650       46.57       59.67
          . |      1,429       40.33      100.00
------------+-----------------------------------
      Total |      3,543      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021, eia_diagnosis = RA

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        449       13.21       13.21
         No |      1,580       46.47       59.68
          . |      1,371       40.32      100.00
------------+-----------------------------------
      Total |      3,400      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021, eia_diagnosis = PsA

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        462       13.24       13.24
         No |      1,640       46.99       60.23
          . |      1,388       39.77      100.00
------------+-----------------------------------
      Total |      3,490      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021, eia_diagnosis = AxSpA

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        434       12.20       12.20
         No |      1,628       45.76       57.95
          . |      1,496       42.05      100.00
------------+-----------------------------------
      Total |      3,558      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022, eia_diagnosis = RA

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        449       12.87       12.87
         No |      1,652       47.34       60.20
          . |      1,389       39.80      100.00
------------+-----------------------------------
      Total |      3,490      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022, eia_diagnosis = PsA

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        499       13.80       13.80
         No |      1,694       46.85       60.65
          . |      1,423       39.35      100.00
------------+-----------------------------------
      Total |      3,616      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022, eia_diagnosis = AxSpA

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        479       13.38       13.38
         No |      1,672       46.72       60.10
          . |      1,428       39.90      100.00
------------+-----------------------------------
      Total |      3,579      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = ., eia_diagnosis = RA

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         64       13.47       13.47
         No |        218       45.89       59.37
          . |        193       40.63      100.00
------------+-----------------------------------
      Total |        475      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = ., eia_diagnosis = PsA

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         60       12.15       12.15
         No |        240       48.58       60.73
          . |        194       39.27      100.00
------------+-----------------------------------
      Total |        494      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = ., eia_diagnosis = AxSpA

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         70       14.80       14.80
         No |        232       49.05       63.85
          . |        171       36.15      100.00
------------+-----------------------------------
      Total |        473      100.00


. bys diagnosis_year: tab biologic_12m if has_12m_follow_up==1, missing //for all EIA patients

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      2,795       27.32       27.32
         No |      3,256       31.82       59.14
          . |      4,181       40.86      100.00
------------+-----------------------------------
      Total |     10,232      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      2,744       27.63       27.63
         No |      3,156       31.78       59.40
          . |      4,032       40.60      100.00
------------+-----------------------------------
      Total |      9,932      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      2,680       26.52       26.52
         No |      3,375       33.40       59.91
          . |      4,051       40.09      100.00
------------+-----------------------------------
      Total |     10,106      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        392       28.20       28.20
         No |        458       32.95       61.15
          . |        540       38.85      100.00
------------+-----------------------------------
      Total |      1,390      100.00


. bys diagnosis_year eia_diagnosis: tab biologic_12m if has_12m_follow_up==1, missing //for each diagnosis

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020, eia_diagnosis = RA

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        901       26.27       26.27
         No |      1,096       31.95       58.22
          . |      1,433       41.78      100.00
------------+-----------------------------------
      Total |      3,430      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020, eia_diagnosis = PsA

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        962       27.77       27.77
         No |      1,095       31.61       59.38
          . |      1,407       40.62      100.00
------------+-----------------------------------
      Total |      3,464      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020, eia_diagnosis = AxSpA

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        932       27.92       27.92
         No |      1,065       31.91       59.83
          . |      1,341       40.17      100.00
------------+-----------------------------------
      Total |      3,338      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021, eia_diagnosis = RA

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        915       28.32       28.32
         No |      1,032       31.94       60.26
          . |      1,284       39.74      100.00
------------+-----------------------------------
      Total |      3,231      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021, eia_diagnosis = PsA

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        930       28.00       28.00
         No |      1,070       32.22       60.22
          . |      1,321       39.78      100.00
------------+-----------------------------------
      Total |      3,321      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021, eia_diagnosis = AxSpA

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        899       26.60       26.60
         No |      1,054       31.18       57.78
          . |      1,427       42.22      100.00
------------+-----------------------------------
      Total |      3,380      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022, eia_diagnosis = RA

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        866       26.07       26.07
         No |      1,110       33.41       59.48
          . |      1,346       40.52      100.00
------------+-----------------------------------
      Total |      3,322      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022, eia_diagnosis = PsA

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        914       26.83       26.83
         No |      1,142       33.53       60.36
          . |      1,350       39.64      100.00
------------+-----------------------------------
      Total |      3,406      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022, eia_diagnosis = AxSpA

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        900       26.64       26.64
         No |      1,123       33.24       59.89
          . |      1,355       40.11      100.00
------------+-----------------------------------
      Total |      3,378      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = ., eia_diagnosis = RA

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        124       27.31       27.31
         No |        144       31.72       59.03
          . |        186       40.97      100.00
------------+-----------------------------------
      Total |        454      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = ., eia_diagnosis = PsA

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        128       26.61       26.61
         No |        164       34.10       60.71
          . |        189       39.29      100.00
------------+-----------------------------------
      Total |        481      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = ., eia_diagnosis = AxSpA

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        140       30.77       30.77
         No |        150       32.97       63.74
          . |        165       36.26      100.00
------------+-----------------------------------
      Total |        455      100.00


. 
. save "$projectdir/output/data/file_eia_all", replace
(file C:/Users/k1754142/OneDrive/PhD Project/OpenSAFELY/Github Practice/output/data/file_eia_all.dta not found)
file C:/Users/k1754142/OneDrive/PhD Project/OpenSAFELY/Github Practice/output/data/file_eia_all.dta saved

. 
. log close
      name:  <unnamed>
       log:  C:/Users/k1754142/OneDrive/PhD Project/OpenSAFELY/Github Practice/logs/cleaning_dataset.log
  log type:  text
 closed on:   6 Apr 2022, 14:12:05
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
