-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:/Users/k1754142/OneDrive/PhD Project/OpenSAFELY/Github Practice/logs/cleaning_dataset.log
  log type:  text
 opened on:   6 Apr 2022, 11:54:18

. 
. di "$projectdir"
C:/Users/k1754142/OneDrive/PhD Project/OpenSAFELY/Github Practice

. di "$logdir"
C:/Users/k1754142/OneDrive/PhD Project/OpenSAFELY/Github Practice/logs

. 
. import delimited "$projectdir/output/input.csv", clear
(65 vars, 100,000 obs)

. 
. **Set Ado file path
. adopath + "$projectdir/analysis/extra_ados"
  [1]  (BASE)      "C:\Program Files\Stata17\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata17\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "C:\Users\k1754142\ado\personal/"
  [5]  (PLUS)      "C:\Users\k1754142\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "C:/Users/k1754142/OneDrive/PhD Project/OpenSAFELY/Github Practice/analysis/extra_ados"

. 
. **Set index dates ===========================================================*/
. global year_preceding = "01/03/2018"

. global start_date = "01/03/2019"

. global end_date = "01/03/2022"

. 
. **Rename variables (some are too long for Stata to handle) =======================================*/
. rename chronic_respiratory_disease chronic_resp_disease

. 
. **Convert date strings to dates ====================================================*/
. ***Some dates are given with month/year only, so adding day 15 to enable them to be processed as dates 
. 
. foreach var of varlist   hba1c_mmol_per_mol_date                        ///
>                                                  hba1c_percentage_date                          ///
>                                                  creatinine_date                                ///
>                                                  bmi_date_measured                          ///
>                                                  abatacept                                                      ///
>                                                  adalimumab                                                     ///     
>                                                  baricitinib                                            ///
>                                                  certolizumab                                           ///
>                                                  etanercept                                                     ///
>                                                  golimumab                                                      ///
>                                                  guselkumab                                                     ///     
>                                                  infliximab                                                     ///
>                                                  ixekizumab                                                     ///
>                                                  methotrexate_hcd                                       ///
>                                                  rituximab                                                      ///
>                                                  sarilumab                                                      ///
>                                                  secukinumab                                            ///     
>                                                  tocilizumab                                            ///
>                                                  tofacitinib                                            ///
>                                                  upadacitinib                                           ///
>                                                  ustekinumab                                            ///
>                                                  {
  2.                                                         
.                 capture confirm string variable `var'
  3.                 if _rc!=0 {
  4.                         assert `var'==.
  5.                         rename `var' `var'_date
  6.                 }
  7.         
.                 else {
  8.                                 replace `var' = `var' + "-15"
  9.                                 rename `var' `var'_dstr
 10.                                 replace `var'_dstr = " " if `var'_dstr == "-15"
 11.                                 gen `var'_date = date(`var'_dstr, "YMD") 
 12.                                 order `var'_date, after(`var'_dstr)
 13.                                 drop `var'_dstr
 14.                 }
 15.         
.         format `var'_date %td
 16. }
variable hba1c_mmol_per_mol_date was str7 now str10
(100,000 real changes made)
(5,000 real changes made)
(5,000 missing values generated)
variable hba1c_percentage_date was str7 now str10
(100,000 real changes made)
(5,000 real changes made)
(5,000 missing values generated)
variable creatinine_date was str7 now str10
(100,000 real changes made)
(5,000 real changes made)
(5,000 missing values generated)
variable bmi_date_measured was str7 now str10
(100,000 real changes made)
(40,000 real changes made)
(40,000 missing values generated)
variable abatacept was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable adalimumab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable baricitinib was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable certolizumab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable etanercept was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable golimumab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable guselkumab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable infliximab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable ixekizumab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable methotrexate_hcd was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable rituximab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable sarilumab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable secukinumab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable tocilizumab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable tofacitinib was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable upadacitinib was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable ustekinumab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)

. 
. **Conversion for dates with day already included ====================================================*/
. 
. foreach var of varlist   died_date_ons                                          ///
>                                              eia_code_date                                              ///
>                                                  rheum_appt_date                                        ///
>                                              ra_code_date                                               ///
>                                                  psa_code_date                                          ///
>                                                  anksp_code_date                                        ///
>                                                  last_gp_prerheum_date                          ///
>                                                  last_gp_precode_date                           ///     
>                                                  last_gp_refrheum_date                          ///
>                                                  last_gp_refcode_date                           ///
>                                                  referral_rheum_prerheum                        ///
>                                                  referral_rheum_precode                         ///     
>                                                  chronic_cardiac_disease                        ///
>                                                  diabetes                                                       ///
>                                                  hypertension                                           ///     
>                                                  chronic_resp_disease                           ///
>                                                  copd                                                           ///
>                                                  chronic_liver_disease                          ///
>                                                  stroke                                                         ///
>                                                  lung_cancer                                            ///
>                                                  haem_cancer                                            ///
>                                                  other_cancer                                           ///
>                                                  esrf                                                           ///
>                                                  organ_transplant                                       ///
>                                                  hydroxychloroquine                                     ///
>                                                  leflunomide                                            ///
>                                                  methotrexate                                           ///
>                                                  methotrexate_inj                                       ///
>                                                  sulfasalazine                                          ///
>                                                  {
  2.                                                                  
.                 capture confirm string variable `var'
  3.                 if _rc!=0 {
  4.                         assert `var'==.
  5.                         rename `var' `var'_date
  6.                 }
  7.         
.                 else {
  8.                                 rename `var' `var'_dstr
  9.                                 gen `var'_date = date(`var'_dstr, "YMD") 
 10.                                 order `var'_date, after(`var'_dstr)
 11.                                 drop `var'_dstr
 12.                                 gen `var'_date15 = `var'_date+15
 13.                                 order `var'_date15, after(`var'_date)
 14.                                 drop `var'_date
 15.                                 rename `var'_date15 `var'_date
 16.                 }
 17.         
.         format `var'_date %td
 18. }
(90,000 missing values generated)
(90,000 missing values generated)
(1,000 missing values generated)
(1,000 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(1,000 missing values generated)
(1,000 missing values generated)
(1,000 missing values generated)
(1,000 missing values generated)
(1,000 missing values generated)
(1,000 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(90,000 missing values generated)
(90,000 missing values generated)
(90,000 missing values generated)
(90,000 missing values generated)
(90,000 missing values generated)
(90,000 missing values generated)
(90,000 missing values generated)
(90,000 missing values generated)
(90,000 missing values generated)
(90,000 missing values generated)

.                                                  
. **Rename variables with extra 'date' added to the end of variable names===========================================================*/ 
. rename rheum_appt_date_date rheum_appt_date

. rename eia_code_date_date eia_code_date

. rename ra_code_date_date ra_code_date

. rename psa_code_date_date psa_code_date

. rename anksp_code_date_date anksp_code_date

. rename died_date_ons_date died_ons_date

. rename last_gp_prerheum_date_date last_gp_prerheum_date

. rename last_gp_refrheum_date_date last_gp_refrheum_date

. rename last_gp_refcode_date_date last_gp_refcode_date

. rename last_gp_precode_date_date last_gp_precode_date

. rename hba1c_mmol_per_mol_date_date hba1c_mmol_per_mol_date

. rename hba1c_percentage_date_date hba1c_percentage_date

. rename creatinine_date_date creatinine_date

. rename creatinine creatinine_value 

. rename bmi_date_measured_date bmi_date

. rename bmi bmi_value

. 
. **Create binary indicator variables for relevant conditions ====================================================*/
. 
. foreach var of varlist   eia_code_date                                          ///
>                                                  rheum_appt_date                                        ///
>                                              ra_code_date                                               ///
>                                                  psa_code_date                                          ///
>                                                  anksp_code_date                                        ///
>                                                  died_ons_date                                          ///
>                                                  last_gp_prerheum_date                          ///
>                                                  last_gp_precode_date                           ///     
>                                                  last_gp_refrheum_date                          ///
>                                                  last_gp_refcode_date                           ///
>                                                  referral_rheum_prerheum_date           ///
>                                                  referral_rheum_precode_date            ///     
>                                                  chronic_cardiac_disease_date           ///
>                                                  diabetes_date                                          ///
>                                                  hypertension_date                                      ///
>                                                  chronic_resp_disease_date                      ///
>                                                  copd_date                                                      ///
>                                                  chronic_liver_disease_date                     ///
>                                                  stroke_date                                            ///
>                                                  lung_cancer_date                                       ///
>                                                  haem_cancer_date                                       ///             
>                                                  other_cancer_date                                      ///
>                                                  esrf_date                                                      ///
>                                                  creatinine_date                                        ///
>                                                  organ_transplant_date                          ///
>                                                  hydroxychloroquine_date                        ///     
>                                                  leflunomide_date                                       ///
>                                                  methotrexate_date                                      ///
>                                                  methotrexate_inj_date                          ///             
>                                                  sulfasalazine_date                                     ///
>                                                  abatacept_date                                         ///
>                                                  adalimumab_date                                        ///
>                                                  baricitinib_date                                       ///
>                                                  certolizumab_date                                      ///
>                                                  etanercept_date                                        ///
>                                                  golimumab_date                                         ///
>                                                  guselkumab_date                                        ///
>                                                  infliximab_date                                        ///
>                                                  ixekizumab_date                                        ///
>                                                  methotrexate_hcd_date                          ///
>                                                  rituximab_date                                         ///             
>                                                  sarilumab_date                                         ///
>                                                  secukinumab_date                                       ///
>                                                  tocilizumab_date                                       ///             
>                                                  tofacitinib_date                                       ///
>                                                  upadacitinib_date                                      ///
>                                                  ustekinumab_date   {                           
  2.         /*date ranges are applied in python, so presence of date indicates presence of 
>           disease in the correct time frame*/ 
.         local newvar =  substr("`var'", 1, length("`var'") - 5)
  3.         gen `newvar' = (`var'!=. )
  4.         order `newvar', after(`var')
  5. }

. 
. **Create and label variables ===========================================================*/
. 
. **Demographics
. ***Sex
. gen male = 1 if sex == "M"
(51,136 missing values generated)

. replace male = 0 if sex == "F"
(51,136 real changes made)

. lab var male "Male"

. tab male, missing

       Male |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     51,136       51.14       51.14
          1 |     48,864       48.86      100.00
------------+-----------------------------------
      Total |    100,000      100.00

. 
. ***Ethnicity
. replace ethnicity = .u if ethnicity == .
(25,000 real changes made, 25,000 to missing)

. ****rearrange in order of prevalence
. recode ethnicity 2=6 /* mixed to 6 */
(14982 changes made to ethnicity)

. recode ethnicity 3=2 /* south asian to 2 */
(7600 changes made to ethnicity)

. recode ethnicity 4=3 /* black to 3 */
(7554 changes made to ethnicity)

. recode ethnicity 6=4 /* mixed to 4 */
(14982 changes made to ethnicity)

. recode ethnicity 5=4 /* other to 4 */
(7519 changes made to ethnicity)

. 
. label define ethnicity  1 "White"                                       ///
>                                                 2 "Asian/Asian British"         ///
>                                                 3 "Black"                                       ///
>                                                 4 "Mixed/Other"                         ///
>                                                 .u "Missing"

. label values ethnicity ethnicity

. lab var ethnicity "Ethnicity"

. tab ethnicity, missing

          Ethnicity |      Freq.     Percent        Cum.
--------------------+-----------------------------------
              White |     37,345       37.34       37.34
Asian/Asian British |      7,600        7.60       44.95
              Black |      7,554        7.55       52.50
        Mixed/Other |     22,501       22.50       75.00
            Missing |     25,000       25.00      100.00
--------------------+-----------------------------------
              Total |    100,000      100.00

. 
. ***STP 
. rename stp stp_old

. bysort stp_old: gen stp = 1 if _n==1
(99,998 missing values generated)

. replace stp = sum(stp) //
(99,999 real changes made)

. drop stp_old

. 
. ***Regions
. encode region, gen(nuts_region)

. tab region, missing

                  region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
           East Midlands |      9,942        9.94        9.94
         East of England |     10,116       10.12       20.06
                  London |     19,943       19.94       40.00
              North East |      9,920        9.92       49.92
              North West |      9,870        9.87       59.79
              South East |     20,084       20.08       79.88
           West Midlands |     10,113       10.11       89.99
Yorkshire and the Humber |     10,012       10.01      100.00
-------------------------+-----------------------------------
                   Total |    100,000      100.00

. 
. ***IMD
. *Group into 5 groups
. rename imd imd_o

. egen imd = cut(imd_o), group(5) icodes 

. *Add one to create groups 1-5 
. replace imd = imd + 1
(100,000 real changes made)

. *-1 is missing, should be excluded from population 
. replace imd = .u if imd_o == -1
(0 real changes made)

. drop imd_o

. *Reverse the order (so high is more deprived)
. recode imd 5 = 1 4 = 2 3 = 3 2 = 4 1 = 5 .u = .u
(100000 changes made to imd)

. label define imd 1 "1 least deprived" 2 "2" 3 "3" 4 "4" 5 "5 most deprived" .u "Missing"

. label values imd imd 

. lab var imd "Index of multiple deprivation"

. tab imd, missing

        Index of |
        multiple |
     deprivation |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |     70,465       70.47       70.47
               4 |     19,593       19.59       90.06
 5 most deprived |      9,942        9.94      100.00
-----------------+-----------------------------------
           Total |    100,000      100.00

. 
. ***Age variables
. *Nb. works if ages 18 and over
. *Create categorised age
. drop if age<18 & age !=.
(21,176 observations deleted)

. drop if age>109 & age !=.
(0 observations deleted)

. drop if age==.
(0 observations deleted)

. lab var age "Age"

. 
. recode age 18/39.9999 = 1 /// 
>            40/49.9999 = 2 ///
>                    50/59.9999 = 3 ///
>                60/69.9999 = 4 ///
>                    70/79.9999 = 5 ///
>                    80/max = 6, gen(agegroup) 
(78824 differences between age and agegroup)

. 
. label define agegroup   1 "18-39" ///
>                                                 2 "40-49" ///
>                                                 3 "50-59" ///
>                                                 4 "60-69" ///
>                                                 5 "70-79" ///
>                                                 6 "80+"

.                                                 
. label values agegroup agegroup

. lab var agegroup "Age group"

. tab agegroup, missing

  Age group |      Freq.     Percent        Cum.
------------+-----------------------------------
      18-39 |     28,777       36.51       36.51
      40-49 |     12,770       16.20       52.71
      50-59 |     13,408       17.01       69.72
      60-69 |     10,474       13.29       83.01
      70-79 |      8,444       10.71       93.72
        80+ |      4,951        6.28      100.00
------------+-----------------------------------
      Total |     78,824      100.00

. 
. *Create binary age
. recode age min/69.999 = 0 ///
>            70/max = 1, gen(age70)
(78824 differences between age and age70)

. 
. *Create restricted cubic splines for age
. mkspline age = age, cubic nknots(4)

. 
. ***Body Mass Index
. *Recode strange values 
. replace bmi_value = . if bmi_value == 0 
(31,484 real changes made, 31,484 to missing)

. replace bmi_value = . if !inrange(bmi_value, 10, 80)
(302 real changes made, 302 to missing)

. 
. *Restrict to within 10 years of EIA diagnosis date and aged>16 
. gen bmi_time = (eia_code_date - bmi_date)/365.25
(31,930 missing values generated)

. gen bmi_age = age - bmi_time
(31,930 missing values generated)

. replace bmi_value = . if bmi_age < 16 
(33,297 real changes made, 33,297 to missing)

. replace bmi_value = . if bmi_time > 10 & bmi_time != . 
(8,918 real changes made, 8,918 to missing)

. 
. *Set to missing if no date, and vice versa 
. replace bmi_value = . if bmi_date == . 
(0 real changes made)

. replace bmi_date = . if bmi_value == . 
(42,517 real changes made, 42,517 to missing)

. replace bmi_time = . if bmi_value == . 
(42,514 real changes made, 42,514 to missing)

. replace bmi_age = . if bmi_value == . 
(42,514 real changes made, 42,514 to missing)

. 
. *Create BMI categories
. gen     bmicat = .
(78,824 missing values generated)

. recode  bmicat . = 1 if bmi_value < 18.5
(201 changes made to bmicat)

. recode  bmicat . = 2 if bmi_value < 25
(557 changes made to bmicat)

. recode  bmicat . = 3 if bmi_value < 30
(761 changes made to bmicat)

. recode  bmicat . = 4 if bmi_value < 35
(914 changes made to bmicat)

. recode  bmicat . = 5 if bmi_value < 40
(960 changes made to bmicat)

. recode  bmicat . = 6 if bmi_value < .
(1430 changes made to bmicat)

. replace bmicat = .u if bmi_value >= .
(74,001 real changes made, 74,001 to missing)

. 
. label define bmicat 1 "Underweight (<18.5)"     ///
>                                         2 "Normal (18.5-24.9)"          ///
>                                         3 "Overweight (25-29.9)"        ///
>                                         4 "Obese I (30-34.9)"           ///
>                                         5 "Obese II (35-39.9)"          ///
>                                         6 "Obese III (40+)"                     ///
>                                         .u "Missing"

.                                         
. label values bmicat bmicat

. lab var bmicat "BMI"

. tab bmicat, missing

                 BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |        201        0.25        0.25
  Normal (18.5-24.9) |        557        0.71        0.96
Overweight (25-29.9) |        761        0.97        1.93
   Obese I (30-34.9) |        914        1.16        3.09
  Obese II (35-39.9) |        960        1.22        4.30
     Obese III (40+) |      1,430        1.81        6.12
             Missing |     74,001       93.88      100.00
---------------------+-----------------------------------
               Total |     78,824      100.00

. 
. *Create less granular categorisation
. recode bmicat 1/3 .u = 1 4 = 2 5 = 3 6 = 4, gen(obese4cat)
(78623 differences between bmicat and obese4cat)

. 
. label define obese4cat  1 "No record of obesity"        ///
>                                                 2 "Obese I (30-34.9)"           ///
>                                                 3 "Obese II (35-39.9)"          ///
>                                                 4 "Obese III (40+)"             

. 
. label values obese4cat obese4cat

. order obese4cat, after(bmicat)

. 
. ***Smoking 
. label define smoke 1 "Never" 2 "Former" 3 "Current" .u "Missing"

. 
. gen     smoke = 1  if smoking_status == "N"
(70,984 missing values generated)

. replace smoke = 2  if smoking_status == "E"
(3,973 real changes made)

. replace smoke = 3  if smoking_status == "S"
(23,617 real changes made)

. replace smoke = .u if smoking_status == "M"
(3,935 real changes made, 3,935 to missing)

. replace smoke = .u if smoking_status == "" 
(39,459 real changes made, 39,459 to missing)

. 
. label values smoke smoke

. lab var smoke "Smoking status"

. drop smoking_status

. tab smoke, missing

    Smoking |
     status |      Freq.     Percent        Cum.
------------+-----------------------------------
      Never |      7,840        9.95        9.95
     Former |      3,973        5.04       14.99
    Current |     23,617       29.96       44.95
    Missing |     43,394       55.05      100.00
------------+-----------------------------------
      Total |     78,824      100.00

. 
. *Create non-missing 3-category variable for current smoking (assumes missing smoking is never smoking)
. recode smoke .u = 1, gen(smoke_nomiss)
(43394 differences between smoke and smoke_nomiss)

. order smoke_nomiss, after(smoke)

. label values smoke_nomiss smoke

. 
. **Clinical comorbidities
. ***eGFR
. *Set implausible creatinine values to missing (Note: zero changed to missing)
. replace creatinine_value = . if !inrange(creatinine_value, 20, 3000) 
(19,916 real changes made, 19,916 to missing)

. 
. *Remove creatinine dates if no measurements, and vice versa 
. replace creatinine_value = . if creatinine_date == . 
(0 real changes made)

. replace creatinine_date = . if creatinine_value == . 
(15,928 real changes made, 15,928 to missing)

. replace creatinine = . if creatinine_value == .
(19,916 real changes made, 19,916 to missing)

. recode creatinine .=0
(19916 changes made to creatinine)

. tab creatinine, missing

 creatinine |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     19,916       25.27       25.27
          1 |     58,908       74.73      100.00
------------+-----------------------------------
      Total |     78,824      100.00

. tabstat creatinine_value, stat(n mean p50)

    Variable |         N      Mean       p50
-------------+------------------------------
creatinin~ue |     58908  136.6007  126.3596
--------------------------------------------

. 
. *Divide by 88.4 (to convert umol/l to mg/dl) 
. gen SCr_adj = creatinine_value/88.4
(19,916 missing values generated)

. 
. gen min = .
(78,824 missing values generated)

. replace min = SCr_adj/0.7 if male==0
(30,071 real changes made)

. replace min = SCr_adj/0.9 if male==1
(28,837 real changes made)

. replace min = min^-0.329  if male==0
(30,071 real changes made)

. replace min = min^-0.411  if male==1
(28,837 real changes made)

. replace min = 1 if min<1
(46,074 real changes made)

. 
. gen max=.
(78,824 missing values generated)

. replace max=SCr_adj/0.7 if male==0
(30,071 real changes made)

. replace max=SCr_adj/0.9 if male==1
(28,837 real changes made)

. replace max=max^-1.209
(58,908 real changes made)

. replace max=1 if max>1
(32,750 real changes made)

. 
. gen egfr=min*max*141
(19,916 missing values generated)

. replace egfr=egfr*(0.993^age)
(58,908 real changes made)

. replace egfr=egfr*1.018 if male==0
(30,071 real changes made)

. label var egfr "egfr calculated using CKD-EPI formula with no ethnicity"

. 
. *Categorise into ckd stages
. egen egfr_cat_all = cut(egfr), at(0, 15, 30, 45, 60, 5000)
(19,916 missing values generated)

. recode egfr_cat_all 0 = 5 15 = 4 30 = 3 45 = 2 60 = 0, generate(ckd_egfr)
(58908 differences between egfr_cat_all and ckd_egfr)

. 
. gen egfr_cat = .
(78,824 missing values generated)

. recode egfr_cat . = 3 if egfr < 30
(13860 changes made to egfr_cat)

. recode egfr_cat . = 2 if egfr < 60
(20843 changes made to egfr_cat)

. recode egfr_cat . = 1 if egfr < .
(24205 changes made to egfr_cat)

. replace egfr_cat = .u if egfr >= .
(19,916 real changes made, 19,916 to missing)

. 
. label define egfr_cat   1 ">=60"                ///
>                                                 2 "30-59"               ///
>                                                 3 "<30"                 ///
>                                                 .u "Missing"

.                                         
. label values egfr_cat egfr_cat

. lab var egfr_cat "eGFR"

. tab egfr_cat, missing

       eGFR |      Freq.     Percent        Cum.
------------+-----------------------------------
       >=60 |     24,205       30.71       30.71
      30-59 |     20,843       26.44       57.15
        <30 |     13,860       17.58       74.73
    Missing |     19,916       25.27      100.00
------------+-----------------------------------
      Total |     78,824      100.00

. 
. *If missing eGFR, assume normal
. gen egfr_cat_nomiss = egfr_cat
(19,916 missing values generated)

. replace egfr_cat_nomiss = 1 if egfr_cat == .u
(19,916 real changes made)

. 
. label define egfr_cat_nomiss    1 ">=60/missing"        ///
>                                                                 2 "30-59"                       ///
>                                                                 3 "<30" 

. label values egfr_cat_nomiss egfr_cat_nomiss

. lab var egfr_cat_nomiss "eGFR"

. 
. gen egfr_date = creatinine_date
(19,916 missing values generated)

. format egfr_date %td

. 
. *Add in end stage renal failure and create a single CKD variable 
. *Missing assumed to not have CKD 
. gen ckd = 0

. replace ckd = 1 if ckd_egfr != . & ckd_egfr >= 1
(34,703 real changes made)

. replace ckd = 1 if esrf == 1
(8,665 real changes made)

. 
. label define ckd 0 "No CKD" 1 "CKD"

. label values ckd ckd

. label var ckd "Chronic kidney disease"

. tab ckd, missing

    Chronic |
     kidney |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
     No CKD |     35,456       44.98       44.98
        CKD |     43,368       55.02      100.00
------------+-----------------------------------
      Total |     78,824      100.00

. 
. *Create date (most recent measure prior to index)
. gen temp1_ckd_date = creatinine_date if ckd_egfr >=1
(44,121 missing values generated)

. gen temp2_ckd_date = esrf_date if esrf == 1
(63,079 missing values generated)

. gen ckd_date = max(temp1_ckd_date,temp2_ckd_date) 
(35,456 missing values generated)

. format ckd_date %td 

. 
. drop temp1_ckd_date temp2_ckd_date SCr_adj min max ckd_egfr egfr_cat_all

. 
. ***HbA1c
. *Set zero or negative to missing
. replace hba1c_percentage   = . if hba1c_percentage <= 0
(4,372 real changes made, 4,372 to missing)

. replace hba1c_mmol_per_mol = . if hba1c_mmol_per_mol <= 0
(5,648 real changes made, 5,648 to missing)

. 
. *Change implausible values to missing
. replace hba1c_percentage   = . if !inrange(hba1c_percentage, 1, 20)
(1,232 real changes made, 1,232 to missing)

. replace hba1c_mmol_per_mol = . if !inrange(hba1c_mmol_per_mol, 10, 200)
(3,252 real changes made, 3,252 to missing)

. 
. *Set most recent values of >24 months prior to EIA diagnosis date to missing
. replace hba1c_percentage   = . if (eia_code_date - hba1c_percentage_date) > 24*30 & hba1c_percentage_date != .
(70,738 real changes made, 70,738 to missing)

. replace hba1c_mmol_per_mol = . if (eia_code_date - hba1c_mmol_per_mol_date) > 24*30 & hba1c_mmol_per_mol_date != .
(67,589 real changes made, 67,589 to missing)

. 
. *Clean up dates
. replace hba1c_percentage_date = . if hba1c_percentage == .
(72,397 real changes made, 72,397 to missing)

. replace hba1c_mmol_per_mol_date = . if hba1c_mmol_per_mol == .
(72,507 real changes made, 72,507 to missing)

. 
. *Express  HbA1c as percentage
. *Express all values as perecentage 
. noi summ hba1c_percentage hba1c_mmol_per_mol 

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
hba1c_per~ge |      2,482    5.085768     1.87795   1.009219   12.15619
hba1c_mmol~l |      2,335    43.37589    17.49954   10.01952   120.3744

. gen     hba1c_pct = hba1c_percentage 
(76,342 missing values generated)

. replace hba1c_pct = (hba1c_mmol_per_mol/10.929)+2.15 if hba1c_mmol_per_mol<. 
(2,335 real changes made)

. 
. *Valid % range between 0-20  
. replace hba1c_pct = . if !inrange(hba1c_pct, 1, 20) 
(0 real changes made)

. replace hba1c_pct = round(hba1c_pct, 0.1)
(4,748 real changes made)

. 
. *Categorise HbA1c and diabetes
. *Group hba1c pct
. gen     hba1ccat = 0 if hba1c_pct <  6.5
(75,575 missing values generated)

. replace hba1ccat = 1 if hba1c_pct >= 6.5  & hba1c_pct < 7.5
(731 real changes made)

. replace hba1ccat = 2 if hba1c_pct >= 7.5  & hba1c_pct < 8
(292 real changes made)

. replace hba1ccat = 3 if hba1c_pct >= 8    & hba1c_pct < 9
(311 real changes made)

. replace hba1ccat = 4 if hba1c_pct >= 9    & hba1c_pct !=.
(165 real changes made)

. label define hba1ccat 0 "<6.5%" 1">=6.5-7.4" 2">=7.5-7.9" 3">=8-8.9" 4">=9"

. label values hba1ccat hba1ccat

. tab hba1ccat, missing

   hba1ccat |      Freq.     Percent        Cum.
------------+-----------------------------------
      <6.5% |      3,249        4.12        4.12
  >=6.5-7.4 |        731        0.93        5.05
  >=7.5-7.9 |        292        0.37        5.42
    >=8-8.9 |        311        0.39        5.81
        >=9 |        165        0.21        6.02
          . |     74,076       93.98      100.00
------------+-----------------------------------
      Total |     78,824      100.00

. 
. *Express all values as mmol
. gen hba1c_mmol = hba1c_mmol_per_mol
(76,489 missing values generated)

. replace hba1c_mmol = (hba1c_percentage*10.929)-23.5 if hba1c_percentage<. & hba1c_mmol==.
(2,413 real changes made)

. 
. *Group hba1c mmol
. gen     hba1ccatmm = 0 if hba1c_mmol < 58
(74,840 missing values generated)

. replace hba1ccatmm = 1 if hba1c_mmol >= 58 & hba1c_mmol !=.
(764 real changes made)

. replace hba1ccatmm =.u if hba1ccatmm==. 
(74,076 real changes made, 74,076 to missing)

. label define hba1ccatmm 0 "HbA1c <58mmol/mol" 1 "HbA1c >=58mmol/mol" .u "Missing"

. label values hba1ccatmm hba1ccatmm

. lab var hba1ccatmm "HbA1c"

. tab hba1ccatmm, missing

             HbA1c |      Freq.     Percent        Cum.
-------------------+-----------------------------------
 HbA1c <58mmol/mol |      3,984        5.05        5.05
HbA1c >=58mmol/mol |        764        0.97        6.02
           Missing |     74,076       93.98      100.00
-------------------+-----------------------------------
             Total |     78,824      100.00

. 
. *Create diabetes, split by control/not (assumes missing = no diabetes)
. gen     diabcat = 1 if diabetes==0
(15,844 missing values generated)

. replace diabcat = 2 if diabetes==1 & inlist(hba1ccat, 0, 1)
(769 real changes made)

. replace diabcat = 3 if diabetes==1 & inlist(hba1ccat, 2, 3, 4)
(144 real changes made)

. replace diabcat = 4 if diabetes==1 & !inlist(hba1ccat, 0, 1, 2, 3, 4)
(14,931 real changes made)

. 
. label define diabcat    1 "No diabetes"                         ///
>                                                 2 "Controlled diabetes"         ///
>                                                 3 "Uncontrolled diabetes"       ///
>                                                 4 "Diabetes, no hba1c measure"

. label values diabcat diabcat

. 
. *Create cancer variable 'other cancer currently', includes carcinoma of the head and neck - need to confirm if this excludes NMSC
. gen cancer =0

. replace cancer =1 if lung_cancer ==1 | haem_cancer ==1 | other_cancer ==1
(38,553 real changes made)

. lab var cancer "Cancer"

. tab cancer, missing

     Cancer |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     40,271       51.09       51.09
          1 |     38,553       48.91      100.00
------------+-----------------------------------
      Total |     78,824      100.00

. 
. *Create other comorbid variables
. gen combined_cv_comorbid =1 if chronic_cardiac_disease ==1 | stroke==1
(50,461 missing values generated)

. recode combined_cv_comorbid .=0
(50461 changes made to combined_cv_comorbid)

. 
. *Delete unneeded variables
. drop hba1c_pct hba1c_percentage hba1c_mmol_per_mol

. 
. *Label variables
. lab var hypertension "Hypertension"

. lab var diabetes "Diabetes"

. lab var stroke "Stroke"

. lab var chronic_resp_disease "Chronic respiratory disease"

. lab var copd "COPD"

. lab var esrf "End-stage renal failure"

. lab var chronic_liver_disease "Chronic liver disease"

. lab var chronic_cardiac_disease "Chronic cardiac disease"

. 
. *Refine diagnostic window=============================================================*/
. 
. **All patients should have EIA code
. tab eia_code, missing

   eia_code |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        783        0.99        0.99
          1 |     78,041       99.01      100.00
------------+-----------------------------------
      Total |     78,824      100.00

. keep if eia_code==1
(783 observations deleted)

. 
. **Keep patients with first EIA code in GP record if code was after 1st March 2019
. keep if eia_code_date>=date("$start_date", "DMY") & eia_code_date!=. 
(18,256 observations deleted)

. tab eia_code

   eia_code |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     59,785      100.00      100.00
------------+-----------------------------------
      Total |     59,785      100.00

. 
. **Month/Year of EIA code
. gen year_diag=year(eia_code_date)

. format year_diag %ty

. gen month_diag=month(eia_code_date)

. gen mo_year_diagn=ym(year_diag, month_diag)

. format mo_year_diagn %tm

. 
. *Include only most recent EIA sub-diagnosis=============================================*/
. 
. replace ra_code =0 if psa_code_date >= ra_code_date & psa_code_date !=.
(29,364 real changes made)

. replace ra_code =0 if anksp_code_date >= ra_code_date & anksp_code_date !=.
(9,799 real changes made)

. replace psa_code =0 if ra_code_date >= psa_code_date & ra_code_date !=.
(29,288 real changes made)

. replace psa_code =0 if anksp_code_date >= psa_code_date & anksp_code_date !=.
(9,983 real changes made)

. replace anksp_code =0 if psa_code_date >= anksp_code_date & psa_code_date !=.
(29,384 real changes made)

. replace anksp_code =0 if ra_code_date >= anksp_code_date & ra_code_date !=.
(10,063 real changes made)

. gen eia_diagnosis=1 if ra_code==1
(39,749 missing values generated)

. replace eia_diagnosis=2 if psa_code==1
(19,925 real changes made)

. replace eia_diagnosis=3 if anksp_code==1
(19,753 real changes made)

. lab define eia_diagnosis 1 "RA" 2 "PsA" 3 "AxSpA", modify

. lab val eia_diagnosis eia_diagnosis

. tab eia_diagnosis, missing

eia_diagnos |
         is |      Freq.     Percent        Cum.
------------+-----------------------------------
         RA |     20,036       33.51       33.51
        PsA |     19,925       33.33       66.84
      AxSpA |     19,753       33.04       99.88
          . |         71        0.12      100.00
------------+-----------------------------------
      Total |     59,785      100.00

. drop if eia_diagnosis==.
(71 observations deleted)

. 
. *Define drugs and dates=====================================================*/
. 
. **csDMARDs (not including high cost MTX; wouldn't be shared care)
. gen csdmard=1 if hydroxychloroquine==1 | leflunomide==1 | methotrexate==1 | methotrexate_inj==1 | sulfasalazine==1
(35,346 missing values generated)

. recode csdmard .=0 
(35346 changes made to csdmard)

. tab csdmard, missing

    csdmard |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     35,346       59.19       59.19
          1 |     24,368       40.81      100.00
------------+-----------------------------------
      Total |     59,714      100.00

. bys eia_diagnosis: tab csdmard

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

    csdmard |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     11,806       58.92       58.92
          1 |      8,230       41.08      100.00
------------+-----------------------------------
      Total |     20,036      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    csdmard |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     11,880       59.62       59.62
          1 |      8,045       40.38      100.00
------------+-----------------------------------
      Total |     19,925      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    csdmard |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     11,660       59.03       59.03
          1 |      8,093       40.97      100.00
------------+-----------------------------------
      Total |     19,753      100.00


. 
. **csDMARDs (including high cost MTX)
. gen csdmard_hcd=1 if hydroxychloroquine==1 | leflunomide==1 | methotrexate==1 | methotrexate_inj==1 | methotrexate_hcd==1 | sulfasalazine==1
(31,761 missing values generated)

. recode csdmard_hcd .=0 
(31761 changes made to csdmard_hcd)

. tab csdmard_hcd, missing

csdmard_hcd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     31,761       53.19       53.19
          1 |     27,953       46.81      100.00
------------+-----------------------------------
      Total |     59,714      100.00

. bys eia_diagnosis: tab csdmard_hcd, missing

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

csdmard_hcd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,593       52.87       52.87
          1 |      9,443       47.13      100.00
------------+-----------------------------------
      Total |     20,036      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

csdmard_hcd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,660       53.50       53.50
          1 |      9,265       46.50      100.00
------------+-----------------------------------
      Total |     19,925      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

csdmard_hcd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,508       53.20       53.20
          1 |      9,245       46.80      100.00
------------+-----------------------------------
      Total |     19,753      100.00


. 
. **Date of first csDMARD script (not including high cost MTX prescriptions)
. gen csdmard_date=min(hydroxychloroquine_date, leflunomide_date, methotrexate_date, methotrexate_inj_date, sulfasalazine_date)
(35,346 missing values generated)

. format %td csdmard_date

. 
. **Date of first csDMARD script (including high cost MTX prescriptions)
. gen csdmard_hcd_date=min(hydroxychloroquine_date, leflunomide_date, methotrexate_date, methotrexate_inj_date, methotrexate_hcd_date, sulfasalazine_date)
(31,761 missing values generated)

. format %td csdmard_hcd_date

. 
. **Biologic use
. gen biologic=1 if abatacept==1 | adalimumab==1 | baricitinib==1 | certolizumab==1 | etanercept==1 | golimumab==1 | guselkumab==1 | infliximab==1 | ixekizumab==1 | rituximab==1 | sarilumab==1 | secukinumab==1 | tocilizumab
> ==1 | tofacitinib==1 | upadacitinib==1 | ustekinumab==1 
(11,062 missing values generated)

. recode biologic .=0
(11062 changes made to biologic)

. tab biologic, missing

   biologic |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     11,062       18.52       18.52
          1 |     48,652       81.48      100.00
------------+-----------------------------------
      Total |     59,714      100.00

. bys eia_diagnosis: tab biologic, missing 

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

   biologic |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,686       18.40       18.40
          1 |     16,350       81.60      100.00
------------+-----------------------------------
      Total |     20,036      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

   biologic |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,671       18.42       18.42
          1 |     16,254       81.58      100.00
------------+-----------------------------------
      Total |     19,925      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

   biologic |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,705       18.76       18.76
          1 |     16,048       81.24      100.00
------------+-----------------------------------
      Total |     19,753      100.00


. 
. **Date of first biologic script
. gen biologic_date=min(abatacept_date, adalimumab_date, baricitinib_date, certolizumab_date, etanercept_date, golimumab_date, guselkumab_date, infliximab_date, ixekizumab_date, rituximab_date, sarilumab_date, secukinumab_d
> ate, tocilizumab_date, tofacitinib_date, upadacitinib_date, ustekinumab_date)
(11,062 missing values generated)

. format %td biologic_date

. 
. **Exclude if first csdmard or biologic was before first rheum appt
. ***Nb. could introduce leeway e.g. 30 days?
. tab csdmard if rheum_appt_date!=. & csdmard_date!=. & csdmard_date<rheum_appt_date

    csdmard |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      8,957      100.00      100.00
------------+-----------------------------------
      Total |      8,957      100.00

. drop if rheum_appt_date!=. & csdmard_date!=. & csdmard_date<rheum_appt_date
(8,957 observations deleted)

. tab biologic if rheum_appt_date!=. & biologic_date!=. & biologic_date<rheum_appt_date 

   biologic |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     15,414      100.00      100.00
------------+-----------------------------------
      Total |     15,414      100.00

. drop if rheum_appt_date!=. & biologic_date!=. & biologic_date<rheum_appt_date 
(15,414 observations deleted)

. 
. *Number of EIA diagnoses in 1-year time windows=========================================*/
. 
. gen diagnosis_year=1 if eia_code_date>=td(01mar2019) & eia_code_date<td(01mar2020)
(23,937 missing values generated)

. replace diagnosis_year=2 if eia_code_date>=td(01mar2020) & eia_code_date<td(01mar2021)
(11,173 real changes made)

. replace diagnosis_year=3 if eia_code_date>=td(01mar2021) & eia_code_date<td(01mar2022)
(11,129 real changes made)

. lab define diagnosis_year 1 "March 2019-March 2020" 2 "March 2020-March 2021" 3 "March 2021-March 2022", modify

. lab val diagnosis_year diagnosis_year

. lab var diagnosis_year "Year of diagnosis"

. tab diagnosis_year, missing

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |     11,406       32.27       32.27
March 2020-March 2021 |     11,173       31.61       63.89
March 2021-March 2022 |     11,129       31.49       95.37
                    . |      1,635        4.63      100.00
----------------------+-----------------------------------
                Total |     35,343      100.00

. bys eia_diagnosis: tab diagnosis_year, missing

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |      3,823       32.24       32.24
March 2020-March 2021 |      3,829       32.29       64.54
March 2021-March 2022 |      3,669       30.94       95.48
                    . |        536        4.52      100.00
----------------------+-----------------------------------
                Total |     11,857      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |      3,854       32.54       32.54
March 2020-March 2021 |      3,691       31.16       63.70
March 2021-March 2022 |      3,743       31.60       95.30
                    . |        557        4.70      100.00
----------------------+-----------------------------------
                Total |     11,845      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |      3,729       32.03       32.03
March 2020-March 2021 |      3,653       31.38       63.41
March 2021-March 2022 |      3,717       31.93       95.34
                    . |        542        4.66      100.00
----------------------+-----------------------------------
                Total |     11,641      100.00


. 
. **Proportion of patients with at least 6 or 12 months of GP follow-up after EIA code
. tab has_6m_follow_up

has_6m_foll |
      ow_up |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,782        5.04        5.04
          1 |     33,561       94.96      100.00
------------+-----------------------------------
      Total |     35,343      100.00

. tab has_12m_follow_up

has_12m_fol |
     low_up |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,622       10.25       10.25
          1 |     31,721       89.75      100.00
------------+-----------------------------------
      Total |     35,343      100.00

. tab mo_year_diagn has_6m_follow_up

mo_year_di |   has_6m_follow_up
       agn |         0          1 |     Total
-----------+----------------------+----------
    2019m3 |        53        950 |     1,003 
    2019m4 |        36        904 |       940 
    2019m5 |        46        946 |       992 
    2019m6 |        53        916 |       969 
    2019m7 |        65        869 |       934 
    2019m8 |        53        952 |     1,005 
    2019m9 |        41        872 |       913 
   2019m10 |        36        903 |       939 
   2019m11 |        48        897 |       945 
   2019m12 |        41        927 |       968 
    2020m1 |        39        886 |       925 
    2020m2 |        55        818 |       873 
    2020m3 |        45        888 |       933 
    2020m4 |        37        836 |       873 
    2020m5 |        38        918 |       956 
    2020m6 |        56        857 |       913 
    2020m7 |        43        909 |       952 
    2020m8 |        47        923 |       970 
    2020m9 |        45        901 |       946 
   2020m10 |        49        921 |       970 
   2020m11 |        40        882 |       922 
   2020m12 |        57        884 |       941 
    2021m1 |        38        932 |       970 
    2021m2 |        47        780 |       827 
    2021m3 |        51        914 |       965 
    2021m4 |        44        884 |       928 
    2021m5 |        52        876 |       928 
    2021m6 |        45        899 |       944 
    2021m7 |        58        933 |       991 
    2021m8 |        47        872 |       919 
    2021m9 |        61        867 |       928 
   2021m10 |        55        892 |       947 
   2021m11 |        45        841 |       886 
   2021m12 |        44        877 |       921 
    2022m1 |        52        887 |       939 
    2022m2 |        51        782 |       833 
    2022m3 |        36        948 |       984 
    2022m4 |        33        618 |       651 
-----------+----------------------+----------
     Total |     1,782     33,561 |    35,343 

. tab mo_year_diagn has_12m_follow_up

mo_year_di |   has_12m_follow_up
       agn |         0          1 |     Total
-----------+----------------------+----------
    2019m3 |        95        908 |     1,003 
    2019m4 |       108        832 |       940 
    2019m5 |       103        889 |       992 
    2019m6 |        86        883 |       969 
    2019m7 |        95        839 |       934 
    2019m8 |       113        892 |     1,005 
    2019m9 |        96        817 |       913 
   2019m10 |        94        845 |       939 
   2019m11 |        83        862 |       945 
   2019m12 |       106        862 |       968 
    2020m1 |        78        847 |       925 
    2020m2 |        81        792 |       873 
    2020m3 |        96        837 |       933 
    2020m4 |        98        775 |       873 
    2020m5 |        92        864 |       956 
    2020m6 |        91        822 |       913 
    2020m7 |       100        852 |       952 
    2020m8 |       111        859 |       970 
    2020m9 |       105        841 |       946 
   2020m10 |       100        870 |       970 
   2020m11 |        96        826 |       922 
   2020m12 |       107        834 |       941 
    2021m1 |        91        879 |       970 
    2021m2 |        90        737 |       827 
    2021m3 |       100        865 |       965 
    2021m4 |        94        834 |       928 
    2021m5 |        87        841 |       928 
    2021m6 |       110        834 |       944 
    2021m7 |        99        892 |       991 
    2021m8 |       104        815 |       919 
    2021m9 |        87        841 |       928 
   2021m10 |        94        853 |       947 
   2021m11 |        94        792 |       886 
   2021m12 |        86        835 |       921 
    2022m1 |        98        841 |       939 
    2022m2 |        88        745 |       833 
    2022m3 |       101        883 |       984 
    2022m4 |        65        586 |       651 
-----------+----------------------+----------
     Total |     3,622     31,721 |    35,343 

. tab diagnosis_year if has_6m_follow_up==1, missing

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |     10,840       32.30       32.30
March 2020-March 2021 |     10,631       31.68       63.98
March 2021-March 2022 |     10,524       31.36       95.33
                    . |      1,566        4.67      100.00
----------------------+-----------------------------------
                Total |     33,561      100.00

. bys eia_diagnosis: tab diagnosis_year if has_6m_follow_up==1, missing

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |      3,641       32.27       32.27
March 2020-March 2021 |      3,653       32.37       64.64
March 2021-March 2022 |      3,479       30.83       95.47
                    . |        511        4.53      100.00
----------------------+-----------------------------------
                Total |     11,284      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |      3,641       32.49       32.49
March 2020-March 2021 |      3,501       31.24       63.72
March 2021-March 2022 |      3,533       31.52       95.24
                    . |        533        4.76      100.00
----------------------+-----------------------------------
                Total |     11,208      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |      3,558       32.14       32.14
March 2020-March 2021 |      3,477       31.41       63.56
March 2021-March 2022 |      3,512       31.73       95.28
                    . |        522        4.72      100.00
----------------------+-----------------------------------
                Total |     11,069      100.00


. tab diagnosis_year if has_12m_follow_up==1, missing

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |     10,268       32.37       32.37
March 2020-March 2021 |      9,996       31.51       63.88
March 2021-March 2022 |      9,988       31.49       95.37
                    . |      1,469        4.63      100.00
----------------------+-----------------------------------
                Total |     31,721      100.00

. bys eia_diagnosis: tab diagnosis_year if has_12m_follow_up==1, missing

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |      3,410       32.18       32.18
March 2020-March 2021 |      3,407       32.15       64.32
March 2021-March 2022 |      3,302       31.16       95.48
                    . |        479        4.52      100.00
----------------------+-----------------------------------
                Total |     10,598      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |      3,469       32.59       32.59
March 2020-March 2021 |      3,314       31.13       63.72
March 2021-March 2022 |      3,351       31.48       95.20
                    . |        511        4.80      100.00
----------------------+-----------------------------------
                Total |     10,645      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |      3,389       32.34       32.34
March 2020-March 2021 |      3,275       31.26       63.60
March 2021-March 2022 |      3,335       31.83       95.43
                    . |        479        4.57      100.00
----------------------+-----------------------------------
                Total |     10,478      100.00


. 
. *Define appointments and referrals======================================*/
. **Nb. not excluding those without 6m+ follow-up
. 
. **Rheumatology appt 
. tab rheum_appt  //proportion with first rheum outpatient date in the year before EIA code appears in GP record (could change to two years)

 rheum_appt |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,005       16.99       16.99
          1 |     29,338       83.01      100.00
------------+-----------------------------------
      Total |     35,343      100.00

. tab rheum_appt if rheum_appt_date<eia_code_date & rheum_appt_date!=. //confirm proportion who had rheum appt (i.e. not missing) and appt before EIA code (should be accounted for by Python code)

 rheum_appt |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     23,772      100.00      100.00
------------+-----------------------------------
      Total |     23,772      100.00

. 
. **Rheumatology referrals
. tab referral_rheum_prerheum //last rheum referral in the year before rheumatology outpatient (requires rheum appt to have been present, and rheum appt to be before EIA code)

referral_rh |
eum_prerheu |
          m |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,521        9.96        9.96
          1 |     31,822       90.04      100.00
------------+-----------------------------------
      Total |     35,343      100.00

. tab referral_rheum_prerheum if rheum_appt!=0  //last rheum referral in the year before rheumatology outpatient if rheum appt date present

referral_rh |
eum_prerheu |
          m |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,936       10.01       10.01
          1 |     26,402       89.99      100.00
------------+-----------------------------------
      Total |     29,338      100.00

. tab referral_rheum_prerheum if rheum_appt!=0 & referral_rheum_prerheum_date<rheum_appt_date  //last rheum referral in the year before rheumatology outpatient, assuming ref date before rheum appt date (should be accounted 
> for by Python code)

referral_rh |
eum_prerheu |
          m |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      8,484      100.00      100.00
------------+-----------------------------------
      Total |      8,484      100.00

. tab referral_rheum_precode //last rheum referral in the year before EIA code (could use if rheum appt missing)

referral_rh |
eum_precode |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,542       10.02       10.02
          1 |     31,801       89.98      100.00
------------+-----------------------------------
      Total |     35,343      100.00

. gen referral_rheum_comb_date = referral_rheum_prerheum_date if referral_rheum_prerheum_date!=.
(3,521 missing values generated)

. replace referral_rheum_comb_date = referral_rheum_precode_date if referral_rheum_prerheum_date==. & referral_rheum_precode_date!=.
(3,146 real changes made)

. format %td referral_rheum_comb_date

. codebook referral_rheum_comb_date

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
referral_rheum_comb_date                                                                                                                                                                                            (unlabeled)
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

                  Type: Numeric daily date (float)

                 Range: [21260,22756]                 Units: 1
       Or equivalently: [17mar2018,21apr2022]         Units: days
         Unique values: 1,497                     Missing .: 375/35,343

                  Mean: 22009.8 = 04apr2020(+ 20 hours)
             Std. dev.: 431.975
           Percentiles:       10%        25%        50%        75%        90%
                            21409      21634      22013      22384      22606
                        13aug2018  26mar2019  08apr2020  14apr2021  22nov2021

. 
. **GP appointments
. tab last_gp_refrheum //proportion with last GP appointment in year before rheum referral (pre-rheum appt); requires there to have been a rheum referral, before a rheum appt, before an EIA code

last_gp_ref |
      rheum |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,531        9.99        9.99
          1 |     31,812       90.01      100.00
------------+-----------------------------------
      Total |     35,343      100.00

. gen all_appts=1 if last_gp_refrheum==1 & referral_rheum_prerheum==1 & rheum_appt==1 & eia_code==1 & last_gp_refrheum_date<referral_rheum_prerheum_date & referral_rheum_prerheum_date<rheum_appt_date & rheum_appt_date<eia_c
> ode_date 
(34,446 missing values generated)

. recode all_appts .=0
(34446 changes made to all_appts)

. tab all_appts, missing //KEY - proportion who had a last gp appt, then rheum ref, then rheum appt, then EIA code 

  all_appts |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     34,446       97.46       97.46
          1 |        897        2.54      100.00
------------+-----------------------------------
      Total |     35,343      100.00

. tab last_gp_refcode //last GP appointment before rheum ref (i.e. pre-eia code ref); requires there to have been a rheum referral before an EIA code (i.e. rheum appt could have been missing)

last_gp_ref |
       code |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,468        9.81        9.81
          1 |     31,875       90.19      100.00
------------+-----------------------------------
      Total |     35,343      100.00

. tab last_gp_prerheum //last GP appointment before rheum appt; requires there to have been a rheum appt before and EIA code

last_gp_pre |
      rheum |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,500        9.90        9.90
          1 |     31,843       90.10      100.00
------------+-----------------------------------
      Total |     35,343      100.00

. tab last_gp_precode //last GP appointment before EIA code

last_gp_pre |
       code |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,558       10.07       10.07
          1 |     31,785       89.93      100.00
------------+-----------------------------------
      Total |     35,343      100.00

. 
. **For sensitivity analyses for those without rheum_appt, replace diagnosis date as EIA code date if rheum appt pre-code is missing or after
. gen eia_diagnosis_date_nomiss=rheum_appt_date if rheum_appt_date!=.
(6,005 missing values generated)

. format %td eia_diagnosis_date_nomiss

. replace eia_diagnosis_date_nomiss=eia_code_date if (rheum_appt_date==. | rheum_appt_date>eia_code_date) & eia_code_date!=.
(11,545 real changes made)

. gen eia_diagnosis_nomiss=1 if eia_diagnosis_date_nomiss!=.

. recode eia_diagnosis_nomiss .=0
(0 changes made to eia_diagnosis_nomiss)

. tab eia_diagnosis_nomiss

eia_diagnos |
  is_nomiss |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     35,343      100.00      100.00
------------+-----------------------------------
      Total |     35,343      100.00

. 
. *Time to referral, appointment and EIA code=============================================*/
. 
. **Time from last GP to rheum ref before rheum appt (i.e. if appts are present and in correct time order) //Note - referral could (in theory) be coded just before GP appt
. gen time_gp_rheum_ref_appt = (referral_rheum_prerheum_date - last_gp_refrheum_date) if referral_rheum_prerheum_date!=. & last_gp_refrheum_date!=. & rheum_appt_date!=. & referral_rheum_prerheum_date>last_gp_refrheum_date &
>  referral_rheum_prerheum_date<rheum_appt_date & rheum_appt_date<eia_code_date
(34,446 missing values generated)

. tabstat time_gp_rheum_ref_appt, stats (n mean p50 p25 p75) //all patients (should be same number as all_appts)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~t |       897  237.4459       182        88       332
----------------------------------------------------------------

. bys eia_diagnosis: tabstat time_gp_rheum_ref_appt, stats (n mean p50 p25 p75) //by eia diagnosis

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~t |       308  216.8669       169      77.5       305
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~t |       316  249.7152     189.5        92     342.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~t |       273  246.4615       193        92       355
----------------------------------------------------------------

. bys diagnosis_year: tabstat time_gp_rheum_ref_appt, stats (n mean p50 p25 p75) //by diagnosis year

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~t |        91  138.7253       116        44       194
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~t |       259  203.9305       175        78       281
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~t |       454  259.2137       195        94       371
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~t |        93  321.1183       247       110       486
----------------------------------------------------------------

. bys nuts_region: tabstat time_gp_rheum_ref_appt, stats (n mean p50 p25 p75) //by region

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~t |        94  239.8085       172        99       322
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~t |        91  252.1099       201        76       326
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~t |       175  251.4286       194        88       366
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~t |       103  229.5922       164        81       393
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~t |        82  232.7195       169        89       310
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~t |       174  222.4655     176.5        84       295
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~t |        94  232.1489       182        90       318
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~t |        84  240.9881       181       100     314.5
----------------------------------------------------------------

. 
. gen gp_ref_cat=1 if time_gp_rheum_ref_appt<=3 & time_gp_rheum_ref_appt!=. 
(35,334 missing values generated)

. replace gp_ref_cat=2 if time_gp_rheum_ref_appt<=7 & time_gp_rheum_ref_appt!=. & gp_ref_cat==.
(12 real changes made)

. replace gp_ref_cat=3 if time_gp_rheum_ref_appt>7 & time_gp_rheum_ref_appt!=. & gp_ref_cat==.
(876 real changes made)

. lab define gp_ref_cat 1 "Referred within 3 days" 2 "Referred within 7 days" 3 "Referral delay >7 days", modify

. lab val gp_ref_cat gp_ref_cat

. lab var gp_ref_cat "Time to GP referral"

. tab gp_ref_cat, missing

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          9        0.03        0.03
Referred within 7 days |         12        0.03        0.06
Referral delay >7 days |        876        2.48        2.54
                     . |     34,446       97.46      100.00
-----------------------+-----------------------------------
                 Total |     35,343      100.00

. tab gp_ref_cat

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          9        1.00        1.00
Referred within 7 days |         12        1.34        2.34
Referral delay >7 days |        876       97.66      100.00
-----------------------+-----------------------------------
                 Total |        897      100.00

. bys eia_diagnosis: tab gp_ref_cat, missing

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          3        0.03        0.03
Referred within 7 days |          5        0.04        0.07
Referral delay >7 days |        300        2.53        2.60
                     . |     11,549       97.40      100.00
-----------------------+-----------------------------------
                 Total |     11,857      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          3        0.03        0.03
Referred within 7 days |          5        0.04        0.07
Referral delay >7 days |        308        2.60        2.67
                     . |     11,529       97.33      100.00
-----------------------+-----------------------------------
                 Total |     11,845      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          3        0.03        0.03
Referred within 7 days |          2        0.02        0.04
Referral delay >7 days |        268        2.30        2.35
                     . |     11,368       97.65      100.00
-----------------------+-----------------------------------
                 Total |     11,641      100.00


. bys eia_diagnosis: tab gp_ref_cat

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          3        0.97        0.97
Referred within 7 days |          5        1.62        2.60
Referral delay >7 days |        300       97.40      100.00
-----------------------+-----------------------------------
                 Total |        308      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          3        0.95        0.95
Referred within 7 days |          5        1.58        2.53
Referral delay >7 days |        308       97.47      100.00
-----------------------+-----------------------------------
                 Total |        316      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          3        1.10        1.10
Referred within 7 days |          2        0.73        1.83
Referral delay >7 days |        268       98.17      100.00
-----------------------+-----------------------------------
                 Total |        273      100.00


. bys diagnosis_year: tab gp_ref_cat, missing

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          2        0.02        0.02
Referred within 7 days |          2        0.02        0.04
Referral delay >7 days |         87        0.76        0.80
                     . |     11,315       99.20      100.00
-----------------------+-----------------------------------
                 Total |     11,406      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          2        0.02        0.02
Referred within 7 days |          5        0.04        0.06
Referral delay >7 days |        252        2.26        2.32
                     . |     10,914       97.68      100.00
-----------------------+-----------------------------------
                 Total |     11,173      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          5        0.04        0.04
Referred within 7 days |          5        0.04        0.09
Referral delay >7 days |        444        3.99        4.08
                     . |     10,675       95.92      100.00
-----------------------+-----------------------------------
                 Total |     11,129      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referral delay >7 days |         93        5.69        5.69
                     . |      1,542       94.31      100.00
-----------------------+-----------------------------------
                 Total |      1,635      100.00


. bys diagnosis_year: tab gp_ref_cat

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          2        2.20        2.20
Referred within 7 days |          2        2.20        4.40
Referral delay >7 days |         87       95.60      100.00
-----------------------+-----------------------------------
                 Total |         91      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          2        0.77        0.77
Referred within 7 days |          5        1.93        2.70
Referral delay >7 days |        252       97.30      100.00
-----------------------+-----------------------------------
                 Total |        259      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          5        1.10        1.10
Referred within 7 days |          5        1.10        2.20
Referral delay >7 days |        444       97.80      100.00
-----------------------+-----------------------------------
                 Total |        454      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referral delay >7 days |         93      100.00      100.00
-----------------------+-----------------------------------
                 Total |         93      100.00


. bys nuts_region: tab gp_ref_cat, missing

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        0.03        0.03
Referred within 7 days |          3        0.09        0.11
Referral delay >7 days |         90        2.57        2.69
                     . |      3,403       97.31      100.00
-----------------------+-----------------------------------
                 Total |      3,497      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        0.03        0.03
Referred within 7 days |          1        0.03        0.06
Referral delay >7 days |         89        2.49        2.54
                     . |      3,487       97.46      100.00
-----------------------+-----------------------------------
                 Total |      3,578      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 7 days |          3        0.04        0.04
Referral delay >7 days |        172        2.45        2.50
                     . |      6,832       97.50      100.00
-----------------------+-----------------------------------
                 Total |      7,007      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          3        0.09        0.09
Referred within 7 days |          1        0.03        0.11
Referral delay >7 days |         99        2.81        2.93
                     . |      3,415       97.07      100.00
-----------------------+-----------------------------------
                 Total |      3,518      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referral delay >7 days |         82        2.33        2.33
                     . |      3,439       97.67      100.00
-----------------------+-----------------------------------
                 Total |      3,521      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        0.01        0.01
Referred within 7 days |          3        0.04        0.06
Referral delay >7 days |        170        2.38        2.44
                     . |      6,961       97.56      100.00
-----------------------+-----------------------------------
                 Total |      7,135      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          3        0.08        0.08
Referred within 7 days |          1        0.03        0.11
Referral delay >7 days |         90        2.52        2.63
                     . |      3,483       97.37      100.00
-----------------------+-----------------------------------
                 Total |      3,577      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referral delay >7 days |         84        2.39        2.39
                     . |      3,426       97.61      100.00
-----------------------+-----------------------------------
                 Total |      3,510      100.00


. bys nuts_region: tab gp_ref_cat

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        1.06        1.06
Referred within 7 days |          3        3.19        4.26
Referral delay >7 days |         90       95.74      100.00
-----------------------+-----------------------------------
                 Total |         94      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        1.10        1.10
Referred within 7 days |          1        1.10        2.20
Referral delay >7 days |         89       97.80      100.00
-----------------------+-----------------------------------
                 Total |         91      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 7 days |          3        1.71        1.71
Referral delay >7 days |        172       98.29      100.00
-----------------------+-----------------------------------
                 Total |        175      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          3        2.91        2.91
Referred within 7 days |          1        0.97        3.88
Referral delay >7 days |         99       96.12      100.00
-----------------------+-----------------------------------
                 Total |        103      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referral delay >7 days |         82      100.00      100.00
-----------------------+-----------------------------------
                 Total |         82      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        0.57        0.57
Referred within 7 days |          3        1.72        2.30
Referral delay >7 days |        170       97.70      100.00
-----------------------+-----------------------------------
                 Total |        174      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          3        3.19        3.19
Referred within 7 days |          1        1.06        4.26
Referral delay >7 days |         90       95.74      100.00
-----------------------+-----------------------------------
                 Total |         94      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referral delay >7 days |         84      100.00      100.00
-----------------------+-----------------------------------
                 Total |         84      100.00


. 
. gen gp_ref_3d=1 if time_gp_rheum_ref_appt<=3 & time_gp_rheum_ref_appt!=. 
(35,334 missing values generated)

. replace gp_ref_3d=2 if time_gp_rheum_ref_appt>3 & time_gp_rheum_ref_appt!=.
(888 real changes made)

. lab define gp_ref_3d 1 "Referred within 3 days" 2 "Referral delay >3 days", modify

. lab val gp_ref_3d gp_ref_3d

. lab var gp_ref_3d "Time to GP referral"

. tab gp_ref_3d, missing

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          9        0.03        0.03
Referral delay >3 days |        888        2.51        2.54
                     . |     34,446       97.46      100.00
-----------------------+-----------------------------------
                 Total |     35,343      100.00

. tab gp_ref_3d

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          9        1.00        1.00
Referral delay >3 days |        888       99.00      100.00
-----------------------+-----------------------------------
                 Total |        897      100.00

. bys eia_diagnosis: tab gp_ref_3d, missing

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          3        0.03        0.03
Referral delay >3 days |        305        2.57        2.60
                     . |     11,549       97.40      100.00
-----------------------+-----------------------------------
                 Total |     11,857      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          3        0.03        0.03
Referral delay >3 days |        313        2.64        2.67
                     . |     11,529       97.33      100.00
-----------------------+-----------------------------------
                 Total |     11,845      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          3        0.03        0.03
Referral delay >3 days |        270        2.32        2.35
                     . |     11,368       97.65      100.00
-----------------------+-----------------------------------
                 Total |     11,641      100.00


. bys eia_diagnosis: tab gp_ref_3d

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          3        0.97        0.97
Referral delay >3 days |        305       99.03      100.00
-----------------------+-----------------------------------
                 Total |        308      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          3        0.95        0.95
Referral delay >3 days |        313       99.05      100.00
-----------------------+-----------------------------------
                 Total |        316      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          3        1.10        1.10
Referral delay >3 days |        270       98.90      100.00
-----------------------+-----------------------------------
                 Total |        273      100.00


. bys diagnosis_year: tab gp_ref_3d, missing

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          2        0.02        0.02
Referral delay >3 days |         89        0.78        0.80
                     . |     11,315       99.20      100.00
-----------------------+-----------------------------------
                 Total |     11,406      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          2        0.02        0.02
Referral delay >3 days |        257        2.30        2.32
                     . |     10,914       97.68      100.00
-----------------------+-----------------------------------
                 Total |     11,173      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          5        0.04        0.04
Referral delay >3 days |        449        4.03        4.08
                     . |     10,675       95.92      100.00
-----------------------+-----------------------------------
                 Total |     11,129      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referral delay >3 days |         93        5.69        5.69
                     . |      1,542       94.31      100.00
-----------------------+-----------------------------------
                 Total |      1,635      100.00


. bys diagnosis_year: tab gp_ref_3d

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          2        2.20        2.20
Referral delay >3 days |         89       97.80      100.00
-----------------------+-----------------------------------
                 Total |         91      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          2        0.77        0.77
Referral delay >3 days |        257       99.23      100.00
-----------------------+-----------------------------------
                 Total |        259      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          5        1.10        1.10
Referral delay >3 days |        449       98.90      100.00
-----------------------+-----------------------------------
                 Total |        454      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referral delay >3 days |         93      100.00      100.00
-----------------------+-----------------------------------
                 Total |         93      100.00


. bys nuts_region: tab gp_ref_3d, missing

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        0.03        0.03
Referral delay >3 days |         93        2.66        2.69
                     . |      3,403       97.31      100.00
-----------------------+-----------------------------------
                 Total |      3,497      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        0.03        0.03
Referral delay >3 days |         90        2.52        2.54
                     . |      3,487       97.46      100.00
-----------------------+-----------------------------------
                 Total |      3,578      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referral delay >3 days |        175        2.50        2.50
                     . |      6,832       97.50      100.00
-----------------------+-----------------------------------
                 Total |      7,007      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          3        0.09        0.09
Referral delay >3 days |        100        2.84        2.93
                     . |      3,415       97.07      100.00
-----------------------+-----------------------------------
                 Total |      3,518      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referral delay >3 days |         82        2.33        2.33
                     . |      3,439       97.67      100.00
-----------------------+-----------------------------------
                 Total |      3,521      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        0.01        0.01
Referral delay >3 days |        173        2.42        2.44
                     . |      6,961       97.56      100.00
-----------------------+-----------------------------------
                 Total |      7,135      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          3        0.08        0.08
Referral delay >3 days |         91        2.54        2.63
                     . |      3,483       97.37      100.00
-----------------------+-----------------------------------
                 Total |      3,577      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referral delay >3 days |         84        2.39        2.39
                     . |      3,426       97.61      100.00
-----------------------+-----------------------------------
                 Total |      3,510      100.00


. bys nuts_region: tab gp_ref_3d

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        1.06        1.06
Referral delay >3 days |         93       98.94      100.00
-----------------------+-----------------------------------
                 Total |         94      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        1.10        1.10
Referral delay >3 days |         90       98.90      100.00
-----------------------+-----------------------------------
                 Total |         91      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referral delay >3 days |        175      100.00      100.00
-----------------------+-----------------------------------
                 Total |        175      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          3        2.91        2.91
Referral delay >3 days |        100       97.09      100.00
-----------------------+-----------------------------------
                 Total |        103      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referral delay >3 days |         82      100.00      100.00
-----------------------+-----------------------------------
                 Total |         82      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        0.57        0.57
Referral delay >3 days |        173       99.43      100.00
-----------------------+-----------------------------------
                 Total |        174      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          3        3.19        3.19
Referral delay >3 days |         91       96.81      100.00
-----------------------+-----------------------------------
                 Total |         94      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referral delay >3 days |         84      100.00      100.00
-----------------------+-----------------------------------
                 Total |         84      100.00


. 
. **Time from last GP to rheum ref before eia code (sensitivity analysis; includes those with no rheum appt)
. gen time_gp_rheum_ref_code = (referral_rheum_precode_date - last_gp_refcode_date) if referral_rheum_precode_date!=. & last_gp_refcode_date!=. & referral_rheum_precode_date>last_gp_refcode_date & referral_rheum_precode_dat
> e<eia_code_date
(29,206 missing values generated)

. tabstat time_gp_rheum_ref_code, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~e |      6137  373.2684       310       139       550
----------------------------------------------------------------

. bys eia_diagnosis: tabstat time_gp_rheum_ref_code, stats (n mean p50 p25 p75)

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~e |      2076  371.3666       309     140.5       542
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~e |      2030  378.9754       317       142       560
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~e |      2031  369.5081       304       134       543
----------------------------------------------------------------

. 
. **Time from last GP to rheum ref (combined - sensitivity analysis; includes those with no rheum appt)
. gen time_gp_rheum_ref_comb = time_gp_rheum_ref_appt 
(34,446 missing values generated)

. replace time_gp_rheum_ref_comb = time_gp_rheum_ref_code if time_gp_rheum_ref_appt==. & time_gp_rheum_ref_code!=.
(5,905 real changes made)

. tabstat time_gp_rheum_ref_comb, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~b |      6802  353.7514     283.5       128       520
----------------------------------------------------------------

. bys eia_diagnosis: tabstat time_gp_rheum_ref_comb, stats (n mean p50 p25 p75)

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~b |      2309  350.8579       284       130       523
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~b |      2267  358.9365       288       130       526
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~b |      2226  351.4721       278       123       512
----------------------------------------------------------------

. 
. **Time from last GP pre-rheum appt to first rheum appt (key sensitivity analysis; includes those with no rheum ref)
. gen time_gp_rheum_appt = (rheum_appt_date - last_gp_prerheum_date) if rheum_appt_date!=. & last_gp_prerheum_date!=. & rheum_appt_date>last_gp_prerheum_date & rheum_appt_date<eia_code_date
(29,836 missing values generated)

. tabstat time_gp_rheum_appt, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_~m_appt |      5507  290.4614       231       106       420
----------------------------------------------------------------

. bys eia_diagnosis: tabstat time_gp_rheum_appt, stats (n mean p50 p25 p75)

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_~m_appt |      1810  281.4088     218.5       101       409
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_~m_appt |      1850   298.727       235       105       434
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_~m_appt |      1847  291.0536       237       113       418
----------------------------------------------------------------

. bys diagnosis_year: tabstat time_gp_rheum_appt, stats (n mean p50 p25 p75) //by diagnosis year

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_~m_appt |       899  176.4939       148        69       254
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_~m_appt |      1773   273.132       225       112       400
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_~m_appt |      2450  338.2037       286       125       496
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_~m_appt |       385   332.574       264       120       461
----------------------------------------------------------------

. bys nuts_region: tabstat time_gp_rheum_appt, stats (n mean p50 p25 p75) //by region

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_~m_appt |       595  298.6723       249       104       431
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_~m_appt |       543  302.8821       246       125       434
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_~m_appt |      1115  291.6583       231       106       426
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_~m_appt |       532   279.562     227.5       102     420.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_~m_appt |       553  274.0235       207        99       405
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_~m_appt |      1112  291.2977       233     110.5       414
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_~m_appt |       536  299.6772       235     113.5     410.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_~m_appt |       521  282.8887       226        99       401
----------------------------------------------------------------

. 
. **Time from last GP pre-code to EIA code (sensitivity analysis; includes those with no rheum ref and/or no rheum appt)
. gen time_gp_eia_code = (eia_code_date - last_gp_precode_date) if eia_code_date!=. & last_gp_precode_date!=. & eia_code_date>last_gp_precode_date
(15,862 missing values generated)

. tabstat time_gp_eia_code, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_ei~e |     19481  521.9382       468       230       770
----------------------------------------------------------------

. bys eia_diagnosis: tabstat time_gp_eia_code, stats (n mean p50 p25 p75)

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_ei~e |      6450  523.7984       467       230       771
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_ei~e |      6612  521.9622       470     229.5       769
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_ei~e |      6419  520.0442       468       231       768
----------------------------------------------------------------

. 
. **Time from last GP to EIA diagnosis (combined - sensitivity analysis; includes those with no rheum appt)
. gen time_gp_eia_diag = time_gp_rheum_appt
(29,836 missing values generated)

. replace time_gp_eia_diag = time_gp_eia_code if time_gp_rheum_appt==. & time_gp_eia_code!=.
(16,010 real changes made)

. tabstat time_gp_eia_diag, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_ei~g |     21517  455.3547       384       177       675
----------------------------------------------------------------

. bys eia_diagnosis: tabstat time_gp_eia_diag, stats (n mean p50 p25 p75)

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_ei~g |      7140  454.3739       381     172.5       680
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_ei~g |      7280  458.1692       390       180       682
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_ei~g |      7097  453.4543       380       182       664
----------------------------------------------------------------

. 
. **Time from rheum ref to rheum appt (i.e. if appts are present and in correct time order)
. gen time_ref_rheum_appt = (rheum_appt_date - referral_rheum_prerheum_date) if rheum_appt_date!=. & referral_rheum_prerheum_date!=. & referral_rheum_prerheum_date<rheum_appt_date & rheum_appt_date<eia_code_date
(30,008 missing values generated)

. tabstat time_ref_rheum_appt, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~t |      5335  292.8748       227       105       424
----------------------------------------------------------------

. bys eia_diagnosis: tabstat time_ref_rheum_appt, stats (n mean p50 p25 p75)

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~t |      1792  292.3929       225     104.5       417
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~t |      1776  292.9606     220.5       106       429
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~t |      1767  293.2773       235       105       428
----------------------------------------------------------------

. bys diagnosis_year: tabstat time_ref_rheum_appt, stats (n mean p50 p25 p75) //all patients by diagnosis year

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~t |       819  176.8767       154        73       254
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~t |      1697  267.6199       220       102       398
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~t |      2425  338.1575       272       119       495
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~t |       394   364.066       277       126       534
----------------------------------------------------------------

. bys nuts_region: tabstat time_ref_rheum_appt, stats (n mean p50 p25 p75) //by region

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~t |       559  283.5438       230       108       416
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~t |       529  293.3629       221       101       408
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~t |      1064   280.453     218.5     100.5     404.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~t |       501  309.9222       256       116       448
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~t |       535  288.7813       220       104       407
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~t |      1070   295.757       223       105       439
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~t |       561  297.1034       226       111       441
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~t |       516  305.2151     243.5       105     427.5
----------------------------------------------------------------

. 
. gen ref_appt_cat=1 if time_ref_rheum_appt<=21 & time_ref_rheum_appt!=. 
(35,069 missing values generated)

. replace ref_appt_cat=2 if time_ref_rheum_appt<=42 & time_ref_rheum_appt!=. & ref_appt_cat==.
(269 real changes made)

. replace ref_appt_cat=3 if time_ref_rheum_appt>42 & time_ref_rheum_appt!=. & ref_appt_cat==.
(4,792 real changes made)

. lab define ref_appt_cat 1 "Seen within 3 weeks" 2 "Seen within 6 weeks" 3 "Assessment delay >6 weeks", modify

. lab val ref_appt_cat ref_appt_cat

. lab var ref_appt_cat "Time to rheumatology assessment"

. tab ref_appt_cat, missing

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |        274        0.78        0.78
      Seen within 6 weeks |        269        0.76        1.54
Assessment delay >6 weeks |      4,792       13.56       15.09
                        . |     30,008       84.91      100.00
--------------------------+-----------------------------------
                    Total |     35,343      100.00

. tab ref_appt_cat

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |        274        5.14        5.14
      Seen within 6 weeks |        269        5.04       10.18
Assessment delay >6 weeks |      4,792       89.82      100.00
--------------------------+-----------------------------------
                    Total |      5,335      100.00

. bys eia_diagnosis: tab ref_appt_cat, missing

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         97        0.82        0.82
      Seen within 6 weeks |         97        0.82        1.64
Assessment delay >6 weeks |      1,598       13.48       15.11
                        . |     10,065       84.89      100.00
--------------------------+-----------------------------------
                    Total |     11,857      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         85        0.72        0.72
      Seen within 6 weeks |         90        0.76        1.48
Assessment delay >6 weeks |      1,601       13.52       14.99
                        . |     10,069       85.01      100.00
--------------------------+-----------------------------------
                    Total |     11,845      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         92        0.79        0.79
      Seen within 6 weeks |         82        0.70        1.49
Assessment delay >6 weeks |      1,593       13.68       15.18
                        . |      9,874       84.82      100.00
--------------------------+-----------------------------------
                    Total |     11,641      100.00


. bys eia_diagnosis: tab ref_appt_cat

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         97        5.41        5.41
      Seen within 6 weeks |         97        5.41       10.83
Assessment delay >6 weeks |      1,598       89.17      100.00
--------------------------+-----------------------------------
                    Total |      1,792      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         85        4.79        4.79
      Seen within 6 weeks |         90        5.07        9.85
Assessment delay >6 weeks |      1,601       90.15      100.00
--------------------------+-----------------------------------
                    Total |      1,776      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         92        5.21        5.21
      Seen within 6 weeks |         82        4.64        9.85
Assessment delay >6 weeks |      1,593       90.15      100.00
--------------------------+-----------------------------------
                    Total |      1,767      100.00


. bys diagnosis_year: tab ref_appt_cat, missing

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         63        0.55        0.55
      Seen within 6 weeks |         48        0.42        0.97
Assessment delay >6 weeks |        708        6.21        7.18
                        . |     10,587       92.82      100.00
--------------------------+-----------------------------------
                    Total |     11,406      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         92        0.82        0.82
      Seen within 6 weeks |         94        0.84        1.66
Assessment delay >6 weeks |      1,511       13.52       15.19
                        . |      9,476       84.81      100.00
--------------------------+-----------------------------------
                    Total |     11,173      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         98        0.88        0.88
      Seen within 6 weeks |        115        1.03        1.91
Assessment delay >6 weeks |      2,212       19.88       21.79
                        . |      8,704       78.21      100.00
--------------------------+-----------------------------------
                    Total |     11,129      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         21        1.28        1.28
      Seen within 6 weeks |         12        0.73        2.02
Assessment delay >6 weeks |        361       22.08       24.10
                        . |      1,241       75.90      100.00
--------------------------+-----------------------------------
                    Total |      1,635      100.00


. bys diagnosis_year: tab ref_appt_cat

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         63        7.69        7.69
      Seen within 6 weeks |         48        5.86       13.55
Assessment delay >6 weeks |        708       86.45      100.00
--------------------------+-----------------------------------
                    Total |        819      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         92        5.42        5.42
      Seen within 6 weeks |         94        5.54       10.96
Assessment delay >6 weeks |      1,511       89.04      100.00
--------------------------+-----------------------------------
                    Total |      1,697      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         98        4.04        4.04
      Seen within 6 weeks |        115        4.74        8.78
Assessment delay >6 weeks |      2,212       91.22      100.00
--------------------------+-----------------------------------
                    Total |      2,425      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         21        5.33        5.33
      Seen within 6 weeks |         12        3.05        8.38
Assessment delay >6 weeks |        361       91.62      100.00
--------------------------+-----------------------------------
                    Total |        394      100.00


. bys nuts_region: tab ref_appt_cat, missing

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         33        0.94        0.94
      Seen within 6 weeks |         31        0.89        1.83
Assessment delay >6 weeks |        495       14.15       15.99
                        . |      2,938       84.01      100.00
--------------------------+-----------------------------------
                    Total |      3,497      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         29        0.81        0.81
      Seen within 6 weeks |         25        0.70        1.51
Assessment delay >6 weeks |        475       13.28       14.78
                        . |      3,049       85.22      100.00
--------------------------+-----------------------------------
                    Total |      3,578      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         51        0.73        0.73
      Seen within 6 weeks |         69        0.98        1.71
Assessment delay >6 weeks |        944       13.47       15.18
                        . |      5,943       84.82      100.00
--------------------------+-----------------------------------
                    Total |      7,007      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         24        0.68        0.68
      Seen within 6 weeks |         23        0.65        1.34
Assessment delay >6 weeks |        454       12.91       14.24
                        . |      3,017       85.76      100.00
--------------------------+-----------------------------------
                    Total |      3,518      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         21        0.60        0.60
      Seen within 6 weeks |         30        0.85        1.45
Assessment delay >6 weeks |        484       13.75       15.19
                        . |      2,986       84.81      100.00
--------------------------+-----------------------------------
                    Total |      3,521      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         54        0.76        0.76
      Seen within 6 weeks |         46        0.64        1.40
Assessment delay >6 weeks |        970       13.59       15.00
                        . |      6,065       85.00      100.00
--------------------------+-----------------------------------
                    Total |      7,135      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         31        0.87        0.87
      Seen within 6 weeks |         22        0.62        1.48
Assessment delay >6 weeks |        508       14.20       15.68
                        . |      3,016       84.32      100.00
--------------------------+-----------------------------------
                    Total |      3,577      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         31        0.88        0.88
      Seen within 6 weeks |         23        0.66        1.54
Assessment delay >6 weeks |        462       13.16       14.70
                        . |      2,994       85.30      100.00
--------------------------+-----------------------------------
                    Total |      3,510      100.00


. bys nuts_region: tab ref_appt_cat

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         33        5.90        5.90
      Seen within 6 weeks |         31        5.55       11.45
Assessment delay >6 weeks |        495       88.55      100.00
--------------------------+-----------------------------------
                    Total |        559      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         29        5.48        5.48
      Seen within 6 weeks |         25        4.73       10.21
Assessment delay >6 weeks |        475       89.79      100.00
--------------------------+-----------------------------------
                    Total |        529      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         51        4.79        4.79
      Seen within 6 weeks |         69        6.48       11.28
Assessment delay >6 weeks |        944       88.72      100.00
--------------------------+-----------------------------------
                    Total |      1,064      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         24        4.79        4.79
      Seen within 6 weeks |         23        4.59        9.38
Assessment delay >6 weeks |        454       90.62      100.00
--------------------------+-----------------------------------
                    Total |        501      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         21        3.93        3.93
      Seen within 6 weeks |         30        5.61        9.53
Assessment delay >6 weeks |        484       90.47      100.00
--------------------------+-----------------------------------
                    Total |        535      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         54        5.05        5.05
      Seen within 6 weeks |         46        4.30        9.35
Assessment delay >6 weeks |        970       90.65      100.00
--------------------------+-----------------------------------
                    Total |      1,070      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         31        5.53        5.53
      Seen within 6 weeks |         22        3.92        9.45
Assessment delay >6 weeks |        508       90.55      100.00
--------------------------+-----------------------------------
                    Total |        561      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         31        6.01        6.01
      Seen within 6 weeks |         23        4.46       10.47
Assessment delay >6 weeks |        462       89.53      100.00
--------------------------+-----------------------------------
                    Total |        516      100.00


. 
. gen ref_appt_3w=1 if time_ref_rheum_appt<=21 & time_ref_rheum_appt!=. 
(35,069 missing values generated)

. replace ref_appt_3w=2 if time_ref_rheum_appt>21 & time_ref_rheum_appt!=.
(5,061 real changes made)

. lab define ref_appt_3w 1 "Seen within 3 weeks" 2 "Assessment delay >3 weeks", modify

. lab val ref_appt_3w ref_appt_3w

. lab var ref_appt_3w "Time to rheumatology assessment"

. tab ref_appt_3w, missing

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |        274        0.78        0.78
Assessment delay >3 weeks |      5,061       14.32       15.09
                        . |     30,008       84.91      100.00
--------------------------+-----------------------------------
                    Total |     35,343      100.00

. tab ref_appt_3w

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |        274        5.14        5.14
Assessment delay >3 weeks |      5,061       94.86      100.00
--------------------------+-----------------------------------
                    Total |      5,335      100.00

. bys eia_diagnosis: tab ref_appt_3w, missing

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         97        0.82        0.82
Assessment delay >3 weeks |      1,695       14.30       15.11
                        . |     10,065       84.89      100.00
--------------------------+-----------------------------------
                    Total |     11,857      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         85        0.72        0.72
Assessment delay >3 weeks |      1,691       14.28       14.99
                        . |     10,069       85.01      100.00
--------------------------+-----------------------------------
                    Total |     11,845      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         92        0.79        0.79
Assessment delay >3 weeks |      1,675       14.39       15.18
                        . |      9,874       84.82      100.00
--------------------------+-----------------------------------
                    Total |     11,641      100.00


. bys eia_diagnosis: tab ref_appt_3w

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         97        5.41        5.41
Assessment delay >3 weeks |      1,695       94.59      100.00
--------------------------+-----------------------------------
                    Total |      1,792      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         85        4.79        4.79
Assessment delay >3 weeks |      1,691       95.21      100.00
--------------------------+-----------------------------------
                    Total |      1,776      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         92        5.21        5.21
Assessment delay >3 weeks |      1,675       94.79      100.00
--------------------------+-----------------------------------
                    Total |      1,767      100.00


. bys diagnosis_year: tab ref_appt_3w, missing

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         63        0.55        0.55
Assessment delay >3 weeks |        756        6.63        7.18
                        . |     10,587       92.82      100.00
--------------------------+-----------------------------------
                    Total |     11,406      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         92        0.82        0.82
Assessment delay >3 weeks |      1,605       14.36       15.19
                        . |      9,476       84.81      100.00
--------------------------+-----------------------------------
                    Total |     11,173      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         98        0.88        0.88
Assessment delay >3 weeks |      2,327       20.91       21.79
                        . |      8,704       78.21      100.00
--------------------------+-----------------------------------
                    Total |     11,129      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         21        1.28        1.28
Assessment delay >3 weeks |        373       22.81       24.10
                        . |      1,241       75.90      100.00
--------------------------+-----------------------------------
                    Total |      1,635      100.00


. bys diagnosis_year: tab ref_appt_3w

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         63        7.69        7.69
Assessment delay >3 weeks |        756       92.31      100.00
--------------------------+-----------------------------------
                    Total |        819      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         92        5.42        5.42
Assessment delay >3 weeks |      1,605       94.58      100.00
--------------------------+-----------------------------------
                    Total |      1,697      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         98        4.04        4.04
Assessment delay >3 weeks |      2,327       95.96      100.00
--------------------------+-----------------------------------
                    Total |      2,425      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         21        5.33        5.33
Assessment delay >3 weeks |        373       94.67      100.00
--------------------------+-----------------------------------
                    Total |        394      100.00


. bys nuts_region: tab ref_appt_3w, missing

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         33        0.94        0.94
Assessment delay >3 weeks |        526       15.04       15.99
                        . |      2,938       84.01      100.00
--------------------------+-----------------------------------
                    Total |      3,497      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         29        0.81        0.81
Assessment delay >3 weeks |        500       13.97       14.78
                        . |      3,049       85.22      100.00
--------------------------+-----------------------------------
                    Total |      3,578      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         51        0.73        0.73
Assessment delay >3 weeks |      1,013       14.46       15.18
                        . |      5,943       84.82      100.00
--------------------------+-----------------------------------
                    Total |      7,007      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         24        0.68        0.68
Assessment delay >3 weeks |        477       13.56       14.24
                        . |      3,017       85.76      100.00
--------------------------+-----------------------------------
                    Total |      3,518      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         21        0.60        0.60
Assessment delay >3 weeks |        514       14.60       15.19
                        . |      2,986       84.81      100.00
--------------------------+-----------------------------------
                    Total |      3,521      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         54        0.76        0.76
Assessment delay >3 weeks |      1,016       14.24       15.00
                        . |      6,065       85.00      100.00
--------------------------+-----------------------------------
                    Total |      7,135      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         31        0.87        0.87
Assessment delay >3 weeks |        530       14.82       15.68
                        . |      3,016       84.32      100.00
--------------------------+-----------------------------------
                    Total |      3,577      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         31        0.88        0.88
Assessment delay >3 weeks |        485       13.82       14.70
                        . |      2,994       85.30      100.00
--------------------------+-----------------------------------
                    Total |      3,510      100.00


. bys nuts_region: tab ref_appt_3w

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         33        5.90        5.90
Assessment delay >3 weeks |        526       94.10      100.00
--------------------------+-----------------------------------
                    Total |        559      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         29        5.48        5.48
Assessment delay >3 weeks |        500       94.52      100.00
--------------------------+-----------------------------------
                    Total |        529      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         51        4.79        4.79
Assessment delay >3 weeks |      1,013       95.21      100.00
--------------------------+-----------------------------------
                    Total |      1,064      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         24        4.79        4.79
Assessment delay >3 weeks |        477       95.21      100.00
--------------------------+-----------------------------------
                    Total |        501      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         21        3.93        3.93
Assessment delay >3 weeks |        514       96.07      100.00
--------------------------+-----------------------------------
                    Total |        535      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         54        5.05        5.05
Assessment delay >3 weeks |      1,016       94.95      100.00
--------------------------+-----------------------------------
                    Total |      1,070      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         31        5.53        5.53
Assessment delay >3 weeks |        530       94.47      100.00
--------------------------+-----------------------------------
                    Total |        561      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         31        6.01        6.01
Assessment delay >3 weeks |        485       93.99      100.00
--------------------------+-----------------------------------
                    Total |        516      100.00


. 
. **Time from rheum ref or last GP to rheum appt (combined - sensitivity analysis; includes those with no rheum ref)
. gen time_refgp_rheum_appt = time_ref_rheum_appt
(30,008 missing values generated)

. replace time_refgp_rheum_appt = time_gp_rheum_appt if time_ref_rheum_appt==. & time_gp_rheum_appt!=.
(3,577 real changes made)

. bys eia_diagnosis: tabstat time_refgp_rheum_appt, stats (n mean p50 p25 p75)

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_refgp~t |      2968  270.7497       211        98       385
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_refgp~t |      2970  277.9263       213        98       398
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_refgp~t |      2974  276.2751     223.5       102       397
----------------------------------------------------------------

. bys diagnosis_year: tabstat time_refgp_rheum_appt, stats (n mean p50 p25 p75) //all patients by diagnosis year

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_refgp~t |      1547  174.5281       148        70       253
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_refgp~t |      2904  258.9363       212       102       386
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_refgp~t |      3849  318.3393       254       114       465
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_refgp~t |       612  332.4085       244       114       470
----------------------------------------------------------------

. bys nuts_region: tabstat time_refgp_rheum_appt, stats (n mean p50 p25 p75) //by region

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_refgp~t |       947  268.1943       214        97       382
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_refgp~t |       871  279.6085       214       101       397
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_refgp~t |      1787  268.3033       209        94       387
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_refgp~t |       845  281.3905       232       103       413
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_refgp~t |       902   265.806       207        96       382
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_refgp~t |      1785  275.9266       215       101       393
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_refgp~t |       904  287.7998       220       110       412
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_refgp~t |       871  279.5166       225        94       400
----------------------------------------------------------------

. 
. **Time from rheum ref to EIA code (sensitivity analysis; includes those with no rheum appt)
. gen time_ref_rheum_eia = (eia_code_date - referral_rheum_precode_date) if eia_code_date!=. & referral_rheum_precode_date!=. & referral_rheum_precode_date<eia_code_date  
(15,655 missing values generated)

. tabstat time_ref_rheum_eia, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~a |     19688   519.788       462       231       765
----------------------------------------------------------------

. bys eia_diagnosis: tabstat time_ref_rheum_eia, stats (n mean p50 p25 p75)

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~a |      6620  519.6686       463       231       764
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~a |      6630  519.4332       461       231       763
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~a |      6438  520.2763       463       229       768
----------------------------------------------------------------

. 
. **Time from rheum ref to EIA diagnosis (combined - sensitivity analysis; includes those with no rheum appt)
. gen time_ref_rheum_eia_comb = time_ref_rheum_appt
(30,008 missing values generated)

. replace time_ref_rheum_eia_comb = time_ref_rheum_eia if time_ref_rheum_appt==. & time_ref_rheum_eia!=.
(16,293 real changes made)

. tabstat time_ref_rheum_eia_comb, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~b |     21628  456.4625       386       180       678
----------------------------------------------------------------

. bys eia_diagnosis: tabstat time_ref_rheum_eia_comb, stats (n mean p50 p25 p75)

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~b |      7264  456.5132       382     183.5       678
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~b |      7279  457.0942       390       179       681
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~b |      7085  455.7613       385       177       675
----------------------------------------------------------------

. 
. **Time from rheum appt to EIA code (i.e. if appts are present and in correct time order)
. gen time_rheum_eia_code = (eia_code_date - rheum_appt_date) if eia_code_date!=. & rheum_appt_date!=. & rheum_appt_date<eia_code_date 
(11,571 missing values generated)

. tabstat time_rheum_eia_code, stats (n mean p50 p25 p75) 

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_rheum~e |     23772  602.5004       576       313       868
----------------------------------------------------------------

. bys eia_diagnosis: tabstat time_rheum_eia_code, stats (n mean p50 p25 p75) 

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_rheum~e |      8005  598.7569       568       307       862
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_rheum~e |      7944  603.1431     579.5       307       873
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_rheum~e |      7823  605.6783       578       322       866
----------------------------------------------------------------

. 
. *Time to first csDMARD prescriptions - all of the below are shared care prescriptions, aside from those with MTX_high cost drug data included======================================================================*/
. 
. *All patients below must have at least six months of GP registration after EIA code
. 
. **Time to first csDMARD script for RA patients, whereby first rheum appt is classed as diagnosis date (if rheum appt present and before csDMARD date; not including high cost MTX prescriptions)
. gen time_to_csdmard=(csdmard_date-rheum_appt_date) if csdmard==1 & rheum_appt_date!=. & csdmard_date>rheum_appt_date 
(25,272 missing values generated)

. tabstat time_to_csdmard if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_cs~d |      3260  556.6816     510.5       269       807
----------------------------------------------------------------

. bys diagnosis_year: tabstat time_to_csdmard if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by diagnosis year

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_cs~d |      1037  562.7734       529       264       810
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_cs~d |      1079  562.1307       508       289       809
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_cs~d |       983    546.12       493       254       795
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_cs~d |       161  545.4099       474       319       780
----------------------------------------------------------------

. bys nuts_region: tabstat time_to_csdmard if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by region

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_cs~d |       319  582.2382       555       293       850
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_cs~d |       376  598.3378     561.5       299       868
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_cs~d |       665   543.982       497       263       795
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_cs~d |       329  536.7964       503       230       792
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_cs~d |       314  567.2771     530.5       295       816
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_cs~d |       632  558.5016       532     284.5     794.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_cs~d |       318  514.1824     449.5       240       741
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_cs~d |       307  557.3648       513       287       805
----------------------------------------------------------------

. 
. **Time to first csDMARD script for RA patients (including high cost MTX prescriptions)
. gen time_to_csdmard_hcd=(csdmard_hcd_date-rheum_appt_date) if csdmard_hcd==1 & rheum_appt_date!=. & csdmard_hcd_date>rheum_appt_date 
(23,888 missing values generated)

. tabstat time_to_csdmard_hcd if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) 

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_c~cd |      3700  549.2022       501       267     797.5
----------------------------------------------------------------

. 
. **Time to first csDMARD script for PsA patients (not including high cost MTX prescriptions)
. tabstat time_to_csdmard if psa_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_c~rd |      3173  558.3681       515       281       809
----------------------------------------------------------------

. bys diagnosis_year: tabstat time_to_csdmard if psa_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by diagnosis year

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_c~rd |      1043  548.9578       502       253       808
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_c~rd |       985  569.0599       536       301       818
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_c~rd |       983  561.2197       516       267       812
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_c~rd |       162   536.642     462.5       329       752
----------------------------------------------------------------

. bys nuts_region: tabstat time_to_csdmard if psa_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by region

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_c~rd |       281  568.4306       502       292       831
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_c~rd |       310  546.3258       526       259       808
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_c~rd |       619  551.1777       514       280       809
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_c~rd |       333  562.1471       505       268       827
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_c~rd |       339  603.9174       546       321       869
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_c~rd |       663   542.006       490       254       790
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_c~rd |       326  543.9325       501       267       771
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_c~rd |       302  572.3113       560       316       790
----------------------------------------------------------------

. 
. **Time to first csDMARD script for PsA patients (including high cost MTX prescriptions)
. tabstat time_to_csdmard_hcd if psa_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) 

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_c~cd |      3632  552.2376       508     280.5       800
----------------------------------------------------------------

. 
. **csDMARD time categories for RA patients (not including high cost MTX prescriptions)
. gen csdmard_3m=1 if time_to_csdmard<=90 & time_to_csdmard!=. 
(34,644 missing values generated)

. replace csdmard_3m=2 if time_to_csdmard>90 & time_to_csdmard!=.
(9,372 real changes made)

. lab define csdmard_3m 1 "Yes" 2 "No", modify

. lab val csdmard_3m csdmard_3m

. lab var csdmard_3m "csDMARD within 3 months" 

. tab csdmard_3m if ra_code==1 & has_6m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after csDMARD script

    csDMARD |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        219        1.94        1.94
         No |      3,041       26.95       28.89
          . |      8,024       71.11      100.00
------------+-----------------------------------
      Total |     11,284      100.00

. tab csdmard_3m if ra_code==1 & has_6m_follow_up==1

    csDMARD |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        219        6.72        6.72
         No |      3,041       93.28      100.00
------------+-----------------------------------
      Total |      3,260      100.00

. gen csdmard_6m=1 if time_to_csdmard<=180 & time_to_csdmard!=. 
(33,820 missing values generated)

. replace csdmard_6m=2 if time_to_csdmard>180 & time_to_csdmard!=.
(8,548 real changes made)

. lab define csdmard_6m 1 "Yes" 2 "No", modify

. lab val csdmard_6m csdmard_6m

. lab var csdmard_6m "csDMARD within 6 months" 

. tab csdmard_6m if ra_code==1 & has_6m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after csDMARD script

    csDMARD |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        514        4.56        4.56
         No |      2,746       24.34       28.89
          . |      8,024       71.11      100.00
------------+-----------------------------------
      Total |     11,284      100.00

. tab csdmard_6m if ra_code==1 & has_6m_follow_up==1

    csDMARD |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        514       15.77       15.77
         No |      2,746       84.23      100.00
------------+-----------------------------------
      Total |      3,260      100.00

. gen csdmard_12m=1 if time_to_csdmard<=365 & time_to_csdmard!=. 
(31,912 missing values generated)

. replace csdmard_12m=2 if time_to_csdmard>365 & time_to_csdmard!=.
(6,640 real changes made)

. lab define csdmard_12m 1 "Yes" 2 "No", modify

. lab val csdmard_12m csdmard_12m

. lab var csdmard_12m "csDMARD within 12 months" 

. tab csdmard_12m if ra_code==1 & has_12m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after csDMARD script

    csDMARD |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,044        9.85        9.85
         No |      1,983       18.71       28.56
          . |      7,571       71.44      100.00
------------+-----------------------------------
      Total |     10,598      100.00

. tab csdmard_12m if ra_code==1 & has_12m_follow_up==1 //for patients with at least 12m registration

    csDMARD |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,044       34.49       34.49
         No |      1,983       65.51      100.00
------------+-----------------------------------
      Total |      3,027      100.00

. 
. **csDMARD time categories for RA patients (including high cost MTX prescriptions)
. gen csdmard_hcd_3m=1 if time_to_csdmard_hcd<=90 & time_to_csdmard_hcd!=. 
(34,529 missing values generated)

. replace csdmard_hcd_3m=2 if time_to_csdmard_hcd>90 & time_to_csdmard_hcd!=.
(10,641 real changes made)

. lab define csdmard_hcd_3m 1 "Yes" 2 "No", modify

. lab val csdmard_hcd_3m csdmard_hcd_3m

. lab var csdmard_hcd_3m "csDMARD within 3 months" 

. tab csdmard_hcd_3m if ra_code==1 & has_6m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after csDMARD script

    csDMARD |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        258        2.29        2.29
         No |      3,442       30.50       32.79
          . |      7,584       67.21      100.00
------------+-----------------------------------
      Total |     11,284      100.00

. tab csdmard_hcd_3m if ra_code==1 & has_6m_follow_up==1

    csDMARD |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        258        6.97        6.97
         No |      3,442       93.03      100.00
------------+-----------------------------------
      Total |      3,700      100.00

. gen csdmard_hcd_6m=1 if time_to_csdmard_hcd<=180 & time_to_csdmard_hcd!=. 
(33,581 missing values generated)

. replace csdmard_hcd_6m=2 if time_to_csdmard_hcd>180 & time_to_csdmard_hcd!=.
(9,693 real changes made)

. lab define csdmard_hcd_6m 1 "Yes" 2 "No", modify

. lab val csdmard_hcd_6m csdmard_hcd_6m

. lab var csdmard_hcd_6m "csDMARD within 6 months" 

. tab csdmard_hcd_6m if ra_code==1 & has_6m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after csDMARD script

    csDMARD |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        594        5.26        5.26
         No |      3,106       27.53       32.79
          . |      7,584       67.21      100.00
------------+-----------------------------------
      Total |     11,284      100.00

. tab csdmard_hcd_6m if ra_code==1 & has_6m_follow_up==1

    csDMARD |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        594       16.05       16.05
         No |      3,106       83.95      100.00
------------+-----------------------------------
      Total |      3,700      100.00

. gen csdmard_hcd_12m=1 if time_to_csdmard_hcd<=365 & time_to_csdmard_hcd!=. 
(31,383 missing values generated)

. replace csdmard_hcd_12m=2 if time_to_csdmard_hcd>365 & time_to_csdmard_hcd!=.
(7,495 real changes made)

. lab define csdmard_hcd_12m 1 "Yes" 2 "No", modify

. lab val csdmard_hcd_12m csdmard_hcd_12m

. lab var csdmard_hcd_12m "csDMARD within 12 months" 

. tab csdmard_hcd_12m if ra_code==1 & has_12m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after csDMARD script

    csDMARD |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,221       11.52       11.52
         No |      2,237       21.11       32.63
          . |      7,140       67.37      100.00
------------+-----------------------------------
      Total |     10,598      100.00

. tab csdmard_hcd_12m if ra_code==1 & has_12m_follow_up==1 //for patients with at least 12m registration

    csDMARD |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,221       35.31       35.31
         No |      2,237       64.69      100.00
------------+-----------------------------------
      Total |      3,458      100.00

. 
. **csDMARD time categories for PsA patients (not including high cost MTX prescriptions)
. tab csdmard_3m if psa_code==1 & has_6m_follow_up==1, missing

    csDMARD |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        226        2.02        2.02
         No |      2,947       26.29       28.31
          . |      8,035       71.69      100.00
------------+-----------------------------------
      Total |     11,208      100.00

. tab csdmard_6m if psa_code==1 & has_6m_follow_up==1, missing

    csDMARD |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        480        4.28        4.28
         No |      2,693       24.03       28.31
          . |      8,035       71.69      100.00
------------+-----------------------------------
      Total |     11,208      100.00

. tab csdmard_12m if psa_code==1 & has_12m_follow_up==1, missing

    csDMARD |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,033        9.70        9.70
         No |      1,984       18.64       28.34
          . |      7,628       71.66      100.00
------------+-----------------------------------
      Total |     10,645      100.00

. 
. **csDMARD time categories for PsA patients (including high cost MTX prescriptions)
. tab csdmard_hcd_3m if psa_code==1 & has_6m_follow_up==1, missing

    csDMARD |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        252        2.25        2.25
         No |      3,380       30.16       32.41
          . |      7,576       67.59      100.00
------------+-----------------------------------
      Total |     11,208      100.00

. tab csdmard_hcd_6m if psa_code==1 & has_6m_follow_up==1, missing

    csDMARD |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        551        4.92        4.92
         No |      3,081       27.49       32.41
          . |      7,576       67.59      100.00
------------+-----------------------------------
      Total |     11,208      100.00

. tab csdmard_hcd_12m if psa_code==1 & has_12m_follow_up==1, missing

    csDMARD |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,203       11.30       11.30
         No |      2,261       21.24       32.54
          . |      7,181       67.46      100.00
------------+-----------------------------------
      Total |     10,645      100.00

. 
. **What was first shared care csDMARD (not including high cost MTX prescriptions)
. gen first_csD=""
(35,343 missing values generated)

. foreach var of varlist hydroxychloroquine_date leflunomide_date methotrexate_date methotrexate_inj_date sulfasalazine_date {
  2.         replace first_csD="`var'" if csdmard_date==`var' & csdmard_date!=.
  3.         }
variable first_csD was str1 now str23
(2,514 real changes made)
(2,451 real changes made)
(2,491 real changes made)
(2,558 real changes made)
(2,521 real changes made)

. gen first_csDMARD = substr(first_csD, 1, length(first_csD) - 5) if first_csD!=""
(22,811 missing values generated)

. drop first_csD

. tab first_csDMARD if ra_code==1 & has_6m_follow_up==1 //for RA patients

     first_csDMARD |      Freq.     Percent        Cum.
-------------------+-----------------------------------
hydroxychloroquine |        775       19.13       19.13
       leflunomide |        816       20.14       39.26
      methotrexate |        755       18.63       57.90
  methotrexate_inj |        878       21.67       79.57
     sulfasalazine |        828       20.43      100.00
-------------------+-----------------------------------
             Total |      4,052      100.00

. tab first_csDMARD if psa_code==1 & has_6m_follow_up==1 //for PsA patients

     first_csDMARD |      Freq.     Percent        Cum.
-------------------+-----------------------------------
hydroxychloroquine |        767       19.43       19.43
       leflunomide |        759       19.23       38.66
      methotrexate |        817       20.70       59.36
  methotrexate_inj |        814       20.62       79.98
     sulfasalazine |        790       20.02      100.00
-------------------+-----------------------------------
             Total |      3,947      100.00

. 
. **What was first csDMARD (including high cost MTX prescriptions)
. gen first_csD_hcd=""
(35,343 missing values generated)

. foreach var of varlist hydroxychloroquine_date leflunomide_date methotrexate_date methotrexate_inj_date methotrexate_hcd_date sulfasalazine_date {
  2.         replace first_csD_hcd="`var'" if csdmard_hcd_date==`var' & csdmard_hcd_date!=.
  3.         }
variable first_csD_hcd was str1 now str23
(2,384 real changes made)
(2,304 real changes made)
(2,388 real changes made)
(2,420 real changes made)
(3,020 real changes made)
(2,377 real changes made)

. gen first_csDMARD_hcd = substr(first_csD_hcd, 1, length(first_csD_hcd) - 5) if first_csD_hcd!=""
(20,454 missing values generated)

. drop first_csD_hcd

. tab first_csDMARD_hcd if ra_code==1 & has_6m_follow_up==1 //for RA patients

 first_csDMARD_hcd |      Freq.     Percent        Cum.
-------------------+-----------------------------------
hydroxychloroquine |        732       15.27       15.27
       leflunomide |        761       15.88       31.15
      methotrexate |        722       15.06       46.21
  methotrexate_hcd |        968       20.20       66.41
  methotrexate_inj |        834       17.40       83.81
     sulfasalazine |        776       16.19      100.00
-------------------+-----------------------------------
             Total |      4,793      100.00

. tab first_csDMARD_hcd if psa_code==1 & has_6m_follow_up==1 //for PsA patients

 first_csDMARD_hcd |      Freq.     Percent        Cum.
-------------------+-----------------------------------
hydroxychloroquine |        728       15.43       15.43
       leflunomide |        708       15.01       30.44
      methotrexate |        779       16.51       46.96
  methotrexate_hcd |        986       20.90       67.86
  methotrexate_inj |        762       16.15       84.02
     sulfasalazine |        754       15.98      100.00
-------------------+-----------------------------------
             Total |      4,717      100.00

.  
. **Methotrexate use (not including high cost MTX prescriptions)
. gen mtx=1 if methotrexate==1 | methotrexate_inj==1
(29,581 missing values generated)

. recode mtx .=0 
(29581 changes made to mtx)

. tab mtx if ra_code==1 & has_6m_follow_up==1 //for RA patients; Nb. this is just a check; need time-to-MTX instead (below)

        mtx |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      9,435       83.61       83.61
          1 |      1,849       16.39      100.00
------------+-----------------------------------
      Total |     11,284      100.00

. tab mtx if psa_code==1 & has_6m_follow_up==1 //for PsA patients

        mtx |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      9,336       83.30       83.30
          1 |      1,872       16.70      100.00
------------+-----------------------------------
      Total |     11,208      100.00

. 
. **Methotrexate use (including high cost MTX prescriptions)
. gen mtx_hcd=1 if methotrexate==1 | methotrexate_inj==1 | methotrexate_hcd==1
(26,517 missing values generated)

. recode mtx_hcd .=0 
(26517 changes made to mtx_hcd)

. tab mtx_hcd if ra_code==1 & has_6m_follow_up==1 //for RA patients

    mtx_hcd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,463       75.00       75.00
          1 |      2,821       25.00      100.00
------------+-----------------------------------
      Total |     11,284      100.00

. tab mtx_hcd if psa_code==1 & has_6m_follow_up==1 //for PsA patients

    mtx_hcd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,346       74.46       74.46
          1 |      2,862       25.54      100.00
------------+-----------------------------------
      Total |     11,208      100.00

. 
. **Date of first methotrexate script (not including high cost MTX prescriptions)
. gen mtx_date=min(methotrexate_date, methotrexate_inj_date)
(29,581 missing values generated)

. format %td mtx_date

. 
. **Date of first methotrexate script (including high cost MTX prescriptions)
. gen mtx_hcd_date=min(methotrexate_date, methotrexate_inj_date, methotrexate_hcd_date)
(26,517 missing values generated)

. format %td mtx_hcd_date

. 
. **Time to first methotrexate script for RA patients (not including high cost MTX prescriptions)
. gen time_to_mtx=(mtx_date-rheum_appt_date) if mtx==1 & rheum_appt_date!=. & mtx_date>rheum_appt_date 
(30,712 missing values generated)

. tabstat time_to_mtx if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |      1475  570.2719       534       283       833
----------------------------------------------------------------

. bys diagnosis_year: tabstat time_to_mtx if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by diagnosis year

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       478  581.7197       565       303       837
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       470   565.783     518.5       265       815
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       450  570.8911       523       266       855
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |        77   522.987       502       319       765
----------------------------------------------------------------

. bys nuts_region: tabstat time_to_mtx if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by region

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       146  652.4452       663       366       968
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       171  596.1053       595       250       871
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       310  549.5774       502       261       833
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       140  567.1071       562       251     807.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       142  574.6549     519.5       311       849
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       278   550.482     510.5       312       769
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       152  549.8487       496     252.5     788.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       136  558.7059       512       291     808.5
----------------------------------------------------------------

. 
. **Time to first methotrexate script for RA patients (including high cost MTX prescriptions)
. gen time_to_mtx_hcd=(mtx_hcd_date-rheum_appt_date) if mtx_hcd==1 & rheum_appt_date!=. & mtx_hcd_date>rheum_appt_date 
(28,773 missing values generated)

. tabstat time_to_mtx_hcd if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_mt~d |      2091  568.6906       533       284       832
----------------------------------------------------------------

. 
. **Time to first methotrexate script for PsA patients (not including high cost MTX prescriptions)
. tabstat time_to_mtx if psa_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |      1512  592.6693     554.5       316     861.5
----------------------------------------------------------------

. bys diagnosis_year: tabstat time_to_mtx if psa_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by diagnosis year

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       488  580.9098     543.5       307     848.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       488  600.7807     569.5     322.5       861
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       458  588.1769       551       293       878
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |        78  641.8718     614.5       387       851
----------------------------------------------------------------

. bys nuts_region: tabstat time_to_mtx if psa_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by region

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       144  615.6389       572       321       929
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       151  560.8344       548       269       823
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       286  603.0699       570       324       865
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       151  593.0795       569       318       887
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       156  638.3333     606.5     352.5       895
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       318  576.1447     507.5       286       856
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       164   566.628       514     306.5     808.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       142  598.7606     600.5       350       823
----------------------------------------------------------------

. 
. **Time to first methotrexate script for PsA patients (including high cost MTX prescriptions)
. tabstat time_to_mtx_hcd if psa_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_mt~d |      2148  584.1276     543.5     310.5       844
----------------------------------------------------------------

. 
. **Methotrexate time categories for RA patients (not including high-cost MTX) //Nb. this is time period from rheum appt (i.e. diagnosis) to shared care, not from referral to first script 
. gen mtx_3m=1 if time_to_mtx<=90 & time_to_mtx!=. 
(35,071 missing values generated)

. replace mtx_3m=2 if time_to_mtx>90 & time_to_mtx!=.
(4,359 real changes made)

. lab define mtx_3m 1 "Yes" 2 "No", modify

. lab val mtx_3m mtx_3m

. lab var mtx_3m "Methotrexate within 3 months" 

. tab mtx_3m if ra_code==1 & has_6m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after csDMARD script

Methotrexat |
 e within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         98        0.87        0.87
         No |      1,377       12.20       13.07
          . |      9,809       86.93      100.00
------------+-----------------------------------
      Total |     11,284      100.00

. tab mtx_3m if ra_code==1 & has_6m_follow_up==1

Methotrexat |
 e within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         98        6.64        6.64
         No |      1,377       93.36      100.00
------------+-----------------------------------
      Total |      1,475      100.00

. gen mtx_6m=1 if time_to_mtx<=180 & time_to_mtx!=. 
(34,707 missing values generated)

. replace mtx_6m=2 if time_to_mtx>180 & time_to_mtx!=.
(3,995 real changes made)

. lab define mtx_6m 1 "Yes" 2 "No", modify

. lab val mtx_6m mtx_6m

. lab var mtx_6m "Methotrexate within 6 months" 

. tab mtx_6m if ra_code==1 & has_6m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after csDMARD script

Methotrexat |
 e within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        236        2.09        2.09
         No |      1,239       10.98       13.07
          . |      9,809       86.93      100.00
------------+-----------------------------------
      Total |     11,284      100.00

. tab mtx_6m if ra_code==1 & has_6m_follow_up==1

Methotrexat |
 e within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        236       16.00       16.00
         No |      1,239       84.00      100.00
------------+-----------------------------------
      Total |      1,475      100.00

. gen mtx_12m=1 if time_to_mtx<=365 & time_to_mtx!=. 
(33,888 missing values generated)

. replace mtx_12m=2 if time_to_mtx>365 & time_to_mtx!=.
(3,176 real changes made)

. lab define mtx_12m 1 "Yes" 2 "No", modify

. lab val mtx_12m mtx_12m

. lab var mtx_12m "Methotrexate within 12 months" 

. tab mtx_12m if ra_code==1 & has_12m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after mtx script

Methotrexat |
e within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        459        4.33        4.33
         No |        894        8.44       12.77
          . |      9,245       87.23      100.00
------------+-----------------------------------
      Total |     10,598      100.00

. tab mtx_12m if ra_code==1 & has_12m_follow_up==1 //for patients with at least 12m registration

Methotrexat |
e within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        459       33.92       33.92
         No |        894       66.08      100.00
------------+-----------------------------------
      Total |      1,353      100.00

. 
. **Methotrexate time categories for RA patients (including high-cost MTX)
. gen mtx_hcd_3m=1 if time_to_mtx_hcd<=90 & time_to_mtx_hcd!=. 
(34,941 missing values generated)

. replace mtx_hcd_3m=2 if time_to_mtx_hcd>90 & time_to_mtx_hcd!=.
(6,168 real changes made)

. lab define mtx_hcd_3m 1 "Yes" 2 "No", modify

. lab val mtx_hcd_3m mtx_hcd_3m

. lab var mtx_hcd_3m "Methotrexate within 3 months" 

. tab mtx_hcd_3m if ra_code==1 & has_6m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after csDMARD script

Methotrexat |
 e within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        143        1.27        1.27
         No |      1,948       17.26       18.53
          . |      9,193       81.47      100.00
------------+-----------------------------------
      Total |     11,284      100.00

. tab mtx_hcd_3m if ra_code==1 & has_6m_follow_up==1

Methotrexat |
 e within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        143        6.84        6.84
         No |      1,948       93.16      100.00
------------+-----------------------------------
      Total |      2,091      100.00

. gen mtx_hcd_6m=1 if time_to_mtx_hcd<=180 & time_to_mtx_hcd!=. 
(34,431 missing values generated)

. replace mtx_hcd_6m=2 if time_to_mtx_hcd>180 & time_to_mtx_hcd!=.
(5,658 real changes made)

. lab define mtx_hcd_6m 1 "Yes" 2 "No", modify

. lab val mtx_hcd_6m mtx_hcd_6m

. lab var mtx_hcd_6m "Methotrexate within 6 months" 

. tab mtx_hcd_6m if ra_code==1 & has_6m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after csDMARD script

Methotrexat |
 e within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        329        2.92        2.92
         No |      1,762       15.62       18.53
          . |      9,193       81.47      100.00
------------+-----------------------------------
      Total |     11,284      100.00

. tab mtx_hcd_6m if ra_code==1 & has_6m_follow_up==1

Methotrexat |
 e within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        329       15.73       15.73
         No |      1,762       84.27      100.00
------------+-----------------------------------
      Total |      2,091      100.00

. gen mtx_hcd_12m=1 if time_to_mtx_hcd<=365 & time_to_mtx_hcd!=. 
(33,264 missing values generated)

. replace mtx_hcd_12m=2 if time_to_mtx_hcd>365 & time_to_mtx_hcd!=.
(4,491 real changes made)

. lab define mtx_hcd_12m 1 "Yes" 2 "No", modify

. lab val mtx_hcd_12m mtx_hcd_12m

. lab var mtx_hcd_12m "Methotrexate within 12 months" 

. tab mtx_hcd_12m if ra_code==1 & has_12m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after csDMARD script

Methotrexat |
e within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        668        6.30        6.30
         No |      1,294       12.21       18.51
          . |      8,636       81.49      100.00
------------+-----------------------------------
      Total |     10,598      100.00

. tab mtx_hcd_12m if ra_code==1 & has_12m_follow_up==1 //for patients with at least 12m registration

Methotrexat |
e within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        668       34.05       34.05
         No |      1,294       65.95      100.00
------------+-----------------------------------
      Total |      1,962      100.00

. 
. **Methotrexate time categories for PsA patients (not including high-cost MTX)
. tab mtx_3m if psa_code==1 & has_6m_follow_up==1, missing

Methotrexat |
 e within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         78        0.70        0.70
         No |      1,434       12.79       13.49
          . |      9,696       86.51      100.00
------------+-----------------------------------
      Total |     11,208      100.00

. tab mtx_6m if psa_code==1 & has_6m_follow_up==1, missing

Methotrexat |
 e within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        200        1.78        1.78
         No |      1,312       11.71       13.49
          . |      9,696       86.51      100.00
------------+-----------------------------------
      Total |     11,208      100.00

. tab mtx_12m if psa_code==1 & has_12m_follow_up==1, missing //with a least 12m registration

Methotrexat |
e within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        442        4.15        4.15
         No |      1,007        9.46       13.61
          . |      9,196       86.39      100.00
------------+-----------------------------------
      Total |     10,645      100.00

. 
. **Methotrexate time categories for PsA patients (including high-cost MTX)
. tab mtx_hcd_3m if psa_code==1 & has_6m_follow_up==1, missing

Methotrexat |
 e within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        111        0.99        0.99
         No |      2,037       18.17       19.16
          . |      9,060       80.84      100.00
------------+-----------------------------------
      Total |     11,208      100.00

. tab mtx_hcd_6m if psa_code==1 & has_6m_follow_up==1, missing

Methotrexat |
 e within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        283        2.52        2.52
         No |      1,865       16.64       19.16
          . |      9,060       80.84      100.00
------------+-----------------------------------
      Total |     11,208      100.00

. tab mtx_hcd_12m if psa_code==1 & has_12m_follow_up==1, missing //with a least 12m registration

Methotrexat |
e within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        641        6.02        6.02
         No |      1,424       13.38       19.40
          . |      8,580       80.60      100.00
------------+-----------------------------------
      Total |     10,645      100.00

. 
. **Sulfasalazine use
. gen time_to_ssz=(sulfasalazine_date-rheum_appt_date) if sulfasalazine==1 & rheum_appt_date!=. & sulfasalazine_date>rheum_appt_date 
(32,885 missing values generated)

. tabstat time_to_ssz if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |       833  605.7431       574       339       856
----------------------------------------------------------------

. bys diagnosis_year: tabstat time_to_ssz if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by diagnosis year for RA

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |       270  611.9407     598.5       311       875
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |       265  608.0075       583       356       851
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |       256  599.8594       566     306.5       856
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |        42  587.4762     533.5       366       816
----------------------------------------------------------------

. bys diagnosis_year: tabstat time_to_ssz if psa_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by diagnosis year for PsA

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |       253  585.5257       544       271       864
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |       220  618.3591       577     356.5     880.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |       245  598.2653       586       310       856
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |        48  577.9583     514.5       307     795.5
----------------------------------------------------------------

. bys nuts_region: tabstat time_to_ssz if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by region for RA

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |        90  623.4222     599.5       416       882
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |        83  633.8072       568       339       914
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |       178       607       599       336       869
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |        80   614.225     609.5     274.5     932.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |        81   592.321       583       311       813
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |       168  579.7798     546.5       302       822
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |        79  596.8861       553       311       821
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |        74  623.6622     562.5       344       884
----------------------------------------------------------------

. bys nuts_region: tabstat time_to_ssz if psa_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by region for PsA

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |        66  558.6212       451       310       803
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |        78  622.7692       625       339       859
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |       149  620.2886       616       298       934
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |        82  560.1951       505       252       806
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |        80   659.225       621       429     904.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |       174  583.5115       566       308       812
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |        70  562.6429     514.5       295       812
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |        67  612.4776       640       316       878
----------------------------------------------------------------

. 
. **Sulfasalazine time categories for RA patients //Nb. this is time period from rheum appt (i.e. diagnosis) to shared care, not from referral to first script 
. gen ssz_3m=1 if time_to_ssz<=90 & time_to_ssz!=. 
(35,188 missing values generated)

. replace ssz_3m=2 if time_to_ssz>90 & time_to_ssz!=.
(2,303 real changes made)

. lab define ssz_3m 1 "Yes" 2 "No", modify

. lab val ssz_3m ssz_3m

. lab var ssz_3m "Sulfasalazine within 3 months" 

. tab ssz_3m if ra_code==1 & has_6m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after csDMARD script

Sulfasalazi |
ne within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         52        0.46        0.46
         No |        781        6.92        7.38
          . |     10,451       92.62      100.00
------------+-----------------------------------
      Total |     11,284      100.00

. tab ssz_3m if ra_code==1 & has_6m_follow_up==1

Sulfasalazi |
ne within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         52        6.24        6.24
         No |        781       93.76      100.00
------------+-----------------------------------
      Total |        833      100.00

. gen ssz_6m=1 if time_to_ssz<=180 & time_to_ssz!=. 
(35,027 missing values generated)

. replace ssz_6m=2 if time_to_ssz>180 & time_to_ssz!=.
(2,142 real changes made)

. lab define ssz_6m 1 "Yes" 2 "No", modify

. lab val ssz_6m ssz_6m

. lab var ssz_6m "Sulfasalazine within 6 months" 

. tab ssz_6m if ra_code==1 & has_6m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after csDMARD script

Sulfasalazi |
ne within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        110        0.97        0.97
         No |        723        6.41        7.38
          . |     10,451       92.62      100.00
------------+-----------------------------------
      Total |     11,284      100.00

. tab ssz_6m if ra_code==1 & has_6m_follow_up==1

Sulfasalazi |
ne within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        110       13.21       13.21
         No |        723       86.79      100.00
------------+-----------------------------------
      Total |        833      100.00

. gen ssz_12m=1 if time_to_ssz<=365 & time_to_ssz!=. 
(34,626 missing values generated)

. replace ssz_12m=2 if time_to_ssz>365 & time_to_ssz!=.
(1,741 real changes made)

. lab define ssz_12m 1 "Yes" 2 "No", modify

. lab val ssz_12m ssz_12m

. lab var ssz_12m "Sulfasalazine within 12 months" 

. tab ssz_12m if ra_code==1 & has_12m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after ssz script

Sulfasalazi |
  ne within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        219        2.07        2.07
         No |        556        5.25        7.31
          . |      9,823       92.69      100.00
------------+-----------------------------------
      Total |     10,598      100.00

. tab ssz_12m if ra_code==1 & has_12m_follow_up==1 //for patients with at least 12m registration

Sulfasalazi |
  ne within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        219       28.26       28.26
         No |        556       71.74      100.00
------------+-----------------------------------
      Total |        775      100.00

. 
. **Sulfasalazine time categories for PsA patients
. tab ssz_3m if psa_code==1 & has_6m_follow_up==1, missing

Sulfasalazi |
ne within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         47        0.42        0.42
         No |        719        6.42        6.83
          . |     10,442       93.17      100.00
------------+-----------------------------------
      Total |     11,208      100.00

. tab ssz_6m if psa_code==1 & has_6m_follow_up==1, missing

Sulfasalazi |
ne within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         95        0.85        0.85
         No |        671        5.99        6.83
          . |     10,442       93.17      100.00
------------+-----------------------------------
      Total |     11,208      100.00

. tab ssz_12m if psa_code==1 & has_12m_follow_up==1, missing //with a least 12m registration

Sulfasalazi |
  ne within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        221        2.08        2.08
         No |        501        4.71        6.78
          . |      9,923       93.22      100.00
------------+-----------------------------------
      Total |     10,645      100.00

. 
. **Hydroxychloroquine use
. gen time_to_hcq=(hydroxychloroquine_date-rheum_appt_date) if hydroxychloroquine==1 & rheum_appt_date!=. & hydroxychloroquine_date>rheum_appt_date 
(32,928 missing values generated)

. tabstat time_to_hcq if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |       770  627.1571     607.5       323       902
----------------------------------------------------------------

. bys diagnosis_year: tabstat time_to_hcq if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by diagnosis year for RA

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |       264  641.3977     635.5       311       921
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |       243  617.7572       590       332       849
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |       226  620.6062       589       304       874
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |        37  627.2973       573       366       920
----------------------------------------------------------------

. bys diagnosis_year: tabstat time_to_hcq if psa_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by diagnosis year for PsA

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |       237  584.5021       569       280       854
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |       234  610.0385     608.5       320       859
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |       231  615.2944       600       316       905
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |        35     498.8       397       318       628
----------------------------------------------------------------

. bys nuts_region: tabstat time_to_hcq if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by region for RA

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |        80  599.3875     587.5     279.5       914
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |       102  655.8431     653.5       343       920
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |       151  650.8146       608       313       973
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |        79  568.9367       571       254       845
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |        70  652.9714       630       328       964
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |       136  626.9779     611.5     347.5     873.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |        70  591.1571       519       293       803
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |        82  640.0854     594.5       364       874
----------------------------------------------------------------

. bys nuts_region: tabstat time_to_hcq if psa_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by region for PsA

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |        66  618.4697     591.5       311       898
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |        63   555.381       534       256       834
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |       149  595.4362       546       319       847
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |        85  624.3059       600       322       944
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |        91  618.2747       541       306       893
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |       159  581.9497       592       257       886
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |        65  588.0923       552       275       864
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |        59  614.4746       635       339       875
----------------------------------------------------------------

. 
. **Hydroxychloroquine time categories for RA patients //Nb. this is time period from rheum appt (i.e. diagnosis) to shared care, not from referral to first script 
. gen hcq_3m=1 if time_to_hcq<=90 & time_to_hcq!=. 
(35,196 missing values generated)

. replace hcq_3m=2 if time_to_hcq>90 & time_to_hcq!=.
(2,268 real changes made)

. lab define hcq_3m 1 "Yes" 2 "No", modify

. lab val hcq_3m hcq_3m

. lab var hcq_3m "Hydroxychloroquine within 3 months" 

. tab hcq_3m if ra_code==1 & has_6m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after csDMARD script

Hydroxychlo |
    roquine |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         36        0.32        0.32
         No |        734        6.50        6.82
          . |     10,514       93.18      100.00
------------+-----------------------------------
      Total |     11,284      100.00

. tab hcq_3m if ra_code==1 & has_6m_follow_up==1

Hydroxychlo |
    roquine |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         36        4.68        4.68
         No |        734       95.32      100.00
------------+-----------------------------------
      Total |        770      100.00

. gen hcq_6m=1 if time_to_hcq<=180 & time_to_hcq!=. 
(35,039 missing values generated)

. replace hcq_6m=2 if time_to_hcq>180 & time_to_hcq!=.
(2,111 real changes made)

. lab define hcq_6m 1 "Yes" 2 "No", modify

. lab val hcq_6m hcq_6m

. lab var hcq_6m "Hydroxychloroquine within 6 months" 

. tab hcq_6m if ra_code==1 & has_6m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after csDMARD script

Hydroxychlo |
    roquine |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         90        0.80        0.80
         No |        680        6.03        6.82
          . |     10,514       93.18      100.00
------------+-----------------------------------
      Total |     11,284      100.00

. tab hcq_6m if ra_code==1 & has_6m_follow_up==1

Hydroxychlo |
    roquine |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         90       11.69       11.69
         No |        680       88.31      100.00
------------+-----------------------------------
      Total |        770      100.00

. gen hcq_12m=1 if time_to_hcq<=365 & time_to_hcq!=. 
(34,617 missing values generated)

. replace hcq_12m=2 if time_to_hcq>365 & time_to_hcq!=.
(1,689 real changes made)

. lab define hcq_12m 1 "Yes" 2 "No", modify

. lab val hcq_12m hcq_12m

. lab var hcq_12m "Hydroxychloroquine within 12 months" 

. tab hcq_12m if ra_code==1 & has_12m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after hcq script

Hydroxychlo |
    roquine |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        218        2.06        2.06
         No |        508        4.79        6.85
          . |      9,872       93.15      100.00
------------+-----------------------------------
      Total |     10,598      100.00

. tab hcq_12m if ra_code==1 & has_12m_follow_up==1 //for patients with at least 12m registration

Hydroxychlo |
    roquine |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        218       30.03       30.03
         No |        508       69.97      100.00
------------+-----------------------------------
      Total |        726      100.00

. 
. **Hydroxychloroquine time categories for PsA patients
. tab hcq_3m if psa_code==1 & has_6m_follow_up==1, missing

Hydroxychlo |
    roquine |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         53        0.47        0.47
         No |        684        6.10        6.58
          . |     10,471       93.42      100.00
------------+-----------------------------------
      Total |     11,208      100.00

. tab hcq_6m if psa_code==1 & has_6m_follow_up==1, missing

Hydroxychlo |
    roquine |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         95        0.85        0.85
         No |        642        5.73        6.58
          . |     10,471       93.42      100.00
------------+-----------------------------------
      Total |     11,208      100.00

. tab hcq_12m if psa_code==1 & has_12m_follow_up==1, missing //with a least 12m registration

Hydroxychlo |
    roquine |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        220        2.07        2.07
         No |        474        4.45        6.52
          . |      9,951       93.48      100.00
------------+-----------------------------------
      Total |     10,645      100.00

. 
. **Leflunomide use
. gen time_to_lef=(leflunomide_date-rheum_appt_date) if leflunomide==1 & rheum_appt_date!=. & leflunomide_date>rheum_appt_date 
(32,995 missing values generated)

. tabstat time_to_lef if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |       781  602.4507       559       319       867
----------------------------------------------------------------

. bys diagnosis_year: tabstat time_to_lef if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by diagnosis year for RA

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |       235  601.8809       567       302       843
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |       279  625.1075       597       355       888
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |       236  568.8051       501     275.5       845
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |        31       659       637       320       921
----------------------------------------------------------------

. bys diagnosis_year: tabstat time_to_lef if psa_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by diagnosis year for PsA

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |       237  563.0464       504       293       800
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |       245  592.3959       587       319       835
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |       216  604.8148     606.5       294     849.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |        37  575.6757       488       386       840
----------------------------------------------------------------

. bys nuts_region: tabstat time_to_lef if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by region for RA

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |        64   530.125       474       217     797.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |        87  683.7356       670       415       948
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |       165  623.3636       601       334       914
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |        94  579.0957     558.5       318       804
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |        70  609.0571       610       334       821
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |       146  627.5274     580.5       296       903
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |        78  533.3846       433       302       796
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |        77  570.8312       572       287       787
----------------------------------------------------------------

. bys nuts_region: tabstat time_to_lef if psa_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by region for PsA

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |        58  592.8103       519       310       869
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |        72  556.0694       533     267.5       748
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |       152  534.7237     509.5       278       781
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |        72    544.75       511     258.5     796.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |        71  614.4648       522       310       975
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |       142  632.2324     655.5       329       923
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |        83  591.9518       542       336       792
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |        85  624.2706       604       389       845
----------------------------------------------------------------

. 
. **Leflunomide time categories for RA patients //Nb. this is time period from rheum appt (i.e. diagnosis) to shared care, not from referral to first script 
. gen lef_3m=1 if time_to_lef<=90 & time_to_lef!=. 
(35,210 missing values generated)

. replace lef_3m=2 if time_to_lef>90 & time_to_lef!=.
(2,215 real changes made)

. lab define lef_3m 1 "Yes" 2 "No", modify

. lab val lef_3m lef_3m

. lab var lef_3m "Leflunomide within 3 months" 

. tab lef_3m if ra_code==1 & has_6m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after csDMARD script

Leflunomide |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         37        0.33        0.33
         No |        744        6.59        6.92
          . |     10,503       93.08      100.00
------------+-----------------------------------
      Total |     11,284      100.00

. tab lef_3m if ra_code==1 & has_6m_follow_up==1

Leflunomide |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         37        4.74        4.74
         No |        744       95.26      100.00
------------+-----------------------------------
      Total |        781      100.00

. gen lef_6m=1 if time_to_lef<=180 & time_to_lef!=. 
(35,041 missing values generated)

. replace lef_6m=2 if time_to_lef>180 & time_to_lef!=.
(2,046 real changes made)

. lab define lef_6m 1 "Yes" 2 "No", modify

. lab val lef_6m lef_6m

. lab var lef_6m "Leflunomide within 6 months" 

. tab lef_6m if ra_code==1 & has_6m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after csDMARD script

Leflunomide |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         89        0.79        0.79
         No |        692        6.13        6.92
          . |     10,503       93.08      100.00
------------+-----------------------------------
      Total |     11,284      100.00

. tab lef_6m if ra_code==1 & has_6m_follow_up==1

Leflunomide |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         89       11.40       11.40
         No |        692       88.60      100.00
------------+-----------------------------------
      Total |        781      100.00

. gen lef_12m=1 if time_to_lef<=365 & time_to_lef!=. 
(34,630 missing values generated)

. replace lef_12m=2 if time_to_lef>365 & time_to_lef!=.
(1,635 real changes made)

. lab define lef_12m 1 "Yes" 2 "No", modify

. lab val lef_12m lef_12m

. lab var lef_12m "Leflunomide within 12 months" 

. tab lef_12m if ra_code==1 & has_12m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after lef script

Leflunomide |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        206        1.94        1.94
         No |        509        4.80        6.75
          . |      9,883       93.25      100.00
------------+-----------------------------------
      Total |     10,598      100.00

. tab lef_12m if ra_code==1 & has_12m_follow_up==1 //for patients with at least 12m registration

Leflunomide |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        206       28.81       28.81
         No |        509       71.19      100.00
------------+-----------------------------------
      Total |        715      100.00

. 
. **Leflunomide time categories for PsA patients
. tab lef_3m if psa_code==1 & has_6m_follow_up==1, missing

Leflunomide |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         49        0.44        0.44
         No |        686        6.12        6.56
          . |     10,473       93.44      100.00
------------+-----------------------------------
      Total |     11,208      100.00

. tab lef_6m if psa_code==1 & has_6m_follow_up==1, missing

Leflunomide |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        100        0.89        0.89
         No |        635        5.67        6.56
          . |     10,473       93.44      100.00
------------+-----------------------------------
      Total |     11,208      100.00

. tab lef_12m if psa_code==1 & has_12m_follow_up==1, missing //with a least 12m registration

Leflunomide |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        211        1.98        1.98
         No |        489        4.59        6.58
          . |      9,945       93.42      100.00
------------+-----------------------------------
      Total |     10,645      100.00

. 
. **Time to first biologic script, whereby first rheum appt is classed as diagnosis date (assumes rheum appt present); high_cost drug data available to Nov 2020===============================================================
> =======*/
. 
. *Below analyses are only for patients with at least 12 months of follow-up available after EIA code
. gen time_to_biologic=(biologic_date-rheum_appt_date) if biologic==1 & rheum_appt_date!=. & biologic_date>rheum_appt_date 
(14,304 missing values generated)

. tabstat time_to_biologic if has_12m_follow_up==1, stats (n mean p50 p25 p75) //for all EIA patients

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_bi~c |     18915  462.6669       404       207       669
----------------------------------------------------------------

. bys eia_diagnosis: tabstat time_to_biologic if has_12m_follow_up==1, stats (n mean p50 p25 p75) 

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_bi~c |      6368  456.8543       400       203       665
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_bi~c |      6366  468.2752       411       211       674
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_bi~c |      6181  462.8793       401       207       668
----------------------------------------------------------------

. bys diagnosis_year: tabstat time_to_biologic if ra_code==1 & has_12m_follow_up==1, stats (n mean p50 p25 p75) //by diagnosis year

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_bi~c |      2009   454.665       400       213       654
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_bi~c |      2078  455.9668       399       202       657
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_bi~c |      1997  457.8438       399       196       673
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_bi~c |       284  471.8768     414.5       181     720.5
----------------------------------------------------------------

. bys nuts_region: tabstat time_to_biologic if ra_code==1 & has_12m_follow_up==1, stats (n mean p50 p25 p75) //by region

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_bi~c |       639  447.0344       392       190       650
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_bi~c |       649  495.3359       432       228       715
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_bi~c |      1318  449.1055       393       198       665
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_bi~c |       597  448.5243       392       188       653
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_bi~c |       637  476.0549       408       214       706
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_bi~c |      1275  442.9616       391       188       635
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_bi~c |       630       470       415       223       683
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_bi~c |       623  446.7207       399       210       640
----------------------------------------------------------------

. 
. **What was first biologic
. gen first_bio=""
(35,343 missing values generated)

. foreach var of varlist abatacept_date adalimumab_date baricitinib_date certolizumab_date etanercept_date golimumab_date guselkumab_date infliximab_date ixekizumab_date rituximab_date sarilumab_date secukinumab_date tocili
> zumab_date tofacitinib_date upadacitinib_date ustekinumab_date {
  2.         replace first_bio="`var'" if biologic_date==`var' & biologic_date!=.
  3.         }
variable first_bio was str1 now str14
(1,685 real changes made)
variable first_bio was str14 now str15
(1,697 real changes made)
variable first_bio was str15 now str16
(1,637 real changes made)
variable first_bio was str16 now str17
(1,725 real changes made)
(1,679 real changes made)
(1,664 real changes made)
(1,601 real changes made)
(1,663 real changes made)
(1,583 real changes made)
(1,616 real changes made)
(1,614 real changes made)
(1,670 real changes made)
(1,689 real changes made)
(1,707 real changes made)
(1,613 real changes made)
(1,653 real changes made)

. gen first_biologic = substr(first_bio, 1, length(first_bio) - 5)        
(9,383 missing values generated)

. drop first_bio

. tab first_biologic if has_12m_follow_up==1 //for all EIA patients

first_biolog |
          ic |      Freq.     Percent        Cum.
-------------+-----------------------------------
   abatacept |      1,472        6.32        6.32
  adalimumab |      1,456        6.25       12.56
 baricitinib |      1,426        6.12       18.68
certolizumab |      1,459        6.26       24.94
  etanercept |      1,476        6.33       31.28
   golimumab |      1,480        6.35       37.63
  guselkumab |      1,391        5.97       43.60
  infliximab |      1,451        6.23       49.82
  ixekizumab |      1,397        5.99       55.82
   rituximab |      1,398        6.00       61.82
   sarilumab |      1,424        6.11       67.93
 secukinumab |      1,502        6.45       74.37
 tocilizumab |      1,507        6.47       80.84
 tofacitinib |      1,526        6.55       87.39
upadacitinib |      1,455        6.24       93.63
 ustekinumab |      1,484        6.37      100.00
-------------+-----------------------------------
       Total |     23,304      100.00

. bys eia_diagnosis: tab first_biologic if has_12m_follow_up==1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

first_biolog |
          ic |      Freq.     Percent        Cum.
-------------+-----------------------------------
   abatacept |        494        6.31        6.31
  adalimumab |        465        5.94       12.25
 baricitinib |        488        6.23       18.48
certolizumab |        503        6.42       24.91
  etanercept |        475        6.07       30.97
   golimumab |        471        6.02       36.99
  guselkumab |        492        6.28       43.28
  infliximab |        490        6.26       49.53
  ixekizumab |        475        6.07       55.60
   rituximab |        478        6.11       61.71
   sarilumab |        477        6.09       67.80
 secukinumab |        537        6.86       74.66
 tocilizumab |        505        6.45       81.11
 tofacitinib |        484        6.18       87.29
upadacitinib |        493        6.30       93.59
 ustekinumab |        502        6.41      100.00
-------------+-----------------------------------
       Total |      7,829      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

first_biolog |
          ic |      Freq.     Percent        Cum.
-------------+-----------------------------------
   abatacept |        484        6.19        6.19
  adalimumab |        505        6.46       12.64
 baricitinib |        488        6.24       18.88
certolizumab |        492        6.29       25.17
  etanercept |        504        6.44       31.61
   golimumab |        526        6.72       38.34
  guselkumab |        451        5.77       44.10
  infliximab |        475        6.07       50.17
  ixekizumab |        464        5.93       56.10
   rituximab |        452        5.78       61.88
   sarilumab |        485        6.20       68.08
 secukinumab |        499        6.38       74.46
 tocilizumab |        505        6.46       80.92
 tofacitinib |        506        6.47       87.38
upadacitinib |        488        6.24       93.62
 ustekinumab |        499        6.38      100.00
-------------+-----------------------------------
       Total |      7,823      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

first_biolog |
          ic |      Freq.     Percent        Cum.
-------------+-----------------------------------
   abatacept |        494        6.46        6.46
  adalimumab |        486        6.35       12.81
 baricitinib |        450        5.88       18.69
certolizumab |        464        6.06       24.75
  etanercept |        497        6.50       31.25
   golimumab |        483        6.31       37.56
  guselkumab |        448        5.85       43.41
  infliximab |        486        6.35       49.76
  ixekizumab |        458        5.99       55.75
   rituximab |        468        6.12       61.87
   sarilumab |        462        6.04       67.90
 secukinumab |        466        6.09       73.99
 tocilizumab |        497        6.50       80.49
 tofacitinib |        536        7.00       87.49
upadacitinib |        474        6.19       93.69
 ustekinumab |        483        6.31      100.00
-------------+-----------------------------------
       Total |      7,652      100.00


. 
. **Biologic time categories (for all patients)
. gen biologic_3m=1 if time_to_biologic<=90 & time_to_biologic!=. 
(33,123 missing values generated)

. replace biologic_3m=2 if time_to_biologic>90 & time_to_biologic!=.
(18,819 real changes made)

. lab define biologic_3m 1 "Yes" 2 "No", modify

. lab val biologic_3m biologic_3m

. lab var biologic_3m "bDMARD/tsDMARD within 3 months" 

. bys eia_diagnosis: tab biologic_3m if has_6m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after bDMARD/tsDMARD script

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

bDMARD/tsDM |
 ARD within |
   3 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        732        6.49        6.49
         No |      6,034       53.47       59.96
          . |      4,518       40.04      100.00
------------+-----------------------------------
      Total |     11,284      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

bDMARD/tsDM |
 ARD within |
   3 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        676        6.03        6.03
         No |      5,993       53.47       59.50
          . |      4,539       40.50      100.00
------------+-----------------------------------
      Total |     11,208      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

bDMARD/tsDM |
 ARD within |
   3 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        706        6.38        6.38
         No |      5,832       52.69       59.07
          . |      4,531       40.93      100.00
------------+-----------------------------------
      Total |     11,069      100.00


. bys eia_diagnosis: tab biologic_3m if has_6m_follow_up==1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

bDMARD/tsDM |
 ARD within |
   3 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        732       10.82       10.82
         No |      6,034       89.18      100.00
------------+-----------------------------------
      Total |      6,766      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

bDMARD/tsDM |
 ARD within |
   3 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        676       10.14       10.14
         No |      5,993       89.86      100.00
------------+-----------------------------------
      Total |      6,669      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

bDMARD/tsDM |
 ARD within |
   3 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        706       10.80       10.80
         No |      5,832       89.20      100.00
------------+-----------------------------------
      Total |      6,538      100.00


. gen biologic_6m=1 if time_to_biologic<=180 & time_to_biologic!=. 
(30,795 missing values generated)

. replace biologic_6m=2 if time_to_biologic>180 & time_to_biologic!=.
(16,491 real changes made)

. lab define biologic_6m 1 "Yes" 2 "No", modify

. lab val biologic_6m biologic_6m

. lab var biologic_6m "bDMARD/tsDMARD within 6 months" 

. bys eia_diagnosis: tab biologic_6m if has_6m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after bDMARD/tsDMARD script

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,495       13.25       13.25
         No |      5,271       46.71       59.96
          . |      4,518       40.04      100.00
------------+-----------------------------------
      Total |     11,284      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,397       12.46       12.46
         No |      5,272       47.04       59.50
          . |      4,539       40.50      100.00
------------+-----------------------------------
      Total |     11,208      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,440       13.01       13.01
         No |      5,098       46.06       59.07
          . |      4,531       40.93      100.00
------------+-----------------------------------
      Total |     11,069      100.00


. bys eia_diagnosis: tab biologic_6m if has_6m_follow_up==1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,495       22.10       22.10
         No |      5,271       77.90      100.00
------------+-----------------------------------
      Total |      6,766      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,397       20.95       20.95
         No |      5,272       79.05      100.00
------------+-----------------------------------
      Total |      6,669      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,440       22.03       22.03
         No |      5,098       77.97      100.00
------------+-----------------------------------
      Total |      6,538      100.00


. gen biologic_12m=1 if time_to_biologic<=365 & time_to_biologic!=. 
(25,852 missing values generated)

. replace biologic_12m=2 if time_to_biologic>365 & time_to_biologic!=.
(11,548 real changes made)

. lab define biologic_12m 1 "Yes" 2 "No", modify

. lab val biologic_12m biologic_12m

. lab var biologic_12m "bDMARD/tsDMARD within 12 months" 

. bys eia_diagnosis: tab biologic_12m if has_12m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after bDMARD/tsDMARD script

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      2,899       27.35       27.35
         No |      3,469       32.73       60.09
          . |      4,230       39.91      100.00
------------+-----------------------------------
      Total |     10,598      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      2,832       26.60       26.60
         No |      3,534       33.20       59.80
          . |      4,279       40.20      100.00
------------+-----------------------------------
      Total |     10,645      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      2,801       26.73       26.73
         No |      3,380       32.26       58.99
          . |      4,297       41.01      100.00
------------+-----------------------------------
      Total |     10,478      100.00


. bys eia_diagnosis: tab biologic_12m if has_12m_follow_up==1 //for patients with at least 12m registration

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      2,899       45.52       45.52
         No |      3,469       54.48      100.00
------------+-----------------------------------
      Total |      6,368      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      2,832       44.49       44.49
         No |      3,534       55.51      100.00
------------+-----------------------------------
      Total |      6,366      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      2,801       45.32       45.32
         No |      3,380       54.68      100.00
------------+-----------------------------------
      Total |      6,181      100.00


. 
. **Biologic time categories (by year)
. bys diagnosis_year: tab biologic_6m if has_6m_follow_up==1, missing //for all EIA patients with at least 6m follow-up

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,383       12.76       12.76
         No |      5,069       46.76       59.52
          . |      4,388       40.48      100.00
------------+-----------------------------------
      Total |     10,840      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,367       12.86       12.86
         No |      4,989       46.93       59.79
          . |      4,275       40.21      100.00
------------+-----------------------------------
      Total |     10,631      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,388       13.19       13.19
         No |      4,871       46.28       59.47
          . |      4,265       40.53      100.00
------------+-----------------------------------
      Total |     10,524      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        194       12.39       12.39
         No |        712       45.47       57.85
          . |        660       42.15      100.00
------------+-----------------------------------
      Total |      1,566      100.00


. bys diagnosis_year eia_diagnosis: tab biologic_6m if has_6m_follow_up==1, missing //for each diagnosis with at least 6m follow-up

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020, eia_diagnosis = RA

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        463       12.72       12.72
         No |      1,672       45.92       58.64
          . |      1,506       41.36      100.00
------------+-----------------------------------
      Total |      3,641      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020, eia_diagnosis = PsA

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        462       12.69       12.69
         No |      1,729       47.49       60.18
          . |      1,450       39.82      100.00
------------+-----------------------------------
      Total |      3,641      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020, eia_diagnosis = AxSpA

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        458       12.87       12.87
         No |      1,668       46.88       59.75
          . |      1,432       40.25      100.00
------------+-----------------------------------
      Total |      3,558      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021, eia_diagnosis = RA

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        486       13.30       13.30
         No |      1,741       47.66       60.96
          . |      1,426       39.04      100.00
------------+-----------------------------------
      Total |      3,653      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021, eia_diagnosis = PsA

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        419       11.97       11.97
         No |      1,668       47.64       59.61
          . |      1,414       40.39      100.00
------------+-----------------------------------
      Total |      3,501      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021, eia_diagnosis = AxSpA

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        462       13.29       13.29
         No |      1,580       45.44       58.73
          . |      1,435       41.27      100.00
------------+-----------------------------------
      Total |      3,477      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022, eia_diagnosis = RA

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        471       13.54       13.54
         No |      1,630       46.85       60.39
          . |      1,378       39.61      100.00
------------+-----------------------------------
      Total |      3,479      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022, eia_diagnosis = PsA

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        451       12.77       12.77
         No |      1,640       46.42       59.18
          . |      1,442       40.82      100.00
------------+-----------------------------------
      Total |      3,533      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022, eia_diagnosis = AxSpA

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        466       13.27       13.27
         No |      1,601       45.59       58.86
          . |      1,445       41.14      100.00
------------+-----------------------------------
      Total |      3,512      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = ., eia_diagnosis = RA

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         75       14.68       14.68
         No |        228       44.62       59.30
          . |        208       40.70      100.00
------------+-----------------------------------
      Total |        511      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = ., eia_diagnosis = PsA

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         65       12.20       12.20
         No |        235       44.09       56.29
          . |        233       43.71      100.00
------------+-----------------------------------
      Total |        533      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = ., eia_diagnosis = AxSpA

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         54       10.34       10.34
         No |        249       47.70       58.05
          . |        219       41.95      100.00
------------+-----------------------------------
      Total |        522      100.00


. bys diagnosis_year: tab biologic_12m if has_12m_follow_up==1, missing //for all EIA patients

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      2,758       26.86       26.86
         No |      3,372       32.84       59.70
          . |      4,138       40.30      100.00
------------+-----------------------------------
      Total |     10,268      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      2,687       26.88       26.88
         No |      3,291       32.92       59.80
          . |      4,018       40.20      100.00
------------+-----------------------------------
      Total |      9,996      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      2,709       27.12       27.12
         No |      3,235       32.39       59.51
          . |      4,044       40.49      100.00
------------+-----------------------------------
      Total |      9,988      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        378       25.73       25.73
         No |        485       33.02       58.75
          . |        606       41.25      100.00
------------+-----------------------------------
      Total |      1,469      100.00


. bys diagnosis_year eia_diagnosis: tab biologic_12m if has_12m_follow_up==1, missing //for each diagnosis

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020, eia_diagnosis = RA

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        910       26.69       26.69
         No |      1,099       32.23       58.91
          . |      1,401       41.09      100.00
------------+-----------------------------------
      Total |      3,410      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020, eia_diagnosis = PsA

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        934       26.92       26.92
         No |      1,169       33.70       60.62
          . |      1,366       39.38      100.00
------------+-----------------------------------
      Total |      3,469      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020, eia_diagnosis = AxSpA

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        914       26.97       26.97
         No |      1,104       32.58       59.55
          . |      1,371       40.45      100.00
------------+-----------------------------------
      Total |      3,389      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021, eia_diagnosis = RA

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        947       27.80       27.80
         No |      1,131       33.20       60.99
          . |      1,329       39.01      100.00
------------+-----------------------------------
      Total |      3,407      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021, eia_diagnosis = PsA

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        871       26.28       26.28
         No |      1,117       33.71       59.99
          . |      1,326       40.01      100.00
------------+-----------------------------------
      Total |      3,314      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021, eia_diagnosis = AxSpA

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        869       26.53       26.53
         No |      1,043       31.85       58.38
          . |      1,363       41.62      100.00
------------+-----------------------------------
      Total |      3,275      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022, eia_diagnosis = RA

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        916       27.74       27.74
         No |      1,081       32.74       60.48
          . |      1,305       39.52      100.00
------------+-----------------------------------
      Total |      3,302      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022, eia_diagnosis = PsA

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        902       26.92       26.92
         No |      1,081       32.26       59.18
          . |      1,368       40.82      100.00
------------+-----------------------------------
      Total |      3,351      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022, eia_diagnosis = AxSpA

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        891       26.72       26.72
         No |      1,073       32.17       58.89
          . |      1,371       41.11      100.00
------------+-----------------------------------
      Total |      3,335      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = ., eia_diagnosis = RA

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        126       26.30       26.30
         No |        158       32.99       59.29
          . |        195       40.71      100.00
------------+-----------------------------------
      Total |        479      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = ., eia_diagnosis = PsA

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        125       24.46       24.46
         No |        167       32.68       57.14
          . |        219       42.86      100.00
------------+-----------------------------------
      Total |        511      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = ., eia_diagnosis = AxSpA

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        127       26.51       26.51
         No |        160       33.40       59.92
          . |        192       40.08      100.00
------------+-----------------------------------
      Total |        479      100.00


. 
. save "$projectdir/output/data/file_eia_all", replace
(file C:/Users/k1754142/OneDrive/PhD Project/OpenSAFELY/Github Practice/output/data/file_eia_all.dta not found)
file C:/Users/k1754142/OneDrive/PhD Project/OpenSAFELY/Github Practice/output/data/file_eia_all.dta saved

. 
. log close
      name:  <unnamed>
       log:  C:/Users/k1754142/OneDrive/PhD Project/OpenSAFELY/Github Practice/logs/cleaning_dataset.log
  log type:  text
 closed on:   6 Apr 2022, 11:54:26
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
