-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/cleaning_dataset.log
  log type:  text
 opened on:  14 Apr 2022, 10:50:29

. 
. di "$projectdir"
/workspace

. di "$logdir"
/workspace/logs

. 
. import delimited "$projectdir/output/input.csv", clear
(64 vars, 200,000 obs)

. 
. **Set Ado file path
. adopath + "$projectdir/analysis/extra_ados"
  [1]  (BASE)      "/usr/local/stata/ado/base/"
  [2]  (SITE)      "/usr/local/ado/"
  [3]              "."
  [4]  (PERSONAL)  "~/ado/personal/"
  [5]  (PLUS)      "~/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "/workspace/analysis/extra_ados"

. 
. **Set index dates ===========================================================
> */
. global year_preceding = "01/03/2018"

. global start_date = "01/03/2019"

. global outpatient_date = "01/04/2019"

. global fup_6m_date = "01/09/2021"

. global end_date = "01/03/2022"

. 
. **Rename variables (some are too long for Stata to handle) ==================
> =====================*/
. rename chronic_respiratory_disease chronic_resp_disease

. 
. **Convert date strings to dates =============================================
> =======*/
. ***Some dates are given with month/year only, so adding day 15 to enable them
>  to be processed as dates 
. 
. foreach var of varlist   hba1c_mmol_per_mol_date                        ///
>                                                  hba1c_percentage_date       
>                    ///
>                                                  creatinine_date             
>                    ///
>                                                  bmi_date_measured           
>                ///
>                                                  abatacept                   
>                                    ///
>                                                  adalimumab                  
>                                    ///     
>                                                  baricitinib                 
>                            ///
>                                                  certolizumab                
>                            ///
>                                                  etanercept                  
>                                    ///
>                                                  golimumab                   
>                                    ///
>                                                  guselkumab                  
>                                    ///     
>                                                  infliximab                  
>                                    ///
>                                                  ixekizumab                  
>                                    ///
>                                                  methotrexate_hcd            
>                            ///
>                                                  rituximab                   
>                                    ///
>                                                  sarilumab                   
>                                    ///
>                                                  secukinumab                 
>                            ///     
>                                                  tocilizumab                 
>                            ///
>                                                  tofacitinib                 
>                            ///
>                                                  upadacitinib                
>                            ///
>                                                  ustekinumab                 
>                            ///
>                                                  {
  2.                                                         
.                 capture confirm string variable `var'
  3.                 if _rc!=0 {
  4.                         assert `var'==.
  5.                         rename `var' `var'_date
  6.                 }
  7.         
.                 else {
  8.                                 replace `var' = `var' + "-15"
  9.                                 rename `var' `var'_dstr
 10.                                 replace `var'_dstr = " " if `var'_dstr == 
> "-15"
 11.                                 gen `var'_date = date(`var'_dstr, "YMD") 
 12.                                 order `var'_date, after(`var'_dstr)
 13.                                 drop `var'_dstr
 14.                 }
 15.         
.         format `var'_date %td
 16. }
variable hba1c_mmol_per_mol_date was str7 now str10
(200,000 real changes made)
(10,000 real changes made)
(10,000 missing values generated)
variable hba1c_percentage_date was str7 now str10
(200,000 real changes made)
(10,000 real changes made)
(10,000 missing values generated)
variable creatinine_date was str7 now str10
(200,000 real changes made)
(10,000 real changes made)
(10,000 missing values generated)
variable bmi_date_measured was str7 now str10
(200,000 real changes made)
(80,000 real changes made)
(80,000 missing values generated)
variable abatacept was str7 now str10
(200,000 real changes made)
(160,000 real changes made)
(160,000 missing values generated)
variable adalimumab was str7 now str10
(200,000 real changes made)
(160,000 real changes made)
(160,000 missing values generated)
variable baricitinib was str7 now str10
(200,000 real changes made)
(160,000 real changes made)
(160,000 missing values generated)
variable certolizumab was str7 now str10
(200,000 real changes made)
(160,000 real changes made)
(160,000 missing values generated)
variable etanercept was str7 now str10
(200,000 real changes made)
(160,000 real changes made)
(160,000 missing values generated)
variable golimumab was str7 now str10
(200,000 real changes made)
(160,000 real changes made)
(160,000 missing values generated)
variable guselkumab was str7 now str10
(200,000 real changes made)
(160,000 real changes made)
(160,000 missing values generated)
variable infliximab was str7 now str10
(200,000 real changes made)
(160,000 real changes made)
(160,000 missing values generated)
variable ixekizumab was str7 now str10
(200,000 real changes made)
(160,000 real changes made)
(160,000 missing values generated)
variable methotrexate_hcd was str7 now str10
(200,000 real changes made)
(160,000 real changes made)
(160,000 missing values generated)
variable rituximab was str7 now str10
(200,000 real changes made)
(160,000 real changes made)
(160,000 missing values generated)
variable sarilumab was str7 now str10
(200,000 real changes made)
(160,000 real changes made)
(160,000 missing values generated)
variable secukinumab was str7 now str10
(200,000 real changes made)
(160,000 real changes made)
(160,000 missing values generated)
variable tocilizumab was str7 now str10
(200,000 real changes made)
(160,000 real changes made)
(160,000 missing values generated)
variable tofacitinib was str7 now str10
(200,000 real changes made)
(160,000 real changes made)
(160,000 missing values generated)
variable upadacitinib was str7 now str10
(200,000 real changes made)
(160,000 real changes made)
(160,000 missing values generated)
variable ustekinumab was str7 now str10
(200,000 real changes made)
(160,000 real changes made)
(160,000 missing values generated)

. 
. **Conversion for dates with day already included ============================
> ========================*/
. 
. foreach var of varlist   died_date_ons                                       
>    ///
>                                              eia_code_date                   
>                            ///
>                                                  rheum_appt_date             
>                            ///
>                                              ra_code_date                    
>                            ///
>                                                  psa_code_date               
>                            ///
>                                                  anksp_code_date             
>                            ///
>                                                  last_gp_prerheum_date       
>                    ///
>                                                  last_gp_precode_date        
>                    ///     
>                                                  last_gp_refrheum_date       
>                    ///
>                                                  last_gp_refcode_date        
>                    ///
>                                                  referral_rheum_prerheum     
>                    ///
>                                                  referral_rheum_precode      
>                    ///     
>                                                  chronic_cardiac_disease     
>                    ///
>                                                  diabetes                    
>                                    ///
>                                                  hypertension                
>                            ///     
>                                                  chronic_resp_disease        
>                    ///
>                                                  copd                        
>                                    ///
>                                                  chronic_liver_disease       
>                    ///
>                                                  stroke                      
>                                    ///
>                                                  lung_cancer                 
>                            ///
>                                                  haem_cancer                 
>                            ///
>                                                  other_cancer                
>                            ///
>                                                  esrf                        
>                                    ///
>                                                  organ_transplant            
>                            ///
>                                                  hydroxychloroquine          
>                            ///
>                                                  leflunomide                 
>                            ///
>                                                  methotrexate                
>                            ///
>                                                  methotrexate_inj            
>                            ///
>                                                  sulfasalazine               
>                            ///
>                                                  {
  2.                                                                  
.                 capture confirm string variable `var'
  3.                 if _rc!=0 {
  4.                         assert `var'==.
  5.                         rename `var' `var'_date
  6.                 }
  7.         
.                 else {
  8.                                 rename `var' `var'_dstr
  9.                                 gen `var'_date = date(`var'_dstr, "YMD") 
 10.                                 order `var'_date, after(`var'_dstr)
 11.                                 drop `var'_dstr
 12.                                 gen `var'_date15 = `var'_date+15
 13.                                 order `var'_date15, after(`var'_date)
 14.                                 drop `var'_date
 15.                                 rename `var'_date15 `var'_date
 16.                 }
 17.         
.         format `var'_date %td
 18. }
(180,000 missing values generated)
(180,000 missing values generated)
(2,000 missing values generated)
(2,000 missing values generated)
(19,999 missing values generated)
(19,999 missing values generated)
(2,000 missing values generated)
(2,000 missing values generated)
(2,000 missing values generated)
(2,000 missing values generated)
(2,000 missing values generated)
(2,000 missing values generated)
(19,999 missing values generated)
(19,999 missing values generated)
(19,999 missing values generated)
(19,999 missing values generated)
(19,999 missing values generated)
(19,999 missing values generated)
(19,999 missing values generated)
(19,999 missing values generated)
(19,999 missing values generated)
(19,999 missing values generated)
(19,999 missing values generated)
(19,999 missing values generated)
(160,000 missing values generated)
(160,000 missing values generated)
(160,000 missing values generated)
(160,000 missing values generated)
(160,000 missing values generated)
(160,000 missing values generated)
(160,000 missing values generated)
(160,000 missing values generated)
(160,000 missing values generated)
(160,000 missing values generated)
(160,000 missing values generated)
(160,000 missing values generated)
(160,000 missing values generated)
(160,000 missing values generated)
(160,000 missing values generated)
(160,000 missing values generated)
(160,000 missing values generated)
(160,000 missing values generated)
(160,000 missing values generated)
(160,000 missing values generated)
(160,000 missing values generated)
(160,000 missing values generated)
(160,000 missing values generated)
(160,000 missing values generated)
(160,000 missing values generated)
(160,000 missing values generated)
(160,000 missing values generated)
(160,000 missing values generated)
(160,000 missing values generated)
(160,000 missing values generated)
(160,000 missing values generated)
(160,000 missing values generated)
(160,000 missing values generated)
(160,000 missing values generated)

.                                                  
. **Rename variables with extra 'date' added to the end of variable names======
> =====================================================*/ 
. rename rheum_appt_date_date rheum_appt_date

. rename eia_code_date_date eia_code_date

. rename ra_code_date_date ra_code_date

. rename psa_code_date_date psa_code_date

. rename anksp_code_date_date anksp_code_date

. rename died_date_ons_date died_ons_date

. rename last_gp_prerheum_date_date last_gp_prerheum_date

. rename last_gp_refrheum_date_date last_gp_refrheum_date

. rename last_gp_refcode_date_date last_gp_refcode_date

. rename last_gp_precode_date_date last_gp_precode_date

. rename hba1c_mmol_per_mol_date_date hba1c_mmol_per_mol_date

. rename hba1c_percentage_date_date hba1c_percentage_date

. rename creatinine_date_date creatinine_date

. rename creatinine creatinine_value 

. rename bmi_date_measured_date bmi_date

. rename bmi bmi_value

. 
. **Create binary indicator variables for relevant conditions =================
> ===================================*/
. 
. foreach var of varlist   eia_code_date                                       
>    ///
>                                                  rheum_appt_date             
>                            ///
>                                              ra_code_date                    
>                            ///
>                                                  psa_code_date               
>                            ///
>                                                  anksp_code_date             
>                            ///
>                                                  died_ons_date               
>                            ///
>                                                  last_gp_prerheum_date       
>                    ///
>                                                  last_gp_precode_date        
>                    ///     
>                                                  last_gp_refrheum_date       
>                    ///
>                                                  last_gp_refcode_date        
>                    ///
>                                                  referral_rheum_prerheum_date
>            ///
>                                                  referral_rheum_precode_date 
>            ///     
>                                                  chronic_cardiac_disease_date
>            ///
>                                                  diabetes_date               
>                            ///
>                                                  hypertension_date           
>                            ///
>                                                  chronic_resp_disease_date   
>                    ///
>                                                  copd_date                   
>                                    ///
>                                                  chronic_liver_disease_date  
>                    ///
>                                                  stroke_date                 
>                            ///
>                                                  lung_cancer_date            
>                            ///
>                                                  haem_cancer_date            
>                            ///             
>                                                  other_cancer_date           
>                            ///
>                                                  esrf_date                   
>                                    ///
>                                                  creatinine_date             
>                            ///
>                                                  organ_transplant_date       
>                    ///
>                                                  hydroxychloroquine_date     
>                    ///     
>                                                  leflunomide_date            
>                            ///
>                                                  methotrexate_date           
>                            ///
>                                                  methotrexate_inj_date       
>                    ///             
>                                                  sulfasalazine_date          
>                            ///
>                                                  abatacept_date              
>                            ///
>                                                  adalimumab_date             
>                            ///
>                                                  baricitinib_date            
>                            ///
>                                                  certolizumab_date           
>                            ///
>                                                  etanercept_date             
>                            ///
>                                                  golimumab_date              
>                            ///
>                                                  guselkumab_date             
>                            ///
>                                                  infliximab_date             
>                            ///
>                                                  ixekizumab_date             
>                            ///
>                                                  methotrexate_hcd_date       
>                    ///
>                                                  rituximab_date              
>                            ///             
>                                                  sarilumab_date              
>                            ///
>                                                  secukinumab_date            
>                            ///
>                                                  tocilizumab_date            
>                            ///             
>                                                  tofacitinib_date            
>                            ///
>                                                  upadacitinib_date           
>                            ///
>                                                  ustekinumab_date   {        
>                    
  2.         /*date ranges are applied in python, so presence of date indicates
>  presence of 
>           disease in the correct time frame*/ 
.         local newvar =  substr("`var'", 1, length("`var'") - 5)
  3.         gen `newvar' = (`var'!=. )
  4.         order `newvar', after(`var')
  5. }

. 
. **Create and label variables ================================================
> ===========*/
. 
. **Demographics
. ***Sex
. gen male = 1 if sex == "M"
(102,154 missing values generated)

. replace male = 0 if sex == "F"
(102,154 real changes made)

. lab var male "Male"

. lab define male 0 "No" 1 "Yes", modify

. lab val male male

. tab male, missing

       Male |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |    102,154       51.08       51.08
        Yes |     97,846       48.92      100.00
------------+-----------------------------------
      Total |    200,000      100.00

. 
. ***Ethnicity
. replace ethnicity = .u if ethnicity == .
(50,000 real changes made, 50,000 to missing)

. ****rearrange in order of prevalence
. recode ethnicity 2=6 /* mixed to 6 */
(ethnicity: 30174 changes made)

. recode ethnicity 3=2 /* south asian to 2 */
(ethnicity: 14827 changes made)

. recode ethnicity 4=3 /* black to 3 */
(ethnicity: 15053 changes made)

. recode ethnicity 6=4 /* mixed to 4 */
(ethnicity: 30174 changes made)

. recode ethnicity 5=4 /* other to 4 */
(ethnicity: 15055 changes made)

. 
. label define ethnicity  1 "White"                                       ///
>                                                 2 "Asian/Asian British"      
>    ///
>                                                 3 "Black"                    
>                    ///
>                                                 4 "Mixed/Other"              
>            ///
>                                                 .u "Not known"

. label values ethnicity ethnicity

. lab var ethnicity "Ethnicity"

. tab ethnicity, missing

          Ethnicity |      Freq.     Percent        Cum.
--------------------+-----------------------------------
              White |     74,891       37.45       37.45
Asian/Asian British |     14,827        7.41       44.86
              Black |     15,053        7.53       52.39
        Mixed/Other |     45,229       22.61       75.00
          Not known |     50,000       25.00      100.00
--------------------+-----------------------------------
              Total |    200,000      100.00

. 
. ***STP 
. rename stp stp_old

. bysort stp_old: gen stp = 1 if _n==1
(199,998 missing values generated)

. replace stp = sum(stp) //
(199,999 real changes made)

. drop stp_old

. 
. ***Regions
. encode region, gen(nuts_region)

. tab region, missing

                  region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
                         |      2,000        1.00        1.00
           East Midlands |     19,758        9.88       10.88
         East of England |     19,773        9.89       20.77
                  London |     39,581       19.79       40.56
              North East |     19,934        9.97       50.52
              North West |     19,633        9.82       60.34
              South East |     39,756       19.88       80.22
           West Midlands |     19,795        9.90       90.12
Yorkshire and the Humber |     19,770        9.88      100.00
-------------------------+-----------------------------------
                   Total |    200,000      100.00

. replace region="Not known" if region==""
(2,000 real changes made)

. 
. ***IMD
. *Reverse the order (so high is more deprived)
. recode imd 5 = 1 4 = 2 3 = 3 2 = 4 1 = 5 0 = .u
(imd: 161717 changes made)

. label define imd 1 "1 least deprived" 2 "2" 3 "3" 4 "4" 5 "5 most deprived" .
> u "Not known"

. label values imd imd 

. lab var imd "Index of multiple deprivation"

. tab imd, missing

        Index of |
        multiple |
     deprivation |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |     38,241       19.12       19.12
               2 |     37,486       18.74       37.86
               3 |     38,283       19.14       57.01
               4 |     38,074       19.04       76.04
 5 most deprived |     37,948       18.97       95.02
       Not known |      9,968        4.98      100.00
-----------------+-----------------------------------
           Total |    200,000      100.00

. 
. ***Age variables
. *Nb. works if ages 18 and over
. *Create categorised age
. drop if age<18 & age !=.
(42,817 observations deleted)

. drop if age>109 & age !=.
(0 observations deleted)

. drop if age==.
(0 observations deleted)

. lab var age "Age"

. 
. recode age 18/39.9999 = 1 /// 
>            40/49.9999 = 2 ///
>                    50/59.9999 = 3 ///
>                60/69.9999 = 4 ///
>                    70/79.9999 = 5 ///
>                    80/max = 6, gen(agegroup) 
(157183 differences between age and agegroup)

. 
. label define agegroup   1 "18-39" ///
>                                                 2 "40-49" ///
>                                                 3 "50-59" ///
>                                                 4 "60-69" ///
>                                                 5 "70-79" ///
>                                                 6 "80+"

.                                                 
. label values agegroup agegroup

. lab var agegroup "Age group"

. tab agegroup, missing

  Age group |      Freq.     Percent        Cum.
------------+-----------------------------------
      18-39 |     57,037       36.29       36.29
      40-49 |     25,627       16.30       52.59
      50-59 |     27,005       17.18       69.77
      60-69 |     21,317       13.56       83.33
      70-79 |     16,414       10.44       93.78
        80+ |      9,783        6.22      100.00
------------+-----------------------------------
      Total |    157,183      100.00

. 
. *Create binary age
. recode age min/69.999 = 0 ///
>            70/max = 1, gen(age70)
(157183 differences between age and age70)

. 
. ***Body Mass Index
. *Recode strange values 
. replace bmi_value = . if bmi_value == 0 
(62,857 real changes made, 62,857 to missing)

. replace bmi_value = . if !inrange(bmi_value, 10, 80)
(552 real changes made, 552 to missing)

. 
. *Restrict to within 10 years of EIA diagnosis date and aged>16 
. gen bmi_time = (eia_code_date - bmi_date)/365.25
(63,784 missing values generated)

. gen bmi_age = age - bmi_time
(63,784 missing values generated)

. replace bmi_value = . if bmi_age < 16 
(66,432 real changes made, 66,432 to missing)

. replace bmi_value = . if bmi_time > 10 & bmi_time != . 
(17,726 real changes made, 17,726 to missing)

. 
. *Set to missing if no date, and vice versa 
. replace bmi_value = . if bmi_date == . 
(0 real changes made)

. replace bmi_date = . if bmi_value == . 
(84,710 real changes made, 84,710 to missing)

. replace bmi_time = . if bmi_value == . 
(84,706 real changes made, 84,706 to missing)

. replace bmi_age = . if bmi_value == . 
(84,706 real changes made, 84,706 to missing)

. 
. *Create BMI categories
. gen     bmicat = .
(157,183 missing values generated)

. recode  bmicat . = 1 if bmi_value < 18.5
(bmicat: 440 changes made)

. recode  bmicat . = 2 if bmi_value < 25
(bmicat: 1082 changes made)

. recode  bmicat . = 3 if bmi_value < 30
(bmicat: 1466 changes made)

. recode  bmicat . = 4 if bmi_value < 35
(bmicat: 1813 changes made)

. recode  bmicat . = 5 if bmi_value < 40
(bmicat: 1828 changes made)

. recode  bmicat . = 6 if bmi_value < .
(bmicat: 2987 changes made)

. replace bmicat = .u if bmi_value >= .
(147,567 real changes made, 147,567 to missing)

. 
. label define bmicat 1 "Underweight (<18.5)"     ///
>                                         2 "Normal (18.5-24.9)"          ///
>                                         3 "Overweight (25-29.9)"        ///
>                                         4 "Obese I (30-34.9)"           ///
>                                         5 "Obese II (35-39.9)"          ///
>                                         6 "Obese III (40+)"                  
>    ///
>                                         .u "Not known"

.                                         
. label values bmicat bmicat

. lab var bmicat "BMI"

. tab bmicat, missing

                 BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |        440        0.28        0.28
  Normal (18.5-24.9) |      1,082        0.69        0.97
Overweight (25-29.9) |      1,466        0.93        1.90
   Obese I (30-34.9) |      1,813        1.15        3.05
  Obese II (35-39.9) |      1,828        1.16        4.22
     Obese III (40+) |      2,987        1.90        6.12
           Not known |    147,567       93.88      100.00
---------------------+-----------------------------------
               Total |    157,183      100.00

. 
. *Create less granular categorisation
. recode bmicat 1/3 .u = 1 4 = 2 5 = 3 6 = 4, gen(obese4cat)
(156743 differences between bmicat and obese4cat)

. 
. label define obese4cat  1 "No record of obesity"        ///
>                                                 2 "Obese I (30-34.9)"        
>    ///
>                                                 3 "Obese II (35-39.9)"       
>    ///
>                                                 4 "Obese III (40+)"          
>    

. 
. label values obese4cat obese4cat

. order obese4cat, after(bmicat)

. 
. ***Smoking 
. label define smoke 1 "Never" 2 "Former" 3 "Current" .u "Not known"

. 
. gen     smoke = 1  if smoking_status == "N"
(141,532 missing values generated)

. replace smoke = 2  if smoking_status == "E"
(7,850 real changes made)

. replace smoke = 3  if smoking_status == "S"
(47,533 real changes made)

. replace smoke = .u if smoking_status == "M"
(7,801 real changes made, 7,801 to missing)

. replace smoke = .u if smoking_status == "" 
(78,348 real changes made, 78,348 to missing)

. 
. label values smoke smoke

. lab var smoke "Smoking status"

. drop smoking_status

. tab smoke, missing

    Smoking |
     status |      Freq.     Percent        Cum.
------------+-----------------------------------
      Never |     15,651        9.96        9.96
     Former |      7,850        4.99       14.95
    Current |     47,533       30.24       45.19
  Not known |     86,149       54.81      100.00
------------+-----------------------------------
      Total |    157,183      100.00

. 
. *Create non-missing 3-category variable for current smoking (assumes missing 
> smoking is never smoking)
. recode smoke .u = 1, gen(smoke_nomiss)
(86149 differences between smoke and smoke_nomiss)

. order smoke_nomiss, after(smoke)

. label values smoke_nomiss smoke

. 
. **Clinical comorbidities
. ***eGFR
. *Set implausible creatinine values to missing (Note: zero changed to missing)
. replace creatinine_value = . if !inrange(creatinine_value, 20, 3000) 
(39,508 real changes made, 39,508 to missing)

. 
. *Remove creatinine dates if no measurements, and vice versa 
. replace creatinine_value = . if creatinine_date == . 
(0 real changes made)

. replace creatinine_date = . if creatinine_value == . 
(31,608 real changes made, 31,608 to missing)

. replace creatinine = . if creatinine_value == .
(39,508 real changes made, 39,508 to missing)

. recode creatinine .=0
(creatinine: 39508 changes made)

. tab creatinine, missing

 creatinine |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     39,508       25.14       25.14
          1 |    117,675       74.86      100.00
------------+-----------------------------------
      Total |    157,183      100.00

. 
. *Divide by 88.4 (to convert umol/l to mg/dl) 
. gen SCr_adj = creatinine_value/88.4
(39,508 missing values generated)

. 
. gen min = .
(157,183 missing values generated)

. replace min = SCr_adj/0.7 if male==0
(60,017 real changes made)

. replace min = SCr_adj/0.9 if male==1
(57,658 real changes made)

. replace min = min^-0.329  if male==0
(60,017 real changes made)

. replace min = min^-0.411  if male==1
(57,658 real changes made)

. replace min = 1 if min<1
(91,762 real changes made)

. 
. gen max=.
(157,183 missing values generated)

. replace max=SCr_adj/0.7 if male==0
(60,017 real changes made)

. replace max=SCr_adj/0.9 if male==1
(57,658 real changes made)

. replace max=max^-1.209
(117,675 real changes made)

. replace max=1 if max>1
(65,421 real changes made)

. 
. gen egfr=min*max*141
(39,508 missing values generated)

. replace egfr=egfr*(0.993^age)
(117,675 real changes made)

. replace egfr=egfr*1.018 if male==0
(60,017 real changes made)

. label var egfr "egfr calculated using CKD-EPI formula with no ethnicity"

. 
. *Categorise into ckd stages
. egen egfr_cat_all = cut(egfr), at(0, 15, 30, 45, 60, 5000)
(39508 missing values generated)

. recode egfr_cat_all 0 = 5 15 = 4 30 = 3 45 = 2 60 = 0, generate(ckd_egfr)
(117675 differences between egfr_cat_all and ckd_egfr)

. 
. gen egfr_cat = .
(157,183 missing values generated)

. recode egfr_cat . = 3 if egfr < 30
(egfr_cat: 27510 changes made)

. recode egfr_cat . = 2 if egfr < 60
(egfr_cat: 41487 changes made)

. recode egfr_cat . = 1 if egfr < .
(egfr_cat: 48678 changes made)

. replace egfr_cat = .u if egfr >= .
(39,508 real changes made, 39,508 to missing)

. 
. label define egfr_cat   1 ">=60"                ///
>                                                 2 "30-59"               ///
>                                                 3 "<30"                 ///
>                                                 .u "Not known"

.                                         
. label values egfr_cat egfr_cat

. lab var egfr_cat "eGFR"

. tab egfr_cat, missing

       eGFR |      Freq.     Percent        Cum.
------------+-----------------------------------
       >=60 |     48,678       30.97       30.97
      30-59 |     41,487       26.39       57.36
        <30 |     27,510       17.50       74.86
  Not known |     39,508       25.14      100.00
------------+-----------------------------------
      Total |    157,183      100.00

. 
. *If missing eGFR, assume normal
. gen egfr_cat_nomiss = egfr_cat
(39,508 missing values generated)

. replace egfr_cat_nomiss = 1 if egfr_cat == .u
(39,508 real changes made)

. 
. label define egfr_cat_nomiss    1 ">=60/not known"      ///
>                                                                 2 "30-59"    
>                    ///
>                                                                 3 "<30" 

. label values egfr_cat_nomiss egfr_cat_nomiss

. lab var egfr_cat_nomiss "eGFR"

. tab egfr_cat_nomiss, missing

          eGFR |      Freq.     Percent        Cum.
---------------+-----------------------------------
>=60/not known |     88,186       56.10       56.10
         30-59 |     41,487       26.39       82.50
           <30 |     27,510       17.50      100.00
---------------+-----------------------------------
         Total |    157,183      100.00

. 
. gen egfr_date = creatinine_date
(39,508 missing values generated)

. format egfr_date %td

. 
. *Add in end stage renal failure and create a single CKD variable 
. *Missing assumed to not have CKD 
. gen ckd = 0

. replace ckd = 1 if ckd_egfr != . & ckd_egfr >= 1
(68,997 real changes made)

. replace ckd = 1 if esrf == 1
(17,675 real changes made)

. 
. label define ckd 0 "No CKD" 1 "CKD"

. label values ckd ckd

. label var ckd "Chronic kidney disease"

. tab ckd, missing

    Chronic |
     kidney |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
     No CKD |     70,511       44.86       44.86
        CKD |     86,672       55.14      100.00
------------+-----------------------------------
      Total |    157,183      100.00

. 
. *Create date (most recent measure prior to index)
. gen temp1_ckd_date = creatinine_date if ckd_egfr >=1
(88,186 missing values generated)

. gen temp2_ckd_date = esrf_date if esrf == 1
(125,714 missing values generated)

. gen ckd_date = max(temp1_ckd_date,temp2_ckd_date) 
(70,511 missing values generated)

. format ckd_date %td 

. 
. drop temp1_ckd_date temp2_ckd_date SCr_adj min max ckd_egfr egfr_cat_all

. 
. ***HbA1c
. *Set zero or negative to missing
. replace hba1c_percentage   = . if hba1c_percentage <= 0
(8,747 real changes made, 8,747 to missing)

. replace hba1c_mmol_per_mol = . if hba1c_mmol_per_mol <= 0
(11,234 real changes made, 11,234 to missing)

. 
. *Change implausible values to missing
. replace hba1c_percentage   = . if !inrange(hba1c_percentage, 1, 20)
(2,495 real changes made, 2,495 to missing)

. replace hba1c_mmol_per_mol = . if !inrange(hba1c_mmol_per_mol, 10, 200)
(6,505 real changes made, 6,505 to missing)

. 
. *Set most recent values of >24 months prior to EIA diagnosis date to missing
. replace hba1c_percentage   = . if (eia_code_date - hba1c_percentage_date) > 2
> 4*30 & hba1c_percentage_date != .
(141,266 real changes made, 141,266 to missing)

. replace hba1c_mmol_per_mol = . if (eia_code_date - hba1c_mmol_per_mol_date) >
>  24*30 & hba1c_mmol_per_mol_date != .
(134,969 real changes made, 134,969 to missing)

. 
. *Clean up dates
. replace hba1c_percentage_date = . if hba1c_percentage == .
(144,711 real changes made, 144,711 to missing)

. replace hba1c_mmol_per_mol_date = . if hba1c_mmol_per_mol == .
(144,804 real changes made, 144,804 to missing)

. 
. *Express  HbA1c as percentage
. *Express all values as perecentage 
. noi summ hba1c_percentage hba1c_mmol_per_mol 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hba1c_per~ge |      4,675    5.073373    1.874817    1.01555   12.02733
hba1c_mmol~l |      4,475    42.63224    17.57151   10.04124    108.576

. gen     hba1c_pct = hba1c_percentage 
(152,508 missing values generated)

. replace hba1c_pct = (hba1c_mmol_per_mol/10.929)+2.15 if hba1c_mmol_per_mol<. 
(4,475 real changes made)

. 
. *Valid % range between 0-20  
. replace hba1c_pct = . if !inrange(hba1c_pct, 1, 20) 
(0 real changes made)

. replace hba1c_pct = round(hba1c_pct, 0.1)
(9,011 real changes made)

. 
. *Categorise HbA1c and diabetes
. *Group hba1c pct
. gen     hba1ccat = 0 if hba1c_pct <  6.5
(150,936 missing values generated)

. replace hba1ccat = 1 if hba1c_pct >= 6.5  & hba1c_pct < 7.5
(1,405 real changes made)

. replace hba1ccat = 2 if hba1c_pct >= 7.5  & hba1c_pct < 8
(489 real changes made)

. replace hba1ccat = 3 if hba1c_pct >= 8    & hba1c_pct < 9
(550 real changes made)

. replace hba1ccat = 4 if hba1c_pct >= 9    & hba1c_pct !=.
(320 real changes made)

. label define hba1ccat 0 "<6.5%" 1">=6.5-7.4" 2">=7.5-7.9" 3">=8-8.9" 4">=9"

. label values hba1ccat hba1ccat

. tab hba1ccat, missing

   hba1ccat |      Freq.     Percent        Cum.
------------+-----------------------------------
      <6.5% |      6,247        3.97        3.97
  >=6.5-7.4 |      1,405        0.89        4.87
  >=7.5-7.9 |        489        0.31        5.18
    >=8-8.9 |        550        0.35        5.53
        >=9 |        320        0.20        5.73
          . |    148,172       94.27      100.00
------------+-----------------------------------
      Total |    157,183      100.00

. 
. *Express all values as mmol
. gen hba1c_mmol = hba1c_mmol_per_mol
(152,708 missing values generated)

. replace hba1c_mmol = (hba1c_percentage*10.929)-23.5 if hba1c_percentage<. & h
> ba1c_mmol==.
(4,536 real changes made)

. 
. *Group hba1c mmol
. gen     hba1ccatmm = 0 if hba1c_mmol < 58
(149,525 missing values generated)

. replace hba1ccatmm = 1 if hba1c_mmol >= 58 & hba1c_mmol !=.
(1,353 real changes made)

. replace hba1ccatmm =.u if hba1ccatmm==. 
(148,172 real changes made, 148,172 to missing)

. label define hba1ccatmm 0 "HbA1c <58mmol/mol" 1 "HbA1c >=58mmol/mol" .u "Not 
> known"

. label values hba1ccatmm hba1ccatmm

. lab var hba1ccatmm "HbA1c"

. tab hba1ccatmm, missing

             HbA1c |      Freq.     Percent        Cum.
-------------------+-----------------------------------
 HbA1c <58mmol/mol |      7,658        4.87        4.87
HbA1c >=58mmol/mol |      1,353        0.86        5.73
         Not known |    148,172       94.27      100.00
-------------------+-----------------------------------
             Total |    157,183      100.00

. 
. *Create diabetes, split by control/not (assumes missing = no diabetes)
. gen     diabcatm = 1 if diabetes==0
(31,512 missing values generated)

. replace diabcatm = 2 if diabetes==1 & hba1ccatmm==0
(1,535 real changes made)

. replace diabcatm = 3 if diabetes==1 & hba1ccatmm==1
(296 real changes made)

. replace diabcatm = 4 if diabetes==1 & hba1ccatmm==.u
(29,681 real changes made)

. 
. label define diabcatm   1 "No diabetes"                         ///
>                                                 2 "Diabetes with HbA1c <58mmo
> l/mol"             ///
>                                                 3 "Diabetes with HbA1c >58mmo
> l/mol"     ///
>                                                 4 "Diabetes with no HbA1c mea
> sure"

. label values diabcatm diabcatm

. lab var diabcatm "Diabetes"

. 
. *Create cancer variable 'other cancer currently', includes carcinoma of the h
> ead and neck - need to confirm if this excludes NMSC
. gen cancer =0

. replace cancer =1 if lung_cancer ==1 | haem_cancer ==1 | other_cancer ==1
(76,640 real changes made)

. lab var cancer "Cancer"

. tab cancer, missing

     Cancer |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     80,543       51.24       51.24
          1 |     76,640       48.76      100.00
------------+-----------------------------------
      Total |    157,183      100.00

. 
. *Create other comorbid variables
. gen combined_cv_comorbid =1 if chronic_cardiac_disease ==1 | stroke==1
(100,429 missing values generated)

. recode combined_cv_comorbid .=0
(combined_cv_comorbid: 100429 changes made)

. 
. *Label variables
. lab var hypertension "Hypertension"

. lab var diabetes "Diabetes"

. lab var stroke "Stroke"

. lab var chronic_resp_disease "Chronic respiratory disease"

. lab var copd "COPD"

. lab var esrf "End-stage renal failure"

. lab var chronic_liver_disease "Chronic liver disease"

. lab var chronic_cardiac_disease "Chronic cardiac disease"

. 
. drop age

. 
. *Ensure everyone has EIA code================================================
> =============*/
. 
. **All patients should have EIA code
. tab eia_code, missing

   eia_code |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,590        1.01        1.01
          1 |    155,593       98.99      100.00
------------+-----------------------------------
      Total |    157,183      100.00

. keep if eia_code==1
(1,590 observations deleted)

. 
. **Check first rheum appt date was before EIA code date=======================
> ===========*/
. 
. **Rheumatology appt 
. tab rheum_appt, missing //proportion of patients with a rheum outpatient date
>  in the two years before EIA code appeared in GP record; but, data only from 
> April 2019 onwards

 rheum_appt |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     15,581       10.01       10.01
          1 |    140,012       89.99      100.00
------------+-----------------------------------
      Total |    155,593      100.00

. 
. **Check timeframe of rheum appt relative to EIA codebook
. tab rheum_appt if rheum_appt_date>eia_code_date & rheum_appt_date!=. //confir
> m proportion who had rheum appt (i.e. not missing) and appt after EIA code

 rheum_appt |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     70,137      100.00      100.00
------------+-----------------------------------
      Total |     70,137      100.00

. tab rheum_appt if rheum_appt_date>(eia_code_date + 30) & rheum_appt_date!=. /
> /confirm proportion who had rheum appt 30 days after EIA code 

 rheum_appt |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     67,405      100.00      100.00
------------+-----------------------------------
      Total |     67,405      100.00

. tab rheum_appt if rheum_appt_date>(eia_code_date + 60) & rheum_appt_date!=. /
> /confirm proportion who had rheum appt 60 days after EIA code 

 rheum_appt |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     64,680      100.00      100.00
------------+-----------------------------------
      Total |     64,680      100.00

. replace rheum_appt=0 if rheum_appt_date>(eia_code_date + 60) & rheum_appt_dat
> e!=. //replace as missing those appts >60 days after EIA code
(64,680 real changes made)

. replace rheum_appt_date=. if rheum_appt_date>(eia_code_date + 60) & rheum_app
> t_date!=. //replace as missing those appts >60 days after EIA code
(64,680 real changes made, 64,680 to missing)

. 
. *Check first csDMARD/biologic was after rheum appt date======================
> ===============================*/
. 
. **csDMARDs (not including high cost MTX; wouldn't be shared care)
. gen csdmard=1 if hydroxychloroquine==1 | leflunomide==1 | methotrexate==1 | m
> ethotrexate_inj==1 | sulfasalazine==1
(50,991 missing values generated)

. recode csdmard .=0 
(csdmard: 50991 changes made)

. tab csdmard, missing

    csdmard |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     50,991       32.77       32.77
          1 |    104,602       67.23      100.00
------------+-----------------------------------
      Total |    155,593      100.00

. 
. **csDMARDs (including high cost MTX)
. gen csdmard_hcd=1 if hydroxychloroquine==1 | leflunomide==1 | methotrexate==1
>  | methotrexate_inj==1 | methotrexate_hcd==1 | sulfasalazine==1
(40,773 missing values generated)

. recode csdmard_hcd .=0 
(csdmard_hcd: 40773 changes made)

. tab csdmard_hcd, missing

csdmard_hcd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     40,773       26.20       26.20
          1 |    114,820       73.80      100.00
------------+-----------------------------------
      Total |    155,593      100.00

. 
. **Date of first csDMARD script (not including high cost MTX prescriptions)
. gen csdmard_date=min(hydroxychloroquine_date, leflunomide_date, methotrexate_
> date, methotrexate_inj_date, sulfasalazine_date)
(50,991 missing values generated)

. format %td csdmard_date

. 
. **Date of first csDMARD script (including high cost MTX prescriptions)
. gen csdmard_hcd_date=min(hydroxychloroquine_date, leflunomide_date, methotrex
> ate_date, methotrexate_inj_date, methotrexate_hcd_date, sulfasalazine_date)
(40,773 missing values generated)

. format %td csdmard_hcd_date

. 
. **Biologic use
. gen biologic=1 if abatacept==1 | adalimumab==1 | baricitinib==1 | certolizuma
> b==1 | etanercept==1 | golimumab==1 | guselkumab==1 | infliximab==1 | ixekizu
> mab==1 | rituximab==1 | sarilumab==1 | secukinumab==1 | tocilizumab==1 | tofa
> citinib==1 | upadacitinib==1 | ustekinumab==1 
(4,208 missing values generated)

. recode biologic .=0
(biologic: 4208 changes made)

. tab biologic, missing

   biologic |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,208        2.70        2.70
          1 |    151,385       97.30      100.00
------------+-----------------------------------
      Total |    155,593      100.00

. 
. **Date of first biologic script
. gen biologic_date=min(abatacept_date, adalimumab_date, baricitinib_date, cert
> olizumab_date, etanercept_date, golimumab_date, guselkumab_date, infliximab_d
> ate, ixekizumab_date, rituximab_date, sarilumab_date, secukinumab_date, tocil
> izumab_date, tofacitinib_date, upadacitinib_date, ustekinumab_date)
(4,208 missing values generated)

. format %td biologic_date

. 
. **Exclude if first csdmard or biologic was before first rheum appt
. tab csdmard if rheum_appt_date!=. & csdmard_date!=. & csdmard_date<rheum_appt
> _date

    csdmard |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     12,634      100.00      100.00
------------+-----------------------------------
      Total |     12,634      100.00

. tab csdmard if rheum_appt_date!=. & csdmard_date!=. & (csdmard_date + 60)<rhe
> um_appt_date 

    csdmard |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     10,924      100.00      100.00
------------+-----------------------------------
      Total |     10,924      100.00

. drop if rheum_appt_date!=. & csdmard_date!=. & (csdmard_date + 60)<rheum_appt
> _date //drop if first csDMARD more than 60 days before first rheum_appt_date
(10,924 observations deleted)

. tab biologic if rheum_appt_date!=. & biologic_date!=. & biologic_date<rheum_a
> ppt_date 

   biologic |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     18,072      100.00      100.00
------------+-----------------------------------
      Total |     18,072      100.00

. tab biologic if rheum_appt_date!=. & biologic_date!=. & (biologic_date + 60)<
> rheum_appt_date 

   biologic |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     15,412      100.00      100.00
------------+-----------------------------------
      Total |     15,412      100.00

. drop if rheum_appt_date!=. & biologic_date!=. & (biologic_date + 60)<rheum_ap
> pt_date //drop if first biologic more than 60 days before first rheum_appt_da
> te
(15,412 observations deleted)

. 
. *Generate diagnosis date=====================================================
> ==========*/
. 
. *Use first rheum appt date as diagnosis date unless missing, in which case us
> e eia code date as diagnosis date
. gen diagnosis_date=rheum_appt_date if rheum_appt_date!=.
(80,261 missing values generated)

. replace diagnosis_date=eia_code_date if rheum_appt_date==.
(80,261 real changes made)

. format diagnosis_date %td

. codebook diagnosis_date

-------------------------------------------------------------------------------
diagnosis_date                                                      (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric daily date (float)

                 range:  [21260,22764]                units:  1
       or equivalently:  [17mar2018,29apr2022]        units:  days
         unique values:  1,505                    missing .:  0/129,257

                  mean:   21710.9 = 10jun2019 (+ 20 hours)
              std. dev:   346.087

           percentiles:        10%       25%       50%       75%       90%
                             21327     21433     21632     21914     22237
                         23may2018 06sep2018 24mar2019 31dec2019 18nov2020

. 
. *Refine diagnostic window====================================================
> =========*/
. 
. **Keep patients with diagnosis date was after 1st March 2019 and before 1st M
> arch 2022
. keep if diagnosis_date>=date("$start_date", "DMY") & diagnosis_date!=. 
(61,109 observations deleted)

. tab eia_code, missing

   eia_code |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     68,148      100.00      100.00
------------+-----------------------------------
      Total |     68,148      100.00

. keep if diagnosis_date<date("$end_date", "DMY") & diagnosis_date!=. 
(646 observations deleted)

. tab eia_code, missing

   eia_code |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     67,502      100.00      100.00
------------+-----------------------------------
      Total |     67,502      100.00

. 
. *Include only most recent EIA sub-diagnosis==================================
> ===========*/
. 
. replace ra_code =0 if psa_code_date > ra_code_date & psa_code_date !=.
(33,198 real changes made)

. replace ra_code =0 if anksp_code_date > ra_code_date & anksp_code_date !=.
(11,177 real changes made)

. replace psa_code =0 if ra_code_date >= psa_code_date & ra_code_date !=.
(32,962 real changes made)

. replace psa_code =0 if anksp_code_date > psa_code_date & anksp_code_date !=.
(11,445 real changes made)

. replace anksp_code =0 if psa_code_date >= anksp_code_date & psa_code_date !=.
(33,028 real changes made)

. replace anksp_code =0 if ra_code_date >= anksp_code_date & ra_code_date !=.
(11,237 real changes made)

. gen eia_diagnosis=1 if ra_code==1
(45,038 missing values generated)

. replace eia_diagnosis=2 if psa_code==1
(22,413 real changes made)

. replace eia_diagnosis=3 if anksp_code==1
(22,625 real changes made)

. lab define eia_diagnosis 1 "RA" 2 "PsA" 3 "AxSpA", modify

. lab val eia_diagnosis eia_diagnosis

. tab eia_diagnosis, missing

eia_diagnos |
         is |      Freq.     Percent        Cum.
------------+-----------------------------------
         RA |     22,464       33.28       33.28
        PsA |     22,413       33.20       66.48
      AxSpA |     22,625       33.52      100.00
------------+-----------------------------------
      Total |     67,502      100.00

. drop if eia_diagnosis==. //should be none
(0 observations deleted)

. 
. *Number of EIA diagnoses in 1-year time windows==============================
> ===========*/
. 
. **Month/Year of EIA code
. gen year_code=year(eia_code_date)

. format year_code %ty

. gen month_code=month(eia_code_date)

. gen mo_year_code=ym(year_code, month_code)

. format mo_year_code %tm

. generate str16 mo_year_code_s = strofreal(mo_year_code,"%tmCCYY!mNN")

. 
. **Month/Year of rheum appt (=date of diagnosis)
. gen year_diag=year(diagnosis_date) if diagnosis_date!=.

. format year_diag %ty

. gen month_diag=month(diagnosis_date) if diagnosis_date!=. 

. gen mo_year_diagn=ym(year_diag, month_diag)

. format mo_year_diagn %tm

. generate str16 mo_year_diagn_s = strofreal(mo_year_diagn,"%tmCCYY!mNN")

. 
. **Separate into time windows (for diagnosis date)
. gen diagnosis_year=1 if diagnosis_date>=td(01mar2019) & diagnosis_date<td(01m
> ar2020)
(27,024 missing values generated)

. replace diagnosis_year=2 if diagnosis_date>=td(01mar2020) & diagnosis_date<td
> (01mar2021)
(18,685 real changes made)

. replace diagnosis_year=3 if diagnosis_date>=td(01mar2021) & diagnosis_date<=t
> d(01mar2022)
(8,339 real changes made)

. lab define diagnosis_year 1 "March 2019-March 2020" 2 "March 2020-March 2021"
>  3 "March 2021-March 2022", modify

. lab val diagnosis_year diagnosis_year

. lab var diagnosis_year "Year of diagnosis"

. tab diagnosis_year, missing

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |     40,478       59.97       59.97
March 2020-March 2021 |     18,685       27.68       87.65
March 2021-March 2022 |      8,339       12.35      100.00
----------------------+-----------------------------------
                Total |     67,502      100.00

. bys eia_diagnosis: tab diagnosis_year, missing

-------------------------------------------------------------------------------
-> eia_diagnosis = RA

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |     13,522       60.19       60.19
March 2020-March 2021 |      6,218       27.68       87.87
March 2021-March 2022 |      2,724       12.13      100.00
----------------------+-----------------------------------
                Total |     22,464      100.00

-------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |     13,434       59.94       59.94
March 2020-March 2021 |      6,191       27.62       87.56
March 2021-March 2022 |      2,788       12.44      100.00
----------------------+-----------------------------------
                Total |     22,413      100.00

-------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |     13,522       59.77       59.77
March 2020-March 2021 |      6,276       27.74       87.50
March 2021-March 2022 |      2,827       12.50      100.00
----------------------+-----------------------------------
                Total |     22,625      100.00


. 
. **Separate into time windows (for EIA code date)
. gen code_year=1 if eia_code_date>=td(01mar2019) & eia_code_date<td(01mar2020)
(38,941 missing values generated)

. replace code_year=2 if eia_code_date>=td(01mar2020) & eia_code_date<td(01mar2
> 021)
(22,437 real changes made)

. replace code_year=3 if eia_code_date>=td(01mar2021) & eia_code_date<=td(01mar
> 2022)
(15,195 real changes made)

. replace code_year=4 if eia_code_date>td(01mar2022)
(1,169 real changes made)

. replace code_year=0 if eia_code_date<td(01mar2019)
(140 real changes made)

. lab define code_year 0 "Before March 2019" 1 "March 2019-March 2020" 2 "March
>  2020-March 2021" 3 "March 2021-March 2022" 4 "After March 2022", modify

. lab val code_year code_year

. lab var code_year "Year of EIA code"

. tab code_year, missing

     Year of EIA code |      Freq.     Percent        Cum.
----------------------+-----------------------------------
    Before March 2019 |        140        0.21        0.21
March 2019-March 2020 |     28,561       42.31       42.52
March 2020-March 2021 |     22,437       33.24       75.76
March 2021-March 2022 |     15,195       22.51       98.27
     After March 2022 |      1,169        1.73      100.00
----------------------+-----------------------------------
                Total |     67,502      100.00

. bys eia_diagnosis: tab code_year, missing

-------------------------------------------------------------------------------
-> eia_diagnosis = RA

     Year of EIA code |      Freq.     Percent        Cum.
----------------------+-----------------------------------
    Before March 2019 |         50        0.22        0.22
March 2019-March 2020 |      9,479       42.20       42.42
March 2020-March 2021 |      7,477       33.28       75.70
March 2021-March 2022 |      5,045       22.46       98.16
     After March 2022 |        413        1.84      100.00
----------------------+-----------------------------------
                Total |     22,464      100.00

-------------------------------------------------------------------------------
-> eia_diagnosis = PsA

     Year of EIA code |      Freq.     Percent        Cum.
----------------------+-----------------------------------
    Before March 2019 |         49        0.22        0.22
March 2019-March 2020 |      9,449       42.16       42.38
March 2020-March 2021 |      7,469       33.32       75.70
March 2021-March 2022 |      5,064       22.59       98.30
     After March 2022 |        382        1.70      100.00
----------------------+-----------------------------------
                Total |     22,413      100.00

-------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

     Year of EIA code |      Freq.     Percent        Cum.
----------------------+-----------------------------------
    Before March 2019 |         41        0.18        0.18
March 2019-March 2020 |      9,633       42.58       42.76
March 2020-March 2021 |      7,491       33.11       75.87
March 2021-March 2022 |      5,086       22.48       98.35
     After March 2022 |        374        1.65      100.00
----------------------+-----------------------------------
                Total |     22,625      100.00


. 
. *Define appointments and referrals======================================*/
. 
. **Rheumatology appt 
. tab rheum_appt, missing //proportion of patients with a rheum outpatient date
>  in the two years before EIA code appeared in GP record; but, data only from 
> April 2019 onwards

 rheum_appt |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     48,525       71.89       71.89
          1 |     18,977       28.11      100.00
------------+-----------------------------------
      Total |     67,502      100.00

. tab rheum_appt if diagnosis_date>=date("$outpatient_date", "DMY"), missing //
> proportion of patients with a rheum appt from April 2019 onwards

 rheum_appt |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     46,093       73.41       73.41
          1 |     16,693       26.59      100.00
------------+-----------------------------------
      Total |     62,786      100.00

. 
. **Rheumatology referrals
. tab referral_rheum_prerheum //last rheum referral in the 2 years before rheum
> atology outpatient (requires rheum appt to have been present)

referral_rh |
eum_prerheu |
          m |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,652        9.85        9.85
          1 |     60,850       90.15      100.00
------------+-----------------------------------
      Total |     67,502      100.00

. tab referral_rheum_prerheum if rheum_appt!=0 & referral_rheum_prerheum_date<=
> rheum_appt_date  //last rheum referral in the year before rheumatology outpat
> ient, assuming ref date before rheum appt date (should be accounted for by Py
> thon code)

referral_rh |
eum_prerheu |
          m |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      6,291      100.00      100.00
------------+-----------------------------------
      Total |      6,291      100.00

. tab referral_rheum_precode //last rheum referral in the year before EIA code 
> (could potentially use if rheum appt missing)

referral_rh |
eum_precode |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,757       10.01       10.01
          1 |     60,745       89.99      100.00
------------+-----------------------------------
      Total |     67,502      100.00

. gen referral_rheum_comb_date = referral_rheum_prerheum_date if referral_rheum
> _prerheum_date!=.
(6,652 missing values generated)

. replace referral_rheum_comb_date = referral_rheum_precode_date if referral_rh
> eum_prerheum_date==. & referral_rheum_precode_date!=.
(6,008 real changes made)

. format %td referral_rheum_comb_date

. 
. **GP appointments
. tab last_gp_refrheum //proportion with last GP appointment in year before rhe
> um referral (pre-rheum appt); requires there to have been a rheum referral, b
> efore a rheum appt

last_gp_ref |
      rheum |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,681        9.90        9.90
          1 |     60,821       90.10      100.00
------------+-----------------------------------
      Total |     67,502      100.00

. gen all_appts=1 if last_gp_refrheum==1 & referral_rheum_prerheum==1 & rheum_a
> ppt==1 & last_gp_refrheum_date<=referral_rheum_prerheum_date & referral_rheum
> _prerheum_date<=rheum_appt_date
(66,373 missing values generated)

. recode all_appts .=0
(all_appts: 66373 changes made)

. tab all_appts, missing //KEY - proportion who had a last gp appt, then rheum 
> ref, then rheum appt

  all_appts |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     66,373       98.33       98.33
          1 |      1,129        1.67      100.00
------------+-----------------------------------
      Total |     67,502      100.00

. tab last_gp_refcode //last GP appointment before rheum ref (i.e. pre-eia code
>  ref); requires there to have been a rheum referral before an EIA code (i.e. 
> rheum appt could have been missing)

last_gp_ref |
       code |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,812       10.09       10.09
          1 |     60,690       89.91      100.00
------------+-----------------------------------
      Total |     67,502      100.00

. tab last_gp_prerheum //last GP appointment before rheum appt; requires there 
> to have been a rheum appt before and EIA code

last_gp_pre |
      rheum |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,700        9.93        9.93
          1 |     60,802       90.07      100.00
------------+-----------------------------------
      Total |     67,502      100.00

. tab last_gp_precode //last GP appointment before EIA code

last_gp_pre |
       code |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,701        9.93        9.93
          1 |     60,801       90.07      100.00
------------+-----------------------------------
      Total |     67,502      100.00

. 
. *Time to referral, appointment and EIA code==================================
> ===========*/
. 
. **Time from last GP to rheum ref before rheum appt (i.e. if appts are present
>  and in correct time order)
. gen time_gp_rheum_ref_appt = (referral_rheum_prerheum_date - last_gp_refrheum
> _date) if referral_rheum_prerheum_date!=. & last_gp_refrheum_date!=. & rheum_
> appt_date!=. & referral_rheum_prerheum_date>=last_gp_refrheum_date & referral
> _rheum_prerheum_date<=rheum_appt_date
(66,373 missing values generated)

. tabstat time_gp_rheum_ref_appt, stats (n mean p50 p25 p75) //all patients (sh
> ould be same number as all_appts)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~t |      1129  224.5793       182        83       323
----------------------------------------------------------------

. 
. gen gp_ref_cat=1 if time_gp_rheum_ref_appt<=3 & time_gp_rheum_ref_appt!=. 
(67,486 missing values generated)

. replace gp_ref_cat=2 if time_gp_rheum_ref_appt>3 & time_gp_rheum_ref_appt<=7 
> & time_gp_rheum_ref_appt!=. & gp_ref_cat==.
(10 real changes made)

. replace gp_ref_cat=3 if time_gp_rheum_ref_appt>7 & time_gp_rheum_ref_appt!=. 
> & gp_ref_cat==.
(1,103 real changes made)

. lab define gp_ref_cat 1 "Within 3 days" 2 "Between 3-7 days" 3 "More than 7 d
> ays", modify

. lab val gp_ref_cat gp_ref_cat

. lab var gp_ref_cat "Time to GP referral"

. tab gp_ref_cat, missing

      Time to GP |
        referral |      Freq.     Percent        Cum.
-----------------+-----------------------------------
   Within 3 days |         16        0.02        0.02
Between 3-7 days |         10        0.01        0.04
More than 7 days |      1,103        1.63        1.67
               . |     66,373       98.33      100.00
-----------------+-----------------------------------
           Total |     67,502      100.00

. 
. gen gp_ref_3d=1 if time_gp_rheum_ref_appt<=3 & time_gp_rheum_ref_appt!=. 
(67,486 missing values generated)

. replace gp_ref_3d=2 if time_gp_rheum_ref_appt>3 & time_gp_rheum_ref_appt!=.
(1,113 real changes made)

. lab define gp_ref_3d 1 "Within 3 days" 2 "More than 3 days", modify

. lab val gp_ref_3d gp_ref_3d

. lab var gp_ref_3d "Time to GP referral"

. tab gp_ref_3d, missing

      Time to GP |
        referral |      Freq.     Percent        Cum.
-----------------+-----------------------------------
   Within 3 days |         16        0.02        0.02
More than 3 days |      1,113        1.65        1.67
               . |     66,373       98.33      100.00
-----------------+-----------------------------------
           Total |     67,502      100.00

. 
. **Time from last GP to rheum ref before eia code (sensitivity analysis; inclu
> des those with no rheum appt)
. gen time_gp_rheum_ref_code = (referral_rheum_precode_date - last_gp_refcode_d
> ate) if referral_rheum_precode_date!=. & last_gp_refcode_date!=. & referral_r
> heum_precode_date>=last_gp_refcode_date & referral_rheum_precode_date<=eia_co
> de_date
(57,894 missing values generated)

. tabstat time_gp_rheum_ref_code, stats (n mean p50 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~e |      9608  350.3414       290       128       513
----------------------------------------------------------------

. 
. **Time from last GP to rheum ref (combined - sensitivity analysis; includes t
> hose with no rheum appt)
. gen time_gp_rheum_ref_comb = time_gp_rheum_ref_appt 
(66,373 missing values generated)

. replace time_gp_rheum_ref_comb = time_gp_rheum_ref_code if time_gp_rheum_ref_
> appt==. & time_gp_rheum_ref_code!=.
(9,369 real changes made)

. tabstat time_gp_rheum_ref_comb, stats (n mean p50 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~b |     10498   334.809       273       121       489
----------------------------------------------------------------

. 
. **Time from last GP pre-rheum appt to first rheum appt (key sensitivity analy
> sis; includes those with no rheum ref)
. gen time_gp_rheum_appt = (rheum_appt_date - last_gp_prerheum_date) if rheum_a
> ppt_date!=. & last_gp_prerheum_date!=. & rheum_appt_date>=last_gp_prerheum_da
> te
(61,341 missing values generated)

. tabstat time_gp_rheum_appt, stats (n mean p50 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_~m_appt |      6161  296.7099       267       133       410
----------------------------------------------------------------

. 
. **Time from last GP pre-code to EIA code (sensitivity analysis; includes thos
> e with no rheum ref and/or no rheum appt)
. gen time_gp_eia_code = (eia_code_date - last_gp_precode_date) if eia_code_dat
> e!=. & last_gp_precode_date!=. & eia_code_date>=last_gp_precode_date
(34,034 missing values generated)

. tabstat time_gp_eia_code, stats (n mean p50 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_ei~e |     33468  468.9987       411       203       684
----------------------------------------------------------------

. 
. **Time from last GP to EIA diagnosis (combined - sensitivity analysis; includ
> es those with no rheum appt)
. gen time_gp_eia_diag = time_gp_rheum_appt
(61,341 missing values generated)

. replace time_gp_eia_diag = time_gp_eia_code if time_gp_rheum_appt==. & time_g
> p_eia_code!=.
(29,728 real changes made)

. tabstat time_gp_eia_diag, stats (n mean p50 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_ei~g |     35889  430.1192       368       182       622
----------------------------------------------------------------

. 
. **Time from rheum ref to rheum appt (i.e. if appts are present and in correct
>  order)
. gen time_ref_rheum_appt = (rheum_appt_date - referral_rheum_prerheum_date) if
>  rheum_appt_date!=. & referral_rheum_prerheum_date!=. & referral_rheum_prerhe
> um_date<=rheum_appt_date
(61,211 missing values generated)

. tabstat time_ref_rheum_appt, stats (n mean p50 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~t |      6291  301.3896       276       142       419
----------------------------------------------------------------

. 
. gen ref_appt_cat=1 if time_ref_rheum_appt<=21 & time_ref_rheum_appt!=. 
(67,247 missing values generated)

. replace ref_appt_cat=2 if time_ref_rheum_appt>21 & time_ref_rheum_appt<=42 & 
> time_ref_rheum_appt!=. & ref_appt_cat==.
(245 real changes made)

. replace ref_appt_cat=3 if time_ref_rheum_appt>42 & time_ref_rheum_appt!=. & r
> ef_appt_cat==.
(5,791 real changes made)

. lab define ref_appt_cat 1 "Within 3 weeks" 2 "Between 3-6 weeks" 3 "More than
>  6 weeks", modify

. lab val ref_appt_cat ref_appt_cat

. lab var ref_appt_cat "Time to rheumatology assessment"

. tab ref_appt_cat, missing

          Time to |
     rheumatology |
       assessment |      Freq.     Percent        Cum.
------------------+-----------------------------------
   Within 3 weeks |        255        0.38        0.38
Between 3-6 weeks |        245        0.36        0.74
More than 6 weeks |      5,791        8.58        9.32
                . |     61,211       90.68      100.00
------------------+-----------------------------------
            Total |     67,502      100.00

. 
. gen ref_appt_3w=1 if time_ref_rheum_appt<=21 & time_ref_rheum_appt!=. 
(67,247 missing values generated)

. replace ref_appt_3w=2 if time_ref_rheum_appt>21 & time_ref_rheum_appt!=.
(6,036 real changes made)

. lab define ref_appt_3w 1 "Within 3 weeks" 2 "More than 3 weeks", modify

. lab val ref_appt_3w ref_appt_3w

. lab var ref_appt_3w "Time to rheumatology assessment"

. tab ref_appt_3w, missing

          Time to |
     rheumatology |
       assessment |      Freq.     Percent        Cum.
------------------+-----------------------------------
   Within 3 weeks |        255        0.38        0.38
More than 3 weeks |      6,036        8.94        9.32
                . |     61,211       90.68      100.00
------------------+-----------------------------------
            Total |     67,502      100.00

. 
. **Time from rheum ref or last GP to rheum appt (combined - sensitivity analys
> is; includes those with no rheum ref)
. gen time_refgp_rheum_appt = time_ref_rheum_appt
(61,211 missing values generated)

. replace time_refgp_rheum_appt = time_gp_rheum_appt if time_ref_rheum_appt==. 
> & time_gp_rheum_appt!=.
(3,899 real changes made)

. tabstat time_refgp_rheum_appt, stats (n mean p50 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_refgp~t |     10190  290.2862       266       135       403
----------------------------------------------------------------

. 
. **Time from rheum ref to EIA code (sensitivity analysis; includes those with 
> no rheum appt)
. gen time_ref_rheum_eia = (eia_code_date - referral_rheum_precode_date) if eia
> _code_date!=. & referral_rheum_precode_date!=. & referral_rheum_precode_date<
> =eia_code_date  
(33,844 missing values generated)

. tabstat time_ref_rheum_eia, stats (n mean p50 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~a |     33658  469.4396       414       206       682
----------------------------------------------------------------

. 
. **Time from rheum ref to EIA diagnosis (combined - sensitivity analysis; incl
> udes those with no rheum appt)
. gen time_ref_rheum_eia_comb = time_ref_rheum_appt
(61,211 missing values generated)

. replace time_ref_rheum_eia_comb = time_ref_rheum_eia if time_ref_rheum_appt==
> . & time_ref_rheum_eia!=.
(29,699 real changes made)

. tabstat time_ref_rheum_eia_comb, stats (n mean p50 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~b |     35990  431.0694       372       186       618
----------------------------------------------------------------

. 
. **Time from rheum appt to EIA code
. gen time_rheum_eia_code = (eia_code_date - rheum_appt_date) if eia_code_date!
> =. & rheum_appt_date!=. 
(48,525 missing values generated)

. tabstat time_rheum_eia_code, stats (n mean p50 p25 p75) 

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_rheum~e |     18977  451.0628       434       185       700
----------------------------------------------------------------

. 
. *Time from rheum appt to first csDMARD prescriptions - all of the below are s
> hared care prescriptions, aside from those with MTX_high cost drug data inclu
> ded======================================================================*/
. 
. *All patients must have 1) rheum appt 2) 6m+ follow-up after rheum appt 3) 6m
>  of registration after appt
. 
. **Proportion of patients with at least 6 or 12 months of GP registration afte
> r rheum appt (i.e. diagnosis date)
. tab has_6m_follow_up

has_6m_foll |
      ow_up |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,366        4.99        4.99
          1 |     64,136       95.01      100.00
------------+-----------------------------------
      Total |     67,502      100.00

. tab has_12m_follow_up 

has_12m_fol |
     low_up |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,717        9.95        9.95
          1 |     60,785       90.05      100.00
------------+-----------------------------------
      Total |     67,502      100.00

. tab mo_year_diagn has_6m_follow_up

mo_year_di |   has_6m_follow_up
       agn |         0          1 |     Total
-----------+----------------------+----------
    2019m3 |       277      4,439 |     4,716 
    2019m4 |       201      4,239 |     4,440 
    2019m5 |       232      4,058 |     4,290 
    2019m6 |       193      3,683 |     3,876 
    2019m7 |       166      3,637 |     3,803 
    2019m8 |       157      3,268 |     3,425 
    2019m9 |       148      2,889 |     3,037 
   2019m10 |       142      2,759 |     2,901 
   2019m11 |       150      2,604 |     2,754 
   2019m12 |       117      2,499 |     2,616 
    2020m1 |       127      2,347 |     2,474 
    2020m2 |       114      2,032 |     2,146 
    2020m3 |       112      2,089 |     2,201 
    2020m4 |       101      1,786 |     1,887 
    2020m5 |        89      1,800 |     1,889 
    2020m6 |        87      1,657 |     1,744 
    2020m7 |        89      1,640 |     1,729 
    2020m8 |        85      1,536 |     1,621 
    2020m9 |        70      1,393 |     1,463 
   2020m10 |        63      1,365 |     1,428 
   2020m11 |        63      1,177 |     1,240 
   2020m12 |        66      1,192 |     1,258 
    2021m1 |        58      1,169 |     1,227 
    2021m2 |        44        954 |       998 
    2021m3 |        34      1,001 |     1,035 
    2021m4 |        55        900 |       955 
    2021m5 |        52        947 |       999 
    2021m6 |        36        807 |       843 
    2021m7 |        61        759 |       820 
    2021m8 |        30        679 |       709 
    2021m9 |        34        611 |       645 
   2021m10 |        30        540 |       570 
   2021m11 |        30        493 |       523 
   2021m12 |        18        486 |       504 
    2022m1 |        23        397 |       420 
    2022m2 |        12        304 |       316 
-----------+----------------------+----------
     Total |     3,366     64,136 |    67,502 

. tab mo_year_diagn has_12m_follow_up

mo_year_di |   has_12m_follow_up
       agn |         0          1 |     Total
-----------+----------------------+----------
    2019m3 |       479      4,237 |     4,716 
    2019m4 |       440      4,000 |     4,440 
    2019m5 |       421      3,869 |     4,290 
    2019m6 |       401      3,475 |     3,876 
    2019m7 |       342      3,461 |     3,803 
    2019m8 |       339      3,086 |     3,425 
    2019m9 |       305      2,732 |     3,037 
   2019m10 |       335      2,566 |     2,901 
   2019m11 |       248      2,506 |     2,754 
   2019m12 |       282      2,334 |     2,616 
    2020m1 |       249      2,225 |     2,474 
    2020m2 |       196      1,950 |     2,146 
    2020m3 |       206      1,995 |     2,201 
    2020m4 |       171      1,716 |     1,887 
    2020m5 |       180      1,709 |     1,889 
    2020m6 |       194      1,550 |     1,744 
    2020m7 |       168      1,561 |     1,729 
    2020m8 |       141      1,480 |     1,621 
    2020m9 |       160      1,303 |     1,463 
   2020m10 |       130      1,298 |     1,428 
   2020m11 |       138      1,102 |     1,240 
   2020m12 |       124      1,134 |     1,258 
    2021m1 |       114      1,113 |     1,227 
    2021m2 |        95        903 |       998 
    2021m3 |        85        950 |     1,035 
    2021m4 |       104        851 |       955 
    2021m5 |       107        892 |       999 
    2021m6 |        80        763 |       843 
    2021m7 |        95        725 |       820 
    2021m8 |        73        636 |       709 
    2021m9 |        75        570 |       645 
   2021m10 |        55        515 |       570 
   2021m11 |        52        471 |       523 
   2021m12 |        58        446 |       504 
    2022m1 |        44        376 |       420 
    2022m2 |        31        285 |       316 
-----------+----------------------+----------
     Total |     6,717     60,785 |    67,502 

. 
. *All patients must have 1) rheum appt 2) 6m+ follow-up after rheum appt 3) 6m
>  of registration after appt
. gen has_6m_post_appt=1 if date("$end_date", "DMY")>=(rheum_appt_date + 180) &
>  has_6m_follow_up==1 & rheum_appt_date!=.
(49,528 missing values generated)

. recode has_6m_post_appt .=0
(has_6m_post_appt: 49528 changes made)

. gen has_12m_post_appt=1 if date("$end_date", "DMY")>=(rheum_appt_date + 365) 
> & has_12m_follow_up==1 & rheum_appt_date!=.
(50,698 missing values generated)

. recode has_12m_post_appt .=0
(has_12m_post_appt: 50698 changes made)

. 
. **Time to first csDMARD script for RA patients, whereby first rheum appt is c
> lassed as diagnosis date (if present; not including high cost MTX prescriptio
> ns)
. gen time_to_csdmard=(csdmard_date-rheum_appt_date) if csdmard==1 & rheum_appt
> _date!=.
(55,687 missing values generated)

. tabstat time_to_csdmard if ra_code==1, stats (n mean p50 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_cs~d |      3992  390.9667       354       133       618
----------------------------------------------------------------

. 
. **Time to first csDMARD script for RA patients (including high cost MTX presc
> riptions)
. gen time_to_csdmard_hcd=(csdmard_hcd_date-rheum_appt_date) if csdmard_hcd==1 
> & rheum_appt_date!=.
(54,245 missing values generated)

. tabstat time_to_csdmard_hcd if ra_code==1, stats (n mean p50 p25 p75) 

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_c~cd |      4469  355.7492       316       107       573
----------------------------------------------------------------

. 
. **Time to first csDMARD script for PsA patients (not including high cost MTX 
> prescriptions)
. tabstat time_to_csdmard if psa_code==1, stats (n mean p50 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_c~rd |      3911  388.6461       347       131       609
----------------------------------------------------------------

. 
. **Time to first csDMARD script for PsA patients (including high cost MTX pres
> criptions)
. tabstat time_to_csdmard_hcd if psa_code==1, stats (n mean p50 p25 p75) 

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_c~cd |      4381  352.9283       316       102       575
----------------------------------------------------------------

. 
. **csDMARD time categories (not including high cost MTX prescriptions)
. gen csdmard_time=1 if time_to_csdmard<=90 & time_to_csdmard!=. 
(65,183 missing values generated)

. replace csdmard_time=2 if time_to_csdmard>90 & time_to_csdmard<=180 & time_to
> _csdmard!=.
(1,360 real changes made)

. replace csdmard_time=3 if time_to_csdmard>180 & time_to_csdmard!=.
(8,136 real changes made)

. replace csdmard_time=4 if time_to_csdmard==.
(55,687 real changes made)

. lab define csdmard_time 1 "Within 3 months" 2 "3-6 months" 3 "More than 6 mon
> ths" 4 "Not prescribed", modify

. lab val csdmard_time csdmard_time

. lab var csdmard_time "Shared care csDMARD prescription" 

. tab csdmard_time if ra_code==1, missing 

       Shared care |
           csDMARD |
      prescription |      Freq.     Percent        Cum.
-------------------+-----------------------------------
   Within 3 months |        780        3.47        3.47
        3-6 months |        445        1.98        5.45
More than 6 months |      2,767       12.32       17.77
    Not prescribed |     18,472       82.23      100.00
-------------------+-----------------------------------
             Total |     22,464      100.00

. tab csdmard_time if psa_code==1, missing

       Shared care |
           csDMARD |
      prescription |      Freq.     Percent        Cum.
-------------------+-----------------------------------
   Within 3 months |        763        3.40        3.40
        3-6 months |        459        2.05        5.45
More than 6 months |      2,689       12.00       17.45
    Not prescribed |     18,502       82.55      100.00
-------------------+-----------------------------------
             Total |     22,413      100.00

. 
. **csDMARD time categories (including high cost MTX prescriptions)
. gen csdmard_hcd_time=1 if time_to_csdmard_hcd<=90 & time_to_csdmard_hcd!=. 
(64,400 missing values generated)

. replace csdmard_hcd_time=2 if time_to_csdmard_hcd>90 & time_to_csdmard_hcd<=1
> 80 & time_to_csdmard_hcd!=.
(1,547 real changes made)

. replace csdmard_hcd_time=3 if time_to_csdmard_hcd>180 & time_to_csdmard_hcd!=
> .
(8,608 real changes made)

. replace csdmard_hcd_time=4 if time_to_csdmard_hcd==.
(54,245 real changes made)

. lab define csdmard_hcd_time 1 "Within 3 months" 2 "3-6 months" 3 "More than 6
>  months" 4 "Not prescribed", modify

. lab val csdmard_hcd_time csdmard_hcd_time

. lab var csdmard_hcd_time "Shared care csDMARD prescription" 

. tab csdmard_hcd_time if ra_code==1, missing 

       Shared care |
           csDMARD |
      prescription |      Freq.     Percent        Cum.
-------------------+-----------------------------------
   Within 3 months |      1,016        4.52        4.52
        3-6 months |        521        2.32        6.84
More than 6 months |      2,932       13.05       19.89
    Not prescribed |     17,995       80.11      100.00
-------------------+-----------------------------------
             Total |     22,464      100.00

. tab csdmard_hcd_time if psa_code==1, missing

       Shared care |
           csDMARD |
      prescription |      Freq.     Percent        Cum.
-------------------+-----------------------------------
   Within 3 months |      1,033        4.61        4.61
        3-6 months |        514        2.29        6.90
More than 6 months |      2,834       12.64       19.55
    Not prescribed |     18,032       80.45      100.00
-------------------+-----------------------------------
             Total |     22,413      100.00

. 
. **What was first shared care csDMARD (not including high cost MTX prescriptio
> ns)
. gen first_csD=""
(67,502 missing values generated)

. foreach var of varlist hydroxychloroquine_date leflunomide_date methotrexate_
> date methotrexate_inj_date sulfasalazine_date {
  2.         replace first_csD="`var'" if csdmard_date==`var' & csdmard_date!=.
  3.         }
variable first_csD was str1 now str23
(8,987 real changes made)
(8,887 real changes made)
(8,827 real changes made)
(8,898 real changes made)
(8,910 real changes made)

. gen first_csDMARD = substr(first_csD, 1, length(first_csD) - 5) if first_csD!
> =""
(23,010 missing values generated)

. drop first_csD

. tab first_csDMARD if ra_code==1 //for RA patients

     first_csDMARD |      Freq.     Percent        Cum.
-------------------+-----------------------------------
hydroxychloroquine |      2,955       19.95       19.95
       leflunomide |      2,896       19.55       39.50
      methotrexate |      2,995       20.22       59.72
  methotrexate_inj |      2,952       19.93       79.65
     sulfasalazine |      3,015       20.35      100.00
-------------------+-----------------------------------
             Total |     14,813      100.00

. tab first_csDMARD if psa_code==1 //for PsA patients

     first_csDMARD |      Freq.     Percent        Cum.
-------------------+-----------------------------------
hydroxychloroquine |      3,006       20.39       20.39
       leflunomide |      2,993       20.31       40.70
      methotrexate |      2,916       19.78       60.48
  methotrexate_inj |      2,960       20.08       80.56
     sulfasalazine |      2,865       19.44      100.00
-------------------+-----------------------------------
             Total |     14,740      100.00

. 
. **What was first csDMARD (including high cost MTX prescriptions)
. gen first_csD_hcd=""
(67,502 missing values generated)

. foreach var of varlist hydroxychloroquine_date leflunomide_date methotrexate_
> date methotrexate_inj_date methotrexate_hcd_date sulfasalazine_date {
  2.         replace first_csD_hcd="`var'" if csdmard_hcd_date==`var' & csdmard
> _hcd_date!=.
  3.         }
variable first_csD_hcd was str1 now str23
(8,214 real changes made)
(8,060 real changes made)
(7,969 real changes made)
(8,132 real changes made)
(8,625 real changes made)
(8,132 real changes made)

. gen first_csDMARD_hcd = substr(first_csD_hcd, 1, length(first_csD_hcd) - 5) i
> f first_csD_hcd!=""
(18,394 missing values generated)

. drop first_csD_hcd

. tab first_csDMARD_hcd if ra_code==1 //for RA patients

 first_csDMARD_hcd |      Freq.     Percent        Cum.
-------------------+-----------------------------------
hydroxychloroquine |      2,710       16.59       16.59
       leflunomide |      2,617       16.02       32.61
      methotrexate |      2,681       16.41       49.02
  methotrexate_hcd |      2,883       17.65       66.67
  methotrexate_inj |      2,699       16.52       83.20
     sulfasalazine |      2,745       16.80      100.00
-------------------+-----------------------------------
             Total |     16,335      100.00

. tab first_csDMARD_hcd if psa_code==1 //for PsA patients

 first_csDMARD_hcd |      Freq.     Percent        Cum.
-------------------+-----------------------------------
hydroxychloroquine |      2,754       16.92       16.92
       leflunomide |      2,715       16.69       33.61
      methotrexate |      2,640       16.22       49.83
  methotrexate_hcd |      2,832       17.40       67.24
  methotrexate_inj |      2,703       16.61       83.85
     sulfasalazine |      2,628       16.15      100.00
-------------------+-----------------------------------
             Total |     16,272      100.00

.  
. **Methotrexate use (not including high cost MTX prescriptions)
. gen mtx=1 if methotrexate==1 | methotrexate_inj==1
(43,879 missing values generated)

. recode mtx .=0 
(mtx: 43879 changes made)

. tab mtx if ra_code==1 //for RA patients; Nb. this is just a check; need time-
> to-MTX instead (below)

        mtx |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     14,517       64.62       64.62
          1 |      7,947       35.38      100.00
------------+-----------------------------------
      Total |     22,464      100.00

. tab mtx if psa_code==1 //for PsA patients

        mtx |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     14,586       65.08       65.08
          1 |      7,827       34.92      100.00
------------+-----------------------------------
      Total |     22,413      100.00

. 
. **Methotrexate use (including high cost MTX prescriptions)
. gen mtx_hcd=1 if methotrexate==1 | methotrexate_inj==1 | methotrexate_hcd==1
(35,077 missing values generated)

. recode mtx_hcd .=0 
(mtx_hcd: 35077 changes made)

. tab mtx_hcd if ra_code==1 //for RA patients

    mtx_hcd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     11,597       51.62       51.62
          1 |     10,867       48.38      100.00
------------+-----------------------------------
      Total |     22,464      100.00

. tab mtx_hcd if psa_code==1 //for PsA patients

    mtx_hcd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     11,700       52.20       52.20
          1 |     10,713       47.80      100.00
------------+-----------------------------------
      Total |     22,413      100.00

. 
. **Date of first methotrexate script (not including high cost MTX prescription
> s)
. gen mtx_date=min(methotrexate_date, methotrexate_inj_date)
(43,879 missing values generated)

. format %td mtx_date

. 
. **Date of first methotrexate script (including high cost MTX prescriptions)
. gen mtx_hcd_date=min(methotrexate_date, methotrexate_inj_date, methotrexate_h
> cd_date)
(35,077 missing values generated)

. format %td mtx_hcd_date

. 
. **Time to first methotrexate script for RA patients (not including high cost 
> MTX prescriptions)
. gen time_to_mtx=(mtx_date-rheum_appt_date) if mtx==1 & rheum_appt_date!=.
(61,340 missing values generated)

. tabstat time_to_mtx if ra_code==1, stats (n mean p50 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |      2103  442.8345       410       187       678
----------------------------------------------------------------

. 
. **Time to first methotrexate script for RA patients (including high cost MTX 
> prescriptions)
. gen time_to_mtx_hcd=(mtx_hcd_date-rheum_appt_date) if mtx_hcd==1 & rheum_appt
> _date!=. 
(58,801 missing values generated)

. tabstat time_to_mtx_hcd if ra_code==1, stats (n mean p50 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_mt~d |      2963  399.2923       376       145       643
----------------------------------------------------------------

. 
. **Time to first methotrexate script for PsA patients (not including high cost
>  MTX prescriptions)
. tabstat time_to_mtx if psa_code==1, stats (n mean p50 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |      2047  442.7616       414       164       691
----------------------------------------------------------------

. 
. **Time to first methotrexate script for PsA patients (including high cost MTX
>  prescriptions)
. tabstat time_to_mtx_hcd if psa_code==1, stats (n mean p50 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_mt~d |      2866  388.2585       361       120       646
----------------------------------------------------------------

. 
. **Methotrexate time categories (not including high-cost MTX)  
. gen mtx_time=1 if time_to_mtx<=90 & time_to_mtx!=. 
(66,560 missing values generated)

. replace mtx_time=2 if time_to_mtx>90 & time_to_mtx<=180 & time_to_mtx!=.
(629 real changes made)

. replace mtx_time=3 if time_to_mtx>180 & time_to_mtx!=.
(4,591 real changes made)

. replace mtx_time=4 if time_to_mtx==.
(61,340 real changes made)

. lab define mtx_time 1 "Within 3 months" 2 "3-6 months" 3 "More than 6 months"
>  4 "Not prescribed", modify

. lab val mtx_time mtx_time

. lab var mtx_time "Shared care methotrexate prescription" 

. tab mtx_time if ra_code==1, missing 

       Shared care |
      methotrexate |
      prescription |      Freq.     Percent        Cum.
-------------------+-----------------------------------
   Within 3 months |        312        1.39        1.39
        3-6 months |        196        0.87        2.26
More than 6 months |      1,595        7.10        9.36
    Not prescribed |     20,361       90.64      100.00
-------------------+-----------------------------------
             Total |     22,464      100.00

. tab mtx_time if psa_code==1, missing

       Shared care |
      methotrexate |
      prescription |      Freq.     Percent        Cum.
-------------------+-----------------------------------
   Within 3 months |        331        1.48        1.48
        3-6 months |        220        0.98        2.46
More than 6 months |      1,496        6.67        9.13
    Not prescribed |     20,366       90.87      100.00
-------------------+-----------------------------------
             Total |     22,413      100.00

. 
. **Methotrexate time categories for RA patients (including high-cost MTX)
. gen mtx_hcd_time=1 if time_to_mtx_hcd<=90 & time_to_mtx_hcd!=. 
(65,714 missing values generated)

. replace mtx_hcd_time=2 if time_to_mtx_hcd>90 & time_to_mtx_hcd<=180 & time_to
> _mtx_hcd!=.
(872 real changes made)

. replace mtx_hcd_time=3 if time_to_mtx_hcd>180 & time_to_mtx_hcd!=.
(6,041 real changes made)

. replace mtx_hcd_time=4 if time_to_mtx_hcd==.
(58,801 real changes made)

. lab define mtx_hcd_time 1 "Within 3 months" 2 "3-6 months" 3 "More than 6 mon
> ths" 4 "Not prescribed", modify

. lab val mtx_hcd_time mtx_hcd_time

. lab var mtx_hcd_time "Shared care methotrexate prescription" 

. tab mtx_hcd_time if ra_code==1, missing 

       Shared care |
      methotrexate |
      prescription |      Freq.     Percent        Cum.
-------------------+-----------------------------------
   Within 3 months |        568        2.53        2.53
        3-6 months |        286        1.27        3.80
More than 6 months |      2,109        9.39       13.19
    Not prescribed |     19,501       86.81      100.00
-------------------+-----------------------------------
             Total |     22,464      100.00

. tab mtx_hcd_time if psa_code==1, missing

       Shared care |
      methotrexate |
      prescription |      Freq.     Percent        Cum.
-------------------+-----------------------------------
   Within 3 months |        625        2.79        2.79
        3-6 months |        297        1.33        4.11
More than 6 months |      1,944        8.67       12.79
    Not prescribed |     19,547       87.21      100.00
-------------------+-----------------------------------
             Total |     22,413      100.00

. 
. **Sulfasalazine use
. gen ssz=1 if sulfasalazine==1
(54,309 missing values generated)

. recode ssz .=0 
(ssz: 54309 changes made)

. 
. **Time to first Sulfasalazine script for RA patients
. gen time_to_ssz=(sulfasalazine_date-rheum_appt_date) if sulfasalazine_date!=.
>  & rheum_appt_date!=.
(64,049 missing values generated)

. tabstat time_to_ssz if ra_code==1, stats (n mean p50 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |      1199  464.3203       452       196       718
----------------------------------------------------------------

. tabstat time_to_ssz if psa_code==1, stats (n mean p50 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |      1121  479.1936       475       206       723
----------------------------------------------------------------

. 
. **Sulfasalazine time categories  
. gen ssz_time=1 if time_to_ssz<=90 & time_to_ssz!=. 
(67,000 missing values generated)

. replace ssz_time=2 if time_to_ssz>90 & time_to_ssz<=180 & time_to_ssz!=.
(300 real changes made)

. replace ssz_time=3 if time_to_ssz>180 & time_to_ssz!=.
(2,651 real changes made)

. replace ssz_time=4 if time_to_ssz==.
(64,049 real changes made)

. lab define ssz_time 1 "Within 3 months" 2 "3-6 months" 3 "More than 6 months"
>  4 "Not prescribed", modify

. lab val ssz_time ssz_time

. lab var ssz_time "Shared care sulfasalazine prescription" 

. tab ssz_time if ra_code==1, missing 

       Shared care |
     sulfasalazine |
      prescription |      Freq.     Percent        Cum.
-------------------+-----------------------------------
   Within 3 months |        179        0.80        0.80
        3-6 months |        104        0.46        1.26
More than 6 months |        916        4.08        5.34
    Not prescribed |     21,265       94.66      100.00
-------------------+-----------------------------------
             Total |     22,464      100.00

. tab ssz_time if psa_code==1, missing

       Shared care |
     sulfasalazine |
      prescription |      Freq.     Percent        Cum.
-------------------+-----------------------------------
   Within 3 months |        150        0.67        0.67
        3-6 months |         99        0.44        1.11
More than 6 months |        872        3.89        5.00
    Not prescribed |     21,292       95.00      100.00
-------------------+-----------------------------------
             Total |     22,413      100.00

. 
. **Hydroxychloroquine use
. gen hcq=1 if hydroxychloroquine==1
(54,296 missing values generated)

. recode hcq .=0 
(hcq: 54296 changes made)

. 
. **Time to first Hydroxychloroquine script for RA patients
. gen time_to_hcq=(hydroxychloroquine_date-rheum_appt_date) if hydroxychloroqui
> ne_date!=. & rheum_appt_date!=.
(64,097 missing values generated)

. tabstat time_to_hcq if ra_code==1, stats (n mean p50 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |      1144  468.7369     462.5     196.5       727
----------------------------------------------------------------

. tabstat time_to_hcq if psa_code==1, stats (n mean p50 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |      1108  458.4666       446     191.5       692
----------------------------------------------------------------

. 
. **Hydroxychloroquine time categories  
. gen hcq_time=1 if time_to_hcq<=90 & time_to_hcq!=. 
(67,021 missing values generated)

. replace hcq_time=2 if time_to_hcq>90 & time_to_hcq<=180 & time_to_hcq!=.
(316 real changes made)

. replace hcq_time=3 if time_to_hcq>180 & time_to_hcq!=.
(2,608 real changes made)

. replace hcq_time=4 if time_to_hcq==.
(64,097 real changes made)

. lab define hcq_time 1 "Within 3 months" 2 "3-6 months" 3 "More than 6 months"
>  4 "Not prescribed", modify

. lab val hcq_time hcq_time

. lab var hcq_time "Shared care hydroxychloroquine prescription" 

. tab hcq_time if ra_code==1, missing 

       Shared care |
hydroxychloroquine |
      prescription |      Freq.     Percent        Cum.
-------------------+-----------------------------------
   Within 3 months |        169        0.75        0.75
        3-6 months |         98        0.44        1.19
More than 6 months |        877        3.90        5.09
    Not prescribed |     21,320       94.91      100.00
-------------------+-----------------------------------
             Total |     22,464      100.00

. tab hcq_time if psa_code==1, missing

       Shared care |
hydroxychloroquine |
      prescription |      Freq.     Percent        Cum.
-------------------+-----------------------------------
   Within 3 months |        157        0.70        0.70
        3-6 months |        111        0.50        1.20
More than 6 months |        840        3.75        4.94
    Not prescribed |     21,305       95.06      100.00
-------------------+-----------------------------------
             Total |     22,413      100.00

. 
. **Leflunomide use
. gen lef=1 if leflunomide==1
(54,449 missing values generated)

. recode lef .=0 
(lef: 54449 changes made)

. 
. **Time to first methotrexate script for RA patients
. gen time_to_lef=(leflunomide_date-rheum_appt_date) if leflunomide_date!=. & r
> heum_appt_date!=.
(64,138 missing values generated)

. tabstat time_to_lef if ra_code==1, stats (n mean p50 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |      1137  473.3676       471       192       728
----------------------------------------------------------------

. tabstat time_to_lef if psa_code==1, stats (n mean p50 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |      1139  459.8235       438       202       713
----------------------------------------------------------------

. 
. **Leflunomide time categories  
. gen lef_time=1 if time_to_lef<=90 & time_to_lef!=. 
(66,997 missing values generated)

. replace lef_time=2 if time_to_lef>90 & time_to_lef<=180 & time_to_lef!=.
(292 real changes made)

. replace lef_time=3 if time_to_lef>180 & time_to_lef!=.
(2,567 real changes made)

. replace lef_time=4 if time_to_lef==.
(64,138 real changes made)

. lab define lef_time 1 "Within 3 months" 2 "3-6 months" 3 "More than 6 months"
>  4 "Not prescribed", modify

. lab val lef_time lef_time

. lab var lef_time "Shared care leflunomide prescription" 

. tab lef_time if ra_code==1, missing 

       Shared care |
       leflunomide |
      prescription |      Freq.     Percent        Cum.
-------------------+-----------------------------------
   Within 3 months |        164        0.73        0.73
        3-6 months |        105        0.47        1.20
More than 6 months |        868        3.86        5.06
    Not prescribed |     21,327       94.94      100.00
-------------------+-----------------------------------
             Total |     22,464      100.00

. tab lef_time if psa_code==1, missing

       Shared care |
       leflunomide |
      prescription |      Freq.     Percent        Cum.
-------------------+-----------------------------------
   Within 3 months |        161        0.72        0.72
        3-6 months |         98        0.44        1.16
More than 6 months |        880        3.93        5.08
    Not prescribed |     21,274       94.92      100.00
-------------------+-----------------------------------
             Total |     22,413      100.00

. 
. **Time to first biologic script; high_cost drug data available to Nov 2020===
> ===================================================================*/
. 
. *Below analyses are only for patients with at least 12 months of follow-up av
> ailable after rheum appt
. gen time_to_biologic=(biologic_date-rheum_appt_date) if biologic==1 & rheum_a
> ppt_date!=.
(49,465 missing values generated)

. tabstat time_to_biologic, stats (n mean p50 p25 p75) //for all EIA patients

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_bi~c |     18037  230.0422       164        41       360
----------------------------------------------------------------

. 
. /* Suppress due to small numbers
> **What was first biologic
> gen first_bio=""
> foreach var of varlist abatacept_date adalimumab_date baricitinib_date certol
> izumab_date etanercept_date golimumab_date guselkumab_date infliximab_date ix
> ekizumab_date rituximab_date sarilumab_date secukinumab_date tocilizumab_date
>  tofacitinib_date upadacitinib_date ustekinumab_date {
>         replace first_bio="`var'" if biologic_date==`var' & biologic_date!=.
>         }
> gen first_biologic = substr(first_bio, 1, length(first_bio) - 5)        
> drop first_bio
> tab first_biologic //for all EIA patients
> */
. 
. **Biologic time categories (for all patients)
. gen biologic_time=1 if time_to_biologic<=180 & time_to_biologic!=. 
(58,007 missing values generated)

. replace biologic_time=2 if time_to_biologic>180 & time_to_biologic<=365 & tim
> e_to_biologic!=.
(4,121 real changes made)

. replace biologic_time=3 if time_to_biologic>365 & time_to_biologic!=.
(4,421 real changes made)

. replace biologic_time=4 if time_to_biologic==.
(49,465 real changes made)

. lab define biologic_time 1 "Within 6 months" 2 "6-12 months" 3 "More than 12 
> months" 4 "Not prescribed", modify

. lab val biologic_time biologic_time

. lab var biologic_time "bDMARD/tsDMARD prescription" 

. tab biologic_time

     bDMARD/tsDMARD |
       prescription |      Freq.     Percent        Cum.
--------------------+-----------------------------------
    Within 6 months |      9,495       14.07       14.07
        6-12 months |      4,121        6.11       20.17
More than 12 months |      4,421        6.55       26.72
     Not prescribed |     49,465       73.28      100.00
--------------------+-----------------------------------
              Total |     67,502      100.00

. 
. **Biologic time categories (by year)
. bys diagnosis_year: tab biologic_time

-------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

     bDMARD/tsDMARD |
       prescription |      Freq.     Percent        Cum.
--------------------+-----------------------------------
    Within 6 months |      7,885       19.48       19.48
        6-12 months |      3,528        8.72       28.20
More than 12 months |      4,009        9.90       38.10
     Not prescribed |     25,056       61.90      100.00
--------------------+-----------------------------------
              Total |     40,478      100.00

-------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

     bDMARD/tsDMARD |
       prescription |      Freq.     Percent        Cum.
--------------------+-----------------------------------
    Within 6 months |      1,446        7.74        7.74
        6-12 months |        554        2.96       10.70
More than 12 months |        411        2.20       12.90
     Not prescribed |     16,274       87.10      100.00
--------------------+-----------------------------------
              Total |     18,685      100.00

-------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

     bDMARD/tsDMARD |
       prescription |      Freq.     Percent        Cum.
--------------------+-----------------------------------
    Within 6 months |        164        1.97        1.97
        6-12 months |         39        0.47        2.43
More than 12 months |          1        0.01        2.45
     Not prescribed |      8,135       97.55      100.00
--------------------+-----------------------------------
              Total |      8,339      100.00


. 
. save "$projectdir/output/data/file_eia_all", replace
(note: file /workspace/output/data/file_eia_all.dta not found)
file /workspace/output/data/file_eia_all.dta saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/cleaning_dataset.log
  log type:  text
 closed on:  14 Apr 2022, 10:50:57
-------------------------------------------------------------------------------
