{smcl}
{txt}{sf}{ul off}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/workspace/logs/cleaning_dataset_allpts.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 4 Apr 2022, 10:54:58
{txt}
{com}. 
. **Set Ado file path
. adopath + "$projectdir/analysis/extra_ados"
{txt}  [1]  (BASE)      "{res}/usr/local/stata/ado/base/{txt}"
  [2]  (SITE)      "{res}/usr/local/ado/{txt}"
  [3]              "{res}.{txt}"
  [4]  (PERSONAL)  "{res}~/ado/personal/{txt}"
  [5]  (PLUS)      "{res}~/ado/plus/{txt}"
  [6]  (OLDPLACE)  "{res}~/ado/{txt}"
  [7]              "{res}/workspace/analysis/extra_ados{txt}"

{com}. 
. **Set index dates ===========================================================*/
. global year_preceding = "01/03/2018"
{txt}
{com}. global start_date = "01/03/2019"
{txt}
{com}. global end_date = "01/03/2022"
{txt}
{com}. 
. **Rename variables (some are too long for Stata to handle) =======================================*/
. rename chronic_respiratory_disease chronic_resp_disease
{res}{txt}
{com}. 
. **Convert date strings to dates ====================================================*/
. ***Some dates are given with month/year only, so adding day 15 to enable them to be processed as dates 
. 
. foreach var of varlist   hba1c_mmol_per_mol_date                        ///
>                                                  hba1c_percentage_date                          ///
>                                                  creatinine_date                                ///
>                                                  bmi_date_measured                          ///
>                                                  {c -(}
{txt}  2{com}.                                                         
.                 capture confirm string variable `var'
{txt}  3{com}.                 if _rc!=0 {c -(}
{txt}  4{com}.                         assert `var'==.
{txt}  5{com}.                         rename `var' `var'_date
{txt}  6{com}.                 {c )-}
{txt}  7{com}.         
.                 else {c -(}
{txt}  8{com}.                                 replace `var' = `var' + "-15"
{txt}  9{com}.                                 rename `var' `var'_dstr
{txt} 10{com}.                                 replace `var'_dstr = " " if `var'_dstr == "-15"
{txt} 11{com}.                                 gen `var'_date = date(`var'_dstr, "YMD") 
{txt} 12{com}.                                 order `var'_date, after(`var'_dstr)
{txt} 13{com}.                                 drop `var'_dstr
{txt} 14{com}.                 {c )-}
{txt} 15{com}.         
.         format `var'_date %td
{txt} 16{com}. {c )-}
{txt}variable {bf}hba1c_mmol_per_mol_date{sf} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(5,000 real changes made)
(5,000 missing values generated)
variable {bf}hba1c_percentage_date{sf} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(5,000 real changes made)
(5,000 missing values generated)
variable {bf}creatinine_date{sf} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(5,000 real changes made)
(5,000 missing values generated)
variable {bf}bmi_date_measured{sf} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(40,000 real changes made)
(40,000 missing values generated)

{com}. 
. **Conversion for dates with day already included ====================================================*/
. 
. foreach var of varlist   chronic_cardiac_disease                        ///
>                                                  diabetes                                                       ///
>                                                  hypertension                                           ///     
>                                                  chronic_resp_disease                           ///
>                                                  copd                                                           ///
>                                                  chronic_liver_disease                          ///
>                                                  stroke                                                         ///
>                                                  lung_cancer                                            ///
>                                                  haem_cancer                                            ///
>                                                  other_cancer                                           ///
>                                                  esrf                                                           ///
>                                                  organ_transplant                                       ///
>                                                  {c -(}
{txt}  2{com}.                                                                  
.                 capture confirm string variable `var'
{txt}  3{com}.                 if _rc!=0 {c -(}
{txt}  4{com}.                         assert `var'==.
{txt}  5{com}.                         rename `var' `var'_date
{txt}  6{com}.                 {c )-}
{txt}  7{com}.         
.                 else {c -(}
{txt}  8{com}.                                 rename `var' `var'_dstr
{txt}  9{com}.                                 gen `var'_date = date(`var'_dstr, "YMD") 
{txt} 10{com}.                                 order `var'_date, after(`var'_dstr)
{txt} 11{com}.                                 drop `var'_dstr
{txt} 12{com}.                                 gen `var'_date15 = `var'_date+15
{txt} 13{com}.                                 order `var'_date15, after(`var'_date)
{txt} 14{com}.                                 drop `var'_date
{txt} 15{com}.                                 rename `var'_date15 `var'_date
{txt} 16{com}.                 {c )-}
{txt} 17{com}.         
.         format `var'_date %td
{txt} 18{com}. {c )-}
{res}{txt}(80,000 missing values generated)
(80,000 missing values generated)
{res}{txt}(80,000 missing values generated)
(80,000 missing values generated)
{res}{txt}(80,000 missing values generated)
(80,000 missing values generated)
{res}{txt}(80,000 missing values generated)
(80,000 missing values generated)
{res}{txt}(80,000 missing values generated)
(80,000 missing values generated)
{res}{txt}(80,000 missing values generated)
(80,000 missing values generated)
{res}{txt}(80,000 missing values generated)
(80,000 missing values generated)
{res}{txt}(80,000 missing values generated)
(80,000 missing values generated)
{res}{txt}(80,000 missing values generated)
(80,000 missing values generated)
{res}{txt}(80,000 missing values generated)
(80,000 missing values generated)
{res}{txt}(80,000 missing values generated)
(80,000 missing values generated)
{res}{txt}(80,000 missing values generated)
(80,000 missing values generated)
{res}{txt}
{com}.                                                  
. **Rename variables with extra 'date' added to the end of variable names===========================================================*/ 
. rename hba1c_mmol_per_mol_date_date hba1c_mmol_per_mol_date
{res}{txt}
{com}. rename hba1c_percentage_date_date hba1c_percentage_date
{res}{txt}
{com}. rename creatinine_date_date creatinine_date
{res}{txt}
{com}. rename creatinine creatinine_value 
{res}{txt}
{com}. rename bmi_date_measured_date bmi_date
{res}{txt}
{com}. rename bmi bmi_value
{res}{txt}
{com}. 
. **Create binary indicator variables for relevant conditions ====================================================*/
. 
. foreach var of varlist   chronic_cardiac_disease_date           ///
>                                                  diabetes_date                                          ///
>                                                  hypertension_date                                      ///
>                                                  chronic_resp_disease_date                      ///
>                                                  copd_date                                                      ///
>                                                  chronic_liver_disease_date                     ///
>                                                  stroke_date                                            ///
>                                                  lung_cancer_date                                       ///
>                                                  haem_cancer_date                                       ///             
>                                                  other_cancer_date                                      ///
>                                                  esrf_date                                                      ///
>                                                  creatinine_date                                        ///
>                                                  organ_transplant_date                          ///
>                                                  {c -(}                              
{txt}  2{com}.         /*date ranges are applied in python, so presence of date indicates presence of 
>           disease in the correct time frame*/ 
.         local newvar =  substr("`var'", 1, length("`var'") - 5)
{txt}  3{com}.         gen `newvar' = (`var'!=. )
{txt}  4{com}.         order `newvar', after(`var')
{txt}  5{com}. {c )-}
{txt}
{com}. 
. **Demographics======================================================================*/
. ***Sex
. gen male = 1 if sex == "M"
{txt}(50,861 missing values generated)

{com}. replace male = 0 if sex == "F"
{txt}(50,861 real changes made)

{com}. lab var male "Male"
{txt}
{com}. 
. ***Ethnicity
. replace ethnicity = .u if ethnicity == .
{txt}(25,000 real changes made, 25,000 to missing)

{com}. ****rearrange in order of prevalence
. recode ethnicity 2=6 /* mixed to 6 */
{txt}(ethnicity: 15001 changes made)

{com}. recode ethnicity 3=2 /* south asian to 2 */
{txt}(ethnicity: 7475 changes made)

{com}. recode ethnicity 4=3 /* black to 3 */
{txt}(ethnicity: 7501 changes made)

{com}. recode ethnicity 6=4 /* mixed to 4 */
{txt}(ethnicity: 15001 changes made)

{com}. recode ethnicity 5=4 /* other to 4 */
{txt}(ethnicity: 7461 changes made)

{com}. 
. label define ethnicity  1 "White"                                       ///
>                                                 2 "Asian/Asian British"         ///
>                                                 3 "Black"                                       ///
>                                                 4 "Mixed/Other"                         ///
>                                                 .u "Missing"
{txt}
{com}. label values ethnicity ethnicity
{txt}
{com}. lab var ethnicity "Ethnicity"
{txt}
{com}. 
. ***STP 
. rename stp stp_old
{res}{txt}
{com}. bysort stp_old: gen stp = 1 if _n==1
{txt}(99,998 missing values generated)

{com}. replace stp = sum(stp) //
{txt}(99,999 real changes made)

{com}. drop stp_old
{txt}
{com}. 
. ***IMD
. *Group into 5 groups
. rename imd imd_o
{res}{txt}
{com}. egen imd = cut(imd_o), group(5) icodes 
{txt}
{com}. *Add one to create groups 1-5 
. replace imd = imd + 1
{txt}(100,000 real changes made)

{com}. *-1 is missing, should be excluded from population 
. replace imd = .u if imd_o == -1
{txt}(0 real changes made)

{com}. drop imd_o
{txt}
{com}. *Reverse the order (so high is more deprived)
. recode imd 5 = 1 4 = 2 3 = 3 2 = 4 1 = 5 .u = .u
{txt}(imd: 100000 changes made)

{com}. label define imd 1 "1 least deprived" 2 "2" 3 "3" 4 "4" 5 "5 most deprived" .u "Missing"
{txt}
{com}. label values imd imd 
{txt}
{com}. lab var imd "Index of multiple deprivation"
{txt}
{com}. 
. ***Age variables
. *Nb. works if ages 18 and over
. *Create categorised age
. drop if age<18 & age !=.
{txt}(21,271 observations deleted)

{com}. drop if age>109 & age !=.
{txt}(0 observations deleted)

{com}. drop if age==.
{txt}(0 observations deleted)

{com}. lab var age "Age"
{txt}
{com}. 
. recode age 18/39.9999 = 1 /// 
>            40/49.9999 = 2 ///
>                    50/59.9999 = 3 ///
>                60/69.9999 = 4 ///
>                    70/79.9999 = 5 ///
>                    80/max = 6, gen(agegroup) 
{txt}(78729 differences between age and agegroup)

{com}. 
. label define agegroup   1 "18-39" ///
>                                                 2 "40-49" ///
>                                                 3 "50-59" ///
>                                                 4 "60-69" ///
>                                                 5 "70-79" ///
>                                                 6 "80+"
{txt}
{com}.                                                 
. label values agegroup agegroup
{txt}
{com}. lab var agegroup "Age group"
{txt}
{com}. 
. *Create binary age
. recode age min/69.999 = 0 ///
>            70/max = 1, gen(age70)
{txt}(78729 differences between age and age70)

{com}. 
. *Create restricted cubic splines for age
. mkspline age = age, cubic nknots(4)
{txt}
{com}. 
. ***Body Mass Index
. *Recode strange values 
. replace bmi_value = . if bmi_value == 0 
{txt}(31,474 real changes made, 31,474 to missing)

{com}. replace bmi_value = . if !inrange(bmi_value, 10, 80)
{txt}(310 real changes made, 310 to missing)

{com}. 
. *Restrict to within 10 years of start date and aged>16 
. gen bmi_time = (date("$start_date", "DMY") - bmi_date)/365.25
{txt}(31,474 missing values generated)

{com}. gen bmi_age = age - bmi_time
{txt}(31,474 missing values generated)

{com}. replace bmi_value = . if bmi_age < 16 
{txt}(34,107 real changes made, 34,107 to missing)

{com}. replace bmi_value = . if bmi_time > 10 & bmi_time != . 
{txt}(9,207 real changes made, 9,207 to missing)

{com}. 
. *Set to missing if no date, and vice versa 
. replace bmi_value = . if bmi_date == . 
{txt}(0 real changes made)

{com}. replace bmi_date = . if bmi_value == . 
{txt}(43,624 real changes made, 43,624 to missing)

{com}. replace bmi_time = . if bmi_value == . 
{txt}(43,624 real changes made, 43,624 to missing)

{com}. replace bmi_age = . if bmi_value == . 
{txt}(43,624 real changes made, 43,624 to missing)

{com}. 
. *Create BMI categories
. gen     bmicat = .
{txt}(78,729 missing values generated)

{com}. recode  bmicat . = 1 if bmi_value < 18.5
{txt}(bmicat: 142 changes made)

{com}. recode  bmicat . = 2 if bmi_value < 25
{txt}(bmicat: 404 changes made)

{com}. recode  bmicat . = 3 if bmi_value < 30
{txt}(bmicat: 546 changes made)

{com}. recode  bmicat . = 4 if bmi_value < 35
{txt}(bmicat: 679 changes made)

{com}. recode  bmicat . = 5 if bmi_value < 40
{txt}(bmicat: 670 changes made)

{com}. recode  bmicat . = 6 if bmi_value < .
{txt}(bmicat: 1190 changes made)

{com}. replace bmicat = .u if bmi_value >= .
{txt}(75,098 real changes made, 75,098 to missing)

{com}. 
. label define bmicat 1 "Underweight (<18.5)"     ///
>                                         2 "Normal (18.5-24.9)"          ///
>                                         3 "Overweight (25-29.9)"        ///
>                                         4 "Obese I (30-34.9)"           ///
>                                         5 "Obese II (35-39.9)"          ///
>                                         6 "Obese III (40+)"                     ///
>                                         .u "Missing"
{txt}
{com}.                                         
. label values bmicat bmicat
{txt}
{com}. lab var bmicat "BMI"
{txt}
{com}. 
. *Create less granular categorisation
. recode bmicat 1/3 .u = 1 4 = 2 5 = 3 6 = 4, gen(obese4cat)
{txt}(78587 differences between bmicat and obese4cat)

{com}. 
. label define obese4cat  1 "No record of obesity"        ///
>                                                 2 "Obese I (30-34.9)"           ///
>                                                 3 "Obese II (35-39.9)"          ///
>                                                 4 "Obese III (40+)"             
{txt}
{com}. 
. label values obese4cat obese4cat
{txt}
{com}. order obese4cat, after(bmicat)
{txt}
{com}. 
. ***Smoking 
. label define smoke 1 "Never" 2 "Former" 3 "Current" .u "Missing"
{txt}
{com}. 
. gen     smoke = 1  if smoking_status == "N"
{txt}(70,771 missing values generated)

{com}. replace smoke = 2  if smoking_status == "E"
{txt}(3,848 real changes made)

{com}. replace smoke = 3  if smoking_status == "S"
{txt}(23,531 real changes made)

{com}. replace smoke = .u if smoking_status == "M"
{txt}(3,952 real changes made, 3,952 to missing)

{com}. replace smoke = .u if smoking_status == "" 
{txt}(39,440 real changes made, 39,440 to missing)

{com}. 
. label values smoke smoke
{txt}
{com}. lab var smoke "Smoking status"
{txt}
{com}. drop smoking_status
{txt}
{com}. 
. *Create non-missing 3-category variable for current smoking (assumes missing smoking is never smoking)
. recode smoke .u = 1, gen(smoke_nomiss)
{txt}(43392 differences between smoke and smoke_nomiss)

{com}. order smoke_nomiss, after(smoke)
{txt}
{com}. label values smoke_nomiss smoke
{txt}
{com}. 
. **Clinical comorbidities
. ***eGFR
. *Set implausible creatinine values to missing (Note: zero changed to missing)
. replace creatinine_value = . if !inrange(creatinine_value, 20, 3000) 
{txt}(19,636 real changes made, 19,636 to missing)

{com}. 
. *Remove creatinine dates if no measurements, and vice versa 
. replace creatinine_value = . if creatinine_date == . 
{txt}(0 real changes made)

{com}. replace creatinine_date = . if creatinine_value == . 
{txt}(15,712 real changes made, 15,712 to missing)

{com}. replace creatinine = . if creatinine_value == .
{txt}(19,636 real changes made, 19,636 to missing)

{com}. recode creatinine .=0
{txt}(creatinine: 19636 changes made)

{com}. 
. *Divide by 88.4 (to convert umol/l to mg/dl) 
. gen SCr_adj = creatinine_value/88.4
{txt}(19,636 missing values generated)

{com}. 
. gen min = .
{txt}(78,729 missing values generated)

{com}. replace min = SCr_adj/0.7 if male==0
{txt}(30,057 real changes made)

{com}. replace min = SCr_adj/0.9 if male==1
{txt}(29,036 real changes made)

{com}. replace min = min^-0.329  if male==0
{txt}(30,057 real changes made)

{com}. replace min = min^-0.411  if male==1
{txt}(29,036 real changes made)

{com}. replace min = 1 if min<1
{txt}(46,142 real changes made)

{com}. 
. gen max=.
{txt}(78,729 missing values generated)

{com}. replace max=SCr_adj/0.7 if male==0
{txt}(30,057 real changes made)

{com}. replace max=SCr_adj/0.9 if male==1
{txt}(29,036 real changes made)

{com}. replace max=max^-1.209
{txt}(59,093 real changes made)

{com}. replace max=1 if max>1
{txt}(32,587 real changes made)

{com}. 
. gen egfr=min*max*141
{txt}(19,636 missing values generated)

{com}. replace egfr=egfr*(0.993^age)
{txt}(59,093 real changes made)

{com}. replace egfr=egfr*1.018 if male==0
{txt}(30,057 real changes made)

{com}. label var egfr "egfr calculated using CKD-EPI formula with no ethnicity"
{txt}
{com}. 
. *Categorise into ckd stages
. egen egfr_cat_all = cut(egfr), at(0, 15, 30, 45, 60, 5000)
{txt}(19636 missing values generated)

{com}. recode egfr_cat_all 0 = 5 15 = 4 30 = 3 45 = 2 60 = 0, generate(ckd_egfr)
{txt}(59093 differences between egfr_cat_all and ckd_egfr)

{com}. 
. gen egfr_cat = .
{txt}(78,729 missing values generated)

{com}. recode egfr_cat . = 3 if egfr < 30
{txt}(egfr_cat: 13887 changes made)

{com}. recode egfr_cat . = 2 if egfr < 60
{txt}(egfr_cat: 20815 changes made)

{com}. recode egfr_cat . = 1 if egfr < .
{txt}(egfr_cat: 24391 changes made)

{com}. replace egfr_cat = .u if egfr >= .
{txt}(19,636 real changes made, 19,636 to missing)

{com}. 
. label define egfr_cat   1 ">=60"                ///
>                                                 2 "30-59"               ///
>                                                 3 "<30"                 ///
>                                                 .u "Missing"
{txt}
{com}.                                         
. label values egfr_cat egfr_cat
{txt}
{com}. lab var egfr_cat "eGFR"
{txt}
{com}. 
. *If missing eGFR, assume normal
. gen egfr_cat_nomiss = egfr_cat
{txt}(19,636 missing values generated)

{com}. replace egfr_cat_nomiss = 1 if egfr_cat == .u
{txt}(19,636 real changes made)

{com}. 
. label define egfr_cat_nomiss    1 ">=60/missing"        ///
>                                                                 2 "30-59"                       ///
>                                                                 3 "<30" 
{txt}
{com}. label values egfr_cat_nomiss egfr_cat_nomiss
{txt}
{com}. lab var egfr_cat_nomiss "eGFR"
{txt}
{com}. 
. gen egfr_date = creatinine_date
{txt}(19,636 missing values generated)

{com}. format egfr_date %td
{txt}
{com}. 
. *Add in end stage renal failure and create a single CKD variable 
. *Missing assumed to not have CKD 
. gen ckd = 0
{txt}
{com}. replace ckd = 1 if ckd_egfr != . & ckd_egfr >= 1
{txt}(34,702 real changes made)

{com}. replace ckd = 1 if esrf == 1
{txt}(8,874 real changes made)

{com}. 
. label define ckd 0 "No CKD" 1 "CKD"
{txt}
{com}. label values ckd ckd
{txt}
{com}. label var ckd "Chronic kidney disease"
{txt}
{com}. 
. *Create date (most recent measure prior to index)
. gen temp1_ckd_date = creatinine_date if ckd_egfr >=1
{txt}(44,027 missing values generated)

{com}. gen temp2_ckd_date = esrf_date if esrf == 1
{txt}(62,966 missing values generated)

{com}. gen ckd_date = max(temp1_ckd_date,temp2_ckd_date) 
{txt}(35,153 missing values generated)

{com}. format ckd_date %td 
{txt}
{com}. 
. drop temp1_ckd_date temp2_ckd_date SCr_adj min max ckd_egfr egfr_cat_all
{txt}
{com}. 
. ***HbA1c
. *Set zero or negative to missing
. replace hba1c_percentage   = . if hba1c_percentage <= 0
{txt}(4,409 real changes made, 4,409 to missing)

{com}. replace hba1c_mmol_per_mol = . if hba1c_mmol_per_mol <= 0
{txt}(5,626 real changes made, 5,626 to missing)

{com}. 
. *Change implausible values to missing
. replace hba1c_percentage   = . if !inrange(hba1c_percentage, 1, 20)
{txt}(1,295 real changes made, 1,295 to missing)

{com}. replace hba1c_mmol_per_mol = . if !inrange(hba1c_mmol_per_mol, 10, 200)
{txt}(3,374 real changes made, 3,374 to missing)

{com}. 
. *Set most recent values of >24 months prior to start date to missing
. replace hba1c_percentage   = . if (date("$start_date", "DMY") - hba1c_percentage_date) > 24*30 & hba1c_percentage_date != .
{txt}(71,750 real changes made, 71,750 to missing)

{com}. replace hba1c_mmol_per_mol = . if (date("$start_date", "DMY") - hba1c_mmol_per_mol_date) > 24*30 & hba1c_mmol_per_mol_date != .
{txt}(68,628 real changes made, 68,628 to missing)

{com}. 
. *Clean up dates
. replace hba1c_percentage_date = . if hba1c_percentage == .
{txt}(73,550 real changes made, 73,550 to missing)

{com}. replace hba1c_mmol_per_mol_date = . if hba1c_mmol_per_mol == .
{txt}(73,675 real changes made, 73,675 to missing)

{com}. 
. *Express  HbA1c as percentage
. *Express all values as perecentage 
. noi summ hba1c_percentage hba1c_mmol_per_mol 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
hba1c_per~ge {c |}{res}      1,275    5.109392     1.81729   1.025809   11.41417
{txt}hba1c_mmol~l {c |}{res}      1,101    42.17822    17.30369   10.29881   108.6905
{txt}
{com}. gen     hba1c_pct = hba1c_percentage 
{txt}(77,454 missing values generated)

{com}. replace hba1c_pct = (hba1c_mmol_per_mol/10.929)+2.15 if hba1c_mmol_per_mol<. 
{txt}(1,101 real changes made)

{com}. 
. *Valid % range between 0-20  
. replace hba1c_pct = . if !inrange(hba1c_pct, 1, 20) 
{txt}(0 real changes made)

{com}. replace hba1c_pct = round(hba1c_pct, 0.1)
{txt}(2,363 real changes made)

{com}. 
. *Categorise HbA1c and diabetes
. *Group hba1c pct
. gen     hba1ccat = 0 if hba1c_pct <  6.5
{txt}(77,050 missing values generated)

{com}. replace hba1ccat = 1 if hba1c_pct >= 6.5  & hba1c_pct < 7.5
{txt}(353 real changes made)

{com}. replace hba1ccat = 2 if hba1c_pct >= 7.5  & hba1c_pct < 8
{txt}(119 real changes made)

{com}. replace hba1ccat = 3 if hba1c_pct >= 8    & hba1c_pct < 9
{txt}(138 real changes made)

{com}. replace hba1ccat = 4 if hba1c_pct >= 9    & hba1c_pct !=.
{txt}(74 real changes made)

{com}. label define hba1ccat 0 "<6.5%" 1">=6.5-7.4" 2">=7.5-7.9" 3">=8-8.9" 4">=9"
{txt}
{com}. label values hba1ccat hba1ccat
{txt}
{com}. 
. *Express all values as mmol
. gen hba1c_mmol = hba1c_mmol_per_mol
{txt}(77,628 missing values generated)

{com}. replace hba1c_mmol = (hba1c_percentage*10.929)-23.5 if hba1c_percentage<. & hba1c_mmol==.
{txt}(1,262 real changes made)

{com}. 
. *Group hba1c mmol
. gen     hba1ccatmm = 0 if hba1c_mmol < 58
{txt}(76,696 missing values generated)

{com}. replace hba1ccatmm = 1 if hba1c_mmol >= 58 & hba1c_pct !=.
{txt}(330 real changes made)

{com}. replace hba1ccatmm =.u if hba1ccatmm==. 
{txt}(76,366 real changes made, 76,366 to missing)

{com}. label define hba1ccatmm 0 "HbA1c <58mmol/mol" 1 "HbA1c >=58mmol/mol" .u "Missing"
{txt}
{com}. label values hba1ccatmm hba1ccatmm
{txt}
{com}. lab var hba1ccatmm "HbA1c"
{txt}
{com}. 
. *Create diabetes, split by control/not (assumes missing = no diabetes)
. gen     diabcat = 1 if diabetes==0
{txt}(15,808 missing values generated)

{com}. replace diabcat = 2 if diabetes==1 & inlist(hba1ccat, 0, 1)
{txt}(399 real changes made)

{com}. replace diabcat = 3 if diabetes==1 & inlist(hba1ccat, 2, 3, 4)
{txt}(63 real changes made)

{com}. replace diabcat = 4 if diabetes==1 & !inlist(hba1ccat, 0, 1, 2, 3, 4)
{txt}(15,346 real changes made)

{com}. 
. label define diabcat    1 "No diabetes"                         ///
>                                                 2 "Controlled diabetes"         ///
>                                                 3 "Uncontrolled diabetes"       ///
>                                                 4 "Diabetes, no hba1c measure"
{txt}
{com}. label values diabcat diabcat
{txt}
{com}. 
. *Create cancer variable 'other cancer currently', includes carcinoma of the head and neck - need to confirm if this excludes NMSC
. gen cancer =0
{txt}
{com}. replace cancer =1 if lung_cancer ==1 | haem_cancer ==1 | other_cancer ==1
{txt}(38,417 real changes made)

{com}. lab var cancer "Cancer"
{txt}
{com}. 
. *Create other comorbid variables
. gen combined_cv_comorbid =1 if chronic_cardiac_disease ==1 | stroke==1
{txt}(50,358 missing values generated)

{com}. recode combined_cv_comorbid .=0
{txt}(combined_cv_comorbid: 50358 changes made)

{com}. 
. *Delete unneeded variables
. drop hba1c_pct hba1c_percentage hba1c_mmol_per_mol
{txt}
{com}. 
. *Label variables
. lab var hypertension "Hypertension"
{txt}
{com}. lab var diabetes "Diabetes"
{txt}
{com}. lab var stroke "Stroke"
{txt}
{com}. lab var chronic_resp_disease "Chronic respiratory disease"
{txt}
{com}. lab var copd "COPD"
{txt}
{com}. lab var esrf "End-stage renal failure"
{txt}
{com}. lab var chronic_liver_disease "Chronic liver disease"
{txt}
{com}. lab var chronic_cardiac_disease "Chronic cardiac disease"
{txt}
{com}. 
. save "$projectdir/output/data/file_eia_allpts.dta", replace     
{txt}(note: file /workspace/output/data/file_eia_allpts.dta not found)
{err}{p 0 4 2}
file /workspace/output/data/file_eia_allpts.dta
could not be opened
{p_end}
{txt}{search r(603), local:r(603);}

end of do-file
{search r(603), local:r(603);}

end of do-file

{search r(603), local:r(603);}


{com}. 