-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:/Users/k1754142/OneDrive/PhD Project/OpenSAFELY/Github Practice/logs/cleaning_dataset.log
  log type:  text
 opened on:   6 Apr 2022, 11:37:00

. 
. di "$projectdir"
C:/Users/k1754142/OneDrive/PhD Project/OpenSAFELY/Github Practice

. di "$logdir"
C:/Users/k1754142/OneDrive/PhD Project/OpenSAFELY/Github Practice/logs

. 
. import delimited "$projectdir/output/input.csv", clear
(encoding automatically selected: ISO-8859-1)
(65 vars, 100,000 obs)

. 
. **Set Ado file path
. adopath + "$projectdir/analysis/extra_ados"
  [1]  (BASE)      "C:\Program Files\Stata17\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata17\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "C:\Users\k1754142\ado\personal/"
  [5]  (PLUS)      "C:\Users\k1754142\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "C:/Users/k1754142/OneDrive/PhD Project/OpenSAFELY/Github Practice/analysis/extra_ados"

. 
. **Set index dates ===========================================================*/
. global year_preceding = "01/03/2018"

. global start_date = "01/03/2019"

. global end_date = "01/03/2022"

. 
. **Rename variables (some are too long for Stata to handle) =======================================*/
. rename chronic_respiratory_disease chronic_resp_disease

. 
. **Convert date strings to dates ====================================================*/
. ***Some dates are given with month/year only, so adding day 15 to enable them to be processed as dates 
. 
. foreach var of varlist   hba1c_mmol_per_mol_date                        ///
>                                                  hba1c_percentage_date                          ///
>                                                  creatinine_date                                ///
>                                                  bmi_date_measured                          ///
>                                                  abatacept                                                      ///
>                                                  adalimumab                                                     ///     
>                                                  baricitinib                                            ///
>                                                  certolizumab                                           ///
>                                                  etanercept                                                     ///
>                                                  golimumab                                                      ///
>                                                  guselkumab                                                     ///     
>                                                  infliximab                                                     ///
>                                                  ixekizumab                                                     ///
>                                                  methotrexate_hcd                                       ///
>                                                  rituximab                                                      ///
>                                                  sarilumab                                                      ///
>                                                  secukinumab                                            ///     
>                                                  tocilizumab                                            ///
>                                                  tofacitinib                                            ///
>                                                  upadacitinib                                           ///
>                                                  ustekinumab                                            ///
>                                                  {
  2.                                                         
.                 capture confirm string variable `var'
  3.                 if _rc!=0 {
  4.                         assert `var'==.
  5.                         rename `var' `var'_date
  6.                 }
  7.         
.                 else {
  8.                                 replace `var' = `var' + "-15"
  9.                                 rename `var' `var'_dstr
 10.                                 replace `var'_dstr = " " if `var'_dstr == "-15"
 11.                                 gen `var'_date = date(`var'_dstr, "YMD") 
 12.                                 order `var'_date, after(`var'_dstr)
 13.                                 drop `var'_dstr
 14.                 }
 15.         
.         format `var'_date %td
 16. }
variable hba1c_mmol_per_mol_date was str7 now str10
(100,000 real changes made)
(5,000 real changes made)
(5,000 missing values generated)
variable hba1c_percentage_date was str7 now str10
(100,000 real changes made)
(5,000 real changes made)
(5,000 missing values generated)
variable creatinine_date was str7 now str10
(100,000 real changes made)
(5,000 real changes made)
(5,000 missing values generated)
variable bmi_date_measured was str7 now str10
(100,000 real changes made)
(40,000 real changes made)
(40,000 missing values generated)
variable abatacept was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable adalimumab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable baricitinib was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable certolizumab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable etanercept was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable golimumab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable guselkumab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable infliximab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable ixekizumab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable methotrexate_hcd was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable rituximab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable sarilumab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable secukinumab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable tocilizumab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable tofacitinib was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable upadacitinib was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable ustekinumab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)

. 
. **Conversion for dates with day already included ====================================================*/
. 
. foreach var of varlist   died_date_ons                                          ///
>                                              eia_code_date                                              ///
>                                                  rheum_appt_date                                        ///
>                                              ra_code_date                                               ///
>                                                  psa_code_date                                          ///
>                                                  anksp_code_date                                        ///
>                                                  last_gp_prerheum_date                          ///
>                                                  last_gp_precode_date                           ///     
>                                                  last_gp_refrheum_date                          ///
>                                                  last_gp_refcode_date                           ///
>                                                  referral_rheum_prerheum                        ///
>                                                  referral_rheum_precode                         ///     
>                                                  chronic_cardiac_disease                        ///
>                                                  diabetes                                                       ///
>                                                  hypertension                                           ///     
>                                                  chronic_resp_disease                           ///
>                                                  copd                                                           ///
>                                                  chronic_liver_disease                          ///
>                                                  stroke                                                         ///
>                                                  lung_cancer                                            ///
>                                                  haem_cancer                                            ///
>                                                  other_cancer                                           ///
>                                                  esrf                                                           ///
>                                                  organ_transplant                                       ///
>                                                  hydroxychloroquine                                     ///
>                                                  leflunomide                                            ///
>                                                  methotrexate                                           ///
>                                                  methotrexate_inj                                       ///
>                                                  sulfasalazine                                          ///
>                                                  {
  2.                                                                  
.                 capture confirm string variable `var'
  3.                 if _rc!=0 {
  4.                         assert `var'==.
  5.                         rename `var' `var'_date
  6.                 }
  7.         
.                 else {
  8.                                 rename `var' `var'_dstr
  9.                                 gen `var'_date = date(`var'_dstr, "YMD") 
 10.                                 order `var'_date, after(`var'_dstr)
 11.                                 drop `var'_dstr
 12.                                 gen `var'_date15 = `var'_date+15
 13.                                 order `var'_date15, after(`var'_date)
 14.                                 drop `var'_date
 15.                                 rename `var'_date15 `var'_date
 16.                 }
 17.         
.         format `var'_date %td
 18. }
(90,000 missing values generated)
(90,000 missing values generated)
(1,000 missing values generated)
(1,000 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(1,000 missing values generated)
(1,000 missing values generated)
(1,000 missing values generated)
(1,000 missing values generated)
(1,000 missing values generated)
(1,000 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(90,000 missing values generated)
(90,000 missing values generated)
(90,000 missing values generated)
(90,000 missing values generated)
(90,000 missing values generated)
(90,000 missing values generated)
(90,000 missing values generated)
(90,000 missing values generated)
(90,000 missing values generated)
(90,000 missing values generated)

.                                                  
. **Rename variables with extra 'date' added to the end of variable names===========================================================*/ 
. rename rheum_appt_date_date rheum_appt_date

. rename eia_code_date_date eia_code_date

. rename ra_code_date_date ra_code_date

. rename psa_code_date_date psa_code_date

. rename anksp_code_date_date anksp_code_date

. rename died_date_ons_date died_ons_date

. rename last_gp_prerheum_date_date last_gp_prerheum_date

. rename last_gp_refrheum_date_date last_gp_refrheum_date

. rename last_gp_refcode_date_date last_gp_refcode_date

. rename last_gp_precode_date_date last_gp_precode_date

. rename hba1c_mmol_per_mol_date_date hba1c_mmol_per_mol_date

. rename hba1c_percentage_date_date hba1c_percentage_date

. rename creatinine_date_date creatinine_date

. rename creatinine creatinine_value 

. rename bmi_date_measured_date bmi_date

. rename bmi bmi_value

. 
. **Create binary indicator variables for relevant conditions ====================================================*/
. 
. foreach var of varlist   eia_code_date                                          ///
>                                                  rheum_appt_date                                        ///
>                                              ra_code_date                                               ///
>                                                  psa_code_date                                          ///
>                                                  anksp_code_date                                        ///
>                                                  died_ons_date                                          ///
>                                                  last_gp_prerheum_date                          ///
>                                                  last_gp_precode_date                           ///     
>                                                  last_gp_refrheum_date                          ///
>                                                  last_gp_refcode_date                           ///
>                                                  referral_rheum_prerheum_date           ///
>                                                  referral_rheum_precode_date            ///     
>                                                  chronic_cardiac_disease_date           ///
>                                                  diabetes_date                                          ///
>                                                  hypertension_date                                      ///
>                                                  chronic_resp_disease_date                      ///
>                                                  copd_date                                                      ///
>                                                  chronic_liver_disease_date                     ///
>                                                  stroke_date                                            ///
>                                                  lung_cancer_date                                       ///
>                                                  haem_cancer_date                                       ///             
>                                                  other_cancer_date                                      ///
>                                                  esrf_date                                                      ///
>                                                  creatinine_date                                        ///
>                                                  organ_transplant_date                          ///
>                                                  hydroxychloroquine_date                        ///     
>                                                  leflunomide_date                                       ///
>                                                  methotrexate_date                                      ///
>                                                  methotrexate_inj_date                          ///             
>                                                  sulfasalazine_date                                     ///
>                                                  abatacept_date                                         ///
>                                                  adalimumab_date                                        ///
>                                                  baricitinib_date                                       ///
>                                                  certolizumab_date                                      ///
>                                                  etanercept_date                                        ///
>                                                  golimumab_date                                         ///
>                                                  guselkumab_date                                        ///
>                                                  infliximab_date                                        ///
>                                                  ixekizumab_date                                        ///
>                                                  methotrexate_hcd_date                          ///
>                                                  rituximab_date                                         ///             
>                                                  sarilumab_date                                         ///
>                                                  secukinumab_date                                       ///
>                                                  tocilizumab_date                                       ///             
>                                                  tofacitinib_date                                       ///
>                                                  upadacitinib_date                                      ///
>                                                  ustekinumab_date   {                           
  2.         /*date ranges are applied in python, so presence of date indicates presence of 
>           disease in the correct time frame*/ 
.         local newvar =  substr("`var'", 1, length("`var'") - 5)
  3.         gen `newvar' = (`var'!=. )
  4.         order `newvar', after(`var')
  5. }

. 
. **Create and label variables ===========================================================*/
. 
. **Demographics
. ***Sex
. gen male = 1 if sex == "M"
(51,088 missing values generated)

. replace male = 0 if sex == "F"
(51,088 real changes made)

. lab var male "Male"

. tab male, missing

       Male |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     51,088       51.09       51.09
          1 |     48,912       48.91      100.00
------------+-----------------------------------
      Total |    100,000      100.00

. 
. ***Ethnicity
. replace ethnicity = .u if ethnicity == .
(25,000 real changes made, 25,000 to missing)

. ****rearrange in order of prevalence
. recode ethnicity 2=6 /* mixed to 6 */
(15110 changes made to ethnicity)

. recode ethnicity 3=2 /* south asian to 2 */
(7474 changes made to ethnicity)

. recode ethnicity 4=3 /* black to 3 */
(7536 changes made to ethnicity)

. recode ethnicity 6=4 /* mixed to 4 */
(15110 changes made to ethnicity)

. recode ethnicity 5=4 /* other to 4 */
(7578 changes made to ethnicity)

. 
. label define ethnicity  1 "White"                                       ///
>                                                 2 "Asian/Asian British"         ///
>                                                 3 "Black"                                       ///
>                                                 4 "Mixed/Other"                         ///
>                                                 .u "Missing"

. label values ethnicity ethnicity

. lab var ethnicity "Ethnicity"

. tab ethnicity, missing

          Ethnicity |      Freq.     Percent        Cum.
--------------------+-----------------------------------
              White |     37,302       37.30       37.30
Asian/Asian British |      7,474        7.47       44.78
              Black |      7,536        7.54       52.31
        Mixed/Other |     22,688       22.69       75.00
            Missing |     25,000       25.00      100.00
--------------------+-----------------------------------
              Total |    100,000      100.00

. 
. ***STP 
. rename stp stp_old

. bysort stp_old: gen stp = 1 if _n==1
(99,998 missing values generated)

. replace stp = sum(stp) //
(99,999 real changes made)

. drop stp_old

. 
. ***Regions
. encode region, gen(nuts_region)

. tab region, missing

                  region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
           East Midlands |      9,950        9.95        9.95
         East of England |      9,912        9.91       19.86
                  London |     20,158       20.16       40.02
              North East |     10,175       10.18       50.20
              North West |     10,004       10.00       60.20
              South East |     20,041       20.04       80.24
           West Midlands |      9,910        9.91       90.15
Yorkshire and the Humber |      9,850        9.85      100.00
-------------------------+-----------------------------------
                   Total |    100,000      100.00

. 
. ***IMD
. *Group into 5 groups
. rename imd imd_o

. egen imd = cut(imd_o), group(5) icodes 

. *Add one to create groups 1-5 
. replace imd = imd + 1
(100,000 real changes made)

. *-1 is missing, should be excluded from population 
. replace imd = .u if imd_o == -1
(0 real changes made)

. drop imd_o

. *Reverse the order (so high is more deprived)
. recode imd 5 = 1 4 = 2 3 = 3 2 = 4 1 = 5 .u = .u
(100000 changes made to imd)

. label define imd 1 "1 least deprived" 2 "2" 3 "3" 4 "4" 5 "5 most deprived" .u "Missing"

. label values imd imd 

. lab var imd "Index of multiple deprivation"

. tab imd, missing

        Index of |
        multiple |
     deprivation |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |     69,689       69.69       69.69
               4 |     20,368       20.37       90.06
 5 most deprived |      9,943        9.94      100.00
-----------------+-----------------------------------
           Total |    100,000      100.00

. 
. ***Age variables
. *Nb. works if ages 18 and over
. *Create categorised age
. drop if age<18 & age !=.
(21,148 observations deleted)

. drop if age>109 & age !=.
(0 observations deleted)

. drop if age==.
(0 observations deleted)

. lab var age "Age"

. 
. recode age 18/39.9999 = 1 /// 
>            40/49.9999 = 2 ///
>                    50/59.9999 = 3 ///
>                60/69.9999 = 4 ///
>                    70/79.9999 = 5 ///
>                    80/max = 6, gen(agegroup) 
(78852 differences between age and agegroup)

. 
. label define agegroup   1 "18-39" ///
>                                                 2 "40-49" ///
>                                                 3 "50-59" ///
>                                                 4 "60-69" ///
>                                                 5 "70-79" ///
>                                                 6 "80+"

.                                                 
. label values agegroup agegroup

. lab var agegroup "Age group"

. tab agegroup, missing

  Age group |      Freq.     Percent        Cum.
------------+-----------------------------------
      18-39 |     28,559       36.22       36.22
      40-49 |     12,842       16.29       52.50
      50-59 |     13,655       17.32       69.82
      60-69 |     10,621       13.47       83.29
      70-79 |      8,176       10.37       93.66
        80+ |      4,999        6.34      100.00
------------+-----------------------------------
      Total |     78,852      100.00

. 
. *Create binary age
. recode age min/69.999 = 0 ///
>            70/max = 1, gen(age70)
(78852 differences between age and age70)

. 
. *Create restricted cubic splines for age
. mkspline age = age, cubic nknots(4)

. 
. ***Body Mass Index
. *Recode strange values 
. replace bmi_value = . if bmi_value == 0 
(31,643 real changes made, 31,643 to missing)

. replace bmi_value = . if !inrange(bmi_value, 10, 80)
(308 real changes made, 308 to missing)

. 
. *Restrict to within 10 years of EIA diagnosis date and aged>16 
. gen bmi_time = (eia_code_date - bmi_date)/365.25
(32,116 missing values generated)

. gen bmi_age = age - bmi_time
(32,116 missing values generated)

. replace bmi_value = . if bmi_age < 16 
(33,130 real changes made, 33,130 to missing)

. replace bmi_value = . if bmi_time > 10 & bmi_time != . 
(8,913 real changes made, 8,913 to missing)

. 
. *Set to missing if no date, and vice versa 
. replace bmi_value = . if bmi_date == . 
(0 real changes made)

. replace bmi_date = . if bmi_value == . 
(42,351 real changes made, 42,351 to missing)

. replace bmi_time = . if bmi_value == . 
(42,349 real changes made, 42,349 to missing)

. replace bmi_age = . if bmi_value == . 
(42,349 real changes made, 42,349 to missing)

. 
. *Create BMI categories
. gen     bmicat = .
(78,852 missing values generated)

. recode  bmicat . = 1 if bmi_value < 18.5
(224 changes made to bmicat)

. recode  bmicat . = 2 if bmi_value < 25
(540 changes made to bmicat)

. recode  bmicat . = 3 if bmi_value < 30
(716 changes made to bmicat)

. recode  bmicat . = 4 if bmi_value < 35
(885 changes made to bmicat)

. recode  bmicat . = 5 if bmi_value < 40
(958 changes made to bmicat)

. recode  bmicat . = 6 if bmi_value < .
(1535 changes made to bmicat)

. replace bmicat = .u if bmi_value >= .
(73,994 real changes made, 73,994 to missing)

. 
. label define bmicat 1 "Underweight (<18.5)"     ///
>                                         2 "Normal (18.5-24.9)"          ///
>                                         3 "Overweight (25-29.9)"        ///
>                                         4 "Obese I (30-34.9)"           ///
>                                         5 "Obese II (35-39.9)"          ///
>                                         6 "Obese III (40+)"                     ///
>                                         .u "Missing"

.                                         
. label values bmicat bmicat

. lab var bmicat "BMI"

. tab bmicat, missing

                 BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |        224        0.28        0.28
  Normal (18.5-24.9) |        540        0.68        0.97
Overweight (25-29.9) |        716        0.91        1.88
   Obese I (30-34.9) |        885        1.12        3.00
  Obese II (35-39.9) |        958        1.21        4.21
     Obese III (40+) |      1,535        1.95        6.16
             Missing |     73,994       93.84      100.00
---------------------+-----------------------------------
               Total |     78,852      100.00

. 
. *Create less granular categorisation
. recode bmicat 1/3 .u = 1 4 = 2 5 = 3 6 = 4, gen(obese4cat)
(78628 differences between bmicat and obese4cat)

. 
. label define obese4cat  1 "No record of obesity"        ///
>                                                 2 "Obese I (30-34.9)"           ///
>                                                 3 "Obese II (35-39.9)"          ///
>                                                 4 "Obese III (40+)"             

. 
. label values obese4cat obese4cat

. order obese4cat, after(bmicat)

. 
. ***Smoking 
. label define smoke 1 "Never" 2 "Former" 3 "Current" .u "Missing"

. 
. gen     smoke = 1  if smoking_status == "N"
(71,140 missing values generated)

. replace smoke = 2  if smoking_status == "E"
(4,053 real changes made)

. replace smoke = 3  if smoking_status == "S"
(23,723 real changes made)

. replace smoke = .u if smoking_status == "M"
(3,977 real changes made, 3,977 to missing)

. replace smoke = .u if smoking_status == "" 
(39,387 real changes made, 39,387 to missing)

. 
. label values smoke smoke

. lab var smoke "Smoking status"

. drop smoking_status

. tab smoke, missing

    Smoking |
     status |      Freq.     Percent        Cum.
------------+-----------------------------------
      Never |      7,712        9.78        9.78
     Former |      4,053        5.14       14.92
    Current |     23,723       30.09       45.01
    Missing |     43,364       54.99      100.00
------------+-----------------------------------
      Total |     78,852      100.00

. 
. *Create non-missing 3-category variable for current smoking (assumes missing smoking is never smoking)
. recode smoke .u = 1, gen(smoke_nomiss)
(43364 differences between smoke and smoke_nomiss)

. order smoke_nomiss, after(smoke)

. label values smoke_nomiss smoke

. 
. **Clinical comorbidities
. ***eGFR
. *Set implausible creatinine values to missing (Note: zero changed to missing)
. replace creatinine_value = . if !inrange(creatinine_value, 20, 3000) 
(19,839 real changes made, 19,839 to missing)

. 
. *Remove creatinine dates if no measurements, and vice versa 
. replace creatinine_value = . if creatinine_date == . 
(0 real changes made)

. replace creatinine_date = . if creatinine_value == . 
(15,861 real changes made, 15,861 to missing)

. replace creatinine = . if creatinine_value == .
(19,839 real changes made, 19,839 to missing)

. recode creatinine .=0
(19839 changes made to creatinine)

. tab creatinine, missing

 creatinine |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     19,839       25.16       25.16
          1 |     59,013       74.84      100.00
------------+-----------------------------------
      Total |     78,852      100.00

. tabstat creatinine_value, stat(n mean p50)

    Variable |         N      Mean       p50
-------------+------------------------------
creatinin~ue |     59013  136.7967  127.0809
--------------------------------------------

. 
. *Divide by 88.4 (to convert umol/l to mg/dl) 
. gen SCr_adj = creatinine_value/88.4
(19,839 missing values generated)

. 
. gen min = .
(78,852 missing values generated)

. replace min = SCr_adj/0.7 if male==0
(30,089 real changes made)

. replace min = SCr_adj/0.9 if male==1
(28,924 real changes made)

. replace min = min^-0.329  if male==0
(30,089 real changes made)

. replace min = min^-0.411  if male==1
(28,924 real changes made)

. replace min = 1 if min<1
(46,186 real changes made)

. 
. gen max=.
(78,852 missing values generated)

. replace max=SCr_adj/0.7 if male==0
(30,089 real changes made)

. replace max=SCr_adj/0.9 if male==1
(28,924 real changes made)

. replace max=max^-1.209
(59,013 real changes made)

. replace max=1 if max>1
(32,666 real changes made)

. 
. gen egfr=min*max*141
(19,839 missing values generated)

. replace egfr=egfr*(0.993^age)
(59,013 real changes made)

. replace egfr=egfr*1.018 if male==0
(30,089 real changes made)

. label var egfr "egfr calculated using CKD-EPI formula with no ethnicity"

. 
. *Categorise into ckd stages
. egen egfr_cat_all = cut(egfr), at(0, 15, 30, 45, 60, 5000)
(19,839 missing values generated)

. recode egfr_cat_all 0 = 5 15 = 4 30 = 3 45 = 2 60 = 0, generate(ckd_egfr)
(59013 differences between egfr_cat_all and ckd_egfr)

. 
. gen egfr_cat = .
(78,852 missing values generated)

. recode egfr_cat . = 3 if egfr < 30
(13862 changes made to egfr_cat)

. recode egfr_cat . = 2 if egfr < 60
(20976 changes made to egfr_cat)

. recode egfr_cat . = 1 if egfr < .
(24175 changes made to egfr_cat)

. replace egfr_cat = .u if egfr >= .
(19,839 real changes made, 19,839 to missing)

. 
. label define egfr_cat   1 ">=60"                ///
>                                                 2 "30-59"               ///
>                                                 3 "<30"                 ///
>                                                 .u "Missing"

.                                         
. label values egfr_cat egfr_cat

. lab var egfr_cat "eGFR"

. tab egfr_cat, missing

       eGFR |      Freq.     Percent        Cum.
------------+-----------------------------------
       >=60 |     24,175       30.66       30.66
      30-59 |     20,976       26.60       57.26
        <30 |     13,862       17.58       74.84
    Missing |     19,839       25.16      100.00
------------+-----------------------------------
      Total |     78,852      100.00

. 
. *If missing eGFR, assume normal
. gen egfr_cat_nomiss = egfr_cat
(19,839 missing values generated)

. replace egfr_cat_nomiss = 1 if egfr_cat == .u
(19,839 real changes made)

. 
. label define egfr_cat_nomiss    1 ">=60/missing"        ///
>                                                                 2 "30-59"                       ///
>                                                                 3 "<30" 

. label values egfr_cat_nomiss egfr_cat_nomiss

. lab var egfr_cat_nomiss "eGFR"

. 
. gen egfr_date = creatinine_date
(19,839 missing values generated)

. format egfr_date %td

. 
. *Add in end stage renal failure and create a single CKD variable 
. *Missing assumed to not have CKD 
. gen ckd = 0

. replace ckd = 1 if ckd_egfr != . & ckd_egfr >= 1
(34,838 real changes made)

. replace ckd = 1 if esrf == 1
(8,845 real changes made)

. 
. label define ckd 0 "No CKD" 1 "CKD"

. label values ckd ckd

. label var ckd "Chronic kidney disease"

. tab ckd, missing

    Chronic |
     kidney |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
     No CKD |     35,169       44.60       44.60
        CKD |     43,683       55.40      100.00
------------+-----------------------------------
      Total |     78,852      100.00

. 
. *Create date (most recent measure prior to index)
. gen temp1_ckd_date = creatinine_date if ckd_egfr >=1
(44,014 missing values generated)

. gen temp2_ckd_date = esrf_date if esrf == 1
(63,014 missing values generated)

. gen ckd_date = max(temp1_ckd_date,temp2_ckd_date) 
(35,169 missing values generated)

. format ckd_date %td 

. 
. drop temp1_ckd_date temp2_ckd_date SCr_adj min max ckd_egfr egfr_cat_all

. 
. ***HbA1c
. *Set zero or negative to missing
. replace hba1c_percentage   = . if hba1c_percentage <= 0
(4,389 real changes made, 4,389 to missing)

. replace hba1c_mmol_per_mol = . if hba1c_mmol_per_mol <= 0
(5,588 real changes made, 5,588 to missing)

. 
. *Change implausible values to missing
. replace hba1c_percentage   = . if !inrange(hba1c_percentage, 1, 20)
(1,193 real changes made, 1,193 to missing)

. replace hba1c_mmol_per_mol = . if !inrange(hba1c_mmol_per_mol, 10, 200)
(3,364 real changes made, 3,364 to missing)

. 
. *Set most recent values of >24 months prior to EIA diagnosis date to missing
. replace hba1c_percentage   = . if (eia_code_date - hba1c_percentage_date) > 24*30 & hba1c_percentage_date != .
(70,932 real changes made, 70,932 to missing)

. replace hba1c_mmol_per_mol = . if (eia_code_date - hba1c_mmol_per_mol_date) > 24*30 & hba1c_mmol_per_mol_date != .
(67,604 real changes made, 67,604 to missing)

. 
. *Clean up dates
. replace hba1c_percentage_date = . if hba1c_percentage == .
(72,610 real changes made, 72,610 to missing)

. replace hba1c_mmol_per_mol_date = . if hba1c_mmol_per_mol == .
(72,638 real changes made, 72,638 to missing)

. 
. *Express  HbA1c as percentage
. *Express all values as perecentage 
. noi summ hba1c_percentage hba1c_mmol_per_mol 

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
hba1c_per~ge |      2,338    5.178223    1.937896    1.01723   11.89001
hba1c_mmol~l |      2,296    43.18091    17.58152   10.01716   110.0088

. gen     hba1c_pct = hba1c_percentage 
(76,514 missing values generated)

. replace hba1c_pct = (hba1c_mmol_per_mol/10.929)+2.15 if hba1c_mmol_per_mol<. 
(2,296 real changes made)

. 
. *Valid % range between 0-20  
. replace hba1c_pct = . if !inrange(hba1c_pct, 1, 20) 
(0 real changes made)

. replace hba1c_pct = round(hba1c_pct, 0.1)
(4,566 real changes made)

. 
. *Categorise HbA1c and diabetes
. *Group hba1c pct
. gen     hba1ccat = 0 if hba1c_pct <  6.5
(75,774 missing values generated)

. replace hba1ccat = 1 if hba1c_pct >= 6.5  & hba1c_pct < 7.5
(724 real changes made)

. replace hba1ccat = 2 if hba1c_pct >= 7.5  & hba1c_pct < 8
(267 real changes made)

. replace hba1ccat = 3 if hba1c_pct >= 8    & hba1c_pct < 9
(323 real changes made)

. replace hba1ccat = 4 if hba1c_pct >= 9    & hba1c_pct !=.
(174 real changes made)

. label define hba1ccat 0 "<6.5%" 1">=6.5-7.4" 2">=7.5-7.9" 3">=8-8.9" 4">=9"

. label values hba1ccat hba1ccat

. tab hba1ccat, missing

   hba1ccat |      Freq.     Percent        Cum.
------------+-----------------------------------
      <6.5% |      3,078        3.90        3.90
  >=6.5-7.4 |        724        0.92        4.82
  >=7.5-7.9 |        267        0.34        5.16
    >=8-8.9 |        323        0.41        5.57
        >=9 |        174        0.22        5.79
          . |     74,286       94.21      100.00
------------+-----------------------------------
      Total |     78,852      100.00

. 
. *Express all values as mmol
. gen hba1c_mmol = hba1c_mmol_per_mol
(76,556 missing values generated)

. replace hba1c_mmol = (hba1c_percentage*10.929)-23.5 if hba1c_percentage<. & hba1c_mmol==.
(2,270 real changes made)

. 
. *Group hba1c mmol
. gen     hba1ccatmm = 0 if hba1c_mmol < 58
(75,045 missing values generated)

. replace hba1ccatmm = 1 if hba1c_mmol >= 58 & hba1c_mmol !=.
(759 real changes made)

. replace hba1ccatmm =.u if hba1ccatmm==. 
(74,286 real changes made, 74,286 to missing)

. label define hba1ccatmm 0 "HbA1c <58mmol/mol" 1 "HbA1c >=58mmol/mol" .u "Missing"

. label values hba1ccatmm hba1ccatmm

. lab var hba1ccatmm "HbA1c"

. tab hba1ccatmm, missing

             HbA1c |      Freq.     Percent        Cum.
-------------------+-----------------------------------
 HbA1c <58mmol/mol |      3,807        4.83        4.83
HbA1c >=58mmol/mol |        759        0.96        5.79
           Missing |     74,286       94.21      100.00
-------------------+-----------------------------------
             Total |     78,852      100.00

. 
. *Create diabetes, split by control/not (assumes missing = no diabetes)
. gen     diabcat = 1 if diabetes==0
(15,784 missing values generated)

. replace diabcat = 2 if diabetes==1 & inlist(hba1ccat, 0, 1)
(748 real changes made)

. replace diabcat = 3 if diabetes==1 & inlist(hba1ccat, 2, 3, 4)
(145 real changes made)

. replace diabcat = 4 if diabetes==1 & !inlist(hba1ccat, 0, 1, 2, 3, 4)
(14,891 real changes made)

. 
. label define diabcat    1 "No diabetes"                         ///
>                                                 2 "Controlled diabetes"         ///
>                                                 3 "Uncontrolled diabetes"       ///
>                                                 4 "Diabetes, no hba1c measure"

. label values diabcat diabcat

. 
. *Create cancer variable 'other cancer currently', includes carcinoma of the head and neck - need to confirm if this excludes NMSC
. gen cancer =0

. replace cancer =1 if lung_cancer ==1 | haem_cancer ==1 | other_cancer ==1
(38,458 real changes made)

. lab var cancer "Cancer"

. tab cancer, missing

     Cancer |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     40,394       51.23       51.23
          1 |     38,458       48.77      100.00
------------+-----------------------------------
      Total |     78,852      100.00

. 
. *Create other comorbid variables
. gen combined_cv_comorbid =1 if chronic_cardiac_disease ==1 | stroke==1
(50,410 missing values generated)

. recode combined_cv_comorbid .=0
(50410 changes made to combined_cv_comorbid)

. 
. *Delete unneeded variables
. drop hba1c_pct hba1c_percentage hba1c_mmol_per_mol

. 
. *Label variables
. lab var hypertension "Hypertension"

. lab var diabetes "Diabetes"

. lab var stroke "Stroke"

. lab var chronic_resp_disease "Chronic respiratory disease"

. lab var copd "COPD"

. lab var esrf "End-stage renal failure"

. lab var chronic_liver_disease "Chronic liver disease"

. lab var chronic_cardiac_disease "Chronic cardiac disease"

. 
. *Refine diagnostic window=============================================================*/
. 
. **All patients should have EIA code
. tab eia_code, missing

   eia_code |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        791        1.00        1.00
          1 |     78,061       99.00      100.00
------------+-----------------------------------
      Total |     78,852      100.00

. keep if eia_code==1
(791 observations deleted)

. 
. **Keep patients with first EIA code in GP record if code was after 1st March 2019
. keep if eia_code_date>=date("$start_date", "DMY") & eia_code_date!=. 
(18,290 observations deleted)

. tab eia_code

   eia_code |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     59,771      100.00      100.00
------------+-----------------------------------
      Total |     59,771      100.00

. 
. **Month/Year of EIA code
. gen year_diag=year(eia_code_date)

. format year_diag %ty

. gen month_diag=month(eia_code_date)

. gen mo_year_diagn=ym(year_diag, month_diag)

. format mo_year_diagn %tm

. 
. *Include only most recent EIA sub-diagnosis=============================================*/
. 
. replace ra_code =0 if psa_code_date >= ra_code_date & psa_code_date !=.
(29,424 real changes made)

. replace ra_code =0 if anksp_code_date >= ra_code_date & anksp_code_date !=.
(10,011 real changes made)

. replace psa_code =0 if ra_code_date >= psa_code_date & ra_code_date !=.
(29,170 real changes made)

. replace psa_code =0 if anksp_code_date >= psa_code_date & anksp_code_date !=.
(10,068 real changes made)

. replace anksp_code =0 if psa_code_date >= anksp_code_date & psa_code_date !=.
(29,228 real changes made)

. replace anksp_code =0 if ra_code_date >= anksp_code_date & ra_code_date !=.
(9,877 real changes made)

. gen eia_diagnosis=1 if ra_code==1
(40,063 missing values generated)

. replace eia_diagnosis=2 if psa_code==1
(19,941 real changes made)

. replace eia_diagnosis=3 if anksp_code==1
(20,071 real changes made)

. lab define eia_diagnosis 1 "RA" 2 "PsA" 3 "AxSpA", modify

. lab val eia_diagnosis eia_diagnosis

. tab eia_diagnosis, missing

eia_diagnos |
         is |      Freq.     Percent        Cum.
------------+-----------------------------------
         RA |     19,708       32.97       32.97
        PsA |     19,941       33.36       66.33
      AxSpA |     20,071       33.58       99.91
          . |         51        0.09      100.00
------------+-----------------------------------
      Total |     59,771      100.00

. drop if eia_diagnosis==.
(51 observations deleted)

. 
. *Define drugs and dates=====================================================*/
. 
. **csDMARDs (not including high cost MTX; wouldn't be shared care)
. gen csdmard=1 if hydroxychloroquine==1 | leflunomide==1 | methotrexate==1 | methotrexate_inj==1 | sulfasalazine==1
(35,271 missing values generated)

. recode csdmard .=0 
(35271 changes made to csdmard)

. tab csdmard, missing

    csdmard |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     35,271       59.06       59.06
          1 |     24,449       40.94      100.00
------------+-----------------------------------
      Total |     59,720      100.00

. bys eia_diagnosis: tab csdmard

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

    csdmard |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     11,662       59.17       59.17
          1 |      8,046       40.83      100.00
------------+-----------------------------------
      Total |     19,708      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    csdmard |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     11,807       59.21       59.21
          1 |      8,134       40.79      100.00
------------+-----------------------------------
      Total |     19,941      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    csdmard |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     11,802       58.80       58.80
          1 |      8,269       41.20      100.00
------------+-----------------------------------
      Total |     20,071      100.00


. 
. **csDMARDs (including high cost MTX)
. gen csdmard_hcd=1 if hydroxychloroquine==1 | leflunomide==1 | methotrexate==1 | methotrexate_inj==1 | methotrexate_hcd==1 | sulfasalazine==1
(31,728 missing values generated)

. recode csdmard_hcd .=0 
(31728 changes made to csdmard_hcd)

. tab csdmard_hcd, missing

csdmard_hcd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     31,728       53.13       53.13
          1 |     27,992       46.87      100.00
------------+-----------------------------------
      Total |     59,720      100.00

. bys eia_diagnosis: tab csdmard_hcd, missing

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

csdmard_hcd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,475       53.15       53.15
          1 |      9,233       46.85      100.00
------------+-----------------------------------
      Total |     19,708      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

csdmard_hcd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,617       53.24       53.24
          1 |      9,324       46.76      100.00
------------+-----------------------------------
      Total |     19,941      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

csdmard_hcd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,636       52.99       52.99
          1 |      9,435       47.01      100.00
------------+-----------------------------------
      Total |     20,071      100.00


. 
. **Date of first csDMARD script (not including high cost MTX prescriptions)
. gen csdmard_date=min(hydroxychloroquine_date, leflunomide_date, methotrexate_date, methotrexate_inj_date, sulfasalazine_date)
(35,271 missing values generated)

. format %td csdmard_date

. 
. **Date of first csDMARD script (including high cost MTX prescriptions)
. gen csdmard_hcd_date=min(hydroxychloroquine_date, leflunomide_date, methotrexate_date, methotrexate_inj_date, methotrexate_hcd_date, sulfasalazine_date)
(31,728 missing values generated)

. format %td csdmard_hcd_date

. 
. **Biologic use
. gen biologic=1 if abatacept==1 | adalimumab==1 | baricitinib==1 | certolizumab==1 | etanercept==1 | golimumab==1 | guselkumab==1 | infliximab==1 | ixekizumab==1 | rituximab==1 | sarilumab==1 | secukinumab==1 | tocilizumab
> ==1 | tofacitinib==1 | upadacitinib==1 | ustekinumab==1 
(11,025 missing values generated)

. recode biologic .=0
(11025 changes made to biologic)

. tab biologic, missing

   biologic |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     11,025       18.46       18.46
          1 |     48,695       81.54      100.00
------------+-----------------------------------
      Total |     59,720      100.00

. bys eia_diagnosis: tab biologic, missing 

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

   biologic |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,638       18.46       18.46
          1 |     16,070       81.54      100.00
------------+-----------------------------------
      Total |     19,708      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

   biologic |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,661       18.36       18.36
          1 |     16,280       81.64      100.00
------------+-----------------------------------
      Total |     19,941      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

   biologic |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,726       18.56       18.56
          1 |     16,345       81.44      100.00
------------+-----------------------------------
      Total |     20,071      100.00


. 
. **Date of first biologic script
. gen biologic_date=min(abatacept_date, adalimumab_date, baricitinib_date, certolizumab_date, etanercept_date, golimumab_date, guselkumab_date, infliximab_date, ixekizumab_date, rituximab_date, sarilumab_date, secukinumab_d
> ate, tocilizumab_date, tofacitinib_date, upadacitinib_date, ustekinumab_date)
(11,025 missing values generated)

. format %td biologic_date

. 
. **Exclude if first csdmard or biologic was before first rheum appt
. ***Nb. could introduce leeway e.g. 30 days?
. tab csdmard if rheum_appt_date!=. & csdmard_date!=. & csdmard_date<rheum_appt_date

    csdmard |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      8,921      100.00      100.00
------------+-----------------------------------
      Total |      8,921      100.00

. drop if rheum_appt_date!=. & csdmard_date!=. & csdmard_date<rheum_appt_date
(8,921 observations deleted)

. tab biologic if rheum_appt_date!=. & biologic_date!=. & biologic_date<rheum_appt_date 

   biologic |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     15,317      100.00      100.00
------------+-----------------------------------
      Total |     15,317      100.00

. drop if rheum_appt_date!=. & biologic_date!=. & biologic_date<rheum_appt_date 
(15,317 observations deleted)

. 
. *Number of EIA diagnoses in 1-year time windows=========================================*/
. 
. gen diagnosis_year=1 if eia_code_date>=td(01mar2019) & eia_code_date<td(01mar2020)
(24,096 missing values generated)

. replace diagnosis_year=2 if eia_code_date>=td(01mar2020) & eia_code_date<td(01mar2021)
(11,332 real changes made)

. replace diagnosis_year=3 if eia_code_date>=td(01mar2021) & eia_code_date<td(01mar2022)
(11,202 real changes made)

. lab define diagnosis_year 1 "March 2019-March 2020" 2 "March 2020-March 2021" 3 "March 2021-March 2022", modify

. lab val diagnosis_year diagnosis_year

. lab var diagnosis_year "Year of diagnosis"

. tab diagnosis_year, missing

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |     11,386       32.09       32.09
March 2020-March 2021 |     11,332       31.94       64.03
March 2021-March 2022 |     11,202       31.57       95.60
                    . |      1,562        4.40      100.00
----------------------+-----------------------------------
                Total |     35,482      100.00

. bys eia_diagnosis: tab diagnosis_year, missing

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |      3,845       32.67       32.67
March 2020-March 2021 |      3,743       31.80       64.46
March 2021-March 2022 |      3,700       31.43       95.90
                    . |        483        4.10      100.00
----------------------+-----------------------------------
                Total |     11,771      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |      3,803       32.34       32.34
March 2020-March 2021 |      3,674       31.24       63.59
March 2021-March 2022 |      3,757       31.95       95.54
                    . |        525        4.46      100.00
----------------------+-----------------------------------
                Total |     11,759      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |      3,738       31.28       31.28
March 2020-March 2021 |      3,915       32.76       64.03
March 2021-March 2022 |      3,745       31.33       95.36
                    . |        554        4.64      100.00
----------------------+-----------------------------------
                Total |     11,952      100.00


. 
. **Proportion of patients with at least 6 or 12 months of GP follow-up after EIA code
. tab has_6m_follow_up

has_6m_foll |
      ow_up |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,799        5.07        5.07
          1 |     33,683       94.93      100.00
------------+-----------------------------------
      Total |     35,482      100.00

. tab has_12m_follow_up

has_12m_fol |
     low_up |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,532        9.95        9.95
          1 |     31,950       90.05      100.00
------------+-----------------------------------
      Total |     35,482      100.00

. tab mo_year_diagn has_6m_follow_up

mo_year_di |   has_6m_follow_up
       agn |         0          1 |     Total
-----------+----------------------+----------
    2019m3 |        54        889 |       943 
    2019m4 |        39        898 |       937 
    2019m5 |        45        942 |       987 
    2019m6 |        42        842 |       884 
    2019m7 |        53        922 |       975 
    2019m8 |        55        945 |     1,000 
    2019m9 |        57        909 |       966 
   2019m10 |        54        932 |       986 
   2019m11 |        44        892 |       936 
   2019m12 |        38        881 |       919 
    2020m1 |        40        907 |       947 
    2020m2 |        44        862 |       906 
    2020m3 |        55        906 |       961 
    2020m4 |        55        839 |       894 
    2020m5 |        49        919 |       968 
    2020m6 |        51        903 |       954 
    2020m7 |        45        902 |       947 
    2020m8 |        58        890 |       948 
    2020m9 |        47        916 |       963 
   2020m10 |        49        891 |       940 
   2020m11 |        64        918 |       982 
   2020m12 |        49        915 |       964 
    2021m1 |        51        918 |       969 
    2021m2 |        43        799 |       842 
    2021m3 |        49        897 |       946 
    2021m4 |        47        877 |       924 
    2021m5 |        43        904 |       947 
    2021m6 |        42        836 |       878 
    2021m7 |        47        838 |       885 
    2021m8 |        43        929 |       972 
    2021m9 |        48        871 |       919 
   2021m10 |        33        890 |       923 
   2021m11 |        43        971 |     1,014 
   2021m12 |        43        891 |       934 
    2022m1 |        62        923 |       985 
    2022m2 |        45        830 |       875 
    2022m3 |        47        870 |       917 
    2022m4 |        26        619 |       645 
-----------+----------------------+----------
     Total |     1,799     33,683 |    35,482 

. tab mo_year_diagn has_12m_follow_up

mo_year_di |   has_12m_follow_up
       agn |         0          1 |     Total
-----------+----------------------+----------
    2019m3 |        98        845 |       943 
    2019m4 |        80        857 |       937 
    2019m5 |       111        876 |       987 
    2019m6 |        83        801 |       884 
    2019m7 |        90        885 |       975 
    2019m8 |       107        893 |     1,000 
    2019m9 |        86        880 |       966 
   2019m10 |       104        882 |       986 
   2019m11 |       106        830 |       936 
   2019m12 |        97        822 |       919 
    2020m1 |        89        858 |       947 
    2020m2 |        82        824 |       906 
    2020m3 |        86        875 |       961 
    2020m4 |        93        801 |       894 
    2020m5 |        88        880 |       968 
    2020m6 |        94        860 |       954 
    2020m7 |        93        854 |       947 
    2020m8 |        88        860 |       948 
    2020m9 |        95        868 |       963 
   2020m10 |        87        853 |       940 
   2020m11 |        91        891 |       982 
   2020m12 |       112        852 |       964 
    2021m1 |        84        885 |       969 
    2021m2 |       108        734 |       842 
    2021m3 |       102        844 |       946 
    2021m4 |       101        823 |       924 
    2021m5 |        81        866 |       947 
    2021m6 |        96        782 |       878 
    2021m7 |        82        803 |       885 
    2021m8 |       107        865 |       972 
    2021m9 |        76        843 |       919 
   2021m10 |        89        834 |       923 
   2021m11 |       110        904 |     1,014 
   2021m12 |        98        836 |       934 
    2022m1 |       109        876 |       985 
    2022m2 |        79        796 |       875 
    2022m3 |        82        835 |       917 
    2022m4 |        68        577 |       645 
-----------+----------------------+----------
     Total |     3,532     31,950 |    35,482 

. tab diagnosis_year if has_6m_follow_up==1, missing

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |     10,821       32.13       32.13
March 2020-March 2021 |     10,716       31.81       63.94
March 2021-March 2022 |     10,657       31.64       95.58
                    . |      1,489        4.42      100.00
----------------------+-----------------------------------
                Total |     33,683      100.00

. bys eia_diagnosis: tab diagnosis_year if has_6m_follow_up==1, missing

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |      3,653       32.66       32.66
March 2020-March 2021 |      3,546       31.70       64.36
March 2021-March 2022 |      3,525       31.51       95.87
                    . |        462        4.13      100.00
----------------------+-----------------------------------
                Total |     11,186      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |      3,591       32.24       32.24
March 2020-March 2021 |      3,476       31.21       63.45
March 2021-March 2022 |      3,569       32.04       95.49
                    . |        502        4.51      100.00
----------------------+-----------------------------------
                Total |     11,138      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |      3,577       31.49       31.49
March 2020-March 2021 |      3,694       32.52       64.01
March 2021-March 2022 |      3,563       31.37       95.38
                    . |        525        4.62      100.00
----------------------+-----------------------------------
                Total |     11,359      100.00


. tab diagnosis_year if has_12m_follow_up==1, missing

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |     10,253       32.09       32.09
March 2020-March 2021 |     10,213       31.97       64.06
March 2021-March 2022 |     10,072       31.52       95.58
                    . |      1,412        4.42      100.00
----------------------+-----------------------------------
                Total |     31,950      100.00

. bys eia_diagnosis: tab diagnosis_year if has_12m_follow_up==1, missing

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |      3,447       32.59       32.59
March 2020-March 2021 |      3,377       31.93       64.52
March 2021-March 2022 |      3,321       31.40       95.92
                    . |        432        4.08      100.00
----------------------+-----------------------------------
                Total |     10,577      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |      3,449       32.49       32.49
March 2020-March 2021 |      3,323       31.30       63.79
March 2021-March 2022 |      3,374       31.78       95.57
                    . |        470        4.43      100.00
----------------------+-----------------------------------
                Total |     10,616      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |      3,357       31.21       31.21
March 2020-March 2021 |      3,513       32.66       63.87
March 2021-March 2022 |      3,377       31.39       95.26
                    . |        510        4.74      100.00
----------------------+-----------------------------------
                Total |     10,757      100.00


. 
. *Define appointments and referrals======================================*/
. **Nb. not excluding those without 6m+ follow-up
. 
. **Rheumatology appt 
. tab rheum_appt  //proportion with first rheum outpatient date in the year before EIA code appears in GP record (could change to two years)

 rheum_appt |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,016       16.96       16.96
          1 |     29,466       83.04      100.00
------------+-----------------------------------
      Total |     35,482      100.00

. tab rheum_appt if rheum_appt_date<eia_code_date & rheum_appt_date!=. //confirm proportion who had rheum appt (i.e. not missing) and appt before EIA code (should be accounted for by Python code)

 rheum_appt |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     23,845      100.00      100.00
------------+-----------------------------------
      Total |     23,845      100.00

. 
. **Rheumatology referrals
. tab referral_rheum_prerheum //last rheum referral in the year before rheumatology outpatient (requires rheum appt to have been present, and rheum appt to be before EIA code)

referral_rh |
eum_prerheu |
          m |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,600       10.15       10.15
          1 |     31,882       89.85      100.00
------------+-----------------------------------
      Total |     35,482      100.00

. tab referral_rheum_prerheum if rheum_appt!=0  //last rheum referral in the year before rheumatology outpatient if rheum appt date present

referral_rh |
eum_prerheu |
          m |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,018       10.24       10.24
          1 |     26,448       89.76      100.00
------------+-----------------------------------
      Total |     29,466      100.00

. tab referral_rheum_prerheum if rheum_appt!=0 & referral_rheum_prerheum_date<rheum_appt_date  //last rheum referral in the year before rheumatology outpatient, assuming ref date before rheum appt date (should be accounted 
> for by Python code)

referral_rh |
eum_prerheu |
          m |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      8,676      100.00      100.00
------------+-----------------------------------
      Total |      8,676      100.00

. tab referral_rheum_precode //last rheum referral in the year before EIA code (could use if rheum appt missing)

referral_rh |
eum_precode |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,493        9.84        9.84
          1 |     31,989       90.16      100.00
------------+-----------------------------------
      Total |     35,482      100.00

. gen referral_rheum_comb_date = referral_rheum_prerheum_date if referral_rheum_prerheum_date!=.
(3,600 missing values generated)

. replace referral_rheum_comb_date = referral_rheum_precode_date if referral_rheum_prerheum_date==. & referral_rheum_precode_date!=.
(3,277 real changes made)

. format %td referral_rheum_comb_date

. codebook referral_rheum_comb_date

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
referral_rheum_comb_date                                                                                                                                                                                            (unlabeled)
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

                  Type: Numeric daily date (float)

                 Range: [21260,22756]                 Units: 1
       Or equivalently: [17mar2018,21apr2022]         Units: days
         Unique values: 1,497                     Missing .: 323/35,482

                  Mean: 22006.1 = 01apr2020(+ 3 hours)
             Std. dev.: 430.387
           Percentiles:       10%        25%        50%        75%        90%
                            21411      21634      22005      22377      22605
                        15aug2018  26mar2019  31mar2020  07apr2021  21nov2021

. 
. **GP appointments
. tab last_gp_refrheum //proportion with last GP appointment in year before rheum referral (pre-rheum appt); requires there to have been a rheum referral, before a rheum appt, before an EIA code

last_gp_ref |
      rheum |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,498        9.86        9.86
          1 |     31,984       90.14      100.00
------------+-----------------------------------
      Total |     35,482      100.00

. gen all_appts=1 if last_gp_refrheum==1 & referral_rheum_prerheum==1 & rheum_appt==1 & eia_code==1 & last_gp_refrheum_date<referral_rheum_prerheum_date & referral_rheum_prerheum_date<rheum_appt_date & rheum_appt_date<eia_c
> ode_date 
(34,493 missing values generated)

. recode all_appts .=0
(34493 changes made to all_appts)

. tab all_appts, missing //KEY - proportion who had a last gp appt, then rheum ref, then rheum appt, then EIA code 

  all_appts |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     34,493       97.21       97.21
          1 |        989        2.79      100.00
------------+-----------------------------------
      Total |     35,482      100.00

. tab last_gp_refcode //last GP appointment before rheum ref (i.e. pre-eia code ref); requires there to have been a rheum referral before an EIA code (i.e. rheum appt could have been missing)

last_gp_ref |
       code |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,519        9.92        9.92
          1 |     31,963       90.08      100.00
------------+-----------------------------------
      Total |     35,482      100.00

. tab last_gp_prerheum //last GP appointment before rheum appt; requires there to have been a rheum appt before and EIA code

last_gp_pre |
      rheum |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,486        9.82        9.82
          1 |     31,996       90.18      100.00
------------+-----------------------------------
      Total |     35,482      100.00

. tab last_gp_precode //last GP appointment before EIA code

last_gp_pre |
       code |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,561       10.04       10.04
          1 |     31,921       89.96      100.00
------------+-----------------------------------
      Total |     35,482      100.00

. 
. **For sensitivity analyses for those without rheum_appt, replace diagnosis date as EIA code date if rheum appt pre-code is missing or after
. gen eia_diagnosis_date_nomiss=rheum_appt_date if rheum_appt_date!=.
(6,016 missing values generated)

. format %td eia_diagnosis_date_nomiss

. replace eia_diagnosis_date_nomiss=eia_code_date if (rheum_appt_date==. | rheum_appt_date>eia_code_date) & eia_code_date!=.
(11,625 real changes made)

. gen eia_diagnosis_nomiss=1 if eia_diagnosis_date_nomiss!=.

. recode eia_diagnosis_nomiss .=0
(0 changes made to eia_diagnosis_nomiss)

. tab eia_diagnosis_nomiss

eia_diagnos |
  is_nomiss |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     35,482      100.00      100.00
------------+-----------------------------------
      Total |     35,482      100.00

. 
. *Time to referral, appointment and EIA code=============================================*/
. 
. **Time from last GP to rheum ref before rheum appt (i.e. if appts are present and in correct time order) //Note - referral could (in theory) be coded just before GP appt
. gen time_gp_rheum_ref_appt = (referral_rheum_prerheum_date - last_gp_refrheum_date) if referral_rheum_prerheum_date!=. & last_gp_refrheum_date!=. & rheum_appt_date!=. & referral_rheum_prerheum_date>last_gp_refrheum_date &
>  referral_rheum_prerheum_date<rheum_appt_date & rheum_appt_date<eia_code_date
(34,493 missing values generated)

. tabstat time_gp_rheum_ref_appt, stats (n mean p50 p25 p75) //all patients (should be same number as all_appts)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~t |       989   251.453       191        87       361
----------------------------------------------------------------

. bys eia_diagnosis: tabstat time_gp_rheum_ref_appt, stats (n mean p50 p25 p75) //by eia diagnosis

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~t |       331   248.719       180        72       367
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~t |       346  259.5867       199        98       363
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~t |       312  245.3333     193.5        89     349.5
----------------------------------------------------------------

. bys diagnosis_year: tabstat time_gp_rheum_ref_appt, stats (n mean p50 p25 p75) //by diagnosis year

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~t |        93  131.7097       115        51       188
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~t |       284  209.9754       165        77       311
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~t |       523  279.3059       218       100       413
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~t |        89  345.2584       264       116       514
----------------------------------------------------------------

. bys nuts_region: tabstat time_gp_rheum_ref_appt, stats (n mean p50 p25 p75) //by region

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~t |        86  298.3023     245.5        76       480
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~t |       111  221.4685       191        72       314
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~t |       196  235.3878       157      86.5       336
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~t |        99  248.7273       165        88       387
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~t |        94  229.4574     193.5        95       322
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~t |       198  236.9697     180.5        89       340
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~t |        97   311.433       242       108       511
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~t |       108  268.4444       215      86.5     374.5
----------------------------------------------------------------

. 
. gen gp_ref_cat=1 if time_gp_rheum_ref_appt<=3 & time_gp_rheum_ref_appt!=. 
(35,475 missing values generated)

. replace gp_ref_cat=2 if time_gp_rheum_ref_appt<=7 & time_gp_rheum_ref_appt!=. & gp_ref_cat==.
(18 real changes made)

. replace gp_ref_cat=3 if time_gp_rheum_ref_appt>7 & time_gp_rheum_ref_appt!=. & gp_ref_cat==.
(964 real changes made)

. lab define gp_ref_cat 1 "Referred within 3 days" 2 "Referred within 7 days" 3 "Referral delay >7 days", modify

. lab val gp_ref_cat gp_ref_cat

. lab var gp_ref_cat "Time to GP referral"

. tab gp_ref_cat, missing

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          7        0.02        0.02
Referred within 7 days |         18        0.05        0.07
Referral delay >7 days |        964        2.72        2.79
                     . |     34,493       97.21      100.00
-----------------------+-----------------------------------
                 Total |     35,482      100.00

. tab gp_ref_cat

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          7        0.71        0.71
Referred within 7 days |         18        1.82        2.53
Referral delay >7 days |        964       97.47      100.00
-----------------------+-----------------------------------
                 Total |        989      100.00

. bys eia_diagnosis: tab gp_ref_cat, missing

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          2        0.02        0.02
Referred within 7 days |          6        0.05        0.07
Referral delay >7 days |        323        2.74        2.81
                     . |     11,440       97.19      100.00
-----------------------+-----------------------------------
                 Total |     11,771      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          4        0.03        0.03
Referred within 7 days |          2        0.02        0.05
Referral delay >7 days |        340        2.89        2.94
                     . |     11,413       97.06      100.00
-----------------------+-----------------------------------
                 Total |     11,759      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        0.01        0.01
Referred within 7 days |         10        0.08        0.09
Referral delay >7 days |        301        2.52        2.61
                     . |     11,640       97.39      100.00
-----------------------+-----------------------------------
                 Total |     11,952      100.00


. bys eia_diagnosis: tab gp_ref_cat

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          2        0.60        0.60
Referred within 7 days |          6        1.81        2.42
Referral delay >7 days |        323       97.58      100.00
-----------------------+-----------------------------------
                 Total |        331      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          4        1.16        1.16
Referred within 7 days |          2        0.58        1.73
Referral delay >7 days |        340       98.27      100.00
-----------------------+-----------------------------------
                 Total |        346      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        0.32        0.32
Referred within 7 days |         10        3.21        3.53
Referral delay >7 days |        301       96.47      100.00
-----------------------+-----------------------------------
                 Total |        312      100.00


. bys diagnosis_year: tab gp_ref_cat, missing

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        0.01        0.01
Referred within 7 days |          4        0.04        0.04
Referral delay >7 days |         88        0.77        0.82
                     . |     11,293       99.18      100.00
-----------------------+-----------------------------------
                 Total |     11,386      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          2        0.02        0.02
Referred within 7 days |          6        0.05        0.07
Referral delay >7 days |        276        2.44        2.51
                     . |     11,048       97.49      100.00
-----------------------+-----------------------------------
                 Total |     11,332      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          4        0.04        0.04
Referred within 7 days |          8        0.07        0.11
Referral delay >7 days |        511        4.56        4.67
                     . |     10,679       95.33      100.00
-----------------------+-----------------------------------
                 Total |     11,202      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referral delay >7 days |         89        5.70        5.70
                     . |      1,473       94.30      100.00
-----------------------+-----------------------------------
                 Total |      1,562      100.00


. bys diagnosis_year: tab gp_ref_cat

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        1.08        1.08
Referred within 7 days |          4        4.30        5.38
Referral delay >7 days |         88       94.62      100.00
-----------------------+-----------------------------------
                 Total |         93      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          2        0.70        0.70
Referred within 7 days |          6        2.11        2.82
Referral delay >7 days |        276       97.18      100.00
-----------------------+-----------------------------------
                 Total |        284      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          4        0.76        0.76
Referred within 7 days |          8        1.53        2.29
Referral delay >7 days |        511       97.71      100.00
-----------------------+-----------------------------------
                 Total |        523      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referral delay >7 days |         89      100.00      100.00
-----------------------+-----------------------------------
                 Total |         89      100.00


. bys nuts_region: tab gp_ref_cat, missing

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 7 days |          1        0.03        0.03
Referral delay >7 days |         85        2.41        2.44
                     . |      3,442       97.56      100.00
-----------------------+-----------------------------------
                 Total |      3,528      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          2        0.06        0.06
Referred within 7 days |          1        0.03        0.08
Referral delay >7 days |        108        3.06        3.14
                     . |      3,423       96.86      100.00
-----------------------+-----------------------------------
                 Total |      3,534      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        0.01        0.01
Referred within 7 days |          7        0.10        0.11
Referral delay >7 days |        188        2.64        2.75
                     . |      6,921       97.25      100.00
-----------------------+-----------------------------------
                 Total |      7,117      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          2        0.05        0.05
Referred within 7 days |          2        0.05        0.11
Referral delay >7 days |         95        2.61        2.72
                     . |      3,538       97.28      100.00
-----------------------+-----------------------------------
                 Total |      3,637      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referral delay >7 days |         94        2.64        2.64
                     . |      3,462       97.36      100.00
-----------------------+-----------------------------------
                 Total |      3,556      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        0.01        0.01
Referred within 7 days |          3        0.04        0.06
Referral delay >7 days |        194        2.76        2.81
                     . |      6,843       97.19      100.00
-----------------------+-----------------------------------
                 Total |      7,041      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 7 days |          3        0.08        0.08
Referral delay >7 days |         94        2.66        2.75
                     . |      3,433       97.25      100.00
-----------------------+-----------------------------------
                 Total |      3,530      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        0.03        0.03
Referred within 7 days |          1        0.03        0.06
Referral delay >7 days |        106        3.00        3.05
                     . |      3,431       96.95      100.00
-----------------------+-----------------------------------
                 Total |      3,539      100.00


. bys nuts_region: tab gp_ref_cat

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 7 days |          1        1.16        1.16
Referral delay >7 days |         85       98.84      100.00
-----------------------+-----------------------------------
                 Total |         86      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          2        1.80        1.80
Referred within 7 days |          1        0.90        2.70
Referral delay >7 days |        108       97.30      100.00
-----------------------+-----------------------------------
                 Total |        111      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        0.51        0.51
Referred within 7 days |          7        3.57        4.08
Referral delay >7 days |        188       95.92      100.00
-----------------------+-----------------------------------
                 Total |        196      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          2        2.02        2.02
Referred within 7 days |          2        2.02        4.04
Referral delay >7 days |         95       95.96      100.00
-----------------------+-----------------------------------
                 Total |         99      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referral delay >7 days |         94      100.00      100.00
-----------------------+-----------------------------------
                 Total |         94      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        0.51        0.51
Referred within 7 days |          3        1.52        2.02
Referral delay >7 days |        194       97.98      100.00
-----------------------+-----------------------------------
                 Total |        198      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 7 days |          3        3.09        3.09
Referral delay >7 days |         94       96.91      100.00
-----------------------+-----------------------------------
                 Total |         97      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        0.93        0.93
Referred within 7 days |          1        0.93        1.85
Referral delay >7 days |        106       98.15      100.00
-----------------------+-----------------------------------
                 Total |        108      100.00


. 
. gen gp_ref_3d=1 if time_gp_rheum_ref_appt<=3 & time_gp_rheum_ref_appt!=. 
(35,475 missing values generated)

. replace gp_ref_3d=2 if time_gp_rheum_ref_appt>3 & time_gp_rheum_ref_appt!=.
(982 real changes made)

. lab define gp_ref_3d 1 "Referred within 3 days" 2 "Referral delay >3 days", modify

. lab val gp_ref_3d gp_ref_3d

. lab var gp_ref_3d "Time to GP referral"

. tab gp_ref_3d, missing

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          7        0.02        0.02
Referral delay >3 days |        982        2.77        2.79
                     . |     34,493       97.21      100.00
-----------------------+-----------------------------------
                 Total |     35,482      100.00

. tab gp_ref_3d

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          7        0.71        0.71
Referral delay >3 days |        982       99.29      100.00
-----------------------+-----------------------------------
                 Total |        989      100.00

. bys eia_diagnosis: tab gp_ref_3d, missing

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          2        0.02        0.02
Referral delay >3 days |        329        2.80        2.81
                     . |     11,440       97.19      100.00
-----------------------+-----------------------------------
                 Total |     11,771      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          4        0.03        0.03
Referral delay >3 days |        342        2.91        2.94
                     . |     11,413       97.06      100.00
-----------------------+-----------------------------------
                 Total |     11,759      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        0.01        0.01
Referral delay >3 days |        311        2.60        2.61
                     . |     11,640       97.39      100.00
-----------------------+-----------------------------------
                 Total |     11,952      100.00


. bys eia_diagnosis: tab gp_ref_3d

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          2        0.60        0.60
Referral delay >3 days |        329       99.40      100.00
-----------------------+-----------------------------------
                 Total |        331      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          4        1.16        1.16
Referral delay >3 days |        342       98.84      100.00
-----------------------+-----------------------------------
                 Total |        346      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        0.32        0.32
Referral delay >3 days |        311       99.68      100.00
-----------------------+-----------------------------------
                 Total |        312      100.00


. bys diagnosis_year: tab gp_ref_3d, missing

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        0.01        0.01
Referral delay >3 days |         92        0.81        0.82
                     . |     11,293       99.18      100.00
-----------------------+-----------------------------------
                 Total |     11,386      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          2        0.02        0.02
Referral delay >3 days |        282        2.49        2.51
                     . |     11,048       97.49      100.00
-----------------------+-----------------------------------
                 Total |     11,332      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          4        0.04        0.04
Referral delay >3 days |        519        4.63        4.67
                     . |     10,679       95.33      100.00
-----------------------+-----------------------------------
                 Total |     11,202      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referral delay >3 days |         89        5.70        5.70
                     . |      1,473       94.30      100.00
-----------------------+-----------------------------------
                 Total |      1,562      100.00


. bys diagnosis_year: tab gp_ref_3d

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        1.08        1.08
Referral delay >3 days |         92       98.92      100.00
-----------------------+-----------------------------------
                 Total |         93      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          2        0.70        0.70
Referral delay >3 days |        282       99.30      100.00
-----------------------+-----------------------------------
                 Total |        284      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          4        0.76        0.76
Referral delay >3 days |        519       99.24      100.00
-----------------------+-----------------------------------
                 Total |        523      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referral delay >3 days |         89      100.00      100.00
-----------------------+-----------------------------------
                 Total |         89      100.00


. bys nuts_region: tab gp_ref_3d, missing

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referral delay >3 days |         86        2.44        2.44
                     . |      3,442       97.56      100.00
-----------------------+-----------------------------------
                 Total |      3,528      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          2        0.06        0.06
Referral delay >3 days |        109        3.08        3.14
                     . |      3,423       96.86      100.00
-----------------------+-----------------------------------
                 Total |      3,534      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        0.01        0.01
Referral delay >3 days |        195        2.74        2.75
                     . |      6,921       97.25      100.00
-----------------------+-----------------------------------
                 Total |      7,117      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          2        0.05        0.05
Referral delay >3 days |         97        2.67        2.72
                     . |      3,538       97.28      100.00
-----------------------+-----------------------------------
                 Total |      3,637      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referral delay >3 days |         94        2.64        2.64
                     . |      3,462       97.36      100.00
-----------------------+-----------------------------------
                 Total |      3,556      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        0.01        0.01
Referral delay >3 days |        197        2.80        2.81
                     . |      6,843       97.19      100.00
-----------------------+-----------------------------------
                 Total |      7,041      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referral delay >3 days |         97        2.75        2.75
                     . |      3,433       97.25      100.00
-----------------------+-----------------------------------
                 Total |      3,530      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        0.03        0.03
Referral delay >3 days |        107        3.02        3.05
                     . |      3,431       96.95      100.00
-----------------------+-----------------------------------
                 Total |      3,539      100.00


. bys nuts_region: tab gp_ref_3d

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referral delay >3 days |         86      100.00      100.00
-----------------------+-----------------------------------
                 Total |         86      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          2        1.80        1.80
Referral delay >3 days |        109       98.20      100.00
-----------------------+-----------------------------------
                 Total |        111      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        0.51        0.51
Referral delay >3 days |        195       99.49      100.00
-----------------------+-----------------------------------
                 Total |        196      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          2        2.02        2.02
Referral delay >3 days |         97       97.98      100.00
-----------------------+-----------------------------------
                 Total |         99      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referral delay >3 days |         94      100.00      100.00
-----------------------+-----------------------------------
                 Total |         94      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        0.51        0.51
Referral delay >3 days |        197       99.49      100.00
-----------------------+-----------------------------------
                 Total |        198      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referral delay >3 days |         97      100.00      100.00
-----------------------+-----------------------------------
                 Total |         97      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        0.93        0.93
Referral delay >3 days |        107       99.07      100.00
-----------------------+-----------------------------------
                 Total |        108      100.00


. 
. **Time from last GP to rheum ref before eia code (sensitivity analysis; includes those with no rheum appt)
. gen time_gp_rheum_ref_code = (referral_rheum_precode_date - last_gp_refcode_date) if referral_rheum_precode_date!=. & last_gp_refcode_date!=. & referral_rheum_precode_date>last_gp_refcode_date & referral_rheum_precode_dat
> e<eia_code_date
(29,395 missing values generated)

. tabstat time_gp_rheum_ref_code, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~e |      6087  373.1117       307       139       550
----------------------------------------------------------------

. bys eia_diagnosis: tabstat time_gp_rheum_ref_code, stats (n mean p50 p25 p75)

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~e |      1954  370.6561       300       139       551
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~e |      2005  370.5157       305       135       544
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~e |      2128  377.8125     314.5       144       554
----------------------------------------------------------------

. 
. **Time from last GP to rheum ref (combined - sensitivity analysis; includes those with no rheum appt)
. gen time_gp_rheum_ref_comb = time_gp_rheum_ref_appt 
(34,493 missing values generated)

. replace time_gp_rheum_ref_comb = time_gp_rheum_ref_code if time_gp_rheum_ref_appt==. & time_gp_rheum_ref_code!=.
(5,856 real changes made)

. tabstat time_gp_rheum_ref_comb, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~b |      6845  354.2318       286       127       525
----------------------------------------------------------------

. bys eia_diagnosis: tabstat time_gp_rheum_ref_comb, stats (n mean p50 p25 p75)

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~b |      2224  351.5351     277.5       126     521.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~b |      2268  353.1124       285       125     520.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~b |      2353  357.8598       292       132       531
----------------------------------------------------------------

. 
. **Time from last GP pre-rheum appt to first rheum appt (key sensitivity analysis; includes those with no rheum ref)
. gen time_gp_rheum_appt = (rheum_appt_date - last_gp_prerheum_date) if rheum_appt_date!=. & last_gp_prerheum_date!=. & rheum_appt_date>last_gp_prerheum_date & rheum_appt_date<eia_code_date
(30,022 missing values generated)

. tabstat time_gp_rheum_appt, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_~m_appt |      5460  291.0984       233       102       419
----------------------------------------------------------------

. bys eia_diagnosis: tabstat time_gp_rheum_appt, stats (n mean p50 p25 p75)

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_~m_appt |      1804  288.7478       233        97     414.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_~m_appt |      1812  288.5502     232.5       102       415
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_~m_appt |      1844  295.9018       234     109.5       427
----------------------------------------------------------------

. bys diagnosis_year: tabstat time_gp_rheum_appt, stats (n mean p50 p25 p75) //by diagnosis year

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_~m_appt |       860  176.1453       156        70       259
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_~m_appt |      1790  260.8754       220        94       387
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_~m_appt |      2437  336.4374       275       127       494
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_~m_appt |       373  404.9517       333       144       566
----------------------------------------------------------------

. bys nuts_region: tabstat time_gp_rheum_appt, stats (n mean p50 p25 p75) //by region

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_~m_appt |       557    285.93       246       119       400
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_~m_appt |       565  303.6389       252       115       451
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_~m_appt |      1085  298.8747       241        98       425
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_~m_appt |       556  300.5647     245.5       117     425.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_~m_appt |       565  291.4106       232       100       419
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_~m_appt |      1049   278.449       212        92       395
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_~m_appt |       533  288.1107       233       101       422
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_~m_appt |       550    285.24     223.5       104       414
----------------------------------------------------------------

. 
. **Time from last GP pre-code to EIA code (sensitivity analysis; includes those with no rheum ref and/or no rheum appt)
. gen time_gp_eia_code = (eia_code_date - last_gp_precode_date) if eia_code_date!=. & last_gp_precode_date!=. & eia_code_date>last_gp_precode_date
(15,830 missing values generated)

. tabstat time_gp_eia_code, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_ei~e |     19652  519.6875       467       229       768
----------------------------------------------------------------

. bys eia_diagnosis: tabstat time_gp_eia_code, stats (n mean p50 p25 p75)

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_ei~e |      6474  516.8179     459.5       227       771
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_ei~e |      6557  524.7796       478       234       767
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_ei~e |      6621  517.4505       463       225       766
----------------------------------------------------------------

. 
. **Time from last GP to EIA diagnosis (combined - sensitivity analysis; includes those with no rheum appt)
. gen time_gp_eia_diag = time_gp_rheum_appt
(30,022 missing values generated)

. replace time_gp_eia_diag = time_gp_eia_code if time_gp_rheum_appt==. & time_gp_eia_code!=.
(16,208 real changes made)

. tabstat time_gp_eia_diag, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_ei~g |     21668  452.3278       384       176     669.5
----------------------------------------------------------------

. bys eia_diagnosis: tabstat time_gp_eia_diag, stats (n mean p50 p25 p75)

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_ei~g |      7162  450.1565       380       173       668
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_ei~g |      7213  454.3831       387       178       672
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_ei~g |      7293  452.4273       384       177       669
----------------------------------------------------------------

. 
. **Time from rheum ref to rheum appt (i.e. if appts are present and in correct time order)
. gen time_ref_rheum_appt = (rheum_appt_date - referral_rheum_prerheum_date) if rheum_appt_date!=. & referral_rheum_prerheum_date!=. & referral_rheum_prerheum_date<rheum_appt_date & rheum_appt_date<eia_code_date
(30,001 missing values generated)

. tabstat time_ref_rheum_appt, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~t |      5481  294.1859       232       102       426
----------------------------------------------------------------

. bys eia_diagnosis: tabstat time_ref_rheum_appt, stats (n mean p50 p25 p75)

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~t |      1803  291.8258       230        98       427
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~t |      1822  295.8266       235       106       419
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~t |      1856   294.868     231.5       104       431
----------------------------------------------------------------

. bys diagnosis_year: tabstat time_ref_rheum_appt, stats (n mean p50 p25 p75) //all patients by diagnosis year

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~t |       904  175.7002       144      67.5       261
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~t |      1725  269.0609       222       100       395
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~t |      2441  340.7169       284       127       496
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~t |       411  383.8929       319       122       569
----------------------------------------------------------------

. bys nuts_region: tabstat time_ref_rheum_appt, stats (n mean p50 p25 p75) //by region

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~t |       520  295.8058     237.5       103       418
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~t |       586  304.8294       247       118       435
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~t |      1115  285.1049       222        92       402
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~t |       552  302.2681     232.5     100.5     454.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~t |       569  299.2777       245       109       438
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~t |      1059  289.9641       226       110       412
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~t |       538  289.3011       216        97       427
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~t |       542  299.3266       235       100       444
----------------------------------------------------------------

. 
. gen ref_appt_cat=1 if time_ref_rheum_appt<=21 & time_ref_rheum_appt!=. 
(35,197 missing values generated)

. replace ref_appt_cat=2 if time_ref_rheum_appt<=42 & time_ref_rheum_appt!=. & ref_appt_cat==.
(279 real changes made)

. replace ref_appt_cat=3 if time_ref_rheum_appt>42 & time_ref_rheum_appt!=. & ref_appt_cat==.
(4,917 real changes made)

. lab define ref_appt_cat 1 "Seen within 3 weeks" 2 "Seen within 6 weeks" 3 "Assessment delay >6 weeks", modify

. lab val ref_appt_cat ref_appt_cat

. lab var ref_appt_cat "Time to rheumatology assessment"

. tab ref_appt_cat, missing

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |        285        0.80        0.80
      Seen within 6 weeks |        279        0.79        1.59
Assessment delay >6 weeks |      4,917       13.86       15.45
                        . |     30,001       84.55      100.00
--------------------------+-----------------------------------
                    Total |     35,482      100.00

. tab ref_appt_cat

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |        285        5.20        5.20
      Seen within 6 weeks |        279        5.09       10.29
Assessment delay >6 weeks |      4,917       89.71      100.00
--------------------------+-----------------------------------
                    Total |      5,481      100.00

. bys eia_diagnosis: tab ref_appt_cat, missing

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |        106        0.90        0.90
      Seen within 6 weeks |         89        0.76        1.66
Assessment delay >6 weeks |      1,608       13.66       15.32
                        . |      9,968       84.68      100.00
--------------------------+-----------------------------------
                    Total |     11,771      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         88        0.75        0.75
      Seen within 6 weeks |         86        0.73        1.48
Assessment delay >6 weeks |      1,648       14.01       15.49
                        . |      9,937       84.51      100.00
--------------------------+-----------------------------------
                    Total |     11,759      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         91        0.76        0.76
      Seen within 6 weeks |        104        0.87        1.63
Assessment delay >6 weeks |      1,661       13.90       15.53
                        . |     10,096       84.47      100.00
--------------------------+-----------------------------------
                    Total |     11,952      100.00


. bys eia_diagnosis: tab ref_appt_cat

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |        106        5.88        5.88
      Seen within 6 weeks |         89        4.94       10.82
Assessment delay >6 weeks |      1,608       89.18      100.00
--------------------------+-----------------------------------
                    Total |      1,803      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         88        4.83        4.83
      Seen within 6 weeks |         86        4.72        9.55
Assessment delay >6 weeks |      1,648       90.45      100.00
--------------------------+-----------------------------------
                    Total |      1,822      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         91        4.90        4.90
      Seen within 6 weeks |        104        5.60       10.51
Assessment delay >6 weeks |      1,661       89.49      100.00
--------------------------+-----------------------------------
                    Total |      1,856      100.00


. bys diagnosis_year: tab ref_appt_cat, missing

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         72        0.63        0.63
      Seen within 6 weeks |         79        0.69        1.33
Assessment delay >6 weeks |        753        6.61        7.94
                        . |     10,482       92.06      100.00
--------------------------+-----------------------------------
                    Total |     11,386      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         95        0.84        0.84
      Seen within 6 weeks |         87        0.77        1.61
Assessment delay >6 weeks |      1,543       13.62       15.22
                        . |      9,607       84.78      100.00
--------------------------+-----------------------------------
                    Total |     11,332      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |        101        0.90        0.90
      Seen within 6 weeks |         98        0.87        1.78
Assessment delay >6 weeks |      2,242       20.01       21.79
                        . |      8,761       78.21      100.00
--------------------------+-----------------------------------
                    Total |     11,202      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         17        1.09        1.09
      Seen within 6 weeks |         15        0.96        2.05
Assessment delay >6 weeks |        379       24.26       26.31
                        . |      1,151       73.69      100.00
--------------------------+-----------------------------------
                    Total |      1,562      100.00


. bys diagnosis_year: tab ref_appt_cat

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         72        7.96        7.96
      Seen within 6 weeks |         79        8.74       16.70
Assessment delay >6 weeks |        753       83.30      100.00
--------------------------+-----------------------------------
                    Total |        904      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         95        5.51        5.51
      Seen within 6 weeks |         87        5.04       10.55
Assessment delay >6 weeks |      1,543       89.45      100.00
--------------------------+-----------------------------------
                    Total |      1,725      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |        101        4.14        4.14
      Seen within 6 weeks |         98        4.01        8.15
Assessment delay >6 weeks |      2,242       91.85      100.00
--------------------------+-----------------------------------
                    Total |      2,441      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         17        4.14        4.14
      Seen within 6 weeks |         15        3.65        7.79
Assessment delay >6 weeks |        379       92.21      100.00
--------------------------+-----------------------------------
                    Total |        411      100.00


. bys nuts_region: tab ref_appt_cat, missing

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         17        0.48        0.48
      Seen within 6 weeks |         27        0.77        1.25
Assessment delay >6 weeks |        476       13.49       14.74
                        . |      3,008       85.26      100.00
--------------------------+-----------------------------------
                    Total |      3,528      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         29        0.82        0.82
      Seen within 6 weeks |         24        0.68        1.50
Assessment delay >6 weeks |        533       15.08       16.58
                        . |      2,948       83.42      100.00
--------------------------+-----------------------------------
                    Total |      3,534      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         69        0.97        0.97
      Seen within 6 weeks |         66        0.93        1.90
Assessment delay >6 weeks |        980       13.77       15.67
                        . |      6,002       84.33      100.00
--------------------------+-----------------------------------
                    Total |      7,117      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         29        0.80        0.80
      Seen within 6 weeks |         28        0.77        1.57
Assessment delay >6 weeks |        495       13.61       15.18
                        . |      3,085       84.82      100.00
--------------------------+-----------------------------------
                    Total |      3,637      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         29        0.82        0.82
      Seen within 6 weeks |         30        0.84        1.66
Assessment delay >6 weeks |        510       14.34       16.00
                        . |      2,987       84.00      100.00
--------------------------+-----------------------------------
                    Total |      3,556      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         56        0.80        0.80
      Seen within 6 weeks |         48        0.68        1.48
Assessment delay >6 weeks |        955       13.56       15.04
                        . |      5,982       84.96      100.00
--------------------------+-----------------------------------
                    Total |      7,041      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         29        0.82        0.82
      Seen within 6 weeks |         29        0.82        1.64
Assessment delay >6 weeks |        480       13.60       15.24
                        . |      2,992       84.76      100.00
--------------------------+-----------------------------------
                    Total |      3,530      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         27        0.76        0.76
      Seen within 6 weeks |         27        0.76        1.53
Assessment delay >6 weeks |        488       13.79       15.32
                        . |      2,997       84.68      100.00
--------------------------+-----------------------------------
                    Total |      3,539      100.00


. bys nuts_region: tab ref_appt_cat

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         17        3.27        3.27
      Seen within 6 weeks |         27        5.19        8.46
Assessment delay >6 weeks |        476       91.54      100.00
--------------------------+-----------------------------------
                    Total |        520      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         29        4.95        4.95
      Seen within 6 weeks |         24        4.10        9.04
Assessment delay >6 weeks |        533       90.96      100.00
--------------------------+-----------------------------------
                    Total |        586      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         69        6.19        6.19
      Seen within 6 weeks |         66        5.92       12.11
Assessment delay >6 weeks |        980       87.89      100.00
--------------------------+-----------------------------------
                    Total |      1,115      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         29        5.25        5.25
      Seen within 6 weeks |         28        5.07       10.33
Assessment delay >6 weeks |        495       89.67      100.00
--------------------------+-----------------------------------
                    Total |        552      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         29        5.10        5.10
      Seen within 6 weeks |         30        5.27       10.37
Assessment delay >6 weeks |        510       89.63      100.00
--------------------------+-----------------------------------
                    Total |        569      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         56        5.29        5.29
      Seen within 6 weeks |         48        4.53        9.82
Assessment delay >6 weeks |        955       90.18      100.00
--------------------------+-----------------------------------
                    Total |      1,059      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         29        5.39        5.39
      Seen within 6 weeks |         29        5.39       10.78
Assessment delay >6 weeks |        480       89.22      100.00
--------------------------+-----------------------------------
                    Total |        538      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         27        4.98        4.98
      Seen within 6 weeks |         27        4.98        9.96
Assessment delay >6 weeks |        488       90.04      100.00
--------------------------+-----------------------------------
                    Total |        542      100.00


. 
. gen ref_appt_3w=1 if time_ref_rheum_appt<=21 & time_ref_rheum_appt!=. 
(35,197 missing values generated)

. replace ref_appt_3w=2 if time_ref_rheum_appt>21 & time_ref_rheum_appt!=.
(5,196 real changes made)

. lab define ref_appt_3w 1 "Seen within 3 weeks" 2 "Assessment delay >3 weeks", modify

. lab val ref_appt_3w ref_appt_3w

. lab var ref_appt_3w "Time to rheumatology assessment"

. tab ref_appt_3w, missing

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |        285        0.80        0.80
Assessment delay >3 weeks |      5,196       14.64       15.45
                        . |     30,001       84.55      100.00
--------------------------+-----------------------------------
                    Total |     35,482      100.00

. tab ref_appt_3w

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |        285        5.20        5.20
Assessment delay >3 weeks |      5,196       94.80      100.00
--------------------------+-----------------------------------
                    Total |      5,481      100.00

. bys eia_diagnosis: tab ref_appt_3w, missing

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |        106        0.90        0.90
Assessment delay >3 weeks |      1,697       14.42       15.32
                        . |      9,968       84.68      100.00
--------------------------+-----------------------------------
                    Total |     11,771      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         88        0.75        0.75
Assessment delay >3 weeks |      1,734       14.75       15.49
                        . |      9,937       84.51      100.00
--------------------------+-----------------------------------
                    Total |     11,759      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         91        0.76        0.76
Assessment delay >3 weeks |      1,765       14.77       15.53
                        . |     10,096       84.47      100.00
--------------------------+-----------------------------------
                    Total |     11,952      100.00


. bys eia_diagnosis: tab ref_appt_3w

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |        106        5.88        5.88
Assessment delay >3 weeks |      1,697       94.12      100.00
--------------------------+-----------------------------------
                    Total |      1,803      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         88        4.83        4.83
Assessment delay >3 weeks |      1,734       95.17      100.00
--------------------------+-----------------------------------
                    Total |      1,822      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         91        4.90        4.90
Assessment delay >3 weeks |      1,765       95.10      100.00
--------------------------+-----------------------------------
                    Total |      1,856      100.00


. bys diagnosis_year: tab ref_appt_3w, missing

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         72        0.63        0.63
Assessment delay >3 weeks |        832        7.31        7.94
                        . |     10,482       92.06      100.00
--------------------------+-----------------------------------
                    Total |     11,386      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         95        0.84        0.84
Assessment delay >3 weeks |      1,630       14.38       15.22
                        . |      9,607       84.78      100.00
--------------------------+-----------------------------------
                    Total |     11,332      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |        101        0.90        0.90
Assessment delay >3 weeks |      2,340       20.89       21.79
                        . |      8,761       78.21      100.00
--------------------------+-----------------------------------
                    Total |     11,202      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         17        1.09        1.09
Assessment delay >3 weeks |        394       25.22       26.31
                        . |      1,151       73.69      100.00
--------------------------+-----------------------------------
                    Total |      1,562      100.00


. bys diagnosis_year: tab ref_appt_3w

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         72        7.96        7.96
Assessment delay >3 weeks |        832       92.04      100.00
--------------------------+-----------------------------------
                    Total |        904      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         95        5.51        5.51
Assessment delay >3 weeks |      1,630       94.49      100.00
--------------------------+-----------------------------------
                    Total |      1,725      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |        101        4.14        4.14
Assessment delay >3 weeks |      2,340       95.86      100.00
--------------------------+-----------------------------------
                    Total |      2,441      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         17        4.14        4.14
Assessment delay >3 weeks |        394       95.86      100.00
--------------------------+-----------------------------------
                    Total |        411      100.00


. bys nuts_region: tab ref_appt_3w, missing

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         17        0.48        0.48
Assessment delay >3 weeks |        503       14.26       14.74
                        . |      3,008       85.26      100.00
--------------------------+-----------------------------------
                    Total |      3,528      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         29        0.82        0.82
Assessment delay >3 weeks |        557       15.76       16.58
                        . |      2,948       83.42      100.00
--------------------------+-----------------------------------
                    Total |      3,534      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         69        0.97        0.97
Assessment delay >3 weeks |      1,046       14.70       15.67
                        . |      6,002       84.33      100.00
--------------------------+-----------------------------------
                    Total |      7,117      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         29        0.80        0.80
Assessment delay >3 weeks |        523       14.38       15.18
                        . |      3,085       84.82      100.00
--------------------------+-----------------------------------
                    Total |      3,637      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         29        0.82        0.82
Assessment delay >3 weeks |        540       15.19       16.00
                        . |      2,987       84.00      100.00
--------------------------+-----------------------------------
                    Total |      3,556      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         56        0.80        0.80
Assessment delay >3 weeks |      1,003       14.25       15.04
                        . |      5,982       84.96      100.00
--------------------------+-----------------------------------
                    Total |      7,041      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         29        0.82        0.82
Assessment delay >3 weeks |        509       14.42       15.24
                        . |      2,992       84.76      100.00
--------------------------+-----------------------------------
                    Total |      3,530      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         27        0.76        0.76
Assessment delay >3 weeks |        515       14.55       15.32
                        . |      2,997       84.68      100.00
--------------------------+-----------------------------------
                    Total |      3,539      100.00


. bys nuts_region: tab ref_appt_3w

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         17        3.27        3.27
Assessment delay >3 weeks |        503       96.73      100.00
--------------------------+-----------------------------------
                    Total |        520      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         29        4.95        4.95
Assessment delay >3 weeks |        557       95.05      100.00
--------------------------+-----------------------------------
                    Total |        586      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         69        6.19        6.19
Assessment delay >3 weeks |      1,046       93.81      100.00
--------------------------+-----------------------------------
                    Total |      1,115      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         29        5.25        5.25
Assessment delay >3 weeks |        523       94.75      100.00
--------------------------+-----------------------------------
                    Total |        552      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         29        5.10        5.10
Assessment delay >3 weeks |        540       94.90      100.00
--------------------------+-----------------------------------
                    Total |        569      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         56        5.29        5.29
Assessment delay >3 weeks |      1,003       94.71      100.00
--------------------------+-----------------------------------
                    Total |      1,059      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         29        5.39        5.39
Assessment delay >3 weeks |        509       94.61      100.00
--------------------------+-----------------------------------
                    Total |        538      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         27        4.98        4.98
Assessment delay >3 weeks |        515       95.02      100.00
--------------------------+-----------------------------------
                    Total |        542      100.00


. 
. **Time from rheum ref or last GP to rheum appt (combined - sensitivity analysis; includes those with no rheum ref)
. gen time_refgp_rheum_appt = time_ref_rheum_appt
(30,001 missing values generated)

. replace time_refgp_rheum_appt = time_gp_rheum_appt if time_ref_rheum_appt==. & time_gp_rheum_appt!=.
(3,495 real changes made)

. bys eia_diagnosis: tabstat time_refgp_rheum_appt, stats (n mean p50 p25 p75)

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_refgp~t |      2978  274.9412       214        89       393
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_refgp~t |      2982  275.9004       216        96       390
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_refgp~t |      3016  278.3299       219       100       407
----------------------------------------------------------------

. bys diagnosis_year: tabstat time_refgp_rheum_appt, stats (n mean p50 p25 p75) //all patients by diagnosis year

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_refgp~t |      1564  170.4265       143        65       252
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_refgp~t |      2949  257.7996       214        92       380
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_refgp~t |      3858  320.4842       261       116       467
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_refgp~t |       605  359.8793       299       117       523
----------------------------------------------------------------

. bys nuts_region: tabstat time_refgp_rheum_appt, stats (n mean p50 p25 p75) //by region

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_refgp~t |       880  278.0989     231.5        98       392
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_refgp~t |       933  289.6249       231       108       413
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_refgp~t |      1799  271.6126       212        87       387
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_refgp~t |       898   281.088       219        99       408
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_refgp~t |       924  277.6591       218        97       407
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_refgp~t |      1765  269.3756       205        92       375
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_refgp~t |       888  271.5338       209        94     391.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_refgp~t |       889  283.2745       224        98       414
----------------------------------------------------------------

. 
. **Time from rheum ref to EIA code (sensitivity analysis; includes those with no rheum appt)
. gen time_ref_rheum_eia = (eia_code_date - referral_rheum_precode_date) if eia_code_date!=. & referral_rheum_precode_date!=. & referral_rheum_precode_date<eia_code_date  
(15,786 missing values generated)

. tabstat time_ref_rheum_eia, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~a |     19696  522.8662       470       232     772.5
----------------------------------------------------------------

. bys eia_diagnosis: tabstat time_ref_rheum_eia, stats (n mean p50 p25 p75)

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~a |      6464  520.6889       466       230     768.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~a |      6580  526.2333     473.5       233     777.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~a |      6652  521.6512       470       232     768.5
----------------------------------------------------------------

. 
. **Time from rheum ref to EIA diagnosis (combined - sensitivity analysis; includes those with no rheum appt)
. gen time_ref_rheum_eia_comb = time_ref_rheum_appt
(30,001 missing values generated)

. replace time_ref_rheum_eia_comb = time_ref_rheum_eia if time_ref_rheum_appt==. & time_ref_rheum_eia!=.
(16,210 real changes made)

. tabstat time_ref_rheum_eia_comb, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~b |     21691  456.5497       386       177       674
----------------------------------------------------------------

. bys eia_diagnosis: tabstat time_ref_rheum_eia_comb, stats (n mean p50 p25 p75)

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~b |      7144   454.502       381       174       673
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~b |      7244  457.7755       388       180     675.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~b |      7303  457.3368       388       177       674
----------------------------------------------------------------

. 
. **Time from rheum appt to EIA code (i.e. if appts are present and in correct time order)
. gen time_rheum_eia_code = (eia_code_date - rheum_appt_date) if eia_code_date!=. & rheum_appt_date!=. & rheum_appt_date<eia_code_date 
(11,637 missing values generated)

. tabstat time_rheum_eia_code, stats (n mean p50 p25 p75) 

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_rheum~e |     23845  601.9244       573       313       868
----------------------------------------------------------------

. bys eia_diagnosis: tabstat time_rheum_eia_code, stats (n mean p50 p25 p75) 

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_rheum~e |      7953  596.2355       568       310       863
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_rheum~e |      7878  605.4016       579       313       876
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_rheum~e |      8014  604.1519       575       316       865
----------------------------------------------------------------

. 
. *Time to first csDMARD prescriptions - all of the below are shared care prescriptions, aside from those with MTX_high cost drug data included======================================================================*/
. 
. *All patients below must have at least six months of GP registration after EIA code
. 
. **Time to first csDMARD script for RA patients, whereby first rheum appt is classed as diagnosis date (if rheum appt present and before csDMARD date; not including high cost MTX prescriptions)
. gen time_to_csdmard=(csdmard_date-rheum_appt_date) if csdmard==1 & rheum_appt_date!=. & csdmard_date>rheum_appt_date 
(25,344 missing values generated)

. tabstat time_to_csdmard if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_cs~d |      3252  560.7236       524       272     817.5
----------------------------------------------------------------

. bys diagnosis_year: tabstat time_to_csdmard if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by diagnosis year

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_cs~d |      1081  555.9436       519       272       801
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_cs~d |      1006  559.7087       515       273       819
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_cs~d |      1023  566.8192       533       284       819
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_cs~d |       142  560.3873       474       250       851
----------------------------------------------------------------

. bys nuts_region: tabstat time_to_csdmard if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by region

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_cs~d |       321  564.1028       550       293       818
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_cs~d |       375  531.2827       488       233       784
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_cs~d |       628  560.0955       508       299       825
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_cs~d |       315  581.6794       540       298       835
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_cs~d |       337  558.6825       545       250       822
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_cs~d |       633  554.1896       512       258       799
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_cs~d |       311  568.7106       561       268       832
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_cs~d |       332  579.0633     550.5     280.5       830
----------------------------------------------------------------

. 
. **Time to first csDMARD script for RA patients (including high cost MTX prescriptions)
. gen time_to_csdmard_hcd=(csdmard_hcd_date-rheum_appt_date) if csdmard_hcd==1 & rheum_appt_date!=. & csdmard_hcd_date>rheum_appt_date 
(23,983 missing values generated)

. tabstat time_to_csdmard_hcd if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) 

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_c~cd |      3679  555.9478       516       272       809
----------------------------------------------------------------

. 
. **Time to first csDMARD script for PsA patients (not including high cost MTX prescriptions)
. tabstat time_to_csdmard if psa_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_c~rd |      3103   560.088       518       267       830
----------------------------------------------------------------

. bys diagnosis_year: tabstat time_to_csdmard if psa_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by diagnosis year

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_c~rd |       994   556.173       514       269       812
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_c~rd |       956  556.6412       503       252       835
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_c~rd |      1002  567.4032       544       276       845
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_c~rd |       151  559.1391       502       299       811
----------------------------------------------------------------

. bys nuts_region: tabstat time_to_csdmard if psa_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by region

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_c~rd |       306  556.7484     515.5       255       831
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_c~rd |       297  560.5286       524       276       807
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_c~rd |       636  548.3396     491.5       266       803
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_c~rd |       312     575.5       522       294     834.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_c~rd |       346  573.3092       523       261       845
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_c~rd |       628  559.0876     503.5     278.5     843.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_c~rd |       289  554.7163       551       253       834
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_c~rd |       289  564.1038       529       259       847
----------------------------------------------------------------

. 
. **Time to first csDMARD script for PsA patients (including high cost MTX prescriptions)
. tabstat time_to_csdmard_hcd if psa_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) 

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_c~cd |      3542  557.9418       518       269       820
----------------------------------------------------------------

. 
. **csDMARD time categories for RA patients (not including high cost MTX prescriptions)
. gen csdmard_3m=1 if time_to_csdmard<=90 & time_to_csdmard!=. 
(34,731 missing values generated)

. replace csdmard_3m=2 if time_to_csdmard>90 & time_to_csdmard!=.
(9,387 real changes made)

. lab define csdmard_3m 1 "Yes" 2 "No", modify

. lab val csdmard_3m csdmard_3m

. lab var csdmard_3m "csDMARD within 3 months" 

. tab csdmard_3m if ra_code==1 & has_6m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after csDMARD script

    csDMARD |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        252        2.25        2.25
         No |      3,000       26.82       29.07
          . |      7,934       70.93      100.00
------------+-----------------------------------
      Total |     11,186      100.00

. tab csdmard_3m if ra_code==1 & has_6m_follow_up==1

    csDMARD |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        252        7.75        7.75
         No |      3,000       92.25      100.00
------------+-----------------------------------
      Total |      3,252      100.00

. gen csdmard_6m=1 if time_to_csdmard<=180 & time_to_csdmard!=. 
(33,925 missing values generated)

. replace csdmard_6m=2 if time_to_csdmard>180 & time_to_csdmard!=.
(8,581 real changes made)

. lab define csdmard_6m 1 "Yes" 2 "No", modify

. lab val csdmard_6m csdmard_6m

. lab var csdmard_6m "csDMARD within 6 months" 

. tab csdmard_6m if ra_code==1 & has_6m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after csDMARD script

    csDMARD |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        527        4.71        4.71
         No |      2,725       24.36       29.07
          . |      7,934       70.93      100.00
------------+-----------------------------------
      Total |     11,186      100.00

. tab csdmard_6m if ra_code==1 & has_6m_follow_up==1

    csDMARD |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        527       16.21       16.21
         No |      2,725       83.79      100.00
------------+-----------------------------------
      Total |      3,252      100.00

. gen csdmard_12m=1 if time_to_csdmard<=365 & time_to_csdmard!=. 
(32,019 missing values generated)

. replace csdmard_12m=2 if time_to_csdmard>365 & time_to_csdmard!=.
(6,675 real changes made)

. lab define csdmard_12m 1 "Yes" 2 "No", modify

. lab val csdmard_12m csdmard_12m

. lab var csdmard_12m "csDMARD within 12 months" 

. tab csdmard_12m if ra_code==1 & has_12m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after csDMARD script

    csDMARD |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,057        9.99        9.99
         No |      2,038       19.27       29.26
          . |      7,482       70.74      100.00
------------+-----------------------------------
      Total |     10,577      100.00

. tab csdmard_12m if ra_code==1 & has_12m_follow_up==1 //for patients with at least 12m registration

    csDMARD |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,057       34.15       34.15
         No |      2,038       65.85      100.00
------------+-----------------------------------
      Total |      3,095      100.00

. 
. **csDMARD time categories for RA patients (including high cost MTX prescriptions)
. gen csdmard_hcd_3m=1 if time_to_csdmard_hcd<=90 & time_to_csdmard_hcd!=. 
(34,621 missing values generated)

. replace csdmard_hcd_3m=2 if time_to_csdmard_hcd>90 & time_to_csdmard_hcd!=.
(10,638 real changes made)

. lab define csdmard_hcd_3m 1 "Yes" 2 "No", modify

. lab val csdmard_hcd_3m csdmard_hcd_3m

. lab var csdmard_hcd_3m "csDMARD within 3 months" 

. tab csdmard_hcd_3m if ra_code==1 & has_6m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after csDMARD script

    csDMARD |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        294        2.63        2.63
         No |      3,385       30.26       32.89
          . |      7,507       67.11      100.00
------------+-----------------------------------
      Total |     11,186      100.00

. tab csdmard_hcd_3m if ra_code==1 & has_6m_follow_up==1

    csDMARD |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        294        7.99        7.99
         No |      3,385       92.01      100.00
------------+-----------------------------------
      Total |      3,679      100.00

. gen csdmard_hcd_6m=1 if time_to_csdmard_hcd<=180 & time_to_csdmard_hcd!=. 
(33,711 missing values generated)

. replace csdmard_hcd_6m=2 if time_to_csdmard_hcd>180 & time_to_csdmard_hcd!=.
(9,728 real changes made)

. lab define csdmard_hcd_6m 1 "Yes" 2 "No", modify

. lab val csdmard_hcd_6m csdmard_hcd_6m

. lab var csdmard_hcd_6m "csDMARD within 6 months" 

. tab csdmard_hcd_6m if ra_code==1 & has_6m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after csDMARD script

    csDMARD |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        599        5.35        5.35
         No |      3,080       27.53       32.89
          . |      7,507       67.11      100.00
------------+-----------------------------------
      Total |     11,186      100.00

. tab csdmard_hcd_6m if ra_code==1 & has_6m_follow_up==1

    csDMARD |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        599       16.28       16.28
         No |      3,080       83.72      100.00
------------+-----------------------------------
      Total |      3,679      100.00

. gen csdmard_hcd_12m=1 if time_to_csdmard_hcd<=365 & time_to_csdmard_hcd!=. 
(31,536 missing values generated)

. replace csdmard_hcd_12m=2 if time_to_csdmard_hcd>365 & time_to_csdmard_hcd!=.
(7,553 real changes made)

. lab define csdmard_hcd_12m 1 "Yes" 2 "No", modify

. lab val csdmard_hcd_12m csdmard_hcd_12m

. lab var csdmard_hcd_12m "csDMARD within 12 months" 

. tab csdmard_hcd_12m if ra_code==1 & has_12m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after csDMARD script

    csDMARD |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,192       11.27       11.27
         No |      2,314       21.88       33.15
          . |      7,071       66.85      100.00
------------+-----------------------------------
      Total |     10,577      100.00

. tab csdmard_hcd_12m if ra_code==1 & has_12m_follow_up==1 //for patients with at least 12m registration

    csDMARD |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,192       34.00       34.00
         No |      2,314       66.00      100.00
------------+-----------------------------------
      Total |      3,506      100.00

. 
. **csDMARD time categories for PsA patients (not including high cost MTX prescriptions)
. tab csdmard_3m if psa_code==1 & has_6m_follow_up==1, missing

    csDMARD |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        239        2.15        2.15
         No |      2,864       25.71       27.86
          . |      8,035       72.14      100.00
------------+-----------------------------------
      Total |     11,138      100.00

. tab csdmard_6m if psa_code==1 & has_6m_follow_up==1, missing

    csDMARD |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        497        4.46        4.46
         No |      2,606       23.40       27.86
          . |      8,035       72.14      100.00
------------+-----------------------------------
      Total |     11,138      100.00

. tab csdmard_12m if psa_code==1 & has_12m_follow_up==1, missing

    csDMARD |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,034        9.74        9.74
         No |      1,926       18.14       27.88
          . |      7,656       72.12      100.00
------------+-----------------------------------
      Total |     10,616      100.00

. 
. **csDMARD time categories for PsA patients (including high cost MTX prescriptions)
. tab csdmard_hcd_3m if psa_code==1 & has_6m_follow_up==1, missing

    csDMARD |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        271        2.43        2.43
         No |      3,271       29.37       31.80
          . |      7,596       68.20      100.00
------------+-----------------------------------
      Total |     11,138      100.00

. tab csdmard_hcd_6m if psa_code==1 & has_6m_follow_up==1, missing

    csDMARD |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        559        5.02        5.02
         No |      2,983       26.78       31.80
          . |      7,596       68.20      100.00
------------+-----------------------------------
      Total |     11,138      100.00

. tab csdmard_hcd_12m if psa_code==1 & has_12m_follow_up==1, missing

    csDMARD |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,169       11.01       11.01
         No |      2,207       20.79       31.80
          . |      7,240       68.20      100.00
------------+-----------------------------------
      Total |     10,616      100.00

. 
. **What was first shared care csDMARD (not including high cost MTX prescriptions)
. gen first_csD=""
(35,482 missing values generated)

. foreach var of varlist hydroxychloroquine_date leflunomide_date methotrexate_date methotrexate_inj_date sulfasalazine_date {
  2.         replace first_csD="`var'" if csdmard_date==`var' & csdmard_date!=.
  3.         }
variable first_csD was str1 now str23
(2,450 real changes made)
(2,558 real changes made)
(2,498 real changes made)
(2,569 real changes made)
(2,484 real changes made)

. gen first_csDMARD = substr(first_csD, 1, length(first_csD) - 5) if first_csD!=""
(22,924 missing values generated)

. drop first_csD

. tab first_csDMARD if ra_code==1 & has_6m_follow_up==1 //for RA patients

     first_csDMARD |      Freq.     Percent        Cum.
-------------------+-----------------------------------
hydroxychloroquine |        768       19.30       19.30
       leflunomide |        786       19.75       39.06
      methotrexate |        818       20.56       59.61
  methotrexate_inj |        826       20.76       80.37
     sulfasalazine |        781       19.63      100.00
-------------------+-----------------------------------
             Total |      3,979      100.00

. tab first_csDMARD if psa_code==1 & has_6m_follow_up==1 //for PsA patients

     first_csDMARD |      Freq.     Percent        Cum.
-------------------+-----------------------------------
hydroxychloroquine |        760       19.51       19.51
       leflunomide |        756       19.40       38.91
      methotrexate |        765       19.64       58.55
  methotrexate_inj |        815       20.92       79.47
     sulfasalazine |        800       20.53      100.00
-------------------+-----------------------------------
             Total |      3,896      100.00

. 
. **What was first csDMARD (including high cost MTX prescriptions)
. gen first_csD_hcd=""
(35,482 missing values generated)

. foreach var of varlist hydroxychloroquine_date leflunomide_date methotrexate_date methotrexate_inj_date methotrexate_hcd_date sulfasalazine_date {
  2.         replace first_csD_hcd="`var'" if csdmard_hcd_date==`var' & csdmard_hcd_date!=.
  3.         }
variable first_csD_hcd was str1 now str23
(2,319 real changes made)
(2,426 real changes made)
(2,370 real changes made)
(2,428 real changes made)
(3,016 real changes made)
(2,346 real changes made)

. gen first_csDMARD_hcd = substr(first_csD_hcd, 1, length(first_csD_hcd) - 5) if first_csD_hcd!=""
(20,579 missing values generated)

. drop first_csD_hcd

. tab first_csDMARD_hcd if ra_code==1 & has_6m_follow_up==1 //for RA patients

 first_csDMARD_hcd |      Freq.     Percent        Cum.
-------------------+-----------------------------------
hydroxychloroquine |        728       15.44       15.44
       leflunomide |        738       15.66       31.10
      methotrexate |        780       16.55       47.65
  methotrexate_hcd |        951       20.17       67.82
  methotrexate_inj |        778       16.50       84.32
     sulfasalazine |        739       15.68      100.00
-------------------+-----------------------------------
             Total |      4,714      100.00

. tab first_csDMARD_hcd if psa_code==1 & has_6m_follow_up==1 //for PsA patients

 first_csDMARD_hcd |      Freq.     Percent        Cum.
-------------------+-----------------------------------
hydroxychloroquine |        718       15.44       15.44
       leflunomide |        721       15.51       30.95
      methotrexate |        720       15.48       46.43
  methotrexate_hcd |        968       20.82       67.25
  methotrexate_inj |        775       16.67       83.91
     sulfasalazine |        748       16.09      100.00
-------------------+-----------------------------------
             Total |      4,650      100.00

.  
. **Methotrexate use (not including high cost MTX prescriptions)
. gen mtx=1 if methotrexate==1 | methotrexate_inj==1
(29,710 missing values generated)

. recode mtx .=0 
(29710 changes made to mtx)

. tab mtx if ra_code==1 & has_6m_follow_up==1 //for RA patients; Nb. this is just a check; need time-to-MTX instead (below)

        mtx |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      9,320       83.32       83.32
          1 |      1,866       16.68      100.00
------------+-----------------------------------
      Total |     11,186      100.00

. tab mtx if psa_code==1 & has_6m_follow_up==1 //for PsA patients

        mtx |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      9,354       83.98       83.98
          1 |      1,784       16.02      100.00
------------+-----------------------------------
      Total |     11,138      100.00

. 
. **Methotrexate use (including high cost MTX prescriptions)
. gen mtx_hcd=1 if methotrexate==1 | methotrexate_inj==1 | methotrexate_hcd==1
(26,687 missing values generated)

. recode mtx_hcd .=0 
(26687 changes made to mtx_hcd)

. tab mtx_hcd if ra_code==1 & has_6m_follow_up==1 //for RA patients

    mtx_hcd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,370       74.83       74.83
          1 |      2,816       25.17      100.00
------------+-----------------------------------
      Total |     11,186      100.00

. tab mtx_hcd if psa_code==1 & has_6m_follow_up==1 //for PsA patients

    mtx_hcd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,386       75.29       75.29
          1 |      2,752       24.71      100.00
------------+-----------------------------------
      Total |     11,138      100.00

. 
. **Date of first methotrexate script (not including high cost MTX prescriptions)
. gen mtx_date=min(methotrexate_date, methotrexate_inj_date)
(29,710 missing values generated)

. format %td mtx_date

. 
. **Date of first methotrexate script (including high cost MTX prescriptions)
. gen mtx_hcd_date=min(methotrexate_date, methotrexate_inj_date, methotrexate_hcd_date)
(26,687 missing values generated)

. format %td mtx_hcd_date

. 
. **Time to first methotrexate script for RA patients (not including high cost MTX prescriptions)
. gen time_to_mtx=(mtx_date-rheum_appt_date) if mtx==1 & rheum_appt_date!=. & mtx_date>rheum_appt_date 
(30,837 missing values generated)

. tabstat time_to_mtx if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |      1542  594.2691     566.5       305       863
----------------------------------------------------------------

. bys diagnosis_year: tabstat time_to_mtx if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by diagnosis year

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       503  570.3777       556       276       827
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       463  606.7819       559       326       891
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       516  600.2248       568     305.5     857.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |        60  646.7833     675.5       286       950
----------------------------------------------------------------

. bys nuts_region: tabstat time_to_mtx if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by region

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       157  581.0191       559       275       869
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       185  627.5622       606       342       910
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       295  570.3254       530       300       849
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       141  594.5248       546       318       865
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       174  605.5517     587.5       306       841
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       294  590.6156     539.5       284       835
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       145  628.8621       624       362       871
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       151  574.6887       546       280       789
----------------------------------------------------------------

. 
. **Time to first methotrexate script for RA patients (including high cost MTX prescriptions)
. gen time_to_mtx_hcd=(mtx_hcd_date-rheum_appt_date) if mtx_hcd==1 & rheum_appt_date!=. & mtx_hcd_date>rheum_appt_date 
(28,907 missing values generated)

. tabstat time_to_mtx_hcd if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_mt~d |      2143  585.1307       554       300       845
----------------------------------------------------------------

. 
. **Time to first methotrexate script for PsA patients (not including high cost MTX prescriptions)
. tabstat time_to_mtx if psa_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |      1416  576.6356       532       276       860
----------------------------------------------------------------

. bys diagnosis_year: tabstat time_to_mtx if psa_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by diagnosis year

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       454  584.9427       557       310       830
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       436  559.2798       495       248     851.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       455  583.8176       554       293       874
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |        71  584.0704       504       291       979
----------------------------------------------------------------

. bys nuts_region: tabstat time_to_mtx if psa_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by region

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       134  582.9478     548.5       264       860
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       129  596.7209       558       299       873
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       297  548.0034       483       259       812
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       158  588.1772       522       337       831
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       172  624.7849     636.5     268.5       916
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       270  575.4852       532       303       869
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       122  567.6066     555.5       258       840
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       134  549.5746       506       253       796
----------------------------------------------------------------

. 
. **Time to first methotrexate script for PsA patients (including high cost MTX prescriptions)
. tabstat time_to_mtx_hcd if psa_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_mt~d |      2034  576.9017       540       288       846
----------------------------------------------------------------

. 
. **Methotrexate time categories for RA patients (not including high-cost MTX) //Nb. this is time period from rheum appt (i.e. diagnosis) to shared care, not from referral to first script 
. gen mtx_3m=1 if time_to_mtx<=90 & time_to_mtx!=. 
(35,170 missing values generated)

. replace mtx_3m=2 if time_to_mtx>90 & time_to_mtx!=.
(4,333 real changes made)

. lab define mtx_3m 1 "Yes" 2 "No", modify

. lab val mtx_3m mtx_3m

. lab var mtx_3m "Methotrexate within 3 months" 

. tab mtx_3m if ra_code==1 & has_6m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after csDMARD script

Methotrexat |
 e within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        106        0.95        0.95
         No |      1,436       12.84       13.79
          . |      9,644       86.21      100.00
------------+-----------------------------------
      Total |     11,186      100.00

. tab mtx_3m if ra_code==1 & has_6m_follow_up==1

Methotrexat |
 e within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        106        6.87        6.87
         No |      1,436       93.13      100.00
------------+-----------------------------------
      Total |      1,542      100.00

. gen mtx_6m=1 if time_to_mtx<=180 & time_to_mtx!=. 
(34,842 missing values generated)

. replace mtx_6m=2 if time_to_mtx>180 & time_to_mtx!=.
(4,005 real changes made)

. lab define mtx_6m 1 "Yes" 2 "No", modify

. lab val mtx_6m mtx_6m

. lab var mtx_6m "Methotrexate within 6 months" 

. tab mtx_6m if ra_code==1 & has_6m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after csDMARD script

Methotrexat |
 e within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        219        1.96        1.96
         No |      1,323       11.83       13.79
          . |      9,644       86.21      100.00
------------+-----------------------------------
      Total |     11,186      100.00

. tab mtx_6m if ra_code==1 & has_6m_follow_up==1

Methotrexat |
 e within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        219       14.20       14.20
         No |      1,323       85.80      100.00
------------+-----------------------------------
      Total |      1,542      100.00

. gen mtx_12m=1 if time_to_mtx<=365 & time_to_mtx!=. 
(34,014 missing values generated)

. replace mtx_12m=2 if time_to_mtx>365 & time_to_mtx!=.
(3,177 real changes made)

. lab define mtx_12m 1 "Yes" 2 "No", modify

. lab val mtx_12m mtx_12m

. lab var mtx_12m "Methotrexate within 12 months" 

. tab mtx_12m if ra_code==1 & has_12m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after mtx script

Methotrexat |
e within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        447        4.23        4.23
         No |      1,008        9.53       13.76
          . |      9,122       86.24      100.00
------------+-----------------------------------
      Total |     10,577      100.00

. tab mtx_12m if ra_code==1 & has_12m_follow_up==1 //for patients with at least 12m registration

Methotrexat |
e within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        447       30.72       30.72
         No |      1,008       69.28      100.00
------------+-----------------------------------
      Total |      1,455      100.00

. 
. **Methotrexate time categories for RA patients (including high-cost MTX)
. gen mtx_hcd_3m=1 if time_to_mtx_hcd<=90 & time_to_mtx_hcd!=. 
(35,039 missing values generated)

. replace mtx_hcd_3m=2 if time_to_mtx_hcd>90 & time_to_mtx_hcd!=.
(6,132 real changes made)

. lab define mtx_hcd_3m 1 "Yes" 2 "No", modify

. lab val mtx_hcd_3m mtx_hcd_3m

. lab var mtx_hcd_3m "Methotrexate within 3 months" 

. tab mtx_hcd_3m if ra_code==1 & has_6m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after csDMARD script

Methotrexat |
 e within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        154        1.38        1.38
         No |      1,989       17.78       19.16
          . |      9,043       80.84      100.00
------------+-----------------------------------
      Total |     11,186      100.00

. tab mtx_hcd_3m if ra_code==1 & has_6m_follow_up==1

Methotrexat |
 e within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        154        7.19        7.19
         No |      1,989       92.81      100.00
------------+-----------------------------------
      Total |      2,143      100.00

. gen mtx_hcd_6m=1 if time_to_mtx_hcd<=180 & time_to_mtx_hcd!=. 
(34,580 missing values generated)

. replace mtx_hcd_6m=2 if time_to_mtx_hcd>180 & time_to_mtx_hcd!=.
(5,673 real changes made)

. lab define mtx_hcd_6m 1 "Yes" 2 "No", modify

. lab val mtx_hcd_6m mtx_hcd_6m

. lab var mtx_hcd_6m "Methotrexate within 6 months" 

. tab mtx_hcd_6m if ra_code==1 & has_6m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after csDMARD script

Methotrexat |
 e within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        308        2.75        2.75
         No |      1,835       16.40       19.16
          . |      9,043       80.84      100.00
------------+-----------------------------------
      Total |     11,186      100.00

. tab mtx_hcd_6m if ra_code==1 & has_6m_follow_up==1

Methotrexat |
 e within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        308       14.37       14.37
         No |      1,835       85.63      100.00
------------+-----------------------------------
      Total |      2,143      100.00

. gen mtx_hcd_12m=1 if time_to_mtx_hcd<=365 & time_to_mtx_hcd!=. 
(33,404 missing values generated)

. replace mtx_hcd_12m=2 if time_to_mtx_hcd>365 & time_to_mtx_hcd!=.
(4,497 real changes made)

. lab define mtx_hcd_12m 1 "Yes" 2 "No", modify

. lab val mtx_hcd_12m mtx_hcd_12m

. lab var mtx_hcd_12m "Methotrexate within 12 months" 

. tab mtx_hcd_12m if ra_code==1 & has_12m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after csDMARD script

Methotrexat |
e within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        622        5.88        5.88
         No |      1,411       13.34       19.22
          . |      8,544       80.78      100.00
------------+-----------------------------------
      Total |     10,577      100.00

. tab mtx_hcd_12m if ra_code==1 & has_12m_follow_up==1 //for patients with at least 12m registration

Methotrexat |
e within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        622       30.60       30.60
         No |      1,411       69.40      100.00
------------+-----------------------------------
      Total |      2,033      100.00

. 
. **Methotrexate time categories for PsA patients (not including high-cost MTX)
. tab mtx_3m if psa_code==1 & has_6m_follow_up==1, missing

Methotrexat |
 e within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        106        0.95        0.95
         No |      1,310       11.76       12.71
          . |      9,722       87.29      100.00
------------+-----------------------------------
      Total |     11,138      100.00

. tab mtx_6m if psa_code==1 & has_6m_follow_up==1, missing

Methotrexat |
 e within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        213        1.91        1.91
         No |      1,203       10.80       12.71
          . |      9,722       87.29      100.00
------------+-----------------------------------
      Total |     11,138      100.00

. tab mtx_12m if psa_code==1 & has_12m_follow_up==1, missing //with a least 12m registration

Methotrexat |
e within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        446        4.20        4.20
         No |        888        8.36       12.57
          . |      9,282       87.43      100.00
------------+-----------------------------------
      Total |     10,616      100.00

. 
. **Methotrexate time categories for PsA patients (including high-cost MTX)
. tab mtx_hcd_3m if psa_code==1 & has_6m_follow_up==1, missing

Methotrexat |
 e within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        146        1.31        1.31
         No |      1,888       16.95       18.26
          . |      9,104       81.74      100.00
------------+-----------------------------------
      Total |     11,138      100.00

. tab mtx_hcd_6m if psa_code==1 & has_6m_follow_up==1, missing

Methotrexat |
 e within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        292        2.62        2.62
         No |      1,742       15.64       18.26
          . |      9,104       81.74      100.00
------------+-----------------------------------
      Total |     11,138      100.00

. tab mtx_hcd_12m if psa_code==1 & has_12m_follow_up==1, missing //with a least 12m registration

Methotrexat |
e within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        623        5.87        5.87
         No |      1,299       12.24       18.10
          . |      8,694       81.90      100.00
------------+-----------------------------------
      Total |     10,616      100.00

. 
. **Sulfasalazine use
. gen time_to_ssz=(sulfasalazine_date-rheum_appt_date) if sulfasalazine==1 & rheum_appt_date!=. & sulfasalazine_date>rheum_appt_date 
(33,051 missing values generated)

. tabstat time_to_ssz if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |       761  584.6058       552       300       837
----------------------------------------------------------------

. bys diagnosis_year: tabstat time_to_ssz if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by diagnosis year for RA

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |       262  581.6145       580       325       818
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |       227  561.3304       489       273       827
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |       240  614.1917       564       312     863.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |        32  552.3125       475     245.5     778.5
----------------------------------------------------------------

. bys diagnosis_year: tabstat time_to_ssz if psa_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by diagnosis year for PsA

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |       250   589.456       532       307       873
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |       228  571.5833     552.5     304.5       816
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |       249  605.7912       585       285       880
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |        34  638.1471       571       404       864
----------------------------------------------------------------

. bys nuts_region: tabstat time_to_ssz if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by region for RA

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |        68  642.4706     609.5       342     893.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |        91  508.2857       442       259       809
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |       149  614.1678       574       357       864
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |        71  627.2254       620       294       894
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |        71  527.7606       567       203       804
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |       162  604.4259       534       314       860
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |        74  511.6757     424.5       190       791
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |        75  608.6267       630       360       840
----------------------------------------------------------------

. bys nuts_region: tabstat time_to_ssz if psa_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by region for PsA

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |        74  622.0676     626.5       297       896
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |        81   599.963       571       360       856
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |       161  561.8261       541       298       784
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |        77  599.5584       562       271       875
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |        80  552.0125     519.5       357       707
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |       159  598.5786       562       260       905
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |        66  629.1364       625       370       852
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |        63  605.0159       584       273       925
----------------------------------------------------------------

. 
. **Sulfasalazine time categories for RA patients //Nb. this is time period from rheum appt (i.e. diagnosis) to shared care, not from referral to first script 
. gen ssz_3m=1 if time_to_ssz<=90 & time_to_ssz!=. 
(35,329 missing values generated)

. replace ssz_3m=2 if time_to_ssz>90 & time_to_ssz!=.
(2,278 real changes made)

. lab define ssz_3m 1 "Yes" 2 "No", modify

. lab val ssz_3m ssz_3m

. lab var ssz_3m "Sulfasalazine within 3 months" 

. tab ssz_3m if ra_code==1 & has_6m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after csDMARD script

Sulfasalazi |
ne within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         46        0.41        0.41
         No |        715        6.39        6.80
          . |     10,425       93.20      100.00
------------+-----------------------------------
      Total |     11,186      100.00

. tab ssz_3m if ra_code==1 & has_6m_follow_up==1

Sulfasalazi |
ne within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         46        6.04        6.04
         No |        715       93.96      100.00
------------+-----------------------------------
      Total |        761      100.00

. gen ssz_6m=1 if time_to_ssz<=180 & time_to_ssz!=. 
(35,147 missing values generated)

. replace ssz_6m=2 if time_to_ssz>180 & time_to_ssz!=.
(2,096 real changes made)

. lab define ssz_6m 1 "Yes" 2 "No", modify

. lab val ssz_6m ssz_6m

. lab var ssz_6m "Sulfasalazine within 6 months" 

. tab ssz_6m if ra_code==1 & has_6m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after csDMARD script

Sulfasalazi |
ne within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        112        1.00        1.00
         No |        649        5.80        6.80
          . |     10,425       93.20      100.00
------------+-----------------------------------
      Total |     11,186      100.00

. tab ssz_6m if ra_code==1 & has_6m_follow_up==1

Sulfasalazi |
ne within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        112       14.72       14.72
         No |        649       85.28      100.00
------------+-----------------------------------
      Total |        761      100.00

. gen ssz_12m=1 if time_to_ssz<=365 & time_to_ssz!=. 
(34,741 missing values generated)

. replace ssz_12m=2 if time_to_ssz>365 & time_to_ssz!=.
(1,690 real changes made)

. lab define ssz_12m 1 "Yes" 2 "No", modify

. lab val ssz_12m ssz_12m

. lab var ssz_12m "Sulfasalazine within 12 months" 

. tab ssz_12m if ra_code==1 & has_12m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after ssz script

Sulfasalazi |
  ne within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        242        2.29        2.29
         No |        500        4.73        7.02
          . |      9,835       92.98      100.00
------------+-----------------------------------
      Total |     10,577      100.00

. tab ssz_12m if ra_code==1 & has_12m_follow_up==1 //for patients with at least 12m registration

Sulfasalazi |
  ne within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        242       32.61       32.61
         No |        500       67.39      100.00
------------+-----------------------------------
      Total |        742      100.00

. 
. **Sulfasalazine time categories for PsA patients
. tab ssz_3m if psa_code==1 & has_6m_follow_up==1, missing

Sulfasalazi |
ne within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         48        0.43        0.43
         No |        713        6.40        6.83
          . |     10,377       93.17      100.00
------------+-----------------------------------
      Total |     11,138      100.00

. tab ssz_6m if psa_code==1 & has_6m_follow_up==1, missing

Sulfasalazi |
ne within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        103        0.92        0.92
         No |        658        5.91        6.83
          . |     10,377       93.17      100.00
------------+-----------------------------------
      Total |     11,138      100.00

. tab ssz_12m if psa_code==1 & has_12m_follow_up==1, missing //with a least 12m registration

Sulfasalazi |
  ne within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        228        2.15        2.15
         No |        514        4.84        6.99
          . |      9,874       93.01      100.00
------------+-----------------------------------
      Total |     10,616      100.00

. 
. **Hydroxychloroquine use
. gen time_to_hcq=(hydroxychloroquine_date-rheum_appt_date) if hydroxychloroquine==1 & rheum_appt_date!=. & hydroxychloroquine_date>rheum_appt_date 
(33,100 missing values generated)

. tabstat time_to_hcq if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |       753  621.7543       608       321       902
----------------------------------------------------------------

. bys diagnosis_year: tabstat time_to_hcq if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by diagnosis year for RA

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |       262  647.6947       626       355       934
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |       246  600.5528       585       306       888
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |       207  608.1836       609       303       847
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |        38  654.0789     667.5       339      1018
----------------------------------------------------------------

. bys diagnosis_year: tabstat time_to_hcq if psa_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by diagnosis year for PsA

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |       243  598.2716       570       276       901
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |       237  632.1055       582       337       926
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |       239  623.9414       593       336       892
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |        36  563.3333       529       338     767.5
----------------------------------------------------------------

. bys nuts_region: tabstat time_to_hcq if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by region for RA

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |        65  550.9231       506       293       752
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |        88  657.2159       673       380     949.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |       133  585.8271       545       299       845
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |        76  653.1184       617       372       915
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |        82  641.5366     672.5       261       911
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |       157   595.586       557       313       888
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |        73  677.6164       673       360      1038
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |        79  650.6962       660       334       937
----------------------------------------------------------------

. bys nuts_region: tabstat time_to_hcq if psa_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by region for PsA

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |        75    550.88       523       273       808
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |        82  633.7683       654       360       922
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |       129  626.6977       583       338       911
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |        74  674.3378     678.5       345       941
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |        77  623.5455       570       285       902
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |       165       594       562       298       868
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |        80   613.875     569.5       284       952
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |        73  622.3014       598       341       898
----------------------------------------------------------------

. 
. **Hydroxychloroquine time categories for RA patients //Nb. this is time period from rheum appt (i.e. diagnosis) to shared care, not from referral to first script 
. gen hcq_3m=1 if time_to_hcq<=90 & time_to_hcq!=. 
(35,339 missing values generated)

. replace hcq_3m=2 if time_to_hcq>90 & time_to_hcq!=.
(2,239 real changes made)

. lab define hcq_3m 1 "Yes" 2 "No", modify

. lab val hcq_3m hcq_3m

. lab var hcq_3m "Hydroxychloroquine within 3 months" 

. tab hcq_3m if ra_code==1 & has_6m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after csDMARD script

Hydroxychlo |
    roquine |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         46        0.41        0.41
         No |        707        6.32        6.73
          . |     10,433       93.27      100.00
------------+-----------------------------------
      Total |     11,186      100.00

. tab hcq_3m if ra_code==1 & has_6m_follow_up==1

Hydroxychlo |
    roquine |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         46        6.11        6.11
         No |        707       93.89      100.00
------------+-----------------------------------
      Total |        753      100.00

. gen hcq_6m=1 if time_to_hcq<=180 & time_to_hcq!=. 
(35,176 missing values generated)

. replace hcq_6m=2 if time_to_hcq>180 & time_to_hcq!=.
(2,076 real changes made)

. lab define hcq_6m 1 "Yes" 2 "No", modify

. lab val hcq_6m hcq_6m

. lab var hcq_6m "Hydroxychloroquine within 6 months" 

. tab hcq_6m if ra_code==1 & has_6m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after csDMARD script

Hydroxychlo |
    roquine |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         95        0.85        0.85
         No |        658        5.88        6.73
          . |     10,433       93.27      100.00
------------+-----------------------------------
      Total |     11,186      100.00

. tab hcq_6m if ra_code==1 & has_6m_follow_up==1

Hydroxychlo |
    roquine |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         95       12.62       12.62
         No |        658       87.38      100.00
------------+-----------------------------------
      Total |        753      100.00

. gen hcq_12m=1 if time_to_hcq<=365 & time_to_hcq!=. 
(34,797 missing values generated)

. replace hcq_12m=2 if time_to_hcq>365 & time_to_hcq!=.
(1,697 real changes made)

. lab define hcq_12m 1 "Yes" 2 "No", modify

. lab val hcq_12m hcq_12m

. lab var hcq_12m "Hydroxychloroquine within 12 months" 

. tab hcq_12m if ra_code==1 & has_12m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after hcq script

Hydroxychlo |
    roquine |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        201        1.90        1.90
         No |        507        4.79        6.69
          . |      9,869       93.31      100.00
------------+-----------------------------------
      Total |     10,577      100.00

. tab hcq_12m if ra_code==1 & has_12m_follow_up==1 //for patients with at least 12m registration

Hydroxychlo |
    roquine |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        201       28.39       28.39
         No |        507       71.61      100.00
------------+-----------------------------------
      Total |        708      100.00

. 
. **Hydroxychloroquine time categories for PsA patients
. tab hcq_3m if psa_code==1 & has_6m_follow_up==1, missing

Hydroxychlo |
    roquine |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         50        0.45        0.45
         No |        705        6.33        6.78
          . |     10,383       93.22      100.00
------------+-----------------------------------
      Total |     11,138      100.00

. tab hcq_6m if psa_code==1 & has_6m_follow_up==1, missing

Hydroxychlo |
    roquine |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        110        0.99        0.99
         No |        645        5.79        6.78
          . |     10,383       93.22      100.00
------------+-----------------------------------
      Total |     11,138      100.00

. tab hcq_12m if psa_code==1 & has_12m_follow_up==1, missing //with a least 12m registration

Hydroxychlo |
    roquine |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        219        2.06        2.06
         No |        498        4.69        6.75
          . |      9,899       93.25      100.00
------------+-----------------------------------
      Total |     10,616      100.00

. 
. **Leflunomide use
. gen time_to_lef=(leflunomide_date-rheum_appt_date) if leflunomide==1 & rheum_appt_date!=. & leflunomide_date>rheum_appt_date 
(32,998 missing values generated)

. tabstat time_to_lef if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |       772  586.6554       556     293.5       841
----------------------------------------------------------------

. bys diagnosis_year: tabstat time_to_lef if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by diagnosis year for RA

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |       263  585.8137       537       298       844
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |       240  590.4083     615.5       273     834.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |       231  595.6494       557       326       860
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |        38  514.1053       467       178       748
----------------------------------------------------------------

. bys diagnosis_year: tabstat time_to_lef if psa_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by diagnosis year for PsA

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |       233  603.1974       573       325       863
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |       220  639.2455     624.5       326     966.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |       237  618.7848       617       332       903
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |        33  622.7273       548       401       823
----------------------------------------------------------------

. bys nuts_region: tabstat time_to_lef if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by region for RA

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |        78  629.7821       638       333       836
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |        94  511.9574     458.5       189       769
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |       147  575.8367       509       313       823
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |        74  643.4459       661       368       892
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |        71  590.4507       532       250       919
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |       150  591.7667     555.5       305       847
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |        71  566.7324       575       301       844
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |        87   603.023       558       272       848
----------------------------------------------------------------

. bys nuts_region: tabstat time_to_lef if psa_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by region for PsA

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |        86  618.3721       552       340       942
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |        65  578.4462       524       332       746
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |       167  614.9222       617       308       894
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |        57  620.0526       617       334       908
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |        70  654.8571       661       323      1030
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |       136  639.8456     562.5       357     905.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |        67  568.9701       567       251       796
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |        75  647.8267       702       307       928
----------------------------------------------------------------

. 
. **Leflunomide time categories for RA patients //Nb. this is time period from rheum appt (i.e. diagnosis) to shared care, not from referral to first script 
. gen lef_3m=1 if time_to_lef<=90 & time_to_lef!=. 
(35,329 missing values generated)

. replace lef_3m=2 if time_to_lef>90 & time_to_lef!=.
(2,331 real changes made)

. lab define lef_3m 1 "Yes" 2 "No", modify

. lab val lef_3m lef_3m

. lab var lef_3m "Leflunomide within 3 months" 

. tab lef_3m if ra_code==1 & has_6m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after csDMARD script

Leflunomide |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         57        0.51        0.51
         No |        715        6.39        6.90
          . |     10,414       93.10      100.00
------------+-----------------------------------
      Total |     11,186      100.00

. tab lef_3m if ra_code==1 & has_6m_follow_up==1

Leflunomide |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         57        7.38        7.38
         No |        715       92.62      100.00
------------+-----------------------------------
      Total |        772      100.00

. gen lef_6m=1 if time_to_lef<=180 & time_to_lef!=. 
(35,150 missing values generated)

. replace lef_6m=2 if time_to_lef>180 & time_to_lef!=.
(2,152 real changes made)

. lab define lef_6m 1 "Yes" 2 "No", modify

. lab val lef_6m lef_6m

. lab var lef_6m "Leflunomide within 6 months" 

. tab lef_6m if ra_code==1 & has_6m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after csDMARD script

Leflunomide |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        120        1.07        1.07
         No |        652        5.83        6.90
          . |     10,414       93.10      100.00
------------+-----------------------------------
      Total |     11,186      100.00

. tab lef_6m if ra_code==1 & has_6m_follow_up==1

Leflunomide |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        120       15.54       15.54
         No |        652       84.46      100.00
------------+-----------------------------------
      Total |        772      100.00

. gen lef_12m=1 if time_to_lef<=365 & time_to_lef!=. 
(34,730 missing values generated)

. replace lef_12m=2 if time_to_lef>365 & time_to_lef!=.
(1,732 real changes made)

. lab define lef_12m 1 "Yes" 2 "No", modify

. lab val lef_12m lef_12m

. lab var lef_12m "Leflunomide within 12 months" 

. tab lef_12m if ra_code==1 & has_12m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after lef script

Leflunomide |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        214        2.02        2.02
         No |        504        4.77        6.79
          . |      9,859       93.21      100.00
------------+-----------------------------------
      Total |     10,577      100.00

. tab lef_12m if ra_code==1 & has_12m_follow_up==1 //for patients with at least 12m registration

Leflunomide |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        214       29.81       29.81
         No |        504       70.19      100.00
------------+-----------------------------------
      Total |        718      100.00

. 
. **Leflunomide time categories for PsA patients
. tab lef_3m if psa_code==1 & has_6m_follow_up==1, missing

Leflunomide |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         39        0.35        0.35
         No |        684        6.14        6.49
          . |     10,415       93.51      100.00
------------+-----------------------------------
      Total |     11,138      100.00

. tab lef_6m if psa_code==1 & has_6m_follow_up==1, missing

Leflunomide |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         87        0.78        0.78
         No |        636        5.71        6.49
          . |     10,415       93.51      100.00
------------+-----------------------------------
      Total |     11,138      100.00

. tab lef_12m if psa_code==1 & has_12m_follow_up==1, missing //with a least 12m registration

Leflunomide |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        210        1.98        1.98
         No |        493        4.64        6.62
          . |      9,913       93.38      100.00
------------+-----------------------------------
      Total |     10,616      100.00

. 
. **Time to first biologic script, whereby first rheum appt is classed as diagnosis date (assumes rheum appt present); high_cost drug data available to Nov 2020===============================================================
> =======*/
. 
. *Below analyses are only for patients with at least 12 months of follow-up available after EIA code
. gen time_to_biologic=(biologic_date-rheum_appt_date) if biologic==1 & rheum_appt_date!=. & biologic_date>rheum_appt_date 
(14,301 missing values generated)

. tabstat time_to_biologic if has_12m_follow_up==1, stats (n mean p50 p25 p75) //for all EIA patients

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_bi~c |     19091  458.2699       400       202       664
----------------------------------------------------------------

. bys eia_diagnosis: tabstat time_to_biologic if has_12m_follow_up==1, stats (n mean p50 p25 p75) 

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_bi~c |      6363  458.4358       402       202       663
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_bi~c |      6327  458.6766       399       202       666
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_bi~c |      6401  457.7029       396       202       661
----------------------------------------------------------------

. bys diagnosis_year: tabstat time_to_biologic if ra_code==1 & has_12m_follow_up==1, stats (n mean p50 p25 p75) //by diagnosis year

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_bi~c |      2101  455.0762       403       205       654
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_bi~c |      2058  464.9631       404       205       676
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_bi~c |      1954  454.5496       399       196       657
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_bi~c |       250   463.312       378       194       685
----------------------------------------------------------------

. bys nuts_region: tabstat time_to_biologic if ra_code==1 & has_12m_follow_up==1, stats (n mean p50 p25 p75) //by region

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_bi~c |       637  444.2166       379       186       660
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_bi~c |       676  451.2885       412     206.5     641.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_bi~c |      1228  456.3852     400.5     203.5     653.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_bi~c |       650  454.5969     398.5       207       639
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_bi~c |       623  467.8555       417       226       686
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_bi~c |      1278  454.2402     396.5       198       654
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_bi~c |       645  467.9535       415       189       691
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_bi~c |       626   478.016     423.5       207       714
----------------------------------------------------------------

. 
. **What was first biologic
. gen first_bio=""
(35,482 missing values generated)

. foreach var of varlist abatacept_date adalimumab_date baricitinib_date certolizumab_date etanercept_date golimumab_date guselkumab_date infliximab_date ixekizumab_date rituximab_date sarilumab_date secukinumab_date tocili
> zumab_date tofacitinib_date upadacitinib_date ustekinumab_date {
  2.         replace first_bio="`var'" if biologic_date==`var' & biologic_date!=.
  3.         }
variable first_bio was str1 now str14
(1,664 real changes made)
variable first_bio was str14 now str15
(1,685 real changes made)
variable first_bio was str15 now str16
(1,659 real changes made)
variable first_bio was str16 now str17
(1,709 real changes made)
(1,626 real changes made)
(1,619 real changes made)
(1,680 real changes made)
(1,674 real changes made)
(1,708 real changes made)
(1,696 real changes made)
(1,656 real changes made)
(1,714 real changes made)
(1,664 real changes made)
(1,653 real changes made)
(1,668 real changes made)
(1,576 real changes made)

. gen first_biologic = substr(first_bio, 1, length(first_bio) - 5)        
(9,386 missing values generated)

. drop first_bio

. tab first_biologic if has_12m_follow_up==1 //for all EIA patients

first_biolog |
          ic |      Freq.     Percent        Cum.
-------------+-----------------------------------
   abatacept |      1,452        6.17        6.17
  adalimumab |      1,462        6.21       12.38
 baricitinib |      1,443        6.13       18.51
certolizumab |      1,485        6.31       24.82
  etanercept |      1,413        6.00       30.82
   golimumab |      1,429        6.07       36.89
  guselkumab |      1,472        6.25       43.14
  infliximab |      1,470        6.24       49.39
  ixekizumab |      1,519        6.45       55.84
   rituximab |      1,479        6.28       62.12
   sarilumab |      1,483        6.30       68.42
 secukinumab |      1,540        6.54       74.97
 tocilizumab |      1,467        6.23       81.20
 tofacitinib |      1,493        6.34       87.54
upadacitinib |      1,505        6.39       93.93
 ustekinumab |      1,428        6.07      100.00
-------------+-----------------------------------
       Total |     23,540      100.00

. bys eia_diagnosis: tab first_biologic if has_12m_follow_up==1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

first_biolog |
          ic |      Freq.     Percent        Cum.
-------------+-----------------------------------
   abatacept |        468        6.00        6.00
  adalimumab |        473        6.06       12.06
 baricitinib |        495        6.35       18.41
certolizumab |        498        6.38       24.79
  etanercept |        486        6.23       31.02
   golimumab |        493        6.32       37.34
  guselkumab |        456        5.85       43.19
  infliximab |        448        5.74       48.93
  ixekizumab |        519        6.65       55.58
   rituximab |        486        6.23       61.81
   sarilumab |        481        6.17       67.98
 secukinumab |        491        6.29       74.27
 tocilizumab |        532        6.82       81.09
 tofacitinib |        485        6.22       87.31
upadacitinib |        528        6.77       94.08
 ustekinumab |        462        5.92      100.00
-------------+-----------------------------------
       Total |      7,801      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

first_biolog |
          ic |      Freq.     Percent        Cum.
-------------+-----------------------------------
   abatacept |        501        6.41        6.41
  adalimumab |        483        6.18       12.59
 baricitinib |        473        6.05       18.64
certolizumab |        489        6.26       24.90
  etanercept |        488        6.24       31.15
   golimumab |        448        5.73       36.88
  guselkumab |        492        6.30       43.17
  infliximab |        512        6.55       49.72
  ixekizumab |        501        6.41       56.14
   rituximab |        475        6.08       62.21
   sarilumab |        500        6.40       68.61
 secukinumab |        515        6.59       75.20
 tocilizumab |        459        5.87       81.07
 tofacitinib |        510        6.53       87.60
upadacitinib |        500        6.40       94.00
 ustekinumab |        469        6.00      100.00
-------------+-----------------------------------
       Total |      7,815      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

first_biolog |
          ic |      Freq.     Percent        Cum.
-------------+-----------------------------------
   abatacept |        483        6.10        6.10
  adalimumab |        506        6.39       12.48
 baricitinib |        475        5.99       18.48
certolizumab |        498        6.28       24.76
  etanercept |        439        5.54       30.30
   golimumab |        488        6.16       36.46
  guselkumab |        524        6.61       43.07
  infliximab |        510        6.44       49.51
  ixekizumab |        499        6.30       55.81
   rituximab |        518        6.54       62.34
   sarilumab |        502        6.34       68.68
 secukinumab |        534        6.74       75.42
 tocilizumab |        476        6.01       81.42
 tofacitinib |        498        6.28       87.71
upadacitinib |        477        6.02       93.73
 ustekinumab |        497        6.27      100.00
-------------+-----------------------------------
       Total |      7,924      100.00


. 
. **Biologic time categories (for all patients)
. gen biologic_3m=1 if time_to_biologic<=90 & time_to_biologic!=. 
(33,131 missing values generated)

. replace biologic_3m=2 if time_to_biologic>90 & time_to_biologic!=.
(18,830 real changes made)

. lab define biologic_3m 1 "Yes" 2 "No", modify

. lab val biologic_3m biologic_3m

. lab var biologic_3m "bDMARD/tsDMARD within 3 months" 

. bys eia_diagnosis: tab biologic_3m if has_6m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after bDMARD/tsDMARD script

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

bDMARD/tsDM |
 ARD within |
   3 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        778        6.96        6.96
         No |      5,940       53.10       60.06
          . |      4,468       39.94      100.00
------------+-----------------------------------
      Total |     11,186      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

bDMARD/tsDM |
 ARD within |
   3 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        728        6.54        6.54
         No |      5,921       53.16       59.70
          . |      4,489       40.30      100.00
------------+-----------------------------------
      Total |     11,138      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

bDMARD/tsDM |
 ARD within |
   3 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        711        6.26        6.26
         No |      6,039       53.16       59.42
          . |      4,609       40.58      100.00
------------+-----------------------------------
      Total |     11,359      100.00


. bys eia_diagnosis: tab biologic_3m if has_6m_follow_up==1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

bDMARD/tsDM |
 ARD within |
   3 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        778       11.58       11.58
         No |      5,940       88.42      100.00
------------+-----------------------------------
      Total |      6,718      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

bDMARD/tsDM |
 ARD within |
   3 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        728       10.95       10.95
         No |      5,921       89.05      100.00
------------+-----------------------------------
      Total |      6,649      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

bDMARD/tsDM |
 ARD within |
   3 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        711       10.53       10.53
         No |      6,039       89.47      100.00
------------+-----------------------------------
      Total |      6,750      100.00


. gen biologic_6m=1 if time_to_biologic<=180 & time_to_biologic!=. 
(30,724 missing values generated)

. replace biologic_6m=2 if time_to_biologic>180 & time_to_biologic!=.
(16,423 real changes made)

. lab define biologic_6m 1 "Yes" 2 "No", modify

. lab val biologic_6m biologic_6m

. lab var biologic_6m "bDMARD/tsDMARD within 6 months" 

. bys eia_diagnosis: tab biologic_6m if has_6m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after bDMARD/tsDMARD script

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,513       13.53       13.53
         No |      5,205       46.53       60.06
          . |      4,468       39.94      100.00
------------+-----------------------------------
      Total |     11,186      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,504       13.50       13.50
         No |      5,145       46.19       59.70
          . |      4,489       40.30      100.00
------------+-----------------------------------
      Total |     11,138      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,492       13.13       13.13
         No |      5,258       46.29       59.42
          . |      4,609       40.58      100.00
------------+-----------------------------------
      Total |     11,359      100.00


. bys eia_diagnosis: tab biologic_6m if has_6m_follow_up==1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,513       22.52       22.52
         No |      5,205       77.48      100.00
------------+-----------------------------------
      Total |      6,718      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,504       22.62       22.62
         No |      5,145       77.38      100.00
------------+-----------------------------------
      Total |      6,649      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,492       22.10       22.10
         No |      5,258       77.90      100.00
------------+-----------------------------------
      Total |      6,750      100.00


. gen biologic_12m=1 if time_to_biologic<=365 & time_to_biologic!=. 
(25,755 missing values generated)

. replace biologic_12m=2 if time_to_biologic>365 & time_to_biologic!=.
(11,454 real changes made)

. lab define biologic_12m 1 "Yes" 2 "No", modify

. lab val biologic_12m biologic_12m

. lab var biologic_12m "bDMARD/tsDMARD within 12 months" 

. bys eia_diagnosis: tab biologic_12m if has_12m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after bDMARD/tsDMARD script

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      2,895       27.37       27.37
         No |      3,468       32.79       60.16
          . |      4,214       39.84      100.00
------------+-----------------------------------
      Total |     10,577      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      2,903       27.35       27.35
         No |      3,424       32.25       59.60
          . |      4,289       40.40      100.00
------------+-----------------------------------
      Total |     10,616      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      2,967       27.58       27.58
         No |      3,434       31.92       59.51
          . |      4,356       40.49      100.00
------------+-----------------------------------
      Total |     10,757      100.00


. bys eia_diagnosis: tab biologic_12m if has_12m_follow_up==1 //for patients with at least 12m registration

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      2,895       45.50       45.50
         No |      3,468       54.50      100.00
------------+-----------------------------------
      Total |      6,363      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      2,903       45.88       45.88
         No |      3,424       54.12      100.00
------------+-----------------------------------
      Total |      6,327      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      2,967       46.35       46.35
         No |      3,434       53.65      100.00
------------+-----------------------------------
      Total |      6,401      100.00


. 
. **Biologic time categories (by year)
. bys diagnosis_year: tab biologic_6m if has_6m_follow_up==1, missing //for all EIA patients with at least 6m follow-up

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,477       13.65       13.65
         No |      5,021       46.40       60.05
          . |      4,323       39.95      100.00
------------+-----------------------------------
      Total |     10,821      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,400       13.06       13.06
         No |      4,992       46.58       59.65
          . |      4,324       40.35      100.00
------------+-----------------------------------
      Total |     10,716      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,432       13.44       13.44
         No |      4,908       46.05       59.49
          . |      4,317       40.51      100.00
------------+-----------------------------------
      Total |     10,657      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        200       13.43       13.43
         No |        687       46.14       59.57
          . |        602       40.43      100.00
------------+-----------------------------------
      Total |      1,489      100.00


. bys diagnosis_year eia_diagnosis: tab biologic_6m if has_6m_follow_up==1, missing //for each diagnosis with at least 6m follow-up

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020, eia_diagnosis = RA

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        488       13.36       13.36
         No |      1,730       47.36       60.72
          . |      1,435       39.28      100.00
------------+-----------------------------------
      Total |      3,653      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020, eia_diagnosis = PsA

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        483       13.45       13.45
         No |      1,624       45.22       58.67
          . |      1,484       41.33      100.00
------------+-----------------------------------
      Total |      3,591      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020, eia_diagnosis = AxSpA

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        506       14.15       14.15
         No |      1,667       46.60       60.75
          . |      1,404       39.25      100.00
------------+-----------------------------------
      Total |      3,577      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021, eia_diagnosis = RA

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        468       13.20       13.20
         No |      1,672       47.15       60.35
          . |      1,406       39.65      100.00
------------+-----------------------------------
      Total |      3,546      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021, eia_diagnosis = PsA

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        468       13.46       13.46
         No |      1,624       46.72       60.18
          . |      1,384       39.82      100.00
------------+-----------------------------------
      Total |      3,476      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021, eia_diagnosis = AxSpA

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        464       12.56       12.56
         No |      1,696       45.91       58.47
          . |      1,534       41.53      100.00
------------+-----------------------------------
      Total |      3,694      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022, eia_diagnosis = RA

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        498       14.13       14.13
         No |      1,593       45.19       59.32
          . |      1,434       40.68      100.00
------------+-----------------------------------
      Total |      3,525      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022, eia_diagnosis = PsA

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        482       13.51       13.51
         No |      1,657       46.43       59.93
          . |      1,430       40.07      100.00
------------+-----------------------------------
      Total |      3,569      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022, eia_diagnosis = AxSpA

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        452       12.69       12.69
         No |      1,658       46.53       59.22
          . |      1,453       40.78      100.00
------------+-----------------------------------
      Total |      3,563      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = ., eia_diagnosis = RA

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         59       12.77       12.77
         No |        210       45.45       58.23
          . |        193       41.77      100.00
------------+-----------------------------------
      Total |        462      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = ., eia_diagnosis = PsA

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         71       14.14       14.14
         No |        240       47.81       61.95
          . |        191       38.05      100.00
------------+-----------------------------------
      Total |        502      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = ., eia_diagnosis = AxSpA

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         70       13.33       13.33
         No |        237       45.14       58.48
          . |        218       41.52      100.00
------------+-----------------------------------
      Total |        525      100.00


. bys diagnosis_year: tab biologic_12m if has_12m_follow_up==1, missing //for all EIA patients

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      2,868       27.97       27.97
         No |      3,284       32.03       60.00
          . |      4,101       40.00      100.00
------------+-----------------------------------
      Total |     10,253      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      2,778       27.20       27.20
         No |      3,351       32.81       60.01
          . |      4,084       39.99      100.00
------------+-----------------------------------
      Total |     10,213      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      2,739       27.19       27.19
         No |      3,235       32.12       59.31
          . |      4,098       40.69      100.00
------------+-----------------------------------
      Total |     10,072      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        380       26.91       26.91
         No |        456       32.29       59.21
          . |        576       40.79      100.00
------------+-----------------------------------
      Total |      1,412      100.00


. bys diagnosis_year eia_diagnosis: tab biologic_12m if has_12m_follow_up==1, missing //for each diagnosis

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020, eia_diagnosis = RA

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        951       27.59       27.59
         No |      1,150       33.36       60.95
          . |      1,346       39.05      100.00
------------+-----------------------------------
      Total |      3,447      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020, eia_diagnosis = PsA

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        949       27.52       27.52
         No |      1,073       31.11       58.63
          . |      1,427       41.37      100.00
------------+-----------------------------------
      Total |      3,449      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020, eia_diagnosis = AxSpA

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        968       28.84       28.84
         No |      1,061       31.61       60.44
          . |      1,328       39.56      100.00
------------+-----------------------------------
      Total |      3,357      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021, eia_diagnosis = RA

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        912       27.01       27.01
         No |      1,146       33.94       60.94
          . |      1,319       39.06      100.00
------------+-----------------------------------
      Total |      3,377      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021, eia_diagnosis = PsA

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        912       27.45       27.45
         No |      1,086       32.68       60.13
          . |      1,325       39.87      100.00
------------+-----------------------------------
      Total |      3,323      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021, eia_diagnosis = AxSpA

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        954       27.16       27.16
         No |      1,119       31.85       59.01
          . |      1,440       40.99      100.00
------------+-----------------------------------
      Total |      3,513      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022, eia_diagnosis = RA

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        909       27.37       27.37
         No |      1,045       31.47       58.84
          . |      1,367       41.16      100.00
------------+-----------------------------------
      Total |      3,321      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022, eia_diagnosis = PsA

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        916       27.15       27.15
         No |      1,101       32.63       59.78
          . |      1,357       40.22      100.00
------------+-----------------------------------
      Total |      3,374      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022, eia_diagnosis = AxSpA

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        914       27.07       27.07
         No |      1,089       32.25       59.31
          . |      1,374       40.69      100.00
------------+-----------------------------------
      Total |      3,377      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = ., eia_diagnosis = RA

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        123       28.47       28.47
         No |        127       29.40       57.87
          . |        182       42.13      100.00
------------+-----------------------------------
      Total |        432      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = ., eia_diagnosis = PsA

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        126       26.81       26.81
         No |        164       34.89       61.70
          . |        180       38.30      100.00
------------+-----------------------------------
      Total |        470      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = ., eia_diagnosis = AxSpA

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        131       25.69       25.69
         No |        165       32.35       58.04
          . |        214       41.96      100.00
------------+-----------------------------------
      Total |        510      100.00


. 
. save "$projectdir/output/data/file_eia_all", replace
file C:/Users/k1754142/OneDrive/PhD Project/OpenSAFELY/Github Practice/output/data/file_eia_all.dta saved

. 
. log close
      name:  <unnamed>
       log:  C:/Users/k1754142/OneDrive/PhD Project/OpenSAFELY/Github Practice/logs/cleaning_dataset.log
  log type:  text
 closed on:   6 Apr 2022, 11:37:09
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
