-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:/Users/k1754142/OneDrive/PhD Project/OpenSAFELY/Github Practice/logs/cleaning_dataset.log
  log type:  text
 opened on:  11 Apr 2022, 16:47:51

. 
. di "$projectdir"
C:/Users/k1754142/OneDrive/PhD Project/OpenSAFELY/Github Practice

. di "$logdir"
C:/Users/k1754142/OneDrive/PhD Project/OpenSAFELY/Github Practice/logs

. 
. import delimited "$projectdir/output/input.csv", clear
(66 vars, 100,000 obs)

. 
. **Set Ado file path
. adopath + "$projectdir/analysis/extra_ados"
  [1]  (BASE)      "C:\Program Files\Stata17\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata17\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "C:\Users\k1754142\ado\personal/"
  [5]  (PLUS)      "C:\Users\k1754142\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "C:/Users/k1754142/OneDrive/PhD Project/OpenSAFELY/Github Practice/analysis/extra_ados"

. 
. **Set index dates ===========================================================*/
. global year_preceding = "01/03/2018"

. global start_date = "01/03/2019"

. global outpatient_date = "01/10/2019"

. global end_date = "01/03/2022"

. 
. **Rename variables (some are too long for Stata to handle) =======================================*/
. rename chronic_respiratory_disease chronic_resp_disease

. 
. **Convert date strings to dates ====================================================*/
. ***Some dates are given with month/year only, so adding day 15 to enable them to be processed as dates 
. 
. foreach var of varlist   hba1c_mmol_per_mol_date                        ///
>                                                  hba1c_percentage_date                          ///
>                                                  creatinine_date                                ///
>                                                  bmi_date_measured                          ///
>                                                  abatacept                                                      ///
>                                                  adalimumab                                                     ///     
>                                                  baricitinib                                            ///
>                                                  certolizumab                                           ///
>                                                  etanercept                                                     ///
>                                                  golimumab                                                      ///
>                                                  guselkumab                                                     ///     
>                                                  infliximab                                                     ///
>                                                  ixekizumab                                                     ///
>                                                  methotrexate_hcd                                       ///
>                                                  rituximab                                                      ///
>                                                  sarilumab                                                      ///
>                                                  secukinumab                                            ///     
>                                                  tocilizumab                                            ///
>                                                  tofacitinib                                            ///
>                                                  upadacitinib                                           ///
>                                                  ustekinumab                                            ///
>                                                  {
  2.                                                         
.                 capture confirm string variable `var'
  3.                 if _rc!=0 {
  4.                         assert `var'==.
  5.                         rename `var' `var'_date
  6.                 }
  7.         
.                 else {
  8.                                 replace `var' = `var' + "-15"
  9.                                 rename `var' `var'_dstr
 10.                                 replace `var'_dstr = " " if `var'_dstr == "-15"
 11.                                 gen `var'_date = date(`var'_dstr, "YMD") 
 12.                                 order `var'_date, after(`var'_dstr)
 13.                                 drop `var'_dstr
 14.                 }
 15.         
.         format `var'_date %td
 16. }
variable hba1c_mmol_per_mol_date was str7 now str10
(100,000 real changes made)
(5,000 real changes made)
(5,000 missing values generated)
variable hba1c_percentage_date was str7 now str10
(100,000 real changes made)
(5,000 real changes made)
(5,000 missing values generated)
variable creatinine_date was str7 now str10
(100,000 real changes made)
(5,000 real changes made)
(5,000 missing values generated)
variable bmi_date_measured was str7 now str10
(100,000 real changes made)
(40,000 real changes made)
(40,000 missing values generated)
variable abatacept was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable adalimumab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable baricitinib was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable certolizumab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable etanercept was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable golimumab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable guselkumab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable infliximab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable ixekizumab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable methotrexate_hcd was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable rituximab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable sarilumab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable secukinumab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable tocilizumab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable tofacitinib was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable upadacitinib was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable ustekinumab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)

. 
. **Conversion for dates with day already included ====================================================*/
. 
. foreach var of varlist   died_date_ons                                          ///
>                                              eia_code_date                                              ///
>                                                  rheum_appt_date                                        ///
>                                              ra_code_date                                               ///
>                                                  psa_code_date                                          ///
>                                                  anksp_code_date                                        ///
>                                                  last_gp_prerheum_date                          ///
>                                                  last_gp_precode_date                           ///     
>                                                  last_gp_refrheum_date                          ///
>                                                  last_gp_refcode_date                           ///
>                                                  referral_rheum_prerheum                        ///
>                                                  referral_rheum_precode                         ///     
>                                                  chronic_cardiac_disease                        ///
>                                                  diabetes                                                       ///
>                                                  hypertension                                           ///     
>                                                  chronic_resp_disease                           ///
>                                                  copd                                                           ///
>                                                  chronic_liver_disease                          ///
>                                                  stroke                                                         ///
>                                                  lung_cancer                                            ///
>                                                  haem_cancer                                            ///
>                                                  other_cancer                                           ///
>                                                  esrf                                                           ///
>                                                  organ_transplant                                       ///
>                                                  hydroxychloroquine                                     ///
>                                                  leflunomide                                            ///
>                                                  methotrexate                                           ///
>                                                  methotrexate_inj                                       ///
>                                                  sulfasalazine                                          ///
>                                                  {
  2.                                                                  
.                 capture confirm string variable `var'
  3.                 if _rc!=0 {
  4.                         assert `var'==.
  5.                         rename `var' `var'_date
  6.                 }
  7.         
.                 else {
  8.                                 rename `var' `var'_dstr
  9.                                 gen `var'_date = date(`var'_dstr, "YMD") 
 10.                                 order `var'_date, after(`var'_dstr)
 11.                                 drop `var'_dstr
 12.                                 gen `var'_date15 = `var'_date+15
 13.                                 order `var'_date15, after(`var'_date)
 14.                                 drop `var'_date
 15.                                 rename `var'_date15 `var'_date
 16.                 }
 17.         
.         format `var'_date %td
 18. }
(90,000 missing values generated)
(90,000 missing values generated)
(1,000 missing values generated)
(1,000 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(1,000 missing values generated)
(1,000 missing values generated)
(1,000 missing values generated)
(1,000 missing values generated)
(1,000 missing values generated)
(1,000 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(90,000 missing values generated)
(90,000 missing values generated)
(90,000 missing values generated)
(90,000 missing values generated)
(90,000 missing values generated)
(90,000 missing values generated)
(90,000 missing values generated)
(90,000 missing values generated)
(90,000 missing values generated)
(90,000 missing values generated)

.                                                  
. **Rename variables with extra 'date' added to the end of variable names===========================================================*/ 
. rename rheum_appt_date_date rheum_appt_date

. rename eia_code_date_date eia_code_date

. rename ra_code_date_date ra_code_date

. rename psa_code_date_date psa_code_date

. rename anksp_code_date_date anksp_code_date

. rename died_date_ons_date died_ons_date

. rename last_gp_prerheum_date_date last_gp_prerheum_date

. rename last_gp_refrheum_date_date last_gp_refrheum_date

. rename last_gp_refcode_date_date last_gp_refcode_date

. rename last_gp_precode_date_date last_gp_precode_date

. rename hba1c_mmol_per_mol_date_date hba1c_mmol_per_mol_date

. rename hba1c_percentage_date_date hba1c_percentage_date

. rename creatinine_date_date creatinine_date

. rename creatinine creatinine_value 

. rename bmi_date_measured_date bmi_date

. rename bmi bmi_value

. 
. **Create binary indicator variables for relevant conditions ====================================================*/
. 
. foreach var of varlist   eia_code_date                                          ///
>                                                  rheum_appt_date                                        ///
>                                              ra_code_date                                               ///
>                                                  psa_code_date                                          ///
>                                                  anksp_code_date                                        ///
>                                                  died_ons_date                                          ///
>                                                  last_gp_prerheum_date                          ///
>                                                  last_gp_precode_date                           ///     
>                                                  last_gp_refrheum_date                          ///
>                                                  last_gp_refcode_date                           ///
>                                                  referral_rheum_prerheum_date           ///
>                                                  referral_rheum_precode_date            ///     
>                                                  chronic_cardiac_disease_date           ///
>                                                  diabetes_date                                          ///
>                                                  hypertension_date                                      ///
>                                                  chronic_resp_disease_date                      ///
>                                                  copd_date                                                      ///
>                                                  chronic_liver_disease_date                     ///
>                                                  stroke_date                                            ///
>                                                  lung_cancer_date                                       ///
>                                                  haem_cancer_date                                       ///             
>                                                  other_cancer_date                                      ///
>                                                  esrf_date                                                      ///
>                                                  creatinine_date                                        ///
>                                                  organ_transplant_date                          ///
>                                                  hydroxychloroquine_date                        ///     
>                                                  leflunomide_date                                       ///
>                                                  methotrexate_date                                      ///
>                                                  methotrexate_inj_date                          ///             
>                                                  sulfasalazine_date                                     ///
>                                                  abatacept_date                                         ///
>                                                  adalimumab_date                                        ///
>                                                  baricitinib_date                                       ///
>                                                  certolizumab_date                                      ///
>                                                  etanercept_date                                        ///
>                                                  golimumab_date                                         ///
>                                                  guselkumab_date                                        ///
>                                                  infliximab_date                                        ///
>                                                  ixekizumab_date                                        ///
>                                                  methotrexate_hcd_date                          ///
>                                                  rituximab_date                                         ///             
>                                                  sarilumab_date                                         ///
>                                                  secukinumab_date                                       ///
>                                                  tocilizumab_date                                       ///             
>                                                  tofacitinib_date                                       ///
>                                                  upadacitinib_date                                      ///
>                                                  ustekinumab_date   {                           
  2.         /*date ranges are applied in python, so presence of date indicates presence of 
>           disease in the correct time frame*/ 
.         local newvar =  substr("`var'", 1, length("`var'") - 5)
  3.         gen `newvar' = (`var'!=. )
  4.         order `newvar', after(`var')
  5. }

. 
. **Create and label variables ===========================================================*/
. 
. **Demographics
. ***Sex
. gen male = 1 if sex == "M"
(51,134 missing values generated)

. replace male = 0 if sex == "F"
(51,134 real changes made)

. lab var male "Male"

. lab define male 0 "No" 1 "Yes", modify

. lab val male male

. tab male, missing

       Male |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |     51,134       51.13       51.13
        Yes |     48,866       48.87      100.00
------------+-----------------------------------
      Total |    100,000      100.00

. 
. ***Ethnicity
. replace ethnicity = .u if ethnicity == .
(25,000 real changes made, 25,000 to missing)

. ****rearrange in order of prevalence
. recode ethnicity 2=6 /* mixed to 6 */
(14907 changes made to ethnicity)

. recode ethnicity 3=2 /* south asian to 2 */
(7426 changes made to ethnicity)

. recode ethnicity 4=3 /* black to 3 */
(7562 changes made to ethnicity)

. recode ethnicity 6=4 /* mixed to 4 */
(14907 changes made to ethnicity)

. recode ethnicity 5=4 /* other to 4 */
(7377 changes made to ethnicity)

. 
. label define ethnicity  1 "White"                                       ///
>                                                 2 "Asian/Asian British"         ///
>                                                 3 "Black"                                       ///
>                                                 4 "Mixed/Other"                         ///
>                                                 .u "Missing"

. label values ethnicity ethnicity

. lab var ethnicity "Ethnicity"

. tab ethnicity, missing

          Ethnicity |      Freq.     Percent        Cum.
--------------------+-----------------------------------
              White |     37,728       37.73       37.73
Asian/Asian British |      7,426        7.43       45.15
              Black |      7,562        7.56       52.72
        Mixed/Other |     22,284       22.28       75.00
            Missing |     25,000       25.00      100.00
--------------------+-----------------------------------
              Total |    100,000      100.00

. 
. ***STP 
. rename stp stp_old

. bysort stp_old: gen stp = 1 if _n==1
(99,998 missing values generated)

. replace stp = sum(stp) //
(99,999 real changes made)

. drop stp_old

. 
. ***Regions
. encode region, gen(nuts_region)

. tab region, missing

                  region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
                         |      1,000        1.00        1.00
           East Midlands |      9,693        9.69       10.69
         East of England |     10,041       10.04       20.73
                  London |     19,902       19.90       40.64
              North East |      9,712        9.71       50.35
              North West |      9,915        9.91       60.26
              South East |     19,960       19.96       80.22
           West Midlands |      9,874        9.87       90.10
Yorkshire and the Humber |      9,903        9.90      100.00
-------------------------+-----------------------------------
                   Total |    100,000      100.00

. replace region="Missing" if region==""
(1,000 real changes made)

. 
. ***IMD
. *Reverse the order (so high is more deprived)
. recode imd 5 = 1 4 = 2 3 = 3 2 = 4 1 = 5 0 = .u
(80913 changes made to imd)

. label define imd 1 "1 least deprived" 2 "2" 3 "3" 4 "4" 5 "5 most deprived" .u "Missing"

. label values imd imd 

. lab var imd "Index of multiple deprivation"

. tab imd, missing

        Index of |
        multiple |
     deprivation |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |     18,934       18.93       18.93
               2 |     18,805       18.80       37.74
               3 |     19,087       19.09       56.83
               4 |     19,064       19.06       75.89
 5 most deprived |     19,203       19.20       95.09
         Missing |      4,907        4.91      100.00
-----------------+-----------------------------------
           Total |    100,000      100.00

. 
. ***Age variables
. *Nb. works if ages 18 and over
. *Create categorised age
. drop if age<18 & age !=.
(21,313 observations deleted)

. drop if age>109 & age !=.
(0 observations deleted)

. drop if age==.
(0 observations deleted)

. lab var age "Age"

. 
. recode age 18/39.9999 = 1 /// 
>            40/49.9999 = 2 ///
>                    50/59.9999 = 3 ///
>                60/69.9999 = 4 ///
>                    70/79.9999 = 5 ///
>                    80/max = 6, gen(agegroup) 
(78687 differences between age and agegroup)

. 
. label define agegroup   1 "18-39" ///
>                                                 2 "40-49" ///
>                                                 3 "50-59" ///
>                                                 4 "60-69" ///
>                                                 5 "70-79" ///
>                                                 6 "80+"

.                                                 
. label values agegroup agegroup

. lab var agegroup "Age group"

. tab agegroup, missing

  Age group |      Freq.     Percent        Cum.
------------+-----------------------------------
      18-39 |     28,521       36.25       36.25
      40-49 |     12,782       16.24       52.49
      50-59 |     13,484       17.14       69.63
      60-69 |     10,644       13.53       83.15
      70-79 |      8,330       10.59       93.74
        80+ |      4,926        6.26      100.00
------------+-----------------------------------
      Total |     78,687      100.00

. 
. *Create binary age
. recode age min/69.999 = 0 ///
>            70/max = 1, gen(age70)
(78687 differences between age and age70)

. 
. ***Body Mass Index
. *Recode strange values 
. replace bmi_value = . if bmi_value == 0 
(31,460 real changes made, 31,460 to missing)

. replace bmi_value = . if !inrange(bmi_value, 10, 80)
(299 real changes made, 299 to missing)

. 
. *Restrict to within 10 years of EIA diagnosis date and aged>16 
. codebook bmi_date

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
bmi_date                                                                                                                                                                                                            (unlabeled)
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

                  Type: Numeric daily date (float)

                 Range: [-21900,22750]                Units: 1
       Or equivalently: [15jan1900,15apr2022]         Units: days
         Unique values: 1,468                     Missing .: 31,460/78,687

                  Mean: 244.723 = 01sep1960(+ 17 hours)
             Std. dev.: 12862.1
           Percentiles:       10%        25%        50%        75%        90%
                           -17487     -10912        196      11276      18155
                        15feb1912  15feb1930  15jul1960  15nov1990  15sep2009

. gen bmi_time = (eia_code_date - bmi_date)/365.25
(31,928 missing values generated)

. gen bmi_age = age - bmi_time
(31,928 missing values generated)

. replace bmi_value = . if bmi_age < 16 
(33,370 real changes made, 33,370 to missing)

. replace bmi_value = . if bmi_time > 10 & bmi_time != . 
(8,842 real changes made, 8,842 to missing)

. 
. *Set to missing if no date, and vice versa 
. replace bmi_value = . if bmi_date == . 
(0 real changes made)

. replace bmi_date = . if bmi_value == . 
(42,511 real changes made, 42,511 to missing)

. replace bmi_time = . if bmi_value == . 
(42,507 real changes made, 42,507 to missing)

. replace bmi_age = . if bmi_value == . 
(42,507 real changes made, 42,507 to missing)

. 
. *Create BMI categories
. gen     bmicat = .
(78,687 missing values generated)

. recode  bmicat . = 1 if bmi_value < 18.5
(188 changes made to bmicat)

. recode  bmicat . = 2 if bmi_value < 25
(511 changes made to bmicat)

. recode  bmicat . = 3 if bmi_value < 30
(742 changes made to bmicat)

. recode  bmicat . = 4 if bmi_value < 35
(944 changes made to bmicat)

. recode  bmicat . = 5 if bmi_value < 40
(880 changes made to bmicat)

. recode  bmicat . = 6 if bmi_value < .
(1451 changes made to bmicat)

. replace bmicat = .u if bmi_value >= .
(73,971 real changes made, 73,971 to missing)

. 
. label define bmicat 1 "Underweight (<18.5)"     ///
>                                         2 "Normal (18.5-24.9)"          ///
>                                         3 "Overweight (25-29.9)"        ///
>                                         4 "Obese I (30-34.9)"           ///
>                                         5 "Obese II (35-39.9)"          ///
>                                         6 "Obese III (40+)"                     ///
>                                         .u "Missing"

.                                         
. label values bmicat bmicat

. lab var bmicat "BMI"

. tab bmicat, missing

                 BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |        188        0.24        0.24
  Normal (18.5-24.9) |        511        0.65        0.89
Overweight (25-29.9) |        742        0.94        1.83
   Obese I (30-34.9) |        944        1.20        3.03
  Obese II (35-39.9) |        880        1.12        4.15
     Obese III (40+) |      1,451        1.84        5.99
             Missing |     73,971       94.01      100.00
---------------------+-----------------------------------
               Total |     78,687      100.00

. 
. *Create less granular categorisation
. recode bmicat 1/3 .u = 1 4 = 2 5 = 3 6 = 4, gen(obese4cat)
(78499 differences between bmicat and obese4cat)

. 
. label define obese4cat  1 "No record of obesity"        ///
>                                                 2 "Obese I (30-34.9)"           ///
>                                                 3 "Obese II (35-39.9)"          ///
>                                                 4 "Obese III (40+)"             

. 
. label values obese4cat obese4cat

. order obese4cat, after(bmicat)

. 
. ***Smoking 
. label define smoke 1 "Never" 2 "Former" 3 "Current" .u "Missing"

. 
. gen     smoke = 1  if smoking_status == "N"
(70,868 missing values generated)

. replace smoke = 2  if smoking_status == "E"
(3,841 real changes made)

. replace smoke = 3  if smoking_status == "S"
(23,754 real changes made)

. replace smoke = .u if smoking_status == "M"
(3,929 real changes made, 3,929 to missing)

. replace smoke = .u if smoking_status == "" 
(39,344 real changes made, 39,344 to missing)

. 
. label values smoke smoke

. lab var smoke "Smoking status"

. drop smoking_status

. tab smoke, missing

    Smoking |
     status |      Freq.     Percent        Cum.
------------+-----------------------------------
      Never |      7,819        9.94        9.94
     Former |      3,841        4.88       14.82
    Current |     23,754       30.19       45.01
    Missing |     43,273       54.99      100.00
------------+-----------------------------------
      Total |     78,687      100.00

. 
. *Create non-missing 3-category variable for current smoking (assumes missing smoking is never smoking)
. recode smoke .u = 1, gen(smoke_nomiss)
(43273 differences between smoke and smoke_nomiss)

. order smoke_nomiss, after(smoke)

. label values smoke_nomiss smoke

. 
. **Clinical comorbidities
. ***eGFR
. *Set implausible creatinine values to missing (Note: zero changed to missing)
. codebook creatinine_value

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
creatinine_value                                                                                                                                                                                                    (unlabeled)
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

                  Type: Numeric (float)

                 Range: [-293.72614,504.10419]        Units: 1.000e-10
         Unique values: 74,675                    Missing .: 0/78,687

                  Mean:  94.5881
             Std. dev.:  99.8838

           Percentiles:      10%       25%       50%       75%       90%
                        -25.9474   18.9986   93.3018    163.21   224.962

. replace creatinine_value = . if !inrange(creatinine_value, 20, 3000) 
(19,903 real changes made, 19,903 to missing)

. codebook creatinine_value

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
creatinine_value                                                                                                                                                                                                    (unlabeled)
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

                  Type: Numeric (float)

                 Range: [20.005514,504.10419]         Units: 1.000e-06
         Unique values: 58,725                    Missing .: 19,903/78,687

                  Mean: 136.619
             Std. dev.: 75.4128

           Percentiles:     10%       25%       50%       75%       90%
                        44.5443   76.9755   126.758   185.143   240.995

. 
. *Remove creatinine dates if no measurements, and vice versa 
. replace creatinine_value = . if creatinine_date == . 
(0 real changes made)

. replace creatinine_date = . if creatinine_value == . 
(15,952 real changes made, 15,952 to missing)

. replace creatinine = . if creatinine_value == .
(19,903 real changes made, 19,903 to missing)

. recode creatinine .=0
(19903 changes made to creatinine)

. tab creatinine, missing

 creatinine |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     19,903       25.29       25.29
          1 |     58,784       74.71      100.00
------------+-----------------------------------
      Total |     78,687      100.00

. tabstat creatinine_value, stat(n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
creatinin~ue |     58784  136.6191  126.7578  76.97551  185.1433
----------------------------------------------------------------

. 
. *Divide by 88.4 (to convert umol/l to mg/dl) 
. gen SCr_adj = creatinine_value/88.4
(19,903 missing values generated)

. 
. gen min = .
(78,687 missing values generated)

. replace min = SCr_adj/0.7 if male==0
(29,943 real changes made)

. replace min = SCr_adj/0.9 if male==1
(28,841 real changes made)

. replace min = min^-0.329  if male==0
(29,943 real changes made)

. replace min = min^-0.411  if male==1
(28,841 real changes made)

. replace min = 1 if min<1
(45,877 real changes made)

. 
. gen max=.
(78,687 missing values generated)

. replace max=SCr_adj/0.7 if male==0
(29,943 real changes made)

. replace max=SCr_adj/0.9 if male==1
(28,841 real changes made)

. replace max=max^-1.209
(58,784 real changes made)

. replace max=1 if max>1
(32,810 real changes made)

. 
. gen egfr=min*max*141
(19,903 missing values generated)

. replace egfr=egfr*(0.993^age)
(58,784 real changes made)

. replace egfr=egfr*1.018 if male==0
(29,943 real changes made)

. label var egfr "egfr calculated using CKD-EPI formula with no ethnicity"

. codebook egfr

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
egfr                                                                                                                                                                    egfr calculated using CKD-EPI formula with no ethnicity
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

                  Type: Numeric (float)

                 Range: [7.8470869,215.75238]         Units: 1.000e-07
         Unique values: 58,725                    Missing .: 19,903/78,687

                  Mean: 62.5533
             Std. dev.: 39.6753

           Percentiles:     10%       25%       50%       75%       90%
                        21.7993   30.7138   49.6093    89.497   123.333

. tabstat egfr, stat(n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
        egfr |     58784  62.55332  49.60926  30.71379  89.49704
----------------------------------------------------------------

. 
. *Categorise into ckd stages
. egen egfr_cat_all = cut(egfr), at(0, 15, 30, 45, 60, 5000)
(19,903 missing values generated)

. recode egfr_cat_all 0 = 5 15 = 4 30 = 3 45 = 2 60 = 0, generate(ckd_egfr)
(58784 differences between egfr_cat_all and ckd_egfr)

. tab egfr_cat_all, missing

egfr_cat_al |
          l |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,172        1.49        1.49
         15 |     12,818       16.29       17.78
         30 |     12,458       15.83       33.61
         45 |      8,313       10.56       44.18
         60 |     24,023       30.53       74.71
          . |     19,903       25.29      100.00
------------+-----------------------------------
      Total |     78,687      100.00

. 
. gen egfr_cat = .
(78,687 missing values generated)

. recode egfr_cat . = 3 if egfr < 30
(13990 changes made to egfr_cat)

. recode egfr_cat . = 2 if egfr < 60
(20771 changes made to egfr_cat)

. recode egfr_cat . = 1 if egfr < .
(24023 changes made to egfr_cat)

. replace egfr_cat = .u if egfr >= .
(19,903 real changes made, 19,903 to missing)

. 
. label define egfr_cat   1 ">=60"                ///
>                                                 2 "30-59"               ///
>                                                 3 "<30"                 ///
>                                                 .u "Missing"

.                                         
. label values egfr_cat egfr_cat

. lab var egfr_cat "eGFR"

. tab egfr_cat, missing

       eGFR |      Freq.     Percent        Cum.
------------+-----------------------------------
       >=60 |     24,023       30.53       30.53
      30-59 |     20,771       26.40       56.93
        <30 |     13,990       17.78       74.71
    Missing |     19,903       25.29      100.00
------------+-----------------------------------
      Total |     78,687      100.00

. 
. *If missing eGFR, assume normal
. gen egfr_cat_nomiss = egfr_cat
(19,903 missing values generated)

. replace egfr_cat_nomiss = 1 if egfr_cat == .u
(19,903 real changes made)

. 
. label define egfr_cat_nomiss    1 ">=60/missing"        ///
>                                                                 2 "30-59"                       ///
>                                                                 3 "<30" 

. label values egfr_cat_nomiss egfr_cat_nomiss

. lab var egfr_cat_nomiss "eGFR"

. tab egfr_cat_nomiss, missing

        eGFR |      Freq.     Percent        Cum.
-------------+-----------------------------------
>=60/missing |     43,926       55.82       55.82
       30-59 |     20,771       26.40       82.22
         <30 |     13,990       17.78      100.00
-------------+-----------------------------------
       Total |     78,687      100.00

. 
. gen egfr_date = creatinine_date
(19,903 missing values generated)

. format egfr_date %td

. 
. *Add in end stage renal failure and create a single CKD variable 
. *Missing assumed to not have CKD 
. gen ckd = 0

. replace ckd = 1 if ckd_egfr != . & ckd_egfr >= 1
(34,761 real changes made)

. replace ckd = 1 if esrf == 1
(8,718 real changes made)

. 
. label define ckd 0 "No CKD" 1 "CKD"

. label values ckd ckd

. label var ckd "Chronic kidney disease"

. tab ckd, missing

    Chronic |
     kidney |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
     No CKD |     35,208       44.74       44.74
        CKD |     43,479       55.26      100.00
------------+-----------------------------------
      Total |     78,687      100.00

. 
. *Create date (most recent measure prior to index)
. gen temp1_ckd_date = creatinine_date if ckd_egfr >=1
(43,926 missing values generated)

. gen temp2_ckd_date = esrf_date if esrf == 1
(62,948 missing values generated)

. gen ckd_date = max(temp1_ckd_date,temp2_ckd_date) 
(35,208 missing values generated)

. format ckd_date %td 

. 
. drop temp1_ckd_date temp2_ckd_date SCr_adj min max ckd_egfr egfr_cat_all

. 
. ***HbA1c
. *Set zero or negative to missing
. replace hba1c_percentage   = . if hba1c_percentage <= 0
(4,443 real changes made, 4,443 to missing)

. replace hba1c_mmol_per_mol = . if hba1c_mmol_per_mol <= 0
(5,701 real changes made, 5,701 to missing)

. 
. *Change implausible values to missing
. replace hba1c_percentage   = . if !inrange(hba1c_percentage, 1, 20)
(1,215 real changes made, 1,215 to missing)

. replace hba1c_mmol_per_mol = . if !inrange(hba1c_mmol_per_mol, 10, 200)
(3,322 real changes made, 3,322 to missing)

. 
. *Set most recent values of >24 months prior to EIA diagnosis date to missing
. replace hba1c_percentage   = . if (eia_code_date - hba1c_percentage_date) > 24*30 & hba1c_percentage_date != .
(70,724 real changes made, 70,724 to missing)

. replace hba1c_mmol_per_mol = . if (eia_code_date - hba1c_mmol_per_mol_date) > 24*30 & hba1c_mmol_per_mol_date != .
(67,390 real changes made, 67,390 to missing)

. 
. *Clean up dates
. replace hba1c_percentage_date = . if hba1c_percentage == .
(72,402 real changes made, 72,402 to missing)

. replace hba1c_mmol_per_mol_date = . if hba1c_mmol_per_mol == .
(72,465 real changes made, 72,465 to missing)

. 
. *Express  HbA1c as percentage
. *Express all values as perecentage 
. noi summ hba1c_percentage hba1c_mmol_per_mol 

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
hba1c_per~ge |      2,305    5.130296    1.854613   1.015584   12.81997
hba1c_mmol~l |      2,274    42.73847    17.58738   10.05758   111.5655

. gen     hba1c_pct = hba1c_percentage 
(76,382 missing values generated)

. replace hba1c_pct = (hba1c_mmol_per_mol/10.929)+2.15 if hba1c_mmol_per_mol<. 
(2,274 real changes made)

. 
. *Valid % range between 0-20  
. replace hba1c_pct = . if !inrange(hba1c_pct, 1, 20) 
(0 real changes made)

. replace hba1c_pct = round(hba1c_pct, 0.1)
(4,506 real changes made)

. 
. *Categorise HbA1c and diabetes
. *Group hba1c pct
. gen     hba1ccat = 0 if hba1c_pct <  6.5
(75,579 missing values generated)

. replace hba1ccat = 1 if hba1c_pct >= 6.5  & hba1c_pct < 7.5
(704 real changes made)

. replace hba1ccat = 2 if hba1c_pct >= 7.5  & hba1c_pct < 8
(256 real changes made)

. replace hba1ccat = 3 if hba1c_pct >= 8    & hba1c_pct < 9
(272 real changes made)

. replace hba1ccat = 4 if hba1c_pct >= 9    & hba1c_pct !=.
(166 real changes made)

. label define hba1ccat 0 "<6.5%" 1">=6.5-7.4" 2">=7.5-7.9" 3">=8-8.9" 4">=9"

. label values hba1ccat hba1ccat

. tab hba1ccat, missing

   hba1ccat |      Freq.     Percent        Cum.
------------+-----------------------------------
      <6.5% |      3,108        3.95        3.95
  >=6.5-7.4 |        704        0.89        4.84
  >=7.5-7.9 |        256        0.33        5.17
    >=8-8.9 |        272        0.35        5.52
        >=9 |        166        0.21        5.73
          . |     74,181       94.27      100.00
------------+-----------------------------------
      Total |     78,687      100.00

. 
. *Express all values as mmol
. gen hba1c_mmol = hba1c_mmol_per_mol
(76,413 missing values generated)

. replace hba1c_mmol = (hba1c_percentage*10.929)-23.5 if hba1c_percentage<. & hba1c_mmol==.
(2,232 real changes made)

. 
. *Group hba1c mmol
. gen     hba1ccatmm = 0 if hba1c_mmol < 58
(74,870 missing values generated)

. replace hba1ccatmm = 1 if hba1c_mmol >= 58 & hba1c_mmol !=.
(689 real changes made)

. replace hba1ccatmm =.u if hba1ccatmm==. 
(74,181 real changes made, 74,181 to missing)

. label define hba1ccatmm 0 "HbA1c <58mmol/mol" 1 "HbA1c >=58mmol/mol" .u "Missing"

. label values hba1ccatmm hba1ccatmm

. lab var hba1ccatmm "HbA1c"

. tab hba1ccatmm, missing

             HbA1c |      Freq.     Percent        Cum.
-------------------+-----------------------------------
 HbA1c <58mmol/mol |      3,817        4.85        4.85
HbA1c >=58mmol/mol |        689        0.88        5.73
           Missing |     74,181       94.27      100.00
-------------------+-----------------------------------
             Total |     78,687      100.00

. 
. *Create diabetes, split by control/not (assumes missing = no diabetes)
. gen     diabcatm = 1 if diabetes==0
(15,744 missing values generated)

. replace diabcatm = 2 if diabetes==1 & hba1ccatmm==0
(751 real changes made)

. replace diabcatm = 3 if diabetes==1 & hba1ccatmm==1
(129 real changes made)

. replace diabcatm = 4 if diabetes==1 & hba1ccatmm==.u
(14,864 real changes made)

. 
. label define diabcatm   1 "No diabetes"                         ///
>                                                 2 "Diabetes with HbA1c <58mmol/mol"             ///
>                                                 3 "Diabetes with HbA1c >58mmol/mol"     ///
>                                                 4 "Diabetes with no HbA1c measure"

. label values diabcatm diabcatm

. lab var diabcatm "Diabetes"

. 
. *Create cancer variable 'other cancer currently', includes carcinoma of the head and neck - need to confirm if this excludes NMSC
. gen cancer =0

. replace cancer =1 if lung_cancer ==1 | haem_cancer ==1 | other_cancer ==1
(38,469 real changes made)

. lab var cancer "Cancer"

. tab cancer, missing

     Cancer |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     40,218       51.11       51.11
          1 |     38,469       48.89      100.00
------------+-----------------------------------
      Total |     78,687      100.00

. 
. *Create other comorbid variables
. gen combined_cv_comorbid =1 if chronic_cardiac_disease ==1 | stroke==1
(50,471 missing values generated)

. recode combined_cv_comorbid .=0
(50471 changes made to combined_cv_comorbid)

. 
. *Label variables
. lab var hypertension "Hypertension"

. lab var diabetes "Diabetes"

. lab var stroke "Stroke"

. lab var chronic_resp_disease "Chronic respiratory disease"

. lab var copd "COPD"

. lab var esrf "End-stage renal failure"

. lab var chronic_liver_disease "Chronic liver disease"

. lab var chronic_cardiac_disease "Chronic cardiac disease"

. 
. drop age

. 
. *Refine diagnostic window=============================================================*/
. 
. **All patients should have EIA code
. tab eia_code, missing

   eia_code |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        798        1.01        1.01
          1 |     77,889       98.99      100.00
------------+-----------------------------------
      Total |     78,687      100.00

. keep if eia_code==1
(798 observations deleted)

. 
. **Keep patients with first EIA code in GP record if code was after 1st March 2019
. keep if eia_code_date>=date("$start_date", "DMY") & eia_code_date!=. 
(17,913 observations deleted)

. tab eia_code

   eia_code |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     59,976      100.00      100.00
------------+-----------------------------------
      Total |     59,976      100.00

. keep if eia_code_date<=date("$end_date", "DMY") & eia_code_date!=. 
(2,924 observations deleted)

. 
. **Month/Year of EIA code
. gen year_diag=year(eia_code_date)

. format year_diag %ty

. gen month_diag=month(eia_code_date)

. gen mo_year_diagn=ym(year_diag, month_diag)

. format mo_year_diagn %tm

. generate str16 mo_year_diagn_s = strofreal(mo_year_diagn,"%tmCCYY!mNN")

. 
. *Include only most recent EIA sub-diagnosis=============================================*/
. 
. replace ra_code =0 if psa_code_date > ra_code_date & psa_code_date !=.
(28,112 real changes made)

. replace ra_code =0 if anksp_code_date > ra_code_date & anksp_code_date !=.
(9,467 real changes made)

. replace psa_code =0 if ra_code_date >= psa_code_date & ra_code_date !=.
(27,833 real changes made)

. replace psa_code =0 if anksp_code_date > psa_code_date & anksp_code_date !=.
(9,505 real changes made)

. replace anksp_code =0 if psa_code_date >= anksp_code_date & psa_code_date !=.
(28,061 real changes made)

. replace anksp_code =0 if ra_code_date >= anksp_code_date & ra_code_date !=.
(9,422 real changes made)

. gen eia_diagnosis=1 if ra_code==1
(38,126 missing values generated)

. replace eia_diagnosis=2 if psa_code==1
(19,149 real changes made)

. replace eia_diagnosis=3 if anksp_code==1
(18,977 real changes made)

. lab define eia_diagnosis 1 "RA" 2 "PsA" 3 "AxSpA", modify

. lab val eia_diagnosis eia_diagnosis

. tab eia_diagnosis, missing

eia_diagnos |
         is |      Freq.     Percent        Cum.
------------+-----------------------------------
         RA |     18,926       33.17       33.17
        PsA |     19,149       33.56       66.74
      AxSpA |     18,977       33.26      100.00
------------+-----------------------------------
      Total |     57,052      100.00

. drop if eia_diagnosis==. //should be ~none
(0 observations deleted)

. 
. *Define drugs and dates=====================================================*/
. 
. **csDMARDs (not including high cost MTX; wouldn't be shared care)
. gen csdmard=1 if hydroxychloroquine==1 | leflunomide==1 | methotrexate==1 | methotrexate_inj==1 | sulfasalazine==1
(33,672 missing values generated)

. recode csdmard .=0 
(33672 changes made to csdmard)

. tab csdmard, missing

    csdmard |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     33,672       59.02       59.02
          1 |     23,380       40.98      100.00
------------+-----------------------------------
      Total |     57,052      100.00

. bys eia_diagnosis: tab csdmard

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

    csdmard |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     11,133       58.82       58.82
          1 |      7,793       41.18      100.00
------------+-----------------------------------
      Total |     18,926      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    csdmard |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     11,295       58.98       58.98
          1 |      7,854       41.02      100.00
------------+-----------------------------------
      Total |     19,149      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    csdmard |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     11,244       59.25       59.25
          1 |      7,733       40.75      100.00
------------+-----------------------------------
      Total |     18,977      100.00


. 
. **csDMARDs (including high cost MTX)
. gen csdmard_hcd=1 if hydroxychloroquine==1 | leflunomide==1 | methotrexate==1 | methotrexate_inj==1 | methotrexate_hcd==1 | sulfasalazine==1
(30,322 missing values generated)

. recode csdmard_hcd .=0 
(30322 changes made to csdmard_hcd)

. tab csdmard_hcd, missing

csdmard_hcd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,322       53.15       53.15
          1 |     26,730       46.85      100.00
------------+-----------------------------------
      Total |     57,052      100.00

. bys eia_diagnosis: tab csdmard_hcd, missing

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

csdmard_hcd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,020       52.94       52.94
          1 |      8,906       47.06      100.00
------------+-----------------------------------
      Total |     18,926      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

csdmard_hcd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,174       53.13       53.13
          1 |      8,975       46.87      100.00
------------+-----------------------------------
      Total |     19,149      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

csdmard_hcd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,128       53.37       53.37
          1 |      8,849       46.63      100.00
------------+-----------------------------------
      Total |     18,977      100.00


. 
. **Date of first csDMARD script (not including high cost MTX prescriptions)
. gen csdmard_date=min(hydroxychloroquine_date, leflunomide_date, methotrexate_date, methotrexate_inj_date, sulfasalazine_date)
(33,672 missing values generated)

. format %td csdmard_date

. 
. **Date of first csDMARD script (including high cost MTX prescriptions)
. gen csdmard_hcd_date=min(hydroxychloroquine_date, leflunomide_date, methotrexate_date, methotrexate_inj_date, methotrexate_hcd_date, sulfasalazine_date)
(30,322 missing values generated)

. format %td csdmard_hcd_date

. 
. **Biologic use
. gen biologic=1 if abatacept==1 | adalimumab==1 | baricitinib==1 | certolizumab==1 | etanercept==1 | golimumab==1 | guselkumab==1 | infliximab==1 | ixekizumab==1 | rituximab==1 | sarilumab==1 | secukinumab==1 | tocilizumab
> ==1 | tofacitinib==1 | upadacitinib==1 | ustekinumab==1 
(10,590 missing values generated)

. recode biologic .=0
(10590 changes made to biologic)

. tab biologic, missing

   biologic |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,590       18.56       18.56
          1 |     46,462       81.44      100.00
------------+-----------------------------------
      Total |     57,052      100.00

. bys eia_diagnosis: tab biologic, missing 

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

   biologic |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,471       18.34       18.34
          1 |     15,455       81.66      100.00
------------+-----------------------------------
      Total |     18,926      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

   biologic |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,577       18.68       18.68
          1 |     15,572       81.32      100.00
------------+-----------------------------------
      Total |     19,149      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

   biologic |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,542       18.66       18.66
          1 |     15,435       81.34      100.00
------------+-----------------------------------
      Total |     18,977      100.00


. 
. **Date of first biologic script
. gen biologic_date=min(abatacept_date, adalimumab_date, baricitinib_date, certolizumab_date, etanercept_date, golimumab_date, guselkumab_date, infliximab_date, ixekizumab_date, rituximab_date, sarilumab_date, secukinumab_d
> ate, tocilizumab_date, tofacitinib_date, upadacitinib_date, ustekinumab_date)
(10,590 missing values generated)

. format %td biologic_date

. 
. **Exclude if first csdmard or biologic was before first rheum appt
. ***Nb. could introduce leeway e.g. 30 days?
. tab csdmard if rheum_appt_date!=. & csdmard_date!=. & csdmard_date<rheum_appt_date

    csdmard |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      8,501      100.00      100.00
------------+-----------------------------------
      Total |      8,501      100.00

. tab csdmard if rheum_appt_date!=. & csdmard_date!=. & (csdmard_date + 60)<rheum_appt_date 

    csdmard |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      7,679      100.00      100.00
------------+-----------------------------------
      Total |      7,679      100.00

. drop if rheum_appt_date!=. & csdmard_date!=. & (csdmard_date + 60)<rheum_appt_date
(7,679 observations deleted)

. tab biologic if rheum_appt_date!=. & biologic_date!=. & biologic_date<rheum_appt_date 

   biologic |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     15,282      100.00      100.00
------------+-----------------------------------
      Total |     15,282      100.00

. tab biologic if rheum_appt_date!=. & biologic_date!=. & (biologic_date + 60)<rheum_appt_date 

   biologic |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     13,885      100.00      100.00
------------+-----------------------------------
      Total |     13,885      100.00

. drop if rheum_appt_date!=. & biologic_date!=. & (biologic_date + 60)<rheum_appt_date 
(13,885 observations deleted)

. 
. *Number of EIA diagnoses in 1-year time windows=========================================*/
. 
. gen diagnosis_year=1 if eia_code_date>=td(01mar2019) & eia_code_date<td(01mar2020)
(23,608 missing values generated)

. replace diagnosis_year=2 if eia_code_date>=td(01mar2020) & eia_code_date<td(01mar2021)
(11,961 real changes made)

. replace diagnosis_year=3 if eia_code_date>=td(01mar2021) & eia_code_date<=td(01mar2022)
(11,647 real changes made)

. lab define diagnosis_year 1 "March 2019-March 2020" 2 "March 2020-March 2021" 3 "March 2021-March 2022", modify

. lab val diagnosis_year diagnosis_year

. lab var diagnosis_year "Year of diagnosis"

. tab diagnosis_year, missing

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |     11,880       33.48       33.48
March 2020-March 2021 |     11,961       33.70       67.18
March 2021-March 2022 |     11,647       32.82      100.00
----------------------+-----------------------------------
                Total |     35,488      100.00

. bys eia_diagnosis: tab diagnosis_year, missing

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |      3,903       33.18       33.18
March 2020-March 2021 |      4,007       34.06       67.24
March 2021-March 2022 |      3,854       32.76      100.00
----------------------+-----------------------------------
                Total |     11,764      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |      3,985       33.45       33.45
March 2020-March 2021 |      3,973       33.35       66.81
March 2021-March 2022 |      3,954       33.19      100.00
----------------------+-----------------------------------
                Total |     11,912      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |      3,992       33.80       33.80
March 2020-March 2021 |      3,981       33.70       67.50
March 2021-March 2022 |      3,839       32.50      100.00
----------------------+-----------------------------------
                Total |     11,812      100.00


. 
. **Proportion of patients with at least 6 or 12 months of GP follow-up after EIA code
. tab has_6m_follow_up

has_6m_foll |
      ow_up |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,741        4.91        4.91
          1 |     33,747       95.09      100.00
------------+-----------------------------------
      Total |     35,488      100.00

. tab has_12m_follow_up

has_12m_fol |
     low_up |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,565       10.05       10.05
          1 |     31,923       89.95      100.00
------------+-----------------------------------
      Total |     35,488      100.00

. tab mo_year_diagn has_6m_follow_up

mo_year_di |   has_6m_follow_up
       agn |         0          1 |     Total
-----------+----------------------+----------
    2019m3 |        57        931 |       988 
    2019m4 |        44        905 |       949 
    2019m5 |        53        925 |       978 
    2019m6 |        51        910 |       961 
    2019m7 |        50        999 |     1,049 
    2019m8 |        45        944 |       989 
    2019m9 |        34        950 |       984 
   2019m10 |        36        936 |       972 
   2019m11 |        50        912 |       962 
   2019m12 |        35      1,036 |     1,071 
    2020m1 |        51        960 |     1,011 
    2020m2 |        61        905 |       966 
    2020m3 |        48        997 |     1,045 
    2020m4 |        53        972 |     1,025 
    2020m5 |        57        951 |     1,008 
    2020m6 |        48        907 |       955 
    2020m7 |        55      1,003 |     1,058 
    2020m8 |        47        948 |       995 
    2020m9 |        52        899 |       951 
   2020m10 |        57        943 |     1,000 
   2020m11 |        45        964 |     1,009 
   2020m12 |        43        958 |     1,001 
    2021m1 |        51        943 |       994 
    2021m2 |        46        874 |       920 
    2021m3 |        54        943 |       997 
    2021m4 |        45        910 |       955 
    2021m5 |        34        957 |       991 
    2021m6 |        44        925 |       969 
    2021m7 |        55      1,001 |     1,056 
    2021m8 |        37        958 |       995 
    2021m9 |        53        903 |       956 
   2021m10 |        53        885 |       938 
   2021m11 |        47        932 |       979 
   2021m12 |        46        885 |       931 
    2022m1 |        53        882 |       935 
    2022m2 |        48        863 |       911 
    2022m3 |         3         31 |        34 
-----------+----------------------+----------
     Total |     1,741     33,747 |    35,488 

. tab mo_year_diagn has_12m_follow_up

mo_year_di |   has_12m_follow_up
       agn |         0          1 |     Total
-----------+----------------------+----------
    2019m3 |       102        886 |       988 
    2019m4 |        87        862 |       949 
    2019m5 |       117        861 |       978 
    2019m6 |       105        856 |       961 
    2019m7 |        95        954 |     1,049 
    2019m8 |       100        889 |       989 
    2019m9 |       107        877 |       984 
   2019m10 |        97        875 |       972 
   2019m11 |        79        883 |       962 
   2019m12 |       106        965 |     1,071 
    2020m1 |       115        896 |     1,011 
    2020m2 |        84        882 |       966 
    2020m3 |       109        936 |     1,045 
    2020m4 |       119        906 |     1,025 
    2020m5 |       104        904 |     1,008 
    2020m6 |        98        857 |       955 
    2020m7 |       109        949 |     1,058 
    2020m8 |       104        891 |       995 
    2020m9 |        95        856 |       951 
   2020m10 |        76        924 |     1,000 
   2020m11 |       104        905 |     1,009 
   2020m12 |        85        916 |     1,001 
    2021m1 |       101        893 |       994 
    2021m2 |        88        832 |       920 
    2021m3 |       109        888 |       997 
    2021m4 |       107        848 |       955 
    2021m5 |        86        905 |       991 
    2021m6 |        90        879 |       969 
    2021m7 |        98        958 |     1,056 
    2021m8 |       110        885 |       995 
    2021m9 |        97        859 |       956 
   2021m10 |        97        841 |       938 
   2021m11 |        90        889 |       979 
   2021m12 |        92        839 |       931 
    2022m1 |       110        825 |       935 
    2022m2 |        87        824 |       911 
    2022m3 |         6         28 |        34 
-----------+----------------------+----------
     Total |     3,565     31,923 |    35,488 

. tab diagnosis_year if has_6m_follow_up==1, missing

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |     11,313       33.52       33.52
March 2020-March 2021 |     11,359       33.66       67.18
March 2021-March 2022 |     11,075       32.82      100.00
----------------------+-----------------------------------
                Total |     33,747      100.00

. tab diagnosis_year if has_12m_follow_up==1, missing

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |     10,686       33.47       33.47
March 2020-March 2021 |     10,769       33.73       67.21
March 2021-March 2022 |     10,468       32.79      100.00
----------------------+-----------------------------------
                Total |     31,923      100.00

. 
. *Define appointments and referrals======================================*/
. **Nb. not excluding those without 6m+ follow-up
. 
. **Rheumatology appt 
. tab rheum_appt, missing //proportion of patients with a rheum outpatient date in the two years before EIA code appeared in GP record; but, data only from April 2019 onwards

 rheum_appt |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,699       16.06       16.06
          1 |     29,789       83.94      100.00
------------+-----------------------------------
      Total |     35,488      100.00

. tab rheum_appt if eia_code_date>=date("$outpatient_date", "DMY"), missing //proportion of patients with a code date from Oct 2019 onward with a rheum outpatient date in the two years before EIA code appeared in GP record 
> (i.e. 6m+ preceding)

 rheum_appt |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,579       16.02       16.02
          1 |     24,011       83.98      100.00
------------+-----------------------------------
      Total |     28,590      100.00

. 
. **Check timeframe of rheum appt relative to EIA codebook
. tab rheum_appt if eia_code_date>=date("$outpatient_date", "DMY") & rheum_appt_date>eia_code_date & rheum_appt_date!=. //confirm proportion who had rheum appt (i.e. not missing) and appt after EIA code

 rheum_appt |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      3,467      100.00      100.00
------------+-----------------------------------
      Total |      3,467      100.00

. tab rheum_appt if eia_code_date>=date("$outpatient_date", "DMY") & rheum_appt_date>(eia_code_date + 30) & rheum_appt_date!=. //confirm proportion who had rheum appt 30 days after EIA code 

 rheum_appt |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      3,190      100.00      100.00
------------+-----------------------------------
      Total |      3,190      100.00

. tab rheum_appt if eia_code_date>=date("$outpatient_date", "DMY") & rheum_appt_date>(eia_code_date + 60) & rheum_appt_date!=. //confirm proportion who had rheum appt 60 days after EIA code 

 rheum_appt |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      2,878      100.00      100.00
------------+-----------------------------------
      Total |      2,878      100.00

. replace rheum_appt=0 if rheum_appt_date>(eia_code_date + 60) & rheum_appt_date!=. //replace as missing those appts >60 days after EIA code
(5,315 real changes made)

. replace rheum_appt_date=. if rheum_appt_date>(eia_code_date + 60) & rheum_appt_date!=. //replace as missing those appts >60 days after EIA code
(5,315 real changes made, 5,315 to missing)

. //consider dropping if above or missing for analyses below
. bys nuts_region: tab rheum_appt //check proportion by region

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

 rheum_appt |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,047       30.24       30.24
          1 |      2,415       69.76      100.00
------------+-----------------------------------
      Total |      3,462      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

 rheum_appt |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,120       31.41       31.41
          1 |      2,446       68.59      100.00
------------+-----------------------------------
      Total |      3,566      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

 rheum_appt |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,215       32.02       32.02
          1 |      4,703       67.98      100.00
------------+-----------------------------------
      Total |      6,918      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

 rheum_appt |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,094       31.99       31.99
          1 |      2,326       68.01      100.00
------------+-----------------------------------
      Total |      3,420      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

 rheum_appt |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,091       31.11       31.11
          1 |      2,416       68.89      100.00
------------+-----------------------------------
      Total |      3,507      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

 rheum_appt |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,154       30.11       30.11
          1 |      4,999       69.89      100.00
------------+-----------------------------------
      Total |      7,153      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

 rheum_appt |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,086       30.59       30.59
          1 |      2,464       69.41      100.00
------------+-----------------------------------
      Total |      3,550      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

 rheum_appt |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,096       30.72       30.72
          1 |      2,472       69.28      100.00
------------+-----------------------------------
      Total |      3,568      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = .

 rheum_appt |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        111       32.27       32.27
          1 |        233       67.73      100.00
------------+-----------------------------------
      Total |        344      100.00


. 
end of do-file

. do "C:\Users\k1754142\AppData\Local\Temp\STD4444_000000.tmp"

. drop if eia_code_date<date("$outpatient_date", "DMY")
(6,898 observations deleted)

. 
end of do-file

. tab mo_year_diagn

mo_year_dia |
         gn |      Freq.     Percent        Cum.
------------+-----------------------------------
    2019m10 |        972        3.40        3.40
    2019m11 |        962        3.36        6.76
    2019m12 |      1,071        3.75       10.51
     2020m1 |      1,011        3.54       14.05
     2020m2 |        966        3.38       17.43
     2020m3 |      1,045        3.66       21.08
     2020m4 |      1,025        3.59       24.67
     2020m5 |      1,008        3.53       28.19
     2020m6 |        955        3.34       31.53
     2020m7 |      1,058        3.70       35.23
     2020m8 |        995        3.48       38.71
     2020m9 |        951        3.33       42.04
    2020m10 |      1,000        3.50       45.54
    2020m11 |      1,009        3.53       49.07
    2020m12 |      1,001        3.50       52.57
     2021m1 |        994        3.48       56.04
     2021m2 |        920        3.22       59.26
     2021m3 |        997        3.49       62.75
     2021m4 |        955        3.34       66.09
     2021m5 |        991        3.47       69.56
     2021m6 |        969        3.39       72.95
     2021m7 |      1,056        3.69       76.64
     2021m8 |        995        3.48       80.12
     2021m9 |        956        3.34       83.46
    2021m10 |        938        3.28       86.74
    2021m11 |        979        3.42       90.17
    2021m12 |        931        3.26       93.42
     2022m1 |        935        3.27       96.69
     2022m2 |        911        3.19       99.88
     2022m3 |         34        0.12      100.00
------------+-----------------------------------
      Total |     28,590      100.00

. exit, clear
