-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/cleaning_dataset_allpts.log
  log type:  text
 opened on:   8 Apr 2022, 12:20:41

. 
. **Set Ado file path
. adopath + "$projectdir/analysis/extra_ados"
  [1]  (BASE)      "/usr/local/stata/ado/base/"
  [2]  (SITE)      "/usr/local/ado/"
  [3]              "."
  [4]  (PERSONAL)  "~/ado/personal/"
  [5]  (PLUS)      "~/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "/workspace/analysis/extra_ados"

. 
. **Set index dates ===========================================================
> */
. global year_preceding = "01/03/2018"

. global start_date = "01/03/2019"

. global end_date = "01/03/2022"

. 
. **Rename variables (some are too long for Stata to handle) ==================
> =====================*/
. rename chronic_respiratory_disease chronic_resp_disease

. 
. **Convert date strings to dates =============================================
> =======*/
. ***Some dates are given with month/year only, so adding day 15 to enable them
>  to be processed as dates 
. 
. foreach var of varlist   hba1c_mmol_per_mol_date                        ///
>                                                  hba1c_percentage_date       
>                    ///
>                                                  creatinine_date             
>                    ///
>                                                  bmi_date_measured           
>                ///
>                                                  {
  2.                                                         
.                 capture confirm string variable `var'
  3.                 if _rc!=0 {
  4.                         assert `var'==.
  5.                         rename `var' `var'_date
  6.                 }
  7.         
.                 else {
  8.                                 replace `var' = `var' + "-15"
  9.                                 rename `var' `var'_dstr
 10.                                 replace `var'_dstr = " " if `var'_dstr == 
> "-15"
 11.                                 gen `var'_date = date(`var'_dstr, "YMD") 
 12.                                 order `var'_date, after(`var'_dstr)
 13.                                 drop `var'_dstr
 14.                 }
 15.         
.         format `var'_date %td
 16. }
variable hba1c_mmol_per_mol_date was str7 now str10
(100,000 real changes made)
(5,000 real changes made)
(5,000 missing values generated)
variable hba1c_percentage_date was str7 now str10
(100,000 real changes made)
(5,000 real changes made)
(5,000 missing values generated)
variable creatinine_date was str7 now str10
(100,000 real changes made)
(5,000 real changes made)
(5,000 missing values generated)
variable bmi_date_measured was str7 now str10
(100,000 real changes made)
(40,000 real changes made)
(40,000 missing values generated)

. 
. **Conversion for dates with day already included ============================
> ========================*/
. 
. foreach var of varlist   chronic_cardiac_disease                        ///
>                                                  diabetes                    
>                                    ///
>                                                  hypertension                
>                            ///     
>                                                  chronic_resp_disease        
>                    ///
>                                                  copd                        
>                                    ///
>                                                  chronic_liver_disease       
>                    ///
>                                                  stroke                      
>                                    ///
>                                                  lung_cancer                 
>                            ///
>                                                  haem_cancer                 
>                            ///
>                                                  other_cancer                
>                            ///
>                                                  esrf                        
>                                    ///
>                                                  organ_transplant            
>                            ///
>                                                  {
  2.                                                                  
.                 capture confirm string variable `var'
  3.                 if _rc!=0 {
  4.                         assert `var'==.
  5.                         rename `var' `var'_date
  6.                 }
  7.         
.                 else {
  8.                                 rename `var' `var'_dstr
  9.                                 gen `var'_date = date(`var'_dstr, "YMD") 
 10.                                 order `var'_date, after(`var'_dstr)
 11.                                 drop `var'_dstr
 12.                                 gen `var'_date15 = `var'_date+15
 13.                                 order `var'_date15, after(`var'_date)
 14.                                 drop `var'_date
 15.                                 rename `var'_date15 `var'_date
 16.                 }
 17.         
.         format `var'_date %td
 18. }
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)

.                                                  
. **Rename variables with extra 'date' added to the end of variable names======
> =====================================================*/ 
. rename hba1c_mmol_per_mol_date_date hba1c_mmol_per_mol_date

. rename hba1c_percentage_date_date hba1c_percentage_date

. rename creatinine_date_date creatinine_date

. rename creatinine creatinine_value 

. rename bmi_date_measured_date bmi_date

. rename bmi bmi_value

. 
. **Create binary indicator variables for relevant conditions =================
> ===================================*/
. 
. foreach var of varlist   chronic_cardiac_disease_date           ///
>                                                  diabetes_date               
>                            ///
>                                                  hypertension_date           
>                            ///
>                                                  chronic_resp_disease_date   
>                    ///
>                                                  copd_date                   
>                                    ///
>                                                  chronic_liver_disease_date  
>                    ///
>                                                  stroke_date                 
>                            ///
>                                                  lung_cancer_date            
>                            ///
>                                                  haem_cancer_date            
>                            ///             
>                                                  other_cancer_date           
>                            ///
>                                                  esrf_date                   
>                                    ///
>                                                  creatinine_date             
>                            ///
>                                                  organ_transplant_date       
>                    ///
>                                                  {                           
>    
  2.         /*date ranges are applied in python, so presence of date indicates
>  presence of 
>           disease in the correct time frame*/ 
.         local newvar =  substr("`var'", 1, length("`var'") - 5)
  3.         gen `newvar' = (`var'!=. )
  4.         order `newvar', after(`var')
  5. }

. 
. **Demographics===============================================================
> =======*/
. ***Sex
. gen male = 1 if sex == "M"
(50,880 missing values generated)

. replace male = 0 if sex == "F"
(50,880 real changes made)

. lab var male "Male"

. 
. ***Ethnicity
. replace ethnicity = .u if ethnicity == .
(25,000 real changes made, 25,000 to missing)

. ****rearrange in order of prevalence
. recode ethnicity 2=6 /* mixed to 6 */
(ethnicity: 14919 changes made)

. recode ethnicity 3=2 /* south asian to 2 */
(ethnicity: 7571 changes made)

. recode ethnicity 4=3 /* black to 3 */
(ethnicity: 7609 changes made)

. recode ethnicity 6=4 /* mixed to 4 */
(ethnicity: 14919 changes made)

. recode ethnicity 5=4 /* other to 4 */
(ethnicity: 7442 changes made)

. 
. label define ethnicity  1 "White"                                       ///
>                                                 2 "Asian/Asian British"      
>    ///
>                                                 3 "Black"                    
>                    ///
>                                                 4 "Mixed/Other"              
>            ///
>                                                 .u "Missing"

. label values ethnicity ethnicity

. lab var ethnicity "Ethnicity"

. 
. ***STP 
. rename stp stp_old

. bysort stp_old: gen stp = 1 if _n==1
(99,998 missing values generated)

. replace stp = sum(stp) //
(99,999 real changes made)

. drop stp_old

. 
. ***Regions
. encode region, gen(nuts_region)

. 
. ***IMD
. /*
> *Group into 5 groups
> rename imd imd_o
> egen imd = cut(imd_o), group(5) icodes 
> *Add one to create groups 1-5 
> replace imd = imd + 1
> *-1 is missing, should be excluded from population 
> replace imd = .u if imd_o == -1
> drop imd_o
> *Reverse the order (so high is more deprived)
> recode imd 5 = 1 4 = 2 3 = 3 2 = 4 1 = 5 .u = .u
> label define imd 1 "1 least deprived" 2 "2" 3 "3" 4 "4" 5 "5 most deprived" .
> u "Missing"
> label values imd imd 
> lab var imd "Index of multiple deprivation"
> */
. 
. ***Age variables
. *Nb. works if ages 18 and over
. drop if age<18 & age !=.
(21,124 observations deleted)

. drop if age>109 & age !=.
(0 observations deleted)

. drop if age==.
(0 observations deleted)

. lab var age "Age"

. 
. recode age 18/39.9999 = 1 /// 
>            40/49.9999 = 2 ///
>                    50/59.9999 = 3 ///
>                60/69.9999 = 4 ///
>                    70/79.9999 = 5 ///
>                    80/max = 6, gen(agegroup) 
(78876 differences between age and agegroup)

. 
. label define agegroup   1 "18-39" ///
>                                                 2 "40-49" ///
>                                                 3 "50-59" ///
>                                                 4 "60-69" ///
>                                                 5 "70-79" ///
>                                                 6 "80+"

.                                                 
. label values agegroup agegroup

. lab var agegroup "Age group"

. 
. *Create binary age
. recode age min/69.999 = 0 ///
>            70/max = 1, gen(age70)
(78876 differences between age and age70)

. 
. ***Body Mass Index
. *Recode strange values 
. replace bmi_value = . if bmi_value == 0 
(31,542 real changes made, 31,542 to missing)

. replace bmi_value = . if !inrange(bmi_value, 10, 80)
(279 real changes made, 279 to missing)

. 
. *Restrict to within 10 years of start date and aged>16 
. gen bmi_time = (date("$start_date", "DMY") - bmi_date)/365.25
(31,542 missing values generated)

. gen bmi_age = age - bmi_time
(31,542 missing values generated)

. replace bmi_value = . if bmi_age < 16 
(34,039 real changes made, 34,039 to missing)

. replace bmi_value = . if bmi_time > 10 & bmi_time != . 
(9,337 real changes made, 9,337 to missing)

. 
. *Set to missing if no date, and vice versa 
. replace bmi_value = . if bmi_date == . 
(0 real changes made)

. replace bmi_date = . if bmi_value == . 
(43,655 real changes made, 43,655 to missing)

. replace bmi_time = . if bmi_value == . 
(43,655 real changes made, 43,655 to missing)

. replace bmi_age = . if bmi_value == . 
(43,655 real changes made, 43,655 to missing)

. 
. *Create BMI categories
. gen     bmicat = .
(78,876 missing values generated)

. recode  bmicat . = 1 if bmi_value < 18.5
(bmicat: 155 changes made)

. recode  bmicat . = 2 if bmi_value < 25
(bmicat: 391 changes made)

. recode  bmicat . = 3 if bmi_value < 30
(bmicat: 588 changes made)

. recode  bmicat . = 4 if bmi_value < 35
(bmicat: 715 changes made)

. recode  bmicat . = 5 if bmi_value < 40
(bmicat: 740 changes made)

. recode  bmicat . = 6 if bmi_value < .
(bmicat: 1090 changes made)

. replace bmicat = .u if bmi_value >= .
(75,197 real changes made, 75,197 to missing)

. 
. label define bmicat 1 "Underweight (<18.5)"     ///
>                                         2 "Normal (18.5-24.9)"          ///
>                                         3 "Overweight (25-29.9)"        ///
>                                         4 "Obese I (30-34.9)"           ///
>                                         5 "Obese II (35-39.9)"          ///
>                                         6 "Obese III (40+)"                  
>    ///
>                                         .u "Missing"

.                                         
. label values bmicat bmicat

. lab var bmicat "BMI"

. 
. *Create less granular categorisation
. recode bmicat 1/3 .u = 1 4 = 2 5 = 3 6 = 4, gen(obese4cat)
(78721 differences between bmicat and obese4cat)

. 
. label define obese4cat  1 "No record of obesity"        ///
>                                                 2 "Obese I (30-34.9)"        
>    ///
>                                                 3 "Obese II (35-39.9)"       
>    ///
>                                                 4 "Obese III (40+)"          
>    

. 
. label values obese4cat obese4cat

. order obese4cat, after(bmicat)

. 
. ***Smoking 
. label define smoke 1 "Never" 2 "Former" 3 "Current" .u "Missing"

. 
. gen     smoke = 1  if smoking_status == "N"
(70,976 missing values generated)

. replace smoke = 2  if smoking_status == "E"
(3,870 real changes made)

. replace smoke = 3  if smoking_status == "S"
(23,702 real changes made)

. replace smoke = .u if smoking_status == "M"
(3,999 real changes made, 3,999 to missing)

. replace smoke = .u if smoking_status == "" 
(39,405 real changes made, 39,405 to missing)

. 
. label values smoke smoke

. lab var smoke "Smoking status"

. drop smoking_status

. 
. *Create non-missing 3-category variable for current smoking (assumes missing 
> smoking is never smoking)
. recode smoke .u = 1, gen(smoke_nomiss)
(43404 differences between smoke and smoke_nomiss)

. order smoke_nomiss, after(smoke)

. label values smoke_nomiss smoke

. 
. **Clinical comorbidities
. ***eGFR
. *Set implausible creatinine values to missing (Note: zero changed to missing)
. replace creatinine_value = . if !inrange(creatinine_value, 20, 3000) 
(19,703 real changes made, 19,703 to missing)

. 
. *Remove creatinine dates if no measurements, and vice versa 
. replace creatinine_value = . if creatinine_date == . 
(0 real changes made)

. replace creatinine_date = . if creatinine_value == . 
(15,783 real changes made, 15,783 to missing)

. replace creatinine = . if creatinine_value == .
(19,703 real changes made, 19,703 to missing)

. recode creatinine .=0
(creatinine: 19703 changes made)

. 
. *Divide by 88.4 (to convert umol/l to mg/dl) 
. gen SCr_adj = creatinine_value/88.4
(19,703 missing values generated)

. 
. gen min = .
(78,876 missing values generated)

. replace min = SCr_adj/0.7 if male==0
(30,077 real changes made)

. replace min = SCr_adj/0.9 if male==1
(29,096 real changes made)

. replace min = min^-0.329  if male==0
(30,077 real changes made)

. replace min = min^-0.411  if male==1
(29,096 real changes made)

. replace min = 1 if min<1
(46,102 real changes made)

. 
. gen max=.
(78,876 missing values generated)

. replace max=SCr_adj/0.7 if male==0
(30,077 real changes made)

. replace max=SCr_adj/0.9 if male==1
(29,096 real changes made)

. replace max=max^-1.209
(59,173 real changes made)

. replace max=1 if max>1
(32,774 real changes made)

. 
. gen egfr=min*max*141
(19,703 missing values generated)

. replace egfr=egfr*(0.993^age)
(59,173 real changes made)

. replace egfr=egfr*1.018 if male==0
(30,077 real changes made)

. label var egfr "egfr calculated using CKD-EPI formula with no ethnicity"

. 
. *Categorise into ckd stages
. egen egfr_cat_all = cut(egfr), at(0, 15, 30, 45, 60, 5000)
(19703 missing values generated)

. recode egfr_cat_all 0 = 5 15 = 4 30 = 3 45 = 2 60 = 0, generate(ckd_egfr)
(59173 differences between egfr_cat_all and ckd_egfr)

. 
. gen egfr_cat = .
(78,876 missing values generated)

. recode egfr_cat . = 3 if egfr < 30
(egfr_cat: 13984 changes made)

. recode egfr_cat . = 2 if egfr < 60
(egfr_cat: 20707 changes made)

. recode egfr_cat . = 1 if egfr < .
(egfr_cat: 24482 changes made)

. replace egfr_cat = .u if egfr >= .
(19,703 real changes made, 19,703 to missing)

. 
. label define egfr_cat   1 ">=60"                ///
>                                                 2 "30-59"               ///
>                                                 3 "<30"                 ///
>                                                 .u "Missing"

.                                         
. label values egfr_cat egfr_cat

. lab var egfr_cat "eGFR"

. 
. *If missing eGFR, assume normal
. gen egfr_cat_nomiss = egfr_cat
(19,703 missing values generated)

. replace egfr_cat_nomiss = 1 if egfr_cat == .u
(19,703 real changes made)

. 
. label define egfr_cat_nomiss    1 ">=60/missing"        ///
>                                                                 2 "30-59"    
>                    ///
>                                                                 3 "<30" 

. label values egfr_cat_nomiss egfr_cat_nomiss

. lab var egfr_cat_nomiss "eGFR"

. 
. gen egfr_date = creatinine_date
(19,703 missing values generated)

. format egfr_date %td

. 
. *Add in end stage renal failure and create a single CKD variable 
. *Missing assumed to not have CKD 
. gen ckd = 0

. replace ckd = 1 if ckd_egfr != . & ckd_egfr >= 1
(34,691 real changes made)

. replace ckd = 1 if esrf == 1
(8,801 real changes made)

. 
. label define ckd 0 "No CKD" 1 "CKD"

. label values ckd ckd

. label var ckd "Chronic kidney disease"

. 
. *Create date (most recent measure prior to index)
. gen temp1_ckd_date = creatinine_date if ckd_egfr >=1
(44,185 missing values generated)

. gen temp2_ckd_date = esrf_date if esrf == 1
(63,137 missing values generated)

. gen ckd_date = max(temp1_ckd_date,temp2_ckd_date) 
(35,384 missing values generated)

. format ckd_date %td 

. 
. drop temp1_ckd_date temp2_ckd_date SCr_adj min max ckd_egfr egfr_cat_all

. 
. ***HbA1c
. *Set zero or negative to missing
. replace hba1c_percentage   = . if hba1c_percentage <= 0
(4,404 real changes made, 4,404 to missing)

. replace hba1c_mmol_per_mol = . if hba1c_mmol_per_mol <= 0
(5,724 real changes made, 5,724 to missing)

. 
. *Change implausible values to missing
. replace hba1c_percentage   = . if !inrange(hba1c_percentage, 1, 20)
(1,234 real changes made, 1,234 to missing)

. replace hba1c_mmol_per_mol = . if !inrange(hba1c_mmol_per_mol, 10, 200)
(3,359 real changes made, 3,359 to missing)

. 
. *Set most recent values of >24 months prior to start date to missing
. replace hba1c_percentage   = . if (date("$start_date", "DMY") - hba1c_percent
> age_date) > 24*30 & hba1c_percentage_date != .
(71,983 real changes made, 71,983 to missing)

. replace hba1c_mmol_per_mol = . if (date("$start_date", "DMY") - hba1c_mmol_pe
> r_mol_date) > 24*30 & hba1c_mmol_per_mol_date != .
(68,670 real changes made, 68,670 to missing)

. 
. *Clean up dates
. replace hba1c_percentage_date = . if hba1c_percentage == .
(73,664 real changes made, 73,664 to missing)

. replace hba1c_mmol_per_mol_date = . if hba1c_mmol_per_mol == .
(73,779 real changes made, 73,779 to missing)

. 
. *Express  HbA1c as percentage
. *Express all values as perecentage 
. noi summ hba1c_percentage hba1c_mmol_per_mol 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hba1c_per~ge |      1,255    5.060198    1.881733   1.081135   11.26537
hba1c_mmol~l |      1,123    43.15175    17.96397   10.23574   104.4842

. gen     hba1c_pct = hba1c_percentage 
(77,621 missing values generated)

. replace hba1c_pct = (hba1c_mmol_per_mol/10.929)+2.15 if hba1c_mmol_per_mol<. 
(1,123 real changes made)

. 
. *Valid % range between 0-20  
. replace hba1c_pct = . if !inrange(hba1c_pct, 1, 20) 
(0 real changes made)

. replace hba1c_pct = round(hba1c_pct, 0.1)
(2,362 real changes made)

. 
. *Categorise HbA1c and diabetes
. *Group hba1c pct
. gen     hba1ccat = 0 if hba1c_pct <  6.5
(77,251 missing values generated)

. replace hba1ccat = 1 if hba1c_pct >= 6.5  & hba1c_pct < 7.5
(386 real changes made)

. replace hba1ccat = 2 if hba1c_pct >= 7.5  & hba1c_pct < 8
(110 real changes made)

. replace hba1ccat = 3 if hba1c_pct >= 8    & hba1c_pct < 9
(148 real changes made)

. replace hba1ccat = 4 if hba1c_pct >= 9    & hba1c_pct !=.
(93 real changes made)

. label define hba1ccat 0 "<6.5%" 1">=6.5-7.4" 2">=7.5-7.9" 3">=8-8.9" 4">=9"

. label values hba1ccat hba1ccat

. 
. *Express all values as mmol
. gen hba1c_mmol = hba1c_mmol_per_mol
(77,753 missing values generated)

. replace hba1c_mmol = (hba1c_percentage*10.929)-23.5 if hba1c_percentage<. & h
> ba1c_mmol==.
(1,239 real changes made)

. 
. *Group hba1c mmol
. gen     hba1ccatmm = 0 if hba1c_mmol < 58
(76,864 missing values generated)

. replace hba1ccatmm = 1 if hba1c_mmol >= 58 & hba1c_mmol !=.
(350 real changes made)

. replace hba1ccatmm =.u if hba1ccatmm==. 
(76,514 real changes made, 76,514 to missing)

. label define hba1ccatmm 0 "HbA1c <58mmol/mol" 1 "HbA1c >=58mmol/mol" .u "Miss
> ing"

. label values hba1ccatmm hba1ccatmm

. lab var hba1ccatmm "HbA1c"

. 
. *Create diabetes, split by control/not (assumes missing = no diabetes)
. gen     diabcat = 1 if diabetes==0
(15,762 missing values generated)

. replace diabcat = 2 if diabetes==1 & inlist(hba1ccat, 0, 1)
(387 real changes made)

. replace diabcat = 3 if diabetes==1 & inlist(hba1ccat, 2, 3, 4)
(76 real changes made)

. replace diabcat = 4 if diabetes==1 & !inlist(hba1ccat, 0, 1, 2, 3, 4)
(15,299 real changes made)

. 
. label define diabcat    1 "No diabetes"                         ///
>                                                 2 "Controlled diabetes"      
>    ///
>                                                 3 "Uncontrolled diabetes"    
>    ///
>                                                 4 "Diabetes, no hba1c measure
> "

. label values diabcat diabcat

. 
. *Create cancer variable 'other cancer currently', includes carcinoma of the h
> ead and neck - need to confirm if this excludes NMSC
. gen cancer =0

. replace cancer =1 if lung_cancer ==1 | haem_cancer ==1 | other_cancer ==1
(38,516 real changes made)

. lab var cancer "Cancer"

. 
. *Create other comorbid variables
. gen combined_cv_comorbid =1 if chronic_cardiac_disease ==1 | stroke==1
(50,451 missing values generated)

. recode combined_cv_comorbid .=0
(combined_cv_comorbid: 50451 changes made)

. 
. *Delete unneeded variables
. drop hba1c_pct hba1c_percentage hba1c_mmol_per_mol age

. 
. *Label variables
. lab var hypertension "Hypertension"

. lab var diabetes "Diabetes"

. lab var stroke "Stroke"

. lab var chronic_resp_disease "Chronic respiratory disease"

. lab var copd "COPD"

. lab var esrf "End-stage renal failure"

. lab var chronic_liver_disease "Chronic liver disease"

. lab var chronic_cardiac_disease "Chronic cardiac disease"

. 
. save "$projectdir/output/data/file_eia_allpts", replace 
(note: file /workspace/output/data/file_eia_allpts.dta not found)
file /workspace/output/data/file_eia_allpts.dta saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/cleaning_dataset_allpts.log
  log type:  text
 closed on:   8 Apr 2022, 12:20:44
-------------------------------------------------------------------------------
