{smcl}
{txt}{sf}{ul off}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/workspace/logs/cleaning_dataset.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}29 Mar 2022, 15:30:34
{txt}
{com}. 
. **Set Ado file path
. adopath + "$projectdir/analysis/extra_ados"
{txt}  [1]  (BASE)      "{res}/usr/local/stata/ado/base/{txt}"
  [2]  (SITE)      "{res}/usr/local/ado/{txt}"
  [3]              "{res}.{txt}"
  [4]  (PERSONAL)  "{res}~/ado/personal/{txt}"
  [5]  (PLUS)      "{res}~/ado/plus/{txt}"
  [6]  (OLDPLACE)  "{res}~/ado/{txt}"
  [7]              "{res}/workspace/analysis/extra_ados{txt}"

{com}. 
. **Set index dates ===========================================================*/
. global year_preceding = "01/03/2018"
{txt}
{com}. global start_date = "01/03/2019"
{txt}
{com}. global end_date = "01/03/2022"
{txt}
{com}. 
. **Rename variables (some are too long for Stata to handle) =======================================*/
. rename chronic_respiratory_disease chronic_resp_disease
{res}{txt}
{com}. 
. **Convert date strings to dates ====================================================*/
. ***Some dates are given with month/year only, so adding day 15 to enable them to be processed as dates 
. 
. foreach var of varlist   hba1c_mmol_per_mol_date                        ///
>                                                  hba1c_percentage_date                          ///
>                                                  creatinine_date                                ///
>                                                  bmi_date_measured                          ///
>                                                  abatacept                                                      ///
>                                                  adalimumab                                                     ///     
>                                                  baricitinib                                            ///
>                                                  certolizumab                                           ///
>                                                  etanercept                                                     ///
>                                                  golimumab                                                      ///
>                                                  guselkumab                                                     ///     
>                                                  infliximab                                                     ///
>                                                  ixekizumab                                                     ///
>                                                  methotrexate_hcd                                       ///
>                                                  rituximab                                                      ///
>                                                  sarilumab                                                      ///
>                                                  secukinumab                                            ///     
>                                                  tocilizumab                                            ///
>                                                  tofacitinib                                            ///
>                                                  upadacitinib                                           ///
>                                                  ustekinumab                                            ///
>                                                  {c -(}
{txt}  2{com}.                                                         
.                 capture confirm string variable `var'
{txt}  3{com}.                 if _rc!=0 {c -(}
{txt}  4{com}.                         assert `var'==.
{txt}  5{com}.                         rename `var' `var'_date
{txt}  6{com}.                 {c )-}
{txt}  7{com}.         
.                 else {c -(}
{txt}  8{com}.                                 replace `var' = `var' + "-15"
{txt}  9{com}.                                 rename `var' `var'_dstr
{txt} 10{com}.                                 replace `var'_dstr = " " if `var'_dstr == "-15"
{txt} 11{com}.                                 gen `var'_date = date(`var'_dstr, "YMD") 
{txt} 12{com}.                                 order `var'_date, after(`var'_dstr)
{txt} 13{com}.                                 drop `var'_dstr
{txt} 14{com}.                 {c )-}
{txt} 15{com}.         
.         format `var'_date %td
{txt} 16{com}. {c )-}
{txt}variable {bf}hba1c_mmol_per_mol_date{sf} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(5,000 real changes made)
(5,000 missing values generated)
variable {bf}hba1c_percentage_date{sf} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(5,000 real changes made)
(5,000 missing values generated)
variable {bf}creatinine_date{sf} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(5,000 real changes made)
(5,000 missing values generated)
variable {bf}bmi_date_measured{sf} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(40,000 real changes made)
(40,000 missing values generated)
variable {bf}abatacept{sf} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}adalimumab{sf} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}baricitinib{sf} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}certolizumab{sf} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}etanercept{sf} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}golimumab{sf} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}guselkumab{sf} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}infliximab{sf} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}ixekizumab{sf} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}methotrexate_hcd{sf} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}rituximab{sf} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}sarilumab{sf} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}secukinumab{sf} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}tocilizumab{sf} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}tofacitinib{sf} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}upadacitinib{sf} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}ustekinumab{sf} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)

{com}. 
. **Conversion for dates with day already included ====================================================*/
. 
. foreach var of varlist   died_date_ons                                          ///
>                                              eia_code_date                                              ///
>                                                  rheum_appt_date                                        ///
>                                              ra_code_date                                               ///
>                                                  psa_code_date                                          ///
>                                                  anksp_code_date                                        ///
>                                                  last_gp_prerheum_date                          ///
>                                                  last_gp_precode_date                           ///     
>                                                  last_gp_refrheum_date                          ///
>                                                  last_gp_refcode_date                           ///
>                                                  referral_rheum_prerheum                        ///
>                                                  referral_rheum_precode                         ///     
>                                                  chronic_cardiac_disease                        ///
>                                                  diabetes                                                       ///
>                                                  hypertension                                           ///     
>                                                  chronic_resp_disease                           ///
>                                                  copd                                                           ///
>                                                  chronic_liver_disease                          ///
>                                                  stroke                                                         ///
>                                                  lung_cancer                                            ///
>                                                  haem_cancer                                            ///
>                                                  other_cancer                                           ///
>                                                  esrf                                                           ///
>                                                  organ_transplant                                       ///
>                                                  hydroxychloroquine                                     ///
>                                                  leflunomide                                            ///
>                                                  methotrexate                                           ///
>                                                  methotrexate_inj                                       ///
>                                                  sulfasalazine                                          ///
>                                                  {c -(}
{txt}  2{com}.                                                                  
.                 capture confirm string variable `var'
{txt}  3{com}.                 if _rc!=0 {c -(}
{txt}  4{com}.                         assert `var'==.
{txt}  5{com}.                         rename `var' `var'_date
{txt}  6{com}.                 {c )-}
{txt}  7{com}.         
.                 else {c -(}
{txt}  8{com}.                                 rename `var' `var'_dstr
{txt}  9{com}.                                 gen `var'_date = date(`var'_dstr, "YMD") 
{txt} 10{com}.                                 order `var'_date, after(`var'_dstr)
{txt} 11{com}.                                 drop `var'_dstr
{txt} 12{com}.                                 gen `var'_date15 = `var'_date+15
{txt} 13{com}.                                 order `var'_date15, after(`var'_date)
{txt} 14{com}.                                 drop `var'_date
{txt} 15{com}.                                 rename `var'_date15 `var'_date
{txt} 16{com}.                 {c )-}
{txt} 17{com}.         
.         format `var'_date %td
{txt} 18{com}. {c )-}
{res}{txt}(90,000 missing values generated)
(90,000 missing values generated)
{res}{txt}(1,000 missing values generated)
(1,000 missing values generated)
{res}{txt}(9,999 missing values generated)
(9,999 missing values generated)
{res}{txt}(1,000 missing values generated)
(1,000 missing values generated)
{res}{txt}(1,000 missing values generated)
(1,000 missing values generated)
{res}{txt}(1,000 missing values generated)
(1,000 missing values generated)
{res}{txt}(9,999 missing values generated)
(9,999 missing values generated)
{res}{txt}(9,999 missing values generated)
(9,999 missing values generated)
{res}{txt}(9,999 missing values generated)
(9,999 missing values generated)
{res}{txt}(9,999 missing values generated)
(9,999 missing values generated)
{res}{txt}(9,999 missing values generated)
(9,999 missing values generated)
{res}{txt}(9,999 missing values generated)
(9,999 missing values generated)
{res}{txt}(80,000 missing values generated)
(80,000 missing values generated)
{res}{txt}(80,000 missing values generated)
(80,000 missing values generated)
{res}{txt}(80,000 missing values generated)
(80,000 missing values generated)
{res}{txt}(80,000 missing values generated)
(80,000 missing values generated)
{res}{txt}(80,000 missing values generated)
(80,000 missing values generated)
{res}{txt}(80,000 missing values generated)
(80,000 missing values generated)
{res}{txt}(80,000 missing values generated)
(80,000 missing values generated)
{res}{txt}(80,000 missing values generated)
(80,000 missing values generated)
{res}{txt}(80,000 missing values generated)
(80,000 missing values generated)
{res}{txt}(80,000 missing values generated)
(80,000 missing values generated)
{res}{txt}(80,000 missing values generated)
(80,000 missing values generated)
{res}{txt}(80,000 missing values generated)
(80,000 missing values generated)
{res}{txt}(90,000 missing values generated)
(90,000 missing values generated)
{res}{txt}(90,000 missing values generated)
(90,000 missing values generated)
{res}{txt}(90,000 missing values generated)
(90,000 missing values generated)
{res}{txt}(90,000 missing values generated)
(90,000 missing values generated)
{res}{txt}(90,000 missing values generated)
(90,000 missing values generated)
{res}{txt}
{com}.                                                  
. **Rename variables with extra 'date' added to the end of variable names===========================================================*/ 
. rename rheum_appt_date_date rheum_appt_date
{res}{txt}
{com}. rename eia_code_date_date eia_code_date
{res}{txt}
{com}. rename ra_code_date_date ra_code_date
{res}{txt}
{com}. rename psa_code_date_date psa_code_date
{res}{txt}
{com}. rename anksp_code_date_date anksp_code_date
{res}{txt}
{com}. rename died_date_ons_date died_ons_date
{res}{txt}
{com}. rename last_gp_prerheum_date_date last_gp_prerheum_date
{res}{txt}
{com}. rename last_gp_refrheum_date_date last_gp_refrheum_date
{res}{txt}
{com}. rename last_gp_refcode_date_date last_gp_refcode_date
{res}{txt}
{com}. rename last_gp_precode_date_date last_gp_precode_date
{res}{txt}
{com}. rename hba1c_mmol_per_mol_date_date hba1c_mmol_per_mol_date
{res}{txt}
{com}. rename hba1c_percentage_date_date hba1c_percentage_date
{res}{txt}
{com}. rename creatinine_date_date creatinine_date
{res}{txt}
{com}. rename creatinine creatinine_value 
{res}{txt}
{com}. rename bmi_date_measured_date bmi_date
{res}{txt}
{com}. rename bmi bmi_value
{res}{txt}
{com}. 
. **Create binary indicator variables for relevant conditions ====================================================*/
. 
. foreach var of varlist   eia_code_date                                          ///
>                                                  rheum_appt_date                                        ///
>                                              ra_code_date                                               ///
>                                                  psa_code_date                                          ///
>                                                  anksp_code_date                                        ///
>                                                  died_ons_date                                          ///
>                                                  last_gp_prerheum_date                          ///
>                                                  last_gp_precode_date                           ///     
>                                                  last_gp_refrheum_date                          ///
>                                                  last_gp_refcode_date                           ///
>                                                  referral_rheum_prerheum_date           ///
>                                                  referral_rheum_precode_date            ///     
>                                                  chronic_cardiac_disease_date           ///
>                                                  diabetes_date                                          ///
>                                                  hypertension_date                                      ///
>                                                  chronic_resp_disease_date                      ///
>                                                  copd_date                                                      ///
>                                                  chronic_liver_disease_date                     ///
>                                                  stroke_date                                            ///
>                                                  lung_cancer_date                                       ///
>                                                  haem_cancer_date                                       ///             
>                                                  other_cancer_date                                      ///
>                                                  esrf_date                                                      ///
>                                                  creatinine_date                                        ///
>                                                  organ_transplant_date                          ///
>                                                  hydroxychloroquine_date                        ///     
>                                                  leflunomide_date                                       ///
>                                                  methotrexate_date                                      ///
>                                                  methotrexate_inj_date                          ///             
>                                                  sulfasalazine_date                                     ///
>                                                  abatacept_date                                         ///
>                                                  adalimumab_date                                        ///
>                                                  baricitinib_date                                       ///
>                                                  certolizumab_date                                      ///
>                                                  etanercept_date                                        ///
>                                                  golimumab_date                                         ///
>                                                  guselkumab_date                                        ///
>                                                  infliximab_date                                        ///
>                                                  ixekizumab_date                                        ///
>                                                  methotrexate_hcd_date                          ///
>                                                  rituximab_date                                         ///             
>                                                  sarilumab_date                                         ///
>                                                  secukinumab_date                                       ///
>                                                  tocilizumab_date                                       ///             
>                                                  tofacitinib_date                                       ///
>                                                  upadacitinib_date                                      ///
>                                                  ustekinumab_date   {c -(}                           
{txt}  2{com}.         /*date ranges are applied in python, so presence of date indicates presence of 
>           disease in the correct time frame*/ 
.         local newvar =  substr("`var'", 1, length("`var'") - 5)
{txt}  3{com}.         gen `newvar' = (`var'!=. )
{txt}  4{com}.         order `newvar', after(`var')
{txt}  5{com}. {c )-}
{txt}
{com}. 
. *Refine diagnostic window=============================================================*/
. 
. **All patients should have EIA code
. tab eia_code

   {txt}eia_code {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      1,000        1.00        1.00
{txt}          1 {c |}{res}     99,000       99.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}    100,000      100.00
{txt}
{com}. keep if eia_code==1
{txt}(1,000 observations deleted)

{com}. 
. **Keep patients with first EIA code in GP record if code was after 1st March 2019
. keep if eia_code_date>=date("$start_date", "DMY") & eia_code_date!=. 
{txt}(25,762 observations deleted)

{com}. tab eia_code

   {txt}eia_code {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}     73,238      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     73,238      100.00
{txt}
{com}. 
. **Month/Year of diagnosis
. gen year_diag=year(eia_code_date)
{txt}
{com}. format year_diag %ty
{txt}
{com}. gen month_diag=month(eia_code_date)
{txt}
{com}. gen mo_year_diagn=ym(year_diag, month_diag)
{txt}
{com}. format mo_year_diagn %tm
{txt}
{com}. 
. *Include only most recent EIA sub-diagnosis
. replace ra_code =0 if psa_code_date >= ra_code_date & psa_code_date !=.
{txt}(35,758 real changes made)

{com}. replace ra_code =0 if anksp_code_date >= ra_code_date & anksp_code_date !=.
{txt}(12,238 real changes made)

{com}. replace psa_code =0 if ra_code_date >= psa_code_date & ra_code_date !=.
{txt}(36,064 real changes made)

{com}. replace psa_code =0 if anksp_code_date >= psa_code_date & anksp_code_date !=.
{txt}(12,197 real changes made)

{com}. replace anksp_code =0 if psa_code_date >= anksp_code_date & psa_code_date !=.
{txt}(35,880 real changes made)

{com}. replace anksp_code =0 if ra_code_date >= anksp_code_date & ra_code_date !=.
{txt}(12,202 real changes made)

{com}. gen eia_diagnosis=1 if ra_code==1
{txt}(48,735 missing values generated)

{com}. replace eia_diagnosis=2 if psa_code==1
{txt}(24,250 real changes made)

{com}. replace eia_diagnosis=3 if anksp_code==1
{txt}(24,421 real changes made)

{com}. lab define eia_diagnosis 1 "RA" 2 "PsA" 3 "AxSpA", modify
{txt}
{com}. lab val eia_diagnosis eia_diagnosis
{txt}
{com}. tab eia_diagnosis

{txt}eia_diagnos {c |}
         is {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
         RA {c |}{res}     24,503       33.49       33.49
{txt}        PsA {c |}{res}     24,250       33.14       66.63
{txt}      AxSpA {c |}{res}     24,421       33.37      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     73,174      100.00
{txt}
{com}. drop if eia_diagnosis==.
{txt}(64 observations deleted)

{com}. 
. *Define appointments and referrals======================================*/
. 
. **Rheumatology appt 
. tab rheum_appt  //proportion with first rheum outpatient date in the year before EIA code appears in GP record 

 {txt}rheum_appt {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      7,282        9.95        9.95
{txt}          1 {c |}{res}     65,892       90.05      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     73,174      100.00
{txt}
{com}. tab rheum_appt if rheum_appt_date<eia_code_date & rheum_appt_date!=. //confirm proportion who had rheum appt (i.e. not missing) and appt before EIA code 

 {txt}rheum_appt {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}     40,680      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     40,680      100.00
{txt}
{com}. 
. **Rheumatology referrals
. tab referral_rheum_prerheum //last rheum referral in the year before rheumatology outpatient (requires rheum appt to have been present)

{txt}referral_rh {c |}
eum_prerheu {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      7,254        9.91        9.91
{txt}          1 {c |}{res}     65,920       90.09      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     73,174      100.00
{txt}
{com}. tab referral_rheum_prerheum if rheum_appt!=0  //last rheum referral in the year before rheumatology outpatient if rheum appt date present

{txt}referral_rh {c |}
eum_prerheu {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      6,539        9.92        9.92
{txt}          1 {c |}{res}     59,353       90.08      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     65,892      100.00
{txt}
{com}. tab referral_rheum_prerheum if rheum_appt!=0 & referral_rheum_prerheum_date<rheum_appt_date  //last rheum referral in the year before rheumatology outpatient, assuming ref date before rheum appt date

{txt}referral_rh {c |}
eum_prerheu {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}     29,582      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     29,582      100.00
{txt}
{com}. tab referral_rheum_precode //last rheum referral in the year before EIA code (could use if rheum appt missing)

{txt}referral_rh {c |}
eum_precode {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      7,295        9.97        9.97
{txt}          1 {c |}{res}     65,879       90.03      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     73,174      100.00
{txt}
{com}. gen referral_rheum_comb_date = referral_rheum_prerheum_date if referral_rheum_prerheum_date!=.
{txt}(7,254 missing values generated)

{com}. replace referral_rheum_comb_date = referral_rheum_precode_date if referral_rheum_prerheum_date==. & referral_rheum_precode_date!=.
{txt}(6,564 real changes made)

{com}. format %td referral_rheum_comb_date
{txt}
{com}. 
. **GP appointments
. tab last_gp_refrheum //proportion with last GP appointment in year before rheum referral (pre-rheum appt)

{txt}last_gp_ref {c |}
      rheum {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      7,284        9.95        9.95
{txt}          1 {c |}{res}     65,890       90.05      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     73,174      100.00
{txt}
{com}. gen all_appts=1 if last_gp_refrheum==1 & referral_rheum_prerheum==1 & rheum_appt==1 & eia_code==1 & last_gp_refrheum_date<referral_rheum_prerheum_date & referral_rheum_prerheum_date<rheum_appt_date & rheum_appt_date<eia_code_date 
{txt}(70,337 missing values generated)

{com}. recode all_appts .=0
{txt}(all_appts: 70337 changes made)

{com}. tab all_appts //KEY - proportion who had a last gp appt, then rheum ref, then rheum appt, then EIA code 

  {txt}all_appts {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     70,337       96.12       96.12
{txt}          1 {c |}{res}      2,837        3.88      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     73,174      100.00
{txt}
{com}. tab last_gp_refcode     if referral_rheum_precode!=0 //last GP appointment before rheum ref if present (pre-eia code ref)

{txt}last_gp_ref {c |}
       code {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      6,610       10.03       10.03
{txt}          1 {c |}{res}     59,269       89.97      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     65,879      100.00
{txt}
{com}. tab last_gp_prerheum if rheum_appt!=0 //last GP appointment before rheum appt (if present)

{txt}last_gp_pre {c |}
      rheum {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      6,576        9.98        9.98
{txt}          1 {c |}{res}     59,316       90.02      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     65,892      100.00
{txt}
{com}. tab last_gp_precode //last GP appointment before EIA code

{txt}last_gp_pre {c |}
       code {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      7,245        9.90        9.90
{txt}          1 {c |}{res}     65,929       90.10      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     73,174      100.00
{txt}
{com}. 
. **For sensitivity analyses for those without rheum_appt, replace diagnosis date as EIA code date if rheum appt pre-code is missing or after
. gen eia_diagnosis_date_nomiss=rheum_appt_date if rheum_appt_date!=.
{txt}(7,282 missing values generated)

{com}. format %td eia_diagnosis_date_nomiss
{txt}
{com}. replace eia_diagnosis_date_nomiss=eia_code_date if (rheum_appt_date==. | rheum_appt_date>eia_code_date) & eia_code_date!=.
{txt}(32,460 real changes made)

{com}. gen eia_diagnosis_nomiss=1 if eia_diagnosis_date_nomiss!=.
{txt}
{com}. recode eia_diagnosis_nomiss .=0
{txt}(eia_diagnosis_nomiss: 0 changes made)

{com}. tab eia_diagnosis_nomiss

{txt}eia_diagnos {c |}
  is_nomiss {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}     73,174      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     73,174      100.00
{txt}
{com}. 
. *Define drugs and dates=====================================================*/
. 
. **csDMARDs (not including high cost MTX; wouldn't be shared care)
. gen csdmard=1 if hydroxychloroquine==1 | leflunomide==1 | methotrexate==1 | methotrexate_inj==1 | sulfasalazine==1
{txt}(43,132 missing values generated)

{com}. recode csdmard .=0 
{txt}(csdmard: 43132 changes made)

{com}. tab csdmard 

    {txt}csdmard {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     43,132       58.94       58.94
{txt}          1 {c |}{res}     30,042       41.06      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     73,174      100.00
{txt}
{com}. bys eia_diagnosis: tab csdmard

{txt}{hline}
-> eia_diagnosis = RA

    csdmard {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     14,408       58.80       58.80
{txt}          1 {c |}{res}     10,095       41.20      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     24,503      100.00

{txt}{hline}
-> eia_diagnosis = PsA

    csdmard {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     14,299       58.96       58.96
{txt}          1 {c |}{res}      9,951       41.04      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     24,250      100.00

{txt}{hline}
-> eia_diagnosis = AxSpA

    csdmard {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     14,425       59.07       59.07
{txt}          1 {c |}{res}      9,996       40.93      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     24,421      100.00

{txt}
{com}. 
. **csDMARDs (including high cost MTX)
. gen csdmard_hcd=1 if hydroxychloroquine==1 | leflunomide==1 | methotrexate==1 | methotrexate_inj==1 | methotrexate_hcd==1 | sulfasalazine==1
{txt}(38,874 missing values generated)

{com}. recode csdmard_hcd .=0 
{txt}(csdmard_hcd: 38874 changes made)

{com}. tab csdmard_hcd

{txt}csdmard_hcd {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     38,874       53.13       53.13
{txt}          1 {c |}{res}     34,300       46.87      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     73,174      100.00
{txt}
{com}. bys eia_diagnosis: tab csdmard_hcd 

{txt}{hline}
-> eia_diagnosis = RA

csdmard_hcd {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     12,987       53.00       53.00
{txt}          1 {c |}{res}     11,516       47.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     24,503      100.00

{txt}{hline}
-> eia_diagnosis = PsA

csdmard_hcd {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     12,911       53.24       53.24
{txt}          1 {c |}{res}     11,339       46.76      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     24,250      100.00

{txt}{hline}
-> eia_diagnosis = AxSpA

csdmard_hcd {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     12,976       53.13       53.13
{txt}          1 {c |}{res}     11,445       46.87      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     24,421      100.00

{txt}
{com}. 
. **Date of first csDMARD script (not including high cost MTX prescriptions)
. gen csdmard_date=min(hydroxychloroquine_date, leflunomide_date, methotrexate_date, methotrexate_inj_date, sulfasalazine_date)
{txt}(43,132 missing values generated)

{com}. format %td csdmard_date
{txt}
{com}. 
. **Date of first csDMARD script (including high cost MTX prescriptions)
. gen csdmard_hcd_date=min(hydroxychloroquine_date, leflunomide_date, methotrexate_date, methotrexate_inj_date, methotrexate_hcd_date, sulfasalazine_date)
{txt}(38,874 missing values generated)

{com}. format %td csdmard_hcd_date
{txt}
{com}. 
. **Biologic use
. gen biologic=1 if abatacept==1 | adalimumab==1 | baricitinib==1 | certolizumab==1 | etanercept==1 | golimumab==1 | guselkumab==1 | infliximab==1 | ixekizumab==1 | rituximab==1 | sarilumab==1 | secukinumab==1 | tocilizumab==1 | tofacitinib==1 | upadacitinib==1 | ustekinumab==1 
{txt}(13,406 missing values generated)

{com}. recode biologic .=0
{txt}(biologic: 13406 changes made)

{com}. tab biologic 

   {txt}biologic {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     13,406       18.32       18.32
{txt}          1 {c |}{res}     59,768       81.68      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     73,174      100.00
{txt}
{com}. bys eia_diagnosis: tab biologic 

{txt}{hline}
-> eia_diagnosis = RA

   biologic {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      4,465       18.22       18.22
{txt}          1 {c |}{res}     20,038       81.78      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     24,503      100.00

{txt}{hline}
-> eia_diagnosis = PsA

   biologic {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      4,431       18.27       18.27
{txt}          1 {c |}{res}     19,819       81.73      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     24,250      100.00

{txt}{hline}
-> eia_diagnosis = AxSpA

   biologic {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      4,510       18.47       18.47
{txt}          1 {c |}{res}     19,911       81.53      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     24,421      100.00

{txt}
{com}. 
. **Date of first biologic script
. gen biologic_date=min(abatacept_date, adalimumab_date, baricitinib_date, certolizumab_date, etanercept_date, golimumab_date, guselkumab_date, infliximab_date, ixekizumab_date, rituximab_date, sarilumab_date, secukinumab_date, tocilizumab_date, tofacitinib_date, upadacitinib_date, ustekinumab_date)
{txt}(13,406 missing values generated)

{com}. format %td biologic_date
{txt}
{com}. 
. **Exclude if first csdmard or biologic was before first rheum appt
. ***Nb. could introduce leeway e.g. 30 days?
. tab csdmard if rheum_appt_date!=. & csdmard_date!=. & csdmard_date<rheum_appt_date

    {txt}csdmard {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}     10,932      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     10,932      100.00
{txt}
{com}. drop if rheum_appt_date!=. & csdmard_date!=. & csdmard_date<rheum_appt_date
{txt}(10,932 observations deleted)

{com}. tab biologic if rheum_appt_date!=. & biologic_date!=. & biologic_date<rheum_appt_date 

   {txt}biologic {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}     18,925      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     18,925      100.00
{txt}
{com}. drop if rheum_appt_date!=. & biologic_date!=. & biologic_date<rheum_appt_date 
{txt}(18,925 observations deleted)

{com}. 
. *Number of EIA diagnoses in 1-year time windows=========================================*/
. 
. gen diagnosis_year=1 if eia_code_date>=td(01mar2019) & eia_code_date<td(01mar2020)
{txt}(29,284 missing values generated)

{com}. replace diagnosis_year=2 if eia_code_date>=td(01mar2020) & eia_code_date<td(01mar2021)
{txt}(13,666 real changes made)

{com}. replace diagnosis_year=3 if eia_code_date>=td(01mar2021) & eia_code_date<td(01mar2022)
{txt}(13,949 real changes made)

{com}. lab define diagnosis_year 1 "March 2019-March 2020" 2 "March 2020-March 2021" 3 "March 2021-March 2022", modify
{txt}
{com}. lab val diagnosis_year diagnosis_year
{txt}
{com}. lab var diagnosis_year "Year of diagnosis"
{txt}
{com}. tab diagnosis_year

    {txt}Year of diagnosis {c |}      Freq.     Percent        Cum.
{hline 22}{c +}{hline 35}
March 2019-March 2020 {c |}{res}     14,033       33.69       33.69
{txt}March 2020-March 2021 {c |}{res}     13,666       32.81       66.51
{txt}March 2021-March 2022 {c |}{res}     13,949       33.49      100.00
{txt}{hline 22}{c +}{hline 35}
                Total {c |}{res}     41,648      100.00
{txt}
{com}. bys eia_diagnosis: tab diagnosis_year

{txt}{hline}
-> eia_diagnosis = RA

    Year of diagnosis {c |}      Freq.     Percent        Cum.
{hline 22}{c +}{hline 35}
March 2019-March 2020 {c |}{res}      4,708       33.91       33.91
{txt}March 2020-March 2021 {c |}{res}      4,540       32.70       66.62
{txt}March 2021-March 2022 {c |}{res}      4,634       33.38      100.00
{txt}{hline 22}{c +}{hline 35}
                Total {c |}{res}     13,882      100.00

{txt}{hline}
-> eia_diagnosis = PsA

    Year of diagnosis {c |}      Freq.     Percent        Cum.
{hline 22}{c +}{hline 35}
March 2019-March 2020 {c |}{res}      4,729       34.14       34.14
{txt}March 2020-March 2021 {c |}{res}      4,481       32.35       66.48
{txt}March 2021-March 2022 {c |}{res}      4,643       33.52      100.00
{txt}{hline 22}{c +}{hline 35}
                Total {c |}{res}     13,853      100.00

{txt}{hline}
-> eia_diagnosis = AxSpA

    Year of diagnosis {c |}      Freq.     Percent        Cum.
{hline 22}{c +}{hline 35}
March 2019-March 2020 {c |}{res}      4,596       33.03       33.03
{txt}March 2020-March 2021 {c |}{res}      4,645       33.39       66.42
{txt}March 2021-March 2022 {c |}{res}      4,672       33.58      100.00
{txt}{hline 22}{c +}{hline 35}
                Total {c |}{res}     13,913      100.00

{txt}
{com}. 
. *Time to referral, appointment and EIA code=============================================*/
. 
. **Time from last GP to rheum ref before rheum appt (i.e. if appts are present and in correct time order) //Note - referral could be coded before GP appt?
. gen time_gp_rheum_ref_appt = (referral_rheum_prerheum_date - last_gp_refrheum_date) if referral_rheum_prerheum_date!=. & last_gp_refrheum_date!=. & rheum_appt_date!=. & referral_rheum_prerheum_date>last_gp_refrheum_date & referral_rheum_prerheum_date<rheum_appt_date & rheum_appt_date<eia_code_date
{txt}(42,144 missing values generated)

{com}. tabstat time_gp_rheum_ref_appt, stats (n mean p50 p25 p75) //all patients

{txt}{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_rh~t} {...}
{c |}{...}
 {res}     1173  239.1714       180        73       362
{txt}{hline 13}{c BT}{hline 50}

{com}. bys eia_diagnosis: tabstat time_gp_rheum_ref_appt, stats (n mean p50 p25 p75)

{txt}{hline}
-> eia_diagnosis = RA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_rh~t} {...}
{c |}{...}
 {res}      384    243.25       192      66.5       358
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = PsA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_rh~t} {...}
{c |}{...}
 {res}      381  228.4777       164        69       349
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = AxSpA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_rh~t} {...}
{c |}{...}
 {res}      408  245.3186     185.5      81.5       370
{txt}{hline 13}{c BT}{hline 50}

{com}. 
. **Time from last GP to rheum ref before eia code (sensitivity analysis; includes those with no rheum appt)
. gen time_gp_rheum_ref_code = (referral_rheum_precode_date - last_gp_refcode_date) if referral_rheum_precode_date!=. & last_gp_refcode_date!=. & referral_rheum_precode_date>last_gp_refcode_date & referral_rheum_precode_date<eia_code_date
{txt}(35,789 missing values generated)

{com}. tabstat time_gp_rheum_ref_code, stats (n mean p50 p25 p75)

{txt}{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_rh~e} {...}
{c |}{...}
 {res}     7528  370.4036     304.5       140       545
{txt}{hline 13}{c BT}{hline 50}

{com}. bys eia_diagnosis: tabstat time_gp_rheum_ref_code, stats (n mean p50 p25 p75)

{txt}{hline}
-> eia_diagnosis = RA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_rh~e} {...}
{c |}{...}
 {res}     2482  367.9492       306       138       538
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = PsA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_rh~e} {...}
{c |}{...}
 {res}     2504  373.6785     307.5       140       551
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = AxSpA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_rh~e} {...}
{c |}{...}
 {res}     2542   369.574       300       142       546
{txt}{hline 13}{c BT}{hline 50}

{com}. 
. **Time from last GP to rheum ref (combined - sensitivity analysis; includes those with no rheum appt)
. gen time_gp_rheum_ref_comb = time_gp_rheum_ref_appt 
{txt}(42,144 missing values generated)

{com}. replace time_gp_rheum_ref_comb = time_gp_rheum_ref_code if time_gp_rheum_ref_appt==. & time_gp_rheum_ref_code!=.
{txt}(7,247 real changes made)

{com}. tabstat time_gp_rheum_ref_comb, stats (n mean p50 p25 p75)

{txt}{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_rh~b} {...}
{c |}{...}
 {res}     8420  350.9515       283     125.5       518
{txt}{hline 13}{c BT}{hline 50}

{com}. bys eia_diagnosis: tabstat time_gp_rheum_ref_comb, stats (n mean p50 p25 p75)

{txt}{hline}
-> eia_diagnosis = RA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_rh~b} {...}
{c |}{...}
 {res}     2777  350.6503       286       125       516
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = PsA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_rh~b} {...}
{c |}{...}
 {res}     2795  352.9474       283       125       528
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = AxSpA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_rh~b} {...}
{c |}{...}
 {res}     2848  349.2865       279       126     508.5
{txt}{hline 13}{c BT}{hline 50}

{com}. 
. **Time from last GP pre-rheum appt to first rheum appt (sensitivity analysis; includes those with no rheum ref)
. gen time_gp_rheum_appt = (rheum_appt_date - last_gp_prerheum_date) if rheum_appt_date!=. & last_gp_prerheum_date!=. & rheum_appt_date>last_gp_prerheum_date & rheum_appt_date<eia_code_date
{txt}(36,444 missing values generated)

{com}. tabstat time_gp_rheum_appt, stats (n mean p50 p25 p75)

{txt}{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_~m_appt} {...}
{c |}{...}
 {res}     6873  285.8379       227       102       410
{txt}{hline 13}{c BT}{hline 50}

{com}. bys eia_diagnosis: tabstat time_gp_rheum_appt, stats (n mean p50 p25 p75)

{txt}{hline}
-> eia_diagnosis = RA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_~m_appt} {...}
{c |}{...}
 {res}     2254  285.3035       231        98       413
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = PsA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_~m_appt} {...}
{c |}{...}
 {res}     2328  283.5769       226        99     410.5
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = AxSpA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_~m_appt} {...}
{c |}{...}
 {res}     2291  288.6613       227       107       407
{txt}{hline 13}{c BT}{hline 50}

{com}. 
. **Time from last GP pre-code to EIA code (sensitivity analysis; includes those with no rheum ref and/or no rheum appt)
. gen time_gp_eia_code = (eia_code_date - last_gp_precode_date) if eia_code_date!=. & last_gp_precode_date!=. & eia_code_date>last_gp_precode_date
{txt}(19,172 missing values generated)

{com}. tabstat time_gp_eia_code, stats (n mean p50 p25 p75)

{txt}{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_ei~e} {...}
{c |}{...}
 {res}    24145  518.9004       467       227       766
{txt}{hline 13}{c BT}{hline 50}

{com}. bys eia_diagnosis: tabstat time_gp_eia_code, stats (n mean p50 p25 p75)

{txt}{hline}
-> eia_diagnosis = RA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_ei~e} {...}
{c |}{...}
 {res}     8029  518.1316       463       227       766
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = PsA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_ei~e} {...}
{c |}{...}
 {res}     8081  519.3837       467       231       762
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = AxSpA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_ei~e} {...}
{c |}{...}
 {res}     8035  519.1823       471       224       769
{txt}{hline 13}{c BT}{hline 50}

{com}. 
. **Time from last GP to EIA diagnosis (combined - sensitivity analysis; includes those with no rheum appt)
. gen time_gp_eia_diag = time_gp_rheum_appt
{txt}(36,444 missing values generated)

{com}. replace time_gp_eia_diag = time_gp_eia_code if time_gp_rheum_appt==. & time_gp_eia_code!=.
{txt}(19,794 real changes made)

{com}. tabstat time_gp_eia_diag, stats (n mean p50 p25 p75)

{txt}{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_ei~g} {...}
{c |}{...}
 {res}    26667  452.3486       382       176       673
{txt}{hline 13}{c BT}{hline 50}

{com}. bys eia_diagnosis: tabstat time_gp_eia_diag, stats (n mean p50 p25 p75)

{txt}{hline}
-> eia_diagnosis = RA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_ei~g} {...}
{c |}{...}
 {res}     8871   454.495       384       176       676
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = PsA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_ei~g} {...}
{c |}{...}
 {res}     8930  450.7746       382       176       668
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = AxSpA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_ei~g} {...}
{c |}{...}
 {res}     8866  451.7864       380       176       672
{txt}{hline 13}{c BT}{hline 50}

{com}. 
. **Time from rheum ref to rheum appt (i.e. if appts are present and in correct time order)
. gen time_ref_rheum_appt = (rheum_appt_date - referral_rheum_prerheum_date) if rheum_appt_date!=. & referral_rheum_prerheum_date!=. & referral_rheum_prerheum_date<rheum_appt_date & rheum_appt_date<eia_code_date
{txt}(36,583 missing values generated)

{com}. tabstat time_ref_rheum_appt, stats (n mean p50 p25 p75)

{txt}{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_ref_r~t} {...}
{c |}{...}
 {res}     6734  288.1524       228       102       414
{txt}{hline 13}{c BT}{hline 50}

{com}. bys eia_diagnosis: tabstat time_ref_rheum_appt, stats (n mean p50 p25 p75)

{txt}{hline}
-> eia_diagnosis = RA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_ref_r~t} {...}
{c |}{...}
 {res}     2226  286.3073     225.5       102       408
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = PsA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_ref_r~t} {...}
{c |}{...}
 {res}     2205  299.2313       243       104       434
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = AxSpA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_ref_r~t} {...}
{c |}{...}
 {res}     2303  279.3283       219       101       402
{txt}{hline 13}{c BT}{hline 50}

{com}. 
. **Time from rheum ref to EIA code (sensitivity analysis; includes those with no rheum appt)
. gen time_ref_rheum_eia = (eia_code_date - referral_rheum_precode_date) if eia_code_date!=. & referral_rheum_precode_date!=. & referral_rheum_precode_date<eia_code_date  
{txt}(19,212 missing values generated)

{com}. tabstat time_ref_rheum_eia, stats (n mean p50 p25 p75)

{txt}{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_ref_r~a} {...}
{c |}{...}
 {res}    24105  519.6585       467       233       767
{txt}{hline 13}{c BT}{hline 50}

{com}. bys eia_diagnosis: tabstat time_ref_rheum_eia, stats (n mean p50 p25 p75)

{txt}{hline}
-> eia_diagnosis = RA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_ref_r~a} {...}
{c |}{...}
 {res}     8066  524.7202       476       237       774
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = PsA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_ref_r~a} {...}
{c |}{...}
 {res}     8018  516.1151       462       234       759
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = AxSpA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_ref_r~a} {...}
{c |}{...}
 {res}     8021  518.1103       463       230       764
{txt}{hline 13}{c BT}{hline 50}

{com}. 
. **Time from rheum ref to EIA diagnosis (combined - sensitivity analysis; includes those with no rheum appt)
. gen time_ref_rheum_eia_comb = time_ref_rheum_appt
{txt}(36,583 missing values generated)

{com}. replace time_ref_rheum_eia_comb = time_ref_rheum_eia if time_ref_rheum_appt==. & time_ref_rheum_eia!=.
{txt}(19,878 real changes made)

{com}. tabstat time_ref_rheum_eia_comb, stats (n mean p50 p25 p75)

{txt}{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_ref_r~b} {...}
{c |}{...}
 {res}    26612  455.1353       384       178     679.5
{txt}{hline 13}{c BT}{hline 50}

{com}. bys eia_diagnosis: tabstat time_ref_rheum_eia_comb, stats (n mean p50 p25 p75)

{txt}{hline}
-> eia_diagnosis = RA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_ref_r~b} {...}
{c |}{...}
 {res}     8924   460.103       388       179       690
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = PsA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_ref_r~b} {...}
{c |}{...}
 {res}     8822  457.3474       389       182       676
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = AxSpA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_ref_r~b} {...}
{c |}{...}
 {res}     8866   447.934       376       174       669
{txt}{hline 13}{c BT}{hline 50}

{com}. 
. **Time from rheum appt to EIA code (i.e. if appts are present and in correct time order)
. gen time_rheum_eia_code = (eia_code_date - rheum_appt_date) if eia_code_date!=. & rheum_appt_date!=. & rheum_appt_date<eia_code_date 
{txt}(13,958 missing values generated)

{com}. tabstat time_rheum_eia_code, stats (n mean p50 p25 p75) 

{txt}{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_rheum~e} {...}
{c |}{...}
 {res}    29359  602.9302       575       312       875
{txt}{hline 13}{c BT}{hline 50}

{com}. bys eia_diagnosis: tabstat time_rheum_eia_code, stats (n mean p50 p25 p75) 

{txt}{hline}
-> eia_diagnosis = RA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_rheum~e} {...}
{c |}{...}
 {res}     9713  604.9759       579       312       881
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = PsA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_rheum~e} {...}
{c |}{...}
 {res}     9814  599.9176       571       312       865
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = AxSpA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_rheum~e} {...}
{c |}{...}
 {res}     9832  603.9165       575       313       879
{txt}{hline 13}{c BT}{hline 50}

{com}. 
. ***************************************************************************************************************************
. *Time to first prescription - all of the below are shared care prescriptions, aside from those with MTX_high cost drug data included
. 
. **Time to first csDMARD script for RA patients, whereby first rheum appt is classed as diagnosis date (assumes rheum appt present; not including high cost MTX prescriptions)
. gen time_to_csdmard=(csdmard_date-rheum_appt_date) if csdmard==1 & rheum_appt_date!=. & csdmard_date>rheum_appt_date 
{txt}(30,694 missing values generated)

{com}. tabstat time_to_csdmard if ra_code==1, stats (n mean p50 p25 p75)

{txt}{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_cs~d} {...}
{c |}{...}
 {res}     4275  558.9808       519       286       804
{txt}{hline 13}{c BT}{hline 50}

{com}. 
. **Time to first csDMARD script for RA patients (including high cost MTX prescriptions)
. gen time_to_csdmard_hcd=(csdmard_hcd_date-rheum_appt_date) if csdmard_hcd==1 & rheum_appt_date!=. & csdmard_hcd_date>rheum_appt_date 
{txt}(29,095 missing values generated)

{com}. tabstat time_to_csdmard_hcd if ra_code==1, stats (n mean p50 p25 p75) 

{txt}{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_c~cd} {...}
{c |}{...}
 {res}     4786  555.6084       513       285       797
{txt}{hline 13}{c BT}{hline 50}

{com}. 
. **Time to first csDMARD script for PsA patients (not including high cost MTX prescriptions)
. tabstat time_to_csdmard if psa_code==1, stats (n mean p50 p25 p75)

{txt}{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_c~rd} {...}
{c |}{...}
 {res}     4100  563.2641     518.5       285     821.5
{txt}{hline 13}{c BT}{hline 50}

{com}. tab csdmard if rheum_appt_date!=. & csdmard_date<rheum_appt_date & psa_code==1 
{txt}no observations

{com}. 
. **Time to first csDMARD script for PsA patients (including high cost MTX prescriptions)
. tabstat time_to_csdmard_hcd if psa_code==1, stats (n mean p50 p25 p75) 

{txt}{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_c~cd} {...}
{c |}{...}
 {res}     4648  555.8681       510       278     805.5
{txt}{hline 13}{c BT}{hline 50}

{com}. tab csdmard_hcd if rheum_appt_date!=. & csdmard_hcd_date<rheum_appt_date & psa_code==1  

{txt}csdmard_hcd {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}        234      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        234      100.00
{txt}
{com}. 
. **csDMARD time categories for RA patients (not including high cost MTX prescriptions)
. gen csdmard_6w=1 if time_to_csdmard<=42 & time_to_csdmard!=. 
{txt}(42,920 missing values generated)

{com}. recode csdmard_6w .=0
{txt}(csdmard_6w: 42920 changes made)

{com}. tab csdmard_6w if ra_code==1

 {txt}csdmard_6w {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     14,307       99.19       99.19
{txt}          1 {c |}{res}        117        0.81      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,424      100.00
{txt}
{com}. gen csdmard_3m=1 if time_to_csdmard<=90 & time_to_csdmard!=. 
{txt}(42,433 missing values generated)

{com}. recode csdmard_3m .=0
{txt}(csdmard_3m: 42433 changes made)

{com}. tab csdmard_3m if ra_code==1

 {txt}csdmard_3m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     14,136       98.00       98.00
{txt}          1 {c |}{res}        288        2.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,424      100.00
{txt}
{com}. gen csdmard_6m=1 if time_to_csdmard<=180 & time_to_csdmard!=. 
{txt}(41,410 missing values generated)

{com}. recode csdmard_6m .=0
{txt}(csdmard_6m: 41410 changes made)

{com}. tab csdmard_6m if ra_code==1

 {txt}csdmard_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     13,794       95.63       95.63
{txt}          1 {c |}{res}        630        4.37      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,424      100.00
{txt}
{com}. gen csdmard_12m=1 if time_to_csdmard<=365 & time_to_csdmard!=. 
{txt}(38,989 missing values generated)

{com}. recode csdmard_12m .=0
{txt}(csdmard_12m: 38989 changes made)

{com}. tab csdmard_12m if ra_code==1

{txt}csdmard_12m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     12,976       89.96       89.96
{txt}          1 {c |}{res}      1,448       10.04      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,424      100.00
{txt}
{com}. 
. **csDMARD time categories for RA patients (including high cost MTX prescriptions)
. gen csdmard_hcd_6w=1 if time_to_csdmard_hcd<=42 & time_to_csdmard_hcd!=.
{txt}(42,849 missing values generated)

{com}. recode csdmard_hcd_6w .=0
{txt}(csdmard_hcd_6w: 42849 changes made)

{com}. tab csdmard_hcd_6w if ra_code==1

{txt}csdmard_hcd {c |}
        _6w {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     14,282       99.02       99.02
{txt}          1 {c |}{res}        142        0.98      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,424      100.00
{txt}
{com}. gen csdmard_hcd_3m=1 if time_to_csdmard_hcd<=90 & time_to_csdmard_hcd!=.
{txt}(42,306 missing values generated)

{com}. recode csdmard_hcd_3m .=0
{txt}(csdmard_hcd_3m: 42306 changes made)

{com}. tab csdmard_hcd_3m if ra_code==1

{txt}csdmard_hcd {c |}
        _3m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     14,090       97.68       97.68
{txt}          1 {c |}{res}        334        2.32      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,424      100.00
{txt}
{com}. gen csdmard_hcd_6m=1 if time_to_csdmard_hcd<=180 & time_to_csdmard_hcd!=.
{txt}(41,129 missing values generated)

{com}. recode csdmard_hcd_6m .=0
{txt}(csdmard_hcd_6m: 41129 changes made)

{com}. tab csdmard_hcd_6m if ra_code==1

{txt}csdmard_hcd {c |}
        _6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     13,714       95.08       95.08
{txt}          1 {c |}{res}        710        4.92      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,424      100.00
{txt}
{com}. gen csdmard_hcd_12m=1 if time_to_csdmard_hcd<=365 & time_to_csdmard_hcd!=.
{txt}(38,350 missing values generated)

{com}. recode csdmard_hcd_12m .=0
{txt}(csdmard_hcd_12m: 38350 changes made)

{com}. tab csdmard_hcd_12m if ra_code==1

{txt}csdmard_hcd {c |}
       _12m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     12,784       88.63       88.63
{txt}          1 {c |}{res}      1,640       11.37      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,424      100.00
{txt}
{com}. 
. **csDMARD time categories for PsA patients (not including high cost MTX prescriptions)
. tab csdmard_6w if psa_code==1

 {txt}csdmard_6w {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     14,310       99.12       99.12
{txt}          1 {c |}{res}        127        0.88      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,437      100.00
{txt}
{com}. tab csdmard_3m if psa_code==1

 {txt}csdmard_3m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     14,154       98.04       98.04
{txt}          1 {c |}{res}        283        1.96      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,437      100.00
{txt}
{com}. tab csdmard_6m if psa_code==1

 {txt}csdmard_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     13,831       95.80       95.80
{txt}          1 {c |}{res}        606        4.20      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,437      100.00
{txt}
{com}. tab csdmard_12m if psa_code==1

{txt}csdmard_12m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     13,036       90.30       90.30
{txt}          1 {c |}{res}      1,401        9.70      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,437      100.00
{txt}
{com}. 
. **csDMARD time categories for PsA patients (including high cost MTX prescriptions)
. tab csdmard_hcd_6w if psa_code==1

{txt}csdmard_hcd {c |}
        _6w {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     14,294       99.01       99.01
{txt}          1 {c |}{res}        143        0.99      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,437      100.00
{txt}
{com}. tab csdmard_hcd_3m if psa_code==1

{txt}csdmard_hcd {c |}
        _3m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     14,122       97.82       97.82
{txt}          1 {c |}{res}        315        2.18      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,437      100.00
{txt}
{com}. tab csdmard_hcd_6m if psa_code==1

{txt}csdmard_hcd {c |}
        _6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     13,734       95.13       95.13
{txt}          1 {c |}{res}        703        4.87      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,437      100.00
{txt}
{com}. tab csdmard_hcd_12m if psa_code==1

{txt}csdmard_hcd {c |}
       _12m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     12,815       88.76       88.76
{txt}          1 {c |}{res}      1,622       11.24      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,437      100.00
{txt}
{com}. 
. **What was first shared care csDMARD (not including high cost MTX prescriptions)
. gen first_csD=""
{txt}(43,317 missing values generated)

{com}. foreach var of varlist hydroxychloroquine_date leflunomide_date methotrexate_date methotrexate_inj_date sulfasalazine_date {c -(}
{txt}  2{com}.         replace first_csD="`var'" if csdmard_date==`var' & csdmard_date!=.
{txt}  3{com}.         {c )-}
{txt}variable {bf}first_csD{sf} was {bf}{res}str1{sf}{txt} now {bf}{res}str23{sf}
{txt}(3,136 real changes made)
(3,114 real changes made)
(3,165 real changes made)
(3,100 real changes made)
(3,083 real changes made)

{com}. gen first_csDMARD = substr(first_csD, 1, length(first_csD) - 5) if first_csD!=""
{txt}(27,726 missing values generated)

{com}. drop first_csD
{txt}
{com}. tab first_csDMARD if ra_code==1 //for RA patients

     {txt}first_csDMARD {c |}      Freq.     Percent        Cum.
{hline 19}{c +}{hline 35}
hydroxychloroquine {c |}{res}      1,016       19.36       19.36
{txt}       leflunomide {c |}{res}      1,017       19.38       38.74
{txt}      methotrexate {c |}{res}      1,062       20.24       58.97
{txt}  methotrexate_inj {c |}{res}      1,110       21.15       80.13
{txt}     sulfasalazine {c |}{res}      1,043       19.87      100.00
{txt}{hline 19}{c +}{hline 35}
             Total {c |}{res}      5,248      100.00
{txt}
{com}. tab first_csDMARD if psa_code==1 //for PsA patients

     {txt}first_csDMARD {c |}      Freq.     Percent        Cum.
{hline 19}{c +}{hline 35}
hydroxychloroquine {c |}{res}      1,040       20.38       20.38
{txt}       leflunomide {c |}{res}      1,023       20.04       40.42
{txt}      methotrexate {c |}{res}      1,054       20.65       61.07
{txt}  methotrexate_inj {c |}{res}        958       18.77       79.84
{txt}     sulfasalazine {c |}{res}      1,029       20.16      100.00
{txt}{hline 19}{c +}{hline 35}
             Total {c |}{res}      5,104      100.00
{txt}
{com}. 
. 
. **What was first csDMARD (including high cost MTX prescriptions)
. gen first_csD_hcd=""
{txt}(43,317 missing values generated)

{com}. foreach var of varlist hydroxychloroquine_date leflunomide_date methotrexate_date methotrexate_inj_date methotrexate_hcd_date sulfasalazine_date {c -(}
{txt}  2{com}.         replace first_csD_hcd="`var'" if csdmard_hcd_date==`var' & csdmard_hcd_date!=.
{txt}  3{com}.         {c )-}
{txt}variable {bf}first_csD_hcd{sf} was {bf}{res}str1{sf}{txt} now {bf}{res}str23{sf}
{txt}(2,964 real changes made)
(2,963 real changes made)
(2,990 real changes made)
(2,932 real changes made)
(3,548 real changes made)
(2,927 real changes made)

{com}. gen first_csDMARD_hcd = substr(first_csD_hcd, 1, length(first_csD_hcd) - 5) if first_csD_hcd!=""
{txt}(25,001 missing values generated)

{com}. drop first_csD_hcd
{txt}
{com}. tab first_csDMARD_hcd if ra_code==1 //for RA patients

 {txt}first_csDMARD_hcd {c |}      Freq.     Percent        Cum.
{hline 19}{c +}{hline 35}
hydroxychloroquine {c |}{res}        962       15.69       15.69
{txt}       leflunomide {c |}{res}        971       15.83       31.52
{txt}      methotrexate {c |}{res}      1,007       16.42       47.95
{txt}  methotrexate_hcd {c |}{res}      1,147       18.71       66.65
{txt}  methotrexate_inj {c |}{res}      1,053       17.17       83.82
{txt}     sulfasalazine {c |}{res}        992       16.18      100.00
{txt}{hline 19}{c +}{hline 35}
             Total {c |}{res}      6,132      100.00
{txt}
{com}. tab first_csDMARD_hcd if psa_code==1 //for PsA patients

 {txt}first_csDMARD_hcd {c |}      Freq.     Percent        Cum.
{hline 19}{c +}{hline 35}
hydroxychloroquine {c |}{res}        985       16.34       16.34
{txt}       leflunomide {c |}{res}        970       16.09       32.43
{txt}      methotrexate {c |}{res}        979       16.24       48.67
{txt}  methotrexate_hcd {c |}{res}      1,217       20.19       68.86
{txt}  methotrexate_inj {c |}{res}        908       15.06       83.93
{txt}     sulfasalazine {c |}{res}        969       16.07      100.00
{txt}{hline 19}{c +}{hline 35}
             Total {c |}{res}      6,028      100.00
{txt}
{com}.  
. **Methotrexate use (not including high cost MTX prescriptions)
. gen mtx=1 if methotrexate==1 | methotrexate_inj==1
{txt}(36,153 missing values generated)

{com}. recode mtx .=0 
{txt}(mtx: 36153 changes made)

{com}. tab mtx if ra_code==1 //for RA patients

        {txt}mtx {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     11,953       82.87       82.87
{txt}          1 {c |}{res}      2,471       17.13      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,424      100.00
{txt}
{com}. tab mtx if psa_code==1 //for PsA patients

        {txt}mtx {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     12,125       83.99       83.99
{txt}          1 {c |}{res}      2,312       16.01      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,437      100.00
{txt}
{com}. 
. **Methotrexate use (including high cost MTX prescriptions)
. gen mtx_hcd=1 if methotrexate==1 | methotrexate_inj==1 | methotrexate_hcd==1
{txt}(32,590 missing values generated)

{com}. recode mtx_hcd .=0 
{txt}(mtx_hcd: 32590 changes made)

{com}. tab mtx_hcd if ra_code==1 //for RA patients

    {txt}mtx_hcd {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     10,801       74.88       74.88
{txt}          1 {c |}{res}      3,623       25.12      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,424      100.00
{txt}
{com}. tab mtx_hcd if psa_code==1 //for PsA patients

    {txt}mtx_hcd {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     10,904       75.53       75.53
{txt}          1 {c |}{res}      3,533       24.47      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,437      100.00
{txt}
{com}. 
. **Date of first methotrexate script (not including high cost MTX prescriptions)
. gen mtx_date=min(methotrexate_date, methotrexate_inj_date)
{txt}(36,153 missing values generated)

{com}. format %td mtx_date
{txt}
{com}. 
. **Date of first methotrexate script (including high cost MTX prescriptions)
. gen mtx_hcd_date=min(methotrexate_date, methotrexate_inj_date, methotrexate_hcd_date)
{txt}(32,590 missing values generated)

{com}. format %td mtx_hcd_date
{txt}
{com}. 
. **Time to first methotrexate script for RA patients (not including high cost MTX prescriptions)
. gen time_to_mtx=(mtx_date-rheum_appt_date) if mtx==1 & rheum_appt_date!=. & mtx_date>rheum_appt_date 
{txt}(37,507 missing values generated)

{com}. tabstat time_to_mtx if ra_code==1, stats (n mean p50 p25 p75)

{txt}{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_mtx} {...}
{c |}{...}
 {res}     2008  586.2714       556       318       822
{txt}{hline 13}{c BT}{hline 50}

{com}. 
. **Time to first methotrexate script for RA patients (including high cost MTX prescriptions)
. gen time_to_mtx_hcd=(mtx_hcd_date-rheum_appt_date) if mtx_hcd==1 & rheum_appt_date!=. & mtx_hcd_date>rheum_appt_date 
{txt}(35,222 missing values generated)

{com}. tabstat time_to_mtx_hcd if ra_code==1, stats (n mean p50 p25 p75)

{txt}{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_mt~d} {...}
{c |}{...}
 {res}     2746   585.528       557       318       826
{txt}{hline 13}{c BT}{hline 50}

{com}. 
. **Time to first methotrexate script for PsA patients (not including high cost MTX prescriptions)
. tabstat time_to_mtx if psa_code==1, stats (n mean p50 p25 p75)

{txt}{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_mtx} {...}
{c |}{...}
 {res}     1863  587.8964       560       301       857
{txt}{hline 13}{c BT}{hline 50}

{com}. tab mtx if rheum_appt_date!=. & mtx_date<rheum_appt_date & psa_code==1 //how many patients had precriptions pre-rheum appt
{txt}no observations

{com}. 
. **Time to first methotrexate script for PsA patients (including high cost MTX prescriptions)
. tabstat time_to_mtx_hcd if psa_code==1, stats (n mean p50 p25 p75)

{txt}{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_mt~d} {...}
{c |}{...}
 {res}     2644  581.2591       549       296       848
{txt}{hline 13}{c BT}{hline 50}

{com}. tab mtx_hcd if rheum_appt_date!=. & mtx_hcd_date<rheum_appt_date & psa_code==1 //how many patients had precriptions pre-rheum appt

    {txt}mtx_hcd {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}        234      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        234      100.00
{txt}
{com}. 
. **Methotrexate time categories for RA patients (not including high-cost MTX) //Nb. this is time period from rheum appt (i.e. diagnosis) to shared care, not from referral to first script 
. gen mtx_6w=1 if time_to_mtx<=42 & time_to_mtx!=.
{txt}(43,161 missing values generated)

{com}. recode mtx_6w .=0
{txt}(mtx_6w: 43161 changes made)

{com}. tab mtx_6w if ra_code==1

     {txt}mtx_6w {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     14,372       99.64       99.64
{txt}          1 {c |}{res}         52        0.36      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,424      100.00
{txt}
{com}. gen mtx_3m=1 if time_to_mtx<=90 & time_to_mtx!=.
{txt}(42,960 missing values generated)

{com}. recode mtx_3m .=0
{txt}(mtx_3m: 42960 changes made)

{com}. tab mtx_3m if ra_code==1

     {txt}mtx_3m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     14,310       99.21       99.21
{txt}          1 {c |}{res}        114        0.79      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,424      100.00
{txt}
{com}. gen mtx_6m=1 if time_to_mtx<=180 & time_to_mtx!=.
{txt}(42,531 missing values generated)

{com}. recode mtx_6m .=0
{txt}(mtx_6m: 42531 changes made)

{com}. tab mtx_6m if ra_code==1

     {txt}mtx_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     14,169       98.23       98.23
{txt}          1 {c |}{res}        255        1.77      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,424      100.00
{txt}
{com}. gen mtx_12m=1 if time_to_mtx<=365 & time_to_mtx!=.
{txt}(41,534 missing values generated)

{com}. recode mtx_12m .=0
{txt}(mtx_12m: 41534 changes made)

{com}. tab mtx_12m if ra_code==1

    {txt}mtx_12m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     13,823       95.83       95.83
{txt}          1 {c |}{res}        601        4.17      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,424      100.00
{txt}
{com}. 
. **Methotrexate time categories for RA patients (including high-cost MTX)
. gen mtx_hcd_6w=1 if time_to_mtx_hcd<=42 & time_to_mtx_hcd!=.
{txt}(43,081 missing values generated)

{com}. recode mtx_hcd_6w .=0
{txt}(mtx_hcd_6w: 43081 changes made)

{com}. tab mtx_hcd_6w if ra_code==1

 {txt}mtx_hcd_6w {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     14,343       99.44       99.44
{txt}          1 {c |}{res}         81        0.56      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,424      100.00
{txt}
{com}. gen mtx_hcd_3m=1 if time_to_mtx_hcd<=90 & time_to_mtx_hcd!=.
{txt}(42,812 missing values generated)

{com}. recode mtx_hcd_3m .=0
{txt}(mtx_hcd_3m: 42812 changes made)

{com}. tab mtx_hcd_3m if ra_code==1

 {txt}mtx_hcd_3m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     14,255       98.83       98.83
{txt}          1 {c |}{res}        169        1.17      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,424      100.00
{txt}
{com}. gen mtx_hcd_6m=1 if time_to_mtx_hcd<=180 & time_to_mtx_hcd!=.
{txt}(42,195 missing values generated)

{com}. recode mtx_hcd_6m .=0
{txt}(mtx_hcd_6m: 42195 changes made)

{com}. tab mtx_hcd_6m if ra_code==1

 {txt}mtx_hcd_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     14,064       97.50       97.50
{txt}          1 {c |}{res}        360        2.50      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,424      100.00
{txt}
{com}. gen mtx_hcd_12m=1 if time_to_mtx_hcd<=365 & time_to_mtx_hcd!=.
{txt}(40,753 missing values generated)

{com}. recode mtx_hcd_12m .=0
{txt}(mtx_hcd_12m: 40753 changes made)

{com}. tab mtx_hcd_12m if ra_code==1

{txt}mtx_hcd_12m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     13,586       94.19       94.19
{txt}          1 {c |}{res}        838        5.81      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,424      100.00
{txt}
{com}. 
. **Methotrexate time categories for PsA patients (not including high-cost MTX)
. tab mtx_6w if psa_code==1

     {txt}mtx_6w {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     14,387       99.65       99.65
{txt}          1 {c |}{res}         50        0.35      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,437      100.00
{txt}
{com}. tab mtx_3m if psa_code==1

     {txt}mtx_3m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     14,321       99.20       99.20
{txt}          1 {c |}{res}        116        0.80      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,437      100.00
{txt}
{com}. tab mtx_6m if psa_code==1

     {txt}mtx_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     14,182       98.23       98.23
{txt}          1 {c |}{res}        255        1.77      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,437      100.00
{txt}
{com}. tab mtx_12m if psa_code==1

    {txt}mtx_12m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     13,852       95.95       95.95
{txt}          1 {c |}{res}        585        4.05      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,437      100.00
{txt}
{com}. 
. **Methotrexate time categories for PsA patients (including high-cost MTX)
. tab mtx_hcd_6w if psa_code==1

 {txt}mtx_hcd_6w {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     14,370       99.54       99.54
{txt}          1 {c |}{res}         67        0.46      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,437      100.00
{txt}
{com}. tab mtx_hcd_3m if psa_code==1

 {txt}mtx_hcd_3m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     14,282       98.93       98.93
{txt}          1 {c |}{res}        155        1.07      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,437      100.00
{txt}
{com}. tab mtx_hcd_6m if psa_code==1

 {txt}mtx_hcd_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     14,072       97.47       97.47
{txt}          1 {c |}{res}        365        2.53      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,437      100.00
{txt}
{com}. tab mtx_hcd_12m if psa_code==1

{txt}mtx_hcd_12m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     13,584       94.09       94.09
{txt}          1 {c |}{res}        853        5.91      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,437      100.00
{txt}
{com}. 
. **Time to first biologic script, whereby first rheum appt is classed as diagnosis date (assumes rheum appt present)
. gen time_to_biologic=(biologic_date-rheum_appt_date) if biologic==1 & rheum_appt_date!=. & biologic_date>rheum_appt_date 
{txt}(17,474 missing values generated)

{com}. tabstat time_to_biologic, stats (n mean p50 p25 p75) //for all EIA patients

{txt}{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_bi~c} {...}
{c |}{...}
 {res}    25843  459.9462       401       205       661
{txt}{hline 13}{c BT}{hline 50}

{com}. bys eia_diagnosis: tabstat time_to_biologic, stats (n mean p50 p25 p75) 

{txt}{hline}
-> eia_diagnosis = RA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_bi~c} {...}
{c |}{...}
 {res}     8581  458.5984       401       203       659
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = PsA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_bi~c} {...}
{c |}{...}
 {res}     8613    458.87       400       205       657
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = AxSpA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_bi~c} {...}
{c |}{...}
 {res}     8649  462.3552       402       207       671
{txt}{hline 13}{c BT}{hline 50}

{com}. 
. **What was first biologic
. gen first_bio=""
{txt}(43,317 missing values generated)

{com}. foreach var of varlist abatacept_date adalimumab_date baricitinib_date certolizumab_date etanercept_date golimumab_date guselkumab_date infliximab_date ixekizumab_date rituximab_date sarilumab_date secukinumab_date tocilizumab_date tofacitinib_date upadacitinib_date ustekinumab_date {c -(}
{txt}  2{com}.         replace first_bio="`var'" if biologic_date==`var' & biologic_date!=.
{txt}  3{com}.         {c )-}
{txt}variable {bf}first_bio{sf} was {bf}{res}str1{sf}{txt} now {bf}{res}str14{sf}
{txt}(2,037 real changes made)
variable {bf}first_bio{sf} was {bf}{res}str14{sf}{txt} now {bf}{res}str15{sf}
{txt}(1,978 real changes made)
variable {bf}first_bio{sf} was {bf}{res}str15{sf}{txt} now {bf}{res}str16{sf}
{txt}(2,030 real changes made)
variable {bf}first_bio{sf} was {bf}{res}str16{sf}{txt} now {bf}{res}str17{sf}
{txt}(1,979 real changes made)
(2,010 real changes made)
(2,042 real changes made)
(2,079 real changes made)
(2,032 real changes made)
(2,108 real changes made)
(2,056 real changes made)
(1,984 real changes made)
(1,999 real changes made)
(1,986 real changes made)
(2,067 real changes made)
(2,059 real changes made)
(2,050 real changes made)

{com}. gen first_biologic = substr(first_bio, 1, length(first_bio) - 5)        
{txt}(11,498 missing values generated)

{com}. drop first_bio
{txt}
{com}. tab first_biologic //for all EIA patients

{txt}first_biolog {c |}
          ic {c |}      Freq.     Percent        Cum.
{hline 13}{c +}{hline 35}
   abatacept {c |}{res}      1,960        6.16        6.16
{txt}  adalimumab {c |}{res}      1,903        5.98       12.14
{txt} baricitinib {c |}{res}      1,958        6.15       18.29
{txt}certolizumab {c |}{res}      1,906        5.99       24.28
{txt}  etanercept {c |}{res}      1,956        6.15       30.43
{txt}   golimumab {c |}{res}      1,987        6.24       36.68
{txt}  guselkumab {c |}{res}      2,016        6.34       43.01
{txt}  infliximab {c |}{res}      1,985        6.24       49.25
{txt}  ixekizumab {c |}{res}      2,059        6.47       55.72
{txt}   rituximab {c |}{res}      2,021        6.35       62.07
{txt}   sarilumab {c |}{res}      1,962        6.17       68.24
{txt} secukinumab {c |}{res}      1,973        6.20       74.44
{txt} tocilizumab {c |}{res}      1,972        6.20       80.64
{txt} tofacitinib {c |}{res}      2,055        6.46       87.10
{txt}upadacitinib {c |}{res}      2,056        6.46       93.56
{txt} ustekinumab {c |}{res}      2,050        6.44      100.00
{txt}{hline 13}{c +}{hline 35}
       Total {c |}{res}     31,819      100.00
{txt}
{com}. bys eia_diagnosis: tab first_biologic 

{txt}{hline}
-> eia_diagnosis = RA

first_biolog {c |}
          ic {c |}      Freq.     Percent        Cum.
{hline 13}{c +}{hline 35}
   abatacept {c |}{res}        661        6.24        6.24
{txt}  adalimumab {c |}{res}        644        6.08       12.31
{txt} baricitinib {c |}{res}        697        6.58       18.89
{txt}certolizumab {c |}{res}        654        6.17       25.06
{txt}  etanercept {c |}{res}        658        6.21       31.27
{txt}   golimumab {c |}{res}        684        6.45       37.72
{txt}  guselkumab {c |}{res}        667        6.29       44.02
{txt}  infliximab {c |}{res}        661        6.24       50.25
{txt}  ixekizumab {c |}{res}        680        6.42       56.67
{txt}   rituximab {c |}{res}        672        6.34       63.01
{txt}   sarilumab {c |}{res}        658        6.21       69.22
{txt} secukinumab {c |}{res}        666        6.28       75.50
{txt} tocilizumab {c |}{res}        626        5.91       81.41
{txt} tofacitinib {c |}{res}        623        5.88       87.29
{txt}upadacitinib {c |}{res}        690        6.51       93.80
{txt} ustekinumab {c |}{res}        657        6.20      100.00
{txt}{hline 13}{c +}{hline 35}
       Total {c |}{res}     10,598      100.00

{txt}{hline}
-> eia_diagnosis = PsA

first_biolog {c |}
          ic {c |}      Freq.     Percent        Cum.
{hline 13}{c +}{hline 35}
   abatacept {c |}{res}        664        6.25        6.25
{txt}  adalimumab {c |}{res}        648        6.10       12.34
{txt} baricitinib {c |}{res}        641        6.03       18.37
{txt}certolizumab {c |}{res}        616        5.79       24.17
{txt}  etanercept {c |}{res}        676        6.36       30.52
{txt}   golimumab {c |}{res}        646        6.08       36.60
{txt}  guselkumab {c |}{res}        652        6.13       42.73
{txt}  infliximab {c |}{res}        633        5.95       48.69
{txt}  ixekizumab {c |}{res}        676        6.36       55.05
{txt}   rituximab {c |}{res}        671        6.31       61.36
{txt}   sarilumab {c |}{res}        647        6.09       67.44
{txt} secukinumab {c |}{res}        673        6.33       73.77
{txt} tocilizumab {c |}{res}        688        6.47       80.25
{txt} tofacitinib {c |}{res}        716        6.74       86.98
{txt}upadacitinib {c |}{res}        691        6.50       93.48
{txt} ustekinumab {c |}{res}        693        6.52      100.00
{txt}{hline 13}{c +}{hline 35}
       Total {c |}{res}     10,631      100.00

{txt}{hline}
-> eia_diagnosis = AxSpA

first_biolog {c |}
          ic {c |}      Freq.     Percent        Cum.
{hline 13}{c +}{hline 35}
   abatacept {c |}{res}        635        6.00        6.00
{txt}  adalimumab {c |}{res}        611        5.77       11.77
{txt} baricitinib {c |}{res}        620        5.85       17.62
{txt}certolizumab {c |}{res}        636        6.01       23.63
{txt}  etanercept {c |}{res}        622        5.87       29.50
{txt}   golimumab {c |}{res}        657        6.20       35.70
{txt}  guselkumab {c |}{res}        697        6.58       42.29
{txt}  infliximab {c |}{res}        691        6.53       48.81
{txt}  ixekizumab {c |}{res}        703        6.64       55.45
{txt}   rituximab {c |}{res}        678        6.40       61.85
{txt}   sarilumab {c |}{res}        657        6.20       68.05
{txt} secukinumab {c |}{res}        634        5.99       74.04
{txt} tocilizumab {c |}{res}        658        6.21       80.25
{txt} tofacitinib {c |}{res}        716        6.76       87.02
{txt}upadacitinib {c |}{res}        675        6.37       93.39
{txt} ustekinumab {c |}{res}        700        6.61      100.00
{txt}{hline 13}{c +}{hline 35}
       Total {c |}{res}     10,590      100.00

{txt}
{com}. 
. **Biologic time categories (for all patients)
. gen biologic_6m=1 if time_to_biologic<=180 & time_to_biologic!=.
{txt}(37,696 missing values generated)

{com}. recode biologic_6m .=0
{txt}(biologic_6m: 37696 changes made)

{com}. tab biologic_6m //for all EIA patients

{txt}biologic_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     37,696       87.02       87.02
{txt}          1 {c |}{res}      5,621       12.98      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     43,317      100.00
{txt}
{com}. bys eia_diagnosis: tab biologic_6m 

{txt}{hline}
-> eia_diagnosis = RA

biologic_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     12,519       86.79       86.79
{txt}          1 {c |}{res}      1,905       13.21      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,424      100.00

{txt}{hline}
-> eia_diagnosis = PsA

biologic_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     12,568       87.05       87.05
{txt}          1 {c |}{res}      1,869       12.95      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,437      100.00

{txt}{hline}
-> eia_diagnosis = AxSpA

biologic_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     12,609       87.22       87.22
{txt}          1 {c |}{res}      1,847       12.78      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,456      100.00

{txt}
{com}. gen biologic_12m=1 if time_to_biologic<=365 & time_to_biologic!=.
{txt}(31,570 missing values generated)

{com}. recode biologic_12m .=0
{txt}(biologic_12m: 31570 changes made)

{com}. tab biologic_12m //for all EIA patients

{txt}biologic_12 {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     31,570       72.88       72.88
{txt}          1 {c |}{res}     11,747       27.12      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     43,317      100.00
{txt}
{com}. bys eia_diagnosis: tab biologic_12m 

{txt}{hline}
-> eia_diagnosis = RA

biologic_12 {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     10,533       73.02       73.02
{txt}          1 {c |}{res}      3,891       26.98      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,424      100.00

{txt}{hline}
-> eia_diagnosis = PsA

biologic_12 {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     10,508       72.79       72.79
{txt}          1 {c |}{res}      3,929       27.21      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,437      100.00

{txt}{hline}
-> eia_diagnosis = AxSpA

biologic_12 {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     10,529       72.83       72.83
{txt}          1 {c |}{res}      3,927       27.17      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,456      100.00

{txt}
{com}. 
. **Biologic time categories (by year)
. bys diagnosis_year: tab biologic_6m //for all EIA patients

{txt}{hline}
-> diagnosis_year = March 2019-March 2020

biologic_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     12,216       87.05       87.05
{txt}          1 {c |}{res}      1,817       12.95      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,033      100.00

{txt}{hline}
-> diagnosis_year = March 2020-March 2021

biologic_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     11,908       87.14       87.14
{txt}          1 {c |}{res}      1,758       12.86      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     13,666      100.00

{txt}{hline}
-> diagnosis_year = March 2021-March 2022

biologic_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     12,150       87.10       87.10
{txt}          1 {c |}{res}      1,799       12.90      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     13,949      100.00

{txt}{hline}
-> diagnosis_year = .

biologic_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      1,422       85.20       85.20
{txt}          1 {c |}{res}        247       14.80      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,669      100.00

{txt}
{com}. bys diagnosis_year eia_diagnosis: tab biologic_6m //for each diagnosis

{txt}{hline}
-> diagnosis_year = March 2019-March 2020, eia_diagnosis = RA

biologic_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      4,097       87.02       87.02
{txt}          1 {c |}{res}        611       12.98      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      4,708      100.00

{txt}{hline}
-> diagnosis_year = March 2019-March 2020, eia_diagnosis = PsA

biologic_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      4,114       87.00       87.00
{txt}          1 {c |}{res}        615       13.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      4,729      100.00

{txt}{hline}
-> diagnosis_year = March 2019-March 2020, eia_diagnosis = AxSpA

biologic_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      4,005       87.14       87.14
{txt}          1 {c |}{res}        591       12.86      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      4,596      100.00

{txt}{hline}
-> diagnosis_year = March 2020-March 2021, eia_diagnosis = RA

biologic_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      3,924       86.43       86.43
{txt}          1 {c |}{res}        616       13.57      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      4,540      100.00

{txt}{hline}
-> diagnosis_year = March 2020-March 2021, eia_diagnosis = PsA

biologic_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      3,928       87.66       87.66
{txt}          1 {c |}{res}        553       12.34      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      4,481      100.00

{txt}{hline}
-> diagnosis_year = March 2020-March 2021, eia_diagnosis = AxSpA

biologic_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      4,056       87.32       87.32
{txt}          1 {c |}{res}        589       12.68      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      4,645      100.00

{txt}{hline}
-> diagnosis_year = March 2021-March 2022, eia_diagnosis = RA

biologic_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      4,032       87.01       87.01
{txt}          1 {c |}{res}        602       12.99      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      4,634      100.00

{txt}{hline}
-> diagnosis_year = March 2021-March 2022, eia_diagnosis = PsA

biologic_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      4,027       86.73       86.73
{txt}          1 {c |}{res}        616       13.27      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      4,643      100.00

{txt}{hline}
-> diagnosis_year = March 2021-March 2022, eia_diagnosis = AxSpA

biologic_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      4,091       87.56       87.56
{txt}          1 {c |}{res}        581       12.44      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      4,672      100.00

{txt}{hline}
-> diagnosis_year = ., eia_diagnosis = RA

biologic_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}        466       85.98       85.98
{txt}          1 {c |}{res}         76       14.02      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        542      100.00

{txt}{hline}
-> diagnosis_year = ., eia_diagnosis = PsA

biologic_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}        499       85.45       85.45
{txt}          1 {c |}{res}         85       14.55      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        584      100.00

{txt}{hline}
-> diagnosis_year = ., eia_diagnosis = AxSpA

biologic_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}        457       84.16       84.16
{txt}          1 {c |}{res}         86       15.84      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        543      100.00

{txt}
{com}. bys diagnosis_year: tab biologic_12m //for all EIA patients

{txt}{hline}
-> diagnosis_year = March 2019-March 2020

biologic_12 {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     10,239       72.96       72.96
{txt}          1 {c |}{res}      3,794       27.04      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,033      100.00

{txt}{hline}
-> diagnosis_year = March 2020-March 2021

biologic_12 {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      9,954       72.84       72.84
{txt}          1 {c |}{res}      3,712       27.16      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     13,666      100.00

{txt}{hline}
-> diagnosis_year = March 2021-March 2022

biologic_12 {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     10,198       73.11       73.11
{txt}          1 {c |}{res}      3,751       26.89      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     13,949      100.00

{txt}{hline}
-> diagnosis_year = .

biologic_12 {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      1,179       70.64       70.64
{txt}          1 {c |}{res}        490       29.36      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,669      100.00

{txt}
{com}. bys diagnosis_year eia_diagnosis: tab biologic_12m //for each diagnosis

{txt}{hline}
-> diagnosis_year = March 2019-March 2020, eia_diagnosis = RA

biologic_12 {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      3,462       73.53       73.53
{txt}          1 {c |}{res}      1,246       26.47      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      4,708      100.00

{txt}{hline}
-> diagnosis_year = March 2019-March 2020, eia_diagnosis = PsA

biologic_12 {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      3,451       72.98       72.98
{txt}          1 {c |}{res}      1,278       27.02      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      4,729      100.00

{txt}{hline}
-> diagnosis_year = March 2019-March 2020, eia_diagnosis = AxSpA

biologic_12 {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      3,326       72.37       72.37
{txt}          1 {c |}{res}      1,270       27.63      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      4,596      100.00

{txt}{hline}
-> diagnosis_year = March 2020-March 2021, eia_diagnosis = RA

biologic_12 {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      3,273       72.09       72.09
{txt}          1 {c |}{res}      1,267       27.91      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      4,540      100.00

{txt}{hline}
-> diagnosis_year = March 2020-March 2021, eia_diagnosis = PsA

biologic_12 {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      3,270       72.97       72.97
{txt}          1 {c |}{res}      1,211       27.03      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      4,481      100.00

{txt}{hline}
-> diagnosis_year = March 2020-March 2021, eia_diagnosis = AxSpA

biologic_12 {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      3,411       73.43       73.43
{txt}          1 {c |}{res}      1,234       26.57      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      4,645      100.00

{txt}{hline}
-> diagnosis_year = March 2021-March 2022, eia_diagnosis = RA

biologic_12 {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      3,404       73.46       73.46
{txt}          1 {c |}{res}      1,230       26.54      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      4,634      100.00

{txt}{hline}
-> diagnosis_year = March 2021-March 2022, eia_diagnosis = PsA

biologic_12 {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      3,379       72.78       72.78
{txt}          1 {c |}{res}      1,264       27.22      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      4,643      100.00

{txt}{hline}
-> diagnosis_year = March 2021-March 2022, eia_diagnosis = AxSpA

biologic_12 {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      3,415       73.10       73.10
{txt}          1 {c |}{res}      1,257       26.90      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      4,672      100.00

{txt}{hline}
-> diagnosis_year = ., eia_diagnosis = RA

biologic_12 {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}        394       72.69       72.69
{txt}          1 {c |}{res}        148       27.31      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        542      100.00

{txt}{hline}
-> diagnosis_year = ., eia_diagnosis = PsA

biologic_12 {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}        408       69.86       69.86
{txt}          1 {c |}{res}        176       30.14      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        584      100.00

{txt}{hline}
-> diagnosis_year = ., eia_diagnosis = AxSpA

biologic_12 {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}        377       69.43       69.43
{txt}          1 {c |}{res}        166       30.57      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        543      100.00

{txt}
{com}. 
. **Create and label variables ===========================================================*/
. 
. **Demographics
. ***Sex
. gen male = 1 if sex == "M"
{txt}(22,076 missing values generated)

{com}. replace male = 0 if sex == "F"
{txt}(22,076 real changes made)

{com}. lab var male "Male"
{txt}
{com}. 
. ***Ethnicity
. replace ethnicity = .u if ethnicity == .
{txt}(10,750 real changes made, 10,750 to missing)

{com}. ****rearrange in order of prevalence
. recode ethnicity 2=6 /* mixed to 6 */
{txt}(ethnicity: 6452 changes made)

{com}. recode ethnicity 3=2 /* south asian to 2 */
{txt}(ethnicity: 3236 changes made)

{com}. recode ethnicity 4=3 /* black to 3 */
{txt}(ethnicity: 3294 changes made)

{com}. recode ethnicity 6=4 /* mixed to 4 */
{txt}(ethnicity: 6452 changes made)

{com}. recode ethnicity 5=4 /* other to 4 */
{txt}(ethnicity: 3325 changes made)

{com}. 
. label define ethnicity  1 "White"                                       ///
>                                                 2 "Asian/Asian British"         ///
>                                                 3 "Black"                                       ///
>                                                 4 "Mixed/Other"                         ///
>                                                 .u "Missing"
{txt}
{com}. label values ethnicity ethnicity
{txt}
{com}. lab var ethnicity "Ethnicity"
{txt}
{com}. 
. ***STP 
. rename stp stp_old
{res}{txt}
{com}. bysort stp_old: gen stp = 1 if _n==1
{txt}(43,315 missing values generated)

{com}. replace stp = sum(stp) //
{txt}(43,316 real changes made)

{com}. drop stp_old
{txt}
{com}. 
. ***IMD
. *Group into 5 groups
. rename imd imd_o
{res}{txt}
{com}. egen imd = cut(imd_o), group(5) icodes 
{txt}
{com}. *Add one to create groups 1-5 
. replace imd = imd + 1
{txt}(43,317 real changes made)

{com}. *-1 is missing, should be excluded from population 
. replace imd = .u if imd_o == -1
{txt}(0 real changes made)

{com}. drop imd_o
{txt}
{com}. *Reverse the order (so high is more deprived)
. recode imd 5 = 1 4 = 2 3 = 3 2 = 4 1 = 5 .u = .u
{txt}(imd: 43317 changes made)

{com}. label define imd 1 "1 least deprived" 2 "2" 3 "3" 4 "4" 5 "5 most deprived" .u "Missing"
{txt}
{com}. label values imd imd 
{txt}
{com}. lab var imd "Index of multiple deprivation"
{txt}
{com}. 
. ***Age variables
. *Nb. works if ages 18 and over
. *Create categorised age
. drop if age<18 & age !=.
{txt}(9,176 observations deleted)

{com}. drop if age>109 & age !=.
{txt}(0 observations deleted)

{com}. drop if age==.
{txt}(0 observations deleted)

{com}. lab var age "Age"
{txt}
{com}. 
. recode age 18/39.9999 = 1 /// 
>            40/49.9999 = 2 ///
>                    50/59.9999 = 3 ///
>                60/69.9999 = 4 ///
>                    70/79.9999 = 5 ///
>                    80/max = 6, gen(agegroup) 
{txt}(34141 differences between age and agegroup)

{com}. 
. label define agegroup   1 "18-39" ///
>                                                 2 "40-49" ///
>                                                 3 "50-59" ///
>                                                 4 "60-69" ///
>                                                 5 "70-79" ///
>                                                 6 "80+"
{txt}
{com}.                                                 
. label values agegroup agegroup
{txt}
{com}. lab var agegroup "Age group"
{txt}
{com}. 
. *Create binary age
. recode age min/69.999 = 0 ///
>            70/max = 1, gen(age70)
{txt}(34141 differences between age and age70)

{com}. 
. *Create restricted cubic splines for age
. mkspline age = age, cubic nknots(4)
{txt}
{com}. 
. ***Body Mass Index
. *Recode strange values 
. replace bmi_value = . if bmi_value == 0 
{txt}(13,694 real changes made, 13,694 to missing)

{com}. replace bmi_value = . if !inrange(bmi_value, 10, 80)
{txt}(136 real changes made, 136 to missing)

{com}. 
. *Restrict to within 10 years of EIA diagnosis date and aged>16 
. gen bmi_time = (eia_code_date - bmi_date)/365.25
{txt}(13,694 missing values generated)

{com}. gen bmi_age = age - bmi_time
{txt}(13,694 missing values generated)

{com}. replace bmi_value = . if bmi_age < 16 
{txt}(14,636 real changes made, 14,636 to missing)

{com}. replace bmi_value = . if bmi_time > 10 & bmi_time != . 
{txt}(3,898 real changes made, 3,898 to missing)

{com}. 
. *Set to missing if no date, and vice versa 
. replace bmi_value = . if bmi_date == . 
{txt}(0 real changes made)

{com}. replace bmi_date = . if bmi_value == . 
{txt}(18,670 real changes made, 18,670 to missing)

{com}. replace bmi_time = . if bmi_value == . 
{txt}(18,670 real changes made, 18,670 to missing)

{com}. replace bmi_age = . if bmi_value == . 
{txt}(18,670 real changes made, 18,670 to missing)

{com}. 
. *Create BMI categories
. gen     bmicat = .
{txt}(34,141 missing values generated)

{com}. recode  bmicat . = 1 if bmi_value < 18.5
{txt}(bmicat: 78 changes made)

{com}. recode  bmicat . = 2 if bmi_value < 25
{txt}(bmicat: 212 changes made)

{com}. recode  bmicat . = 3 if bmi_value < 30
{txt}(bmicat: 294 changes made)

{com}. recode  bmicat . = 4 if bmi_value < 35
{txt}(bmicat: 368 changes made)

{com}. recode  bmicat . = 5 if bmi_value < 40
{txt}(bmicat: 312 changes made)

{com}. recode  bmicat . = 6 if bmi_value < .
{txt}(bmicat: 513 changes made)

{com}. replace bmicat = .u if bmi_value >= .
{txt}(32,364 real changes made, 32,364 to missing)

{com}. 
. label define bmicat 1 "Underweight (<18.5)"     ///
>                                         2 "Normal (18.5-24.9)"          ///
>                                         3 "Overweight (25-29.9)"        ///
>                                         4 "Obese I (30-34.9)"           ///
>                                         5 "Obese II (35-39.9)"          ///
>                                         6 "Obese III (40+)"                     ///
>                                         .u "Missing"
{txt}
{com}.                                         
. label values bmicat bmicat
{txt}
{com}. lab var bmicat "BMI"
{txt}
{com}. 
. *Create less granular categorisation
. recode bmicat 1/3 .u = 1 4 = 2 5 = 3 6 = 4, gen(obese4cat)
{txt}(34063 differences between bmicat and obese4cat)

{com}. 
. label define obese4cat  1 "No record of obesity"        ///
>                                                 2 "Obese I (30-34.9)"           ///
>                                                 3 "Obese II (35-39.9)"          ///
>                                                 4 "Obese III (40+)"             
{txt}
{com}. 
. label values obese4cat obese4cat
{txt}
{com}. order obese4cat, after(bmicat)
{txt}
{com}. 
. ***Smoking 
. label define smoke 1 "Never" 2 "Former" 3 "Current" .u "Missing"
{txt}
{com}. 
. gen     smoke = 1  if smoking_status == "N"
{txt}(30,694 missing values generated)

{com}. replace smoke = 2  if smoking_status == "E"
{txt}(1,683 real changes made)

{com}. replace smoke = 3  if smoking_status == "S"
{txt}(10,192 real changes made)

{com}. replace smoke = .u if smoking_status == "M"
{txt}(1,695 real changes made, 1,695 to missing)

{com}. replace smoke = .u if smoking_status == "" 
{txt}(17,124 real changes made, 17,124 to missing)

{com}. 
. label values smoke smoke
{txt}
{com}. lab var smoke "Smoking status"
{txt}
{com}. drop smoking_status
{txt}
{com}. 
. *Create non-missing 3-category variable for current smoking (assumes missing smoking is never smoking)
. recode smoke .u = 1, gen(smoke_nomiss)
{txt}(18819 differences between smoke and smoke_nomiss)

{com}. order smoke_nomiss, after(smoke)
{txt}
{com}. label values smoke_nomiss smoke
{txt}
{com}. 
. **Clinical comorbidities
. ***eGFR
. *Set implausible creatinine values to missing (Note: zero changed to missing)
. replace creatinine_value = . if !inrange(creatinine_value, 20, 3000) 
{txt}(8,622 real changes made, 8,622 to missing)

{com}. 
. *Remove creatinine dates if no measurements, and vice versa 
. replace creatinine_value = . if creatinine_date == . 
{txt}(0 real changes made)

{com}. replace creatinine_date = . if creatinine_value == . 
{txt}(6,945 real changes made, 6,945 to missing)

{com}. replace creatinine = . if creatinine_value == .
{txt}(8,622 real changes made, 8,622 to missing)

{com}. recode creatinine .=0
{txt}(creatinine: 8622 changes made)

{com}. 
. *Divide by 88.4 (to convert umol/l to mg/dl) 
. gen SCr_adj = creatinine_value/88.4
{txt}(8,622 missing values generated)

{com}. 
. gen min = .
{txt}(34,141 missing values generated)

{com}. replace min = SCr_adj/0.7 if male==0
{txt}(13,084 real changes made)

{com}. replace min = SCr_adj/0.9 if male==1
{txt}(12,435 real changes made)

{com}. replace min = min^-0.329  if male==0
{txt}(13,084 real changes made)

{com}. replace min = min^-0.411  if male==1
{txt}(12,435 real changes made)

{com}. replace min = 1 if min<1
{txt}(19,896 real changes made)

{com}. 
. gen max=.
{txt}(34,141 missing values generated)

{com}. replace max=SCr_adj/0.7 if male==0
{txt}(13,084 real changes made)

{com}. replace max=SCr_adj/0.9 if male==1
{txt}(12,435 real changes made)

{com}. replace max=max^-1.209
{txt}(25,519 real changes made)

{com}. replace max=1 if max>1
{txt}(14,245 real changes made)

{com}. 
. gen egfr=min*max*141
{txt}(8,622 missing values generated)

{com}. replace egfr=egfr*(0.993^age)
{txt}(25,519 real changes made)

{com}. replace egfr=egfr*1.018 if male==0
{txt}(13,084 real changes made)

{com}. label var egfr "egfr calculated using CKD-EPI formula with no ethnicity"
{txt}
{com}. 
. *Categorise into ckd stages
. egen egfr_cat_all = cut(egfr), at(0, 15, 30, 45, 60, 5000)
{txt}(8622 missing values generated)

{com}. recode egfr_cat_all 0 = 5 15 = 4 30 = 3 45 = 2 60 = 0, generate(ckd_egfr)
{txt}(25519 differences between egfr_cat_all and ckd_egfr)

{com}. 
. gen egfr_cat = .
{txt}(34,141 missing values generated)

{com}. recode egfr_cat . = 3 if egfr < 30
{txt}(egfr_cat: 6074 changes made)

{com}. recode egfr_cat . = 2 if egfr < 60
{txt}(egfr_cat: 8864 changes made)

{com}. recode egfr_cat . = 1 if egfr < .
{txt}(egfr_cat: 10581 changes made)

{com}. replace egfr_cat = .u if egfr >= .
{txt}(8,622 real changes made, 8,622 to missing)

{com}. 
. label define egfr_cat   1 ">=60"                ///
>                                                 2 "30-59"               ///
>                                                 3 "<30"                 ///
>                                                 .u "Missing"
{txt}
{com}.                                         
. label values egfr_cat egfr_cat
{txt}
{com}. lab var egfr_cat "eGFR"
{txt}
{com}. 
. *If missing eGFR, assume normal
. gen egfr_cat_nomiss = egfr_cat
{txt}(8,622 missing values generated)

{com}. replace egfr_cat_nomiss = 1 if egfr_cat == .u
{txt}(8,622 real changes made)

{com}. 
. label define egfr_cat_nomiss    1 ">=60/missing"        ///
>                                                                 2 "30-59"                       ///
>                                                                 3 "<30" 
{txt}
{com}. label values egfr_cat_nomiss egfr_cat_nomiss
{txt}
{com}. lab var egfr_cat_nomiss "eGFR"
{txt}
{com}. 
. gen egfr_date = creatinine_date
{txt}(8,622 missing values generated)

{com}. format egfr_date %td
{txt}
{com}. 
. *Add in end stage renal failure and create a single CKD variable 
. *Missing assumed to not have CKD 
. gen ckd = 0
{txt}
{com}. replace ckd = 1 if ckd_egfr != . & ckd_egfr >= 1
{txt}(14,938 real changes made)

{com}. replace ckd = 1 if esrf == 1
{txt}(3,796 real changes made)

{com}. 
. label define ckd 0 "No CKD" 1 "CKD"
{txt}
{com}. label values ckd ckd
{txt}
{com}. label var ckd "Chronic kidney disease"
{txt}
{com}. 
. *Create date (most recent measure prior to index)
. gen temp1_ckd_date = creatinine_date if ckd_egfr >=1
{txt}(19,203 missing values generated)

{com}. gen temp2_ckd_date = esrf_date if esrf == 1
{txt}(27,315 missing values generated)

{com}. gen ckd_date = max(temp1_ckd_date,temp2_ckd_date) 
{txt}(15,407 missing values generated)

{com}. format ckd_date %td 
{txt}
{com}. 
. drop temp1_ckd_date temp2_ckd_date SCr_adj min max ckd_egfr egfr_cat_all
{txt}
{com}. 
. ***HbA1c
. *Set zero or negative to missing
. replace hba1c_percentage   = . if hba1c_percentage <= 0
{txt}(1,936 real changes made, 1,936 to missing)

{com}. replace hba1c_mmol_per_mol = . if hba1c_mmol_per_mol <= 0
{txt}(2,531 real changes made, 2,531 to missing)

{com}. 
. *Change implausible values to missing
. replace hba1c_percentage   = . if !inrange(hba1c_percentage, 1, 20)
{txt}(506 real changes made, 506 to missing)

{com}. replace hba1c_mmol_per_mol = . if !inrange(hba1c_mmol_per_mol, 10, 200)
{txt}(1,413 real changes made, 1,413 to missing)

{com}. 
. *Set most recent values of >24 months prior to EIA diagnosis date to missing
. replace hba1c_percentage   = . if (eia_code_date - hba1c_percentage_date) > 24*30 & hba1c_percentage_date != .
{txt}(30,786 real changes made, 30,786 to missing)

{com}. replace hba1c_mmol_per_mol = . if (eia_code_date - hba1c_mmol_per_mol_date) > 24*30 & hba1c_mmol_per_mol_date != .
{txt}(29,309 real changes made, 29,309 to missing)

{com}. 
. *Clean up dates
. replace hba1c_percentage_date = . if hba1c_percentage == .
{txt}(31,487 real changes made, 31,487 to missing)

{com}. replace hba1c_mmol_per_mol_date = . if hba1c_mmol_per_mol == .
{txt}(31,511 real changes made, 31,511 to missing)

{com}. 
. *Express  HbA1c as percentage
. *Express all values as perecentage 
. noi summ hba1c_percentage hba1c_mmol_per_mol 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
hba1c_per~ge {c |}{res}        913    5.130533    1.873388   1.006273   12.06478
{txt}hba1c_mmol~l {c |}{res}        888    42.21298    16.96238   11.01753   98.48809
{txt}
{com}. gen     hba1c_pct = hba1c_percentage 
{txt}(33,228 missing values generated)

{com}. replace hba1c_pct = (hba1c_mmol_per_mol/10.929)+2.15 if hba1c_mmol_per_mol<. 
{txt}(888 real changes made)

{com}. 
. *Valid % range between 0-20  
. replace hba1c_pct = . if !inrange(hba1c_pct, 1, 20) 
{txt}(0 real changes made)

{com}. replace hba1c_pct = round(hba1c_pct, 0.1)
{txt}(1,774 real changes made)

{com}. 
. *Categorise HbA1c and diabetes
. *Group hba1c pct
. gen     hba1ccat = 0 if hba1c_pct <  6.5
{txt}(32,905 missing values generated)

{com}. replace hba1ccat = 1 if hba1c_pct >= 6.5  & hba1c_pct < 7.5
{txt}(274 real changes made)

{com}. replace hba1ccat = 2 if hba1c_pct >= 7.5  & hba1c_pct < 8
{txt}(106 real changes made)

{com}. replace hba1ccat = 3 if hba1c_pct >= 8    & hba1c_pct < 9
{txt}(96 real changes made)

{com}. replace hba1ccat = 4 if hba1c_pct >= 9    & hba1c_pct !=.
{txt}(62 real changes made)

{com}. label define hba1ccat 0 "<6.5%" 1">=6.5-7.4" 2">=7.5-7.9" 3">=8-8.9" 4">=9"
{txt}
{com}. label values hba1ccat hba1ccat
{txt}
{com}. 
. *Express all values as mmol
. gen hba1c_mmol = hba1c_mmol_per_mol
{txt}(33,253 missing values generated)

{com}. replace hba1c_mmol = (hba1c_percentage*10.929)-23.5 if hba1c_percentage<. & hba1c_mmol==.
{txt}(886 real changes made)

{com}. 
. *Group hba1c mmol
. gen     hba1ccatmm = 0 if hba1c_mmol < 58
{txt}(32,629 missing values generated)

{com}. replace hba1ccatmm = 1 if hba1c_mmol >= 58 & hba1c_pct !=.
{txt}(262 real changes made)

{com}. replace hba1ccatmm =.u if hba1ccatmm==. 
{txt}(32,367 real changes made, 32,367 to missing)

{com}. label define hba1ccatmm 0 "HbA1c <58mmol/mol" 1 "HbA1c >=58mmol/mol" .u "Missing"
{txt}
{com}. label values hba1ccatmm hba1ccatmm
{txt}
{com}. lab var hba1ccatmm "HbA1c"
{txt}
{com}. 
. *Create diabetes, split by control/not (assumes missing = no diabetes)
. gen     diabcat = 1 if diabetes==0
{txt}(6,765 missing values generated)

{com}. replace diabcat = 2 if diabetes==1 & inlist(hba1ccat, 0, 1)
{txt}(290 real changes made)

{com}. replace diabcat = 3 if diabetes==1 & inlist(hba1ccat, 2, 3, 4)
{txt}(41 real changes made)

{com}. replace diabcat = 4 if diabetes==1 & !inlist(hba1ccat, 0, 1, 2, 3, 4)
{txt}(6,434 real changes made)

{com}. 
. label define diabcat    1 "No diabetes"                         ///
>                                                 2 "Controlled diabetes"         ///
>                                                 3 "Uncontrolled diabetes"       ///
>                                                 4 "Diabetes, no hba1c measure"
{txt}
{com}. label values diabcat diabcat
{txt}
{com}. 
. *Create cancer variable 'other cancer currently', includes carcinoma of the head and neck - need to confirm if this excludes NMSC
. gen cancer =0
{txt}
{com}. replace cancer =1 if lung_cancer ==1 | haem_cancer ==1 | other_cancer ==1
{txt}(16,651 real changes made)

{com}. lab var cancer "Cancer"
{txt}
{com}. 
. *Create other comorbid variables
. gen combined_cv_comorbid =1 if chronic_cardiac_disease ==1 | stroke==1
{txt}(21,799 missing values generated)

{com}. recode combined_cv_comorbid .=0
{txt}(combined_cv_comorbid: 21799 changes made)

{com}. 
. *Delete unneeded variables
. drop hba1c_pct hba1c_percentage hba1c_mmol_per_mol
{txt}
{com}. 
. *Label variables
. lab var hypertension "Hypertension"
{txt}
{com}. lab var diabetes "Diabetes"
{txt}
{com}. lab var stroke "Stroke"
{txt}
{com}. lab var chronic_resp_disease "Chronic respiratory disease"
{txt}
{com}. lab var copd "COPD"
{txt}
{com}. lab var esrf "End-stage renal failure"
{txt}
{com}. lab var chronic_liver_disease "Chronic liver disease"
{txt}
{com}. lab var chronic_cardiac_disease "Chronic cardiac disease"
{txt}
{com}. 
. save "$projectdir/output/data/file_eia_all.dta", replace        
{txt}(note: file /workspace/output/data/file_eia_all.dta not found)
file /workspace/output/data/file_eia_all.dta saved

{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/workspace/logs/cleaning_dataset.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}29 Mar 2022, 15:30:42
{txt}{.-}
{smcl}
{txt}{sf}{ul off}