-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/cleaning_dataset.log
  log type:  text
 opened on:   6 Apr 2022, 14:51:03

. 
. di "$projectdir"
/workspace

. di "$logdir"
/workspace/logs

. 
. import delimited "$projectdir/output/input.csv", clear
(65 vars, 100,000 obs)

. 
. **Set Ado file path
. adopath + "$projectdir/analysis/extra_ados"
  [1]  (BASE)      "/usr/local/stata/ado/base/"
  [2]  (SITE)      "/usr/local/ado/"
  [3]              "."
  [4]  (PERSONAL)  "~/ado/personal/"
  [5]  (PLUS)      "~/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "/workspace/analysis/extra_ados"

. 
. **Set index dates ===========================================================
> */
. global year_preceding = "01/03/2018"

. global start_date = "01/03/2019"

. global end_date = "01/03/2022"

. 
. **Rename variables (some are too long for Stata to handle) ==================
> =====================*/
. rename chronic_respiratory_disease chronic_resp_disease

. 
. **Convert date strings to dates =============================================
> =======*/
. ***Some dates are given with month/year only, so adding day 15 to enable them
>  to be processed as dates 
. 
. foreach var of varlist   hba1c_mmol_per_mol_date                        ///
>                                                  hba1c_percentage_date       
>                    ///
>                                                  creatinine_date             
>                    ///
>                                                  bmi_date_measured           
>                ///
>                                                  abatacept                   
>                                    ///
>                                                  adalimumab                  
>                                    ///     
>                                                  baricitinib                 
>                            ///
>                                                  certolizumab                
>                            ///
>                                                  etanercept                  
>                                    ///
>                                                  golimumab                   
>                                    ///
>                                                  guselkumab                  
>                                    ///     
>                                                  infliximab                  
>                                    ///
>                                                  ixekizumab                  
>                                    ///
>                                                  methotrexate_hcd            
>                            ///
>                                                  rituximab                   
>                                    ///
>                                                  sarilumab                   
>                                    ///
>                                                  secukinumab                 
>                            ///     
>                                                  tocilizumab                 
>                            ///
>                                                  tofacitinib                 
>                            ///
>                                                  upadacitinib                
>                            ///
>                                                  ustekinumab                 
>                            ///
>                                                  {
  2.                                                         
.                 capture confirm string variable `var'
  3.                 if _rc!=0 {
  4.                         assert `var'==.
  5.                         rename `var' `var'_date
  6.                 }
  7.         
.                 else {
  8.                                 replace `var' = `var' + "-15"
  9.                                 rename `var' `var'_dstr
 10.                                 replace `var'_dstr = " " if `var'_dstr == 
> "-15"
 11.                                 gen `var'_date = date(`var'_dstr, "YMD") 
 12.                                 order `var'_date, after(`var'_dstr)
 13.                                 drop `var'_dstr
 14.                 }
 15.         
.         format `var'_date %td
 16. }
variable hba1c_mmol_per_mol_date was str7 now str10
(100,000 real changes made)
(5,000 real changes made)
(5,000 missing values generated)
variable hba1c_percentage_date was str7 now str10
(100,000 real changes made)
(5,000 real changes made)
(5,000 missing values generated)
variable creatinine_date was str7 now str10
(100,000 real changes made)
(5,000 real changes made)
(5,000 missing values generated)
variable bmi_date_measured was str7 now str10
(100,000 real changes made)
(40,000 real changes made)
(40,000 missing values generated)
variable abatacept was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable adalimumab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable baricitinib was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable certolizumab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable etanercept was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable golimumab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable guselkumab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable infliximab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable ixekizumab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable methotrexate_hcd was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable rituximab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable sarilumab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable secukinumab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable tocilizumab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable tofacitinib was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable upadacitinib was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable ustekinumab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)

. 
. **Conversion for dates with day already included ============================
> ========================*/
. 
. foreach var of varlist   died_date_ons                                       
>    ///
>                                              eia_code_date                   
>                            ///
>                                                  rheum_appt_date             
>                            ///
>                                              ra_code_date                    
>                            ///
>                                                  psa_code_date               
>                            ///
>                                                  anksp_code_date             
>                            ///
>                                                  last_gp_prerheum_date       
>                    ///
>                                                  last_gp_precode_date        
>                    ///     
>                                                  last_gp_refrheum_date       
>                    ///
>                                                  last_gp_refcode_date        
>                    ///
>                                                  referral_rheum_prerheum     
>                    ///
>                                                  referral_rheum_precode      
>                    ///     
>                                                  chronic_cardiac_disease     
>                    ///
>                                                  diabetes                    
>                                    ///
>                                                  hypertension                
>                            ///     
>                                                  chronic_resp_disease        
>                    ///
>                                                  copd                        
>                                    ///
>                                                  chronic_liver_disease       
>                    ///
>                                                  stroke                      
>                                    ///
>                                                  lung_cancer                 
>                            ///
>                                                  haem_cancer                 
>                            ///
>                                                  other_cancer                
>                            ///
>                                                  esrf                        
>                                    ///
>                                                  organ_transplant            
>                            ///
>                                                  hydroxychloroquine          
>                            ///
>                                                  leflunomide                 
>                            ///
>                                                  methotrexate                
>                            ///
>                                                  methotrexate_inj            
>                            ///
>                                                  sulfasalazine               
>                            ///
>                                                  {
  2.                                                                  
.                 capture confirm string variable `var'
  3.                 if _rc!=0 {
  4.                         assert `var'==.
  5.                         rename `var' `var'_date
  6.                 }
  7.         
.                 else {
  8.                                 rename `var' `var'_dstr
  9.                                 gen `var'_date = date(`var'_dstr, "YMD") 
 10.                                 order `var'_date, after(`var'_dstr)
 11.                                 drop `var'_dstr
 12.                                 gen `var'_date15 = `var'_date+15
 13.                                 order `var'_date15, after(`var'_date)
 14.                                 drop `var'_date
 15.                                 rename `var'_date15 `var'_date
 16.                 }
 17.         
.         format `var'_date %td
 18. }
(90,000 missing values generated)
(90,000 missing values generated)
(1,000 missing values generated)
(1,000 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(1,000 missing values generated)
(1,000 missing values generated)
(1,000 missing values generated)
(1,000 missing values generated)
(1,000 missing values generated)
(1,000 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(90,000 missing values generated)
(90,000 missing values generated)
(90,000 missing values generated)
(90,000 missing values generated)
(90,000 missing values generated)
(90,000 missing values generated)
(90,000 missing values generated)
(90,000 missing values generated)
(90,000 missing values generated)
(90,000 missing values generated)

.                                                  
. **Rename variables with extra 'date' added to the end of variable names======
> =====================================================*/ 
. rename rheum_appt_date_date rheum_appt_date

. rename eia_code_date_date eia_code_date

. rename ra_code_date_date ra_code_date

. rename psa_code_date_date psa_code_date

. rename anksp_code_date_date anksp_code_date

. rename died_date_ons_date died_ons_date

. rename last_gp_prerheum_date_date last_gp_prerheum_date

. rename last_gp_refrheum_date_date last_gp_refrheum_date

. rename last_gp_refcode_date_date last_gp_refcode_date

. rename last_gp_precode_date_date last_gp_precode_date

. rename hba1c_mmol_per_mol_date_date hba1c_mmol_per_mol_date

. rename hba1c_percentage_date_date hba1c_percentage_date

. rename creatinine_date_date creatinine_date

. rename creatinine creatinine_value 

. rename bmi_date_measured_date bmi_date

. rename bmi bmi_value

. 
. **Create binary indicator variables for relevant conditions =================
> ===================================*/
. 
. foreach var of varlist   eia_code_date                                       
>    ///
>                                                  rheum_appt_date             
>                            ///
>                                              ra_code_date                    
>                            ///
>                                                  psa_code_date               
>                            ///
>                                                  anksp_code_date             
>                            ///
>                                                  died_ons_date               
>                            ///
>                                                  last_gp_prerheum_date       
>                    ///
>                                                  last_gp_precode_date        
>                    ///     
>                                                  last_gp_refrheum_date       
>                    ///
>                                                  last_gp_refcode_date        
>                    ///
>                                                  referral_rheum_prerheum_date
>            ///
>                                                  referral_rheum_precode_date 
>            ///     
>                                                  chronic_cardiac_disease_date
>            ///
>                                                  diabetes_date               
>                            ///
>                                                  hypertension_date           
>                            ///
>                                                  chronic_resp_disease_date   
>                    ///
>                                                  copd_date                   
>                                    ///
>                                                  chronic_liver_disease_date  
>                    ///
>                                                  stroke_date                 
>                            ///
>                                                  lung_cancer_date            
>                            ///
>                                                  haem_cancer_date            
>                            ///             
>                                                  other_cancer_date           
>                            ///
>                                                  esrf_date                   
>                                    ///
>                                                  creatinine_date             
>                            ///
>                                                  organ_transplant_date       
>                    ///
>                                                  hydroxychloroquine_date     
>                    ///     
>                                                  leflunomide_date            
>                            ///
>                                                  methotrexate_date           
>                            ///
>                                                  methotrexate_inj_date       
>                    ///             
>                                                  sulfasalazine_date          
>                            ///
>                                                  abatacept_date              
>                            ///
>                                                  adalimumab_date             
>                            ///
>                                                  baricitinib_date            
>                            ///
>                                                  certolizumab_date           
>                            ///
>                                                  etanercept_date             
>                            ///
>                                                  golimumab_date              
>                            ///
>                                                  guselkumab_date             
>                            ///
>                                                  infliximab_date             
>                            ///
>                                                  ixekizumab_date             
>                            ///
>                                                  methotrexate_hcd_date       
>                    ///
>                                                  rituximab_date              
>                            ///             
>                                                  sarilumab_date              
>                            ///
>                                                  secukinumab_date            
>                            ///
>                                                  tocilizumab_date            
>                            ///             
>                                                  tofacitinib_date            
>                            ///
>                                                  upadacitinib_date           
>                            ///
>                                                  ustekinumab_date   {        
>                    
  2.         /*date ranges are applied in python, so presence of date indicates
>  presence of 
>           disease in the correct time frame*/ 
.         local newvar =  substr("`var'", 1, length("`var'") - 5)
  3.         gen `newvar' = (`var'!=. )
  4.         order `newvar', after(`var')
  5. }

. 
. **Create and label variables ================================================
> ===========*/
. 
. **Demographics
. ***Sex
. gen male = 1 if sex == "M"
(51,024 missing values generated)

. replace male = 0 if sex == "F"
(51,024 real changes made)

. lab var male "Male"

. tab male, missing

       Male |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     51,024       51.02       51.02
          1 |     48,976       48.98      100.00
------------+-----------------------------------
      Total |    100,000      100.00

. 
. ***Ethnicity
. replace ethnicity = .u if ethnicity == .
(25,000 real changes made, 25,000 to missing)

. ****rearrange in order of prevalence
. recode ethnicity 2=6 /* mixed to 6 */
(ethnicity: 15043 changes made)

. recode ethnicity 3=2 /* south asian to 2 */
(ethnicity: 7422 changes made)

. recode ethnicity 4=3 /* black to 3 */
(ethnicity: 7452 changes made)

. recode ethnicity 6=4 /* mixed to 4 */
(ethnicity: 15043 changes made)

. recode ethnicity 5=4 /* other to 4 */
(ethnicity: 7660 changes made)

. 
. label define ethnicity  1 "White"                                       ///
>                                                 2 "Asian/Asian British"      
>    ///
>                                                 3 "Black"                    
>                    ///
>                                                 4 "Mixed/Other"              
>            ///
>                                                 .u "Missing"

. label values ethnicity ethnicity

. lab var ethnicity "Ethnicity"

. tab ethnicity, missing

          Ethnicity |      Freq.     Percent        Cum.
--------------------+-----------------------------------
              White |     37,423       37.42       37.42
Asian/Asian British |      7,422        7.42       44.84
              Black |      7,452        7.45       52.30
        Mixed/Other |     22,703       22.70       75.00
            Missing |     25,000       25.00      100.00
--------------------+-----------------------------------
              Total |    100,000      100.00

. 
. ***STP 
. rename stp stp_old

. bysort stp_old: gen stp = 1 if _n==1
(99,998 missing values generated)

. replace stp = sum(stp) //
(99,999 real changes made)

. drop stp_old

. 
. ***Regions
. encode region, gen(nuts_region)

. tab region, missing

                  region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
           East Midlands |     10,000       10.00       10.00
         East of England |      9,920        9.92       19.92
                  London |     20,056       20.06       39.98
              North East |      9,929        9.93       49.91
              North West |      9,881        9.88       59.79
              South East |     19,939       19.94       79.72
           West Midlands |     10,167       10.17       89.89
Yorkshire and the Humber |     10,108       10.11      100.00
-------------------------+-----------------------------------
                   Total |    100,000      100.00

. 
. ***IMD
. *Group into 5 groups
. rename imd imd_o

. egen imd = cut(imd_o), group(5) icodes 

. *Add one to create groups 1-5 
. replace imd = imd + 1
(100,000 real changes made)

. *-1 is missing, should be excluded from population 
. replace imd = .u if imd_o == -1
(0 real changes made)

. drop imd_o

. *Reverse the order (so high is more deprived)
. recode imd 5 = 1 4 = 2 3 = 3 2 = 4 1 = 5 .u = .u
(imd: 100000 changes made)

. label define imd 1 "1 least deprived" 2 "2" 3 "3" 4 "4" 5 "5 most deprived" .
> u "Missing"

. label values imd imd 

. lab var imd "Index of multiple deprivation"

. tab imd, missing

        Index of |
        multiple |
     deprivation |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |     70,090       70.09       70.09
               4 |     19,971       19.97       90.06
 5 most deprived |      9,939        9.94      100.00
-----------------+-----------------------------------
           Total |    100,000      100.00

. 
. ***Age variables
. *Nb. works if ages 18 and over
. *Create categorised age
. drop if age<18 & age !=.
(21,123 observations deleted)

. drop if age>109 & age !=.
(0 observations deleted)

. drop if age==.
(0 observations deleted)

. lab var age "Age"

. 
. recode age 18/39.9999 = 1 /// 
>            40/49.9999 = 2 ///
>                    50/59.9999 = 3 ///
>                60/69.9999 = 4 ///
>                    70/79.9999 = 5 ///
>                    80/max = 6, gen(agegroup) 
(78877 differences between age and agegroup)

. 
. label define agegroup   1 "18-39" ///
>                                                 2 "40-49" ///
>                                                 3 "50-59" ///
>                                                 4 "60-69" ///
>                                                 5 "70-79" ///
>                                                 6 "80+"

.                                                 
. label values agegroup agegroup

. lab var agegroup "Age group"

. tab agegroup, missing

  Age group |      Freq.     Percent        Cum.
------------+-----------------------------------
      18-39 |     28,872       36.60       36.60
      40-49 |     12,693       16.09       52.70
      50-59 |     13,463       17.07       69.76
      60-69 |     10,539       13.36       83.13
      70-79 |      8,369       10.61       93.74
        80+ |      4,941        6.26      100.00
------------+-----------------------------------
      Total |     78,877      100.00

. 
. *Create binary age
. recode age min/69.999 = 0 ///
>            70/max = 1, gen(age70)
(78877 differences between age and age70)

. 
. *Create restricted cubic splines for age
. mkspline age = age, cubic nknots(4)

. 
. ***Body Mass Index
. *Recode strange values 
. replace bmi_value = . if bmi_value == 0 
(31,521 real changes made, 31,521 to missing)

. replace bmi_value = . if !inrange(bmi_value, 10, 80)
(322 real changes made, 322 to missing)

. 
. *Restrict to within 10 years of EIA diagnosis date and aged>16 
. gen bmi_time = (eia_code_date - bmi_date)/365.25
(32,003 missing values generated)

. gen bmi_age = age - bmi_time
(32,003 missing values generated)

. replace bmi_value = . if bmi_age < 16 
(33,373 real changes made, 33,373 to missing)

. replace bmi_value = . if bmi_time > 10 & bmi_time != . 
(8,844 real changes made, 8,844 to missing)

. 
. *Set to missing if no date, and vice versa 
. replace bmi_value = . if bmi_date == . 
(0 real changes made)

. replace bmi_date = . if bmi_value == . 
(42,539 real changes made, 42,539 to missing)

. replace bmi_time = . if bmi_value == . 
(42,538 real changes made, 42,538 to missing)

. replace bmi_age = . if bmi_value == . 
(42,538 real changes made, 42,538 to missing)

. 
. *Create BMI categories
. gen     bmicat = .
(78,877 missing values generated)

. recode  bmicat . = 1 if bmi_value < 18.5
(bmicat: 209 changes made)

. recode  bmicat . = 2 if bmi_value < 25
(bmicat: 529 changes made)

. recode  bmicat . = 3 if bmi_value < 30
(bmicat: 731 changes made)

. recode  bmicat . = 4 if bmi_value < 35
(bmicat: 907 changes made)

. recode  bmicat . = 5 if bmi_value < 40
(bmicat: 938 changes made)

. recode  bmicat . = 6 if bmi_value < .
(bmicat: 1503 changes made)

. replace bmicat = .u if bmi_value >= .
(74,060 real changes made, 74,060 to missing)

. 
. label define bmicat 1 "Underweight (<18.5)"     ///
>                                         2 "Normal (18.5-24.9)"          ///
>                                         3 "Overweight (25-29.9)"        ///
>                                         4 "Obese I (30-34.9)"           ///
>                                         5 "Obese II (35-39.9)"          ///
>                                         6 "Obese III (40+)"                  
>    ///
>                                         .u "Missing"

.                                         
. label values bmicat bmicat

. lab var bmicat "BMI"

. tab bmicat, missing

                 BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |        209        0.26        0.26
  Normal (18.5-24.9) |        529        0.67        0.94
Overweight (25-29.9) |        731        0.93        1.86
   Obese I (30-34.9) |        907        1.15        3.01
  Obese II (35-39.9) |        938        1.19        4.20
     Obese III (40+) |      1,503        1.91        6.11
             Missing |     74,060       93.89      100.00
---------------------+-----------------------------------
               Total |     78,877      100.00

. 
. *Create less granular categorisation
. recode bmicat 1/3 .u = 1 4 = 2 5 = 3 6 = 4, gen(obese4cat)
(78668 differences between bmicat and obese4cat)

. 
. label define obese4cat  1 "No record of obesity"        ///
>                                                 2 "Obese I (30-34.9)"        
>    ///
>                                                 3 "Obese II (35-39.9)"       
>    ///
>                                                 4 "Obese III (40+)"          
>    

. 
. label values obese4cat obese4cat

. order obese4cat, after(bmicat)

. 
. ***Smoking 
. label define smoke 1 "Never" 2 "Former" 3 "Current" .u "Missing"

. 
. gen     smoke = 1  if smoking_status == "N"
(71,057 missing values generated)

. replace smoke = 2  if smoking_status == "E"
(3,914 real changes made)

. replace smoke = 3  if smoking_status == "S"
(23,721 real changes made)

. replace smoke = .u if smoking_status == "M"
(4,001 real changes made, 4,001 to missing)

. replace smoke = .u if smoking_status == "" 
(39,421 real changes made, 39,421 to missing)

. 
. label values smoke smoke

. lab var smoke "Smoking status"

. drop smoking_status

. tab smoke, missing

    Smoking |
     status |      Freq.     Percent        Cum.
------------+-----------------------------------
      Never |      7,820        9.91        9.91
     Former |      3,914        4.96       14.88
    Current |     23,721       30.07       44.95
    Missing |     43,422       55.05      100.00
------------+-----------------------------------
      Total |     78,877      100.00

. 
. *Create non-missing 3-category variable for current smoking (assumes missing 
> smoking is never smoking)
. recode smoke .u = 1, gen(smoke_nomiss)
(43422 differences between smoke and smoke_nomiss)

. order smoke_nomiss, after(smoke)

. label values smoke_nomiss smoke

. 
. **Clinical comorbidities
. ***eGFR
. *Set implausible creatinine values to missing (Note: zero changed to missing)
. replace creatinine_value = . if !inrange(creatinine_value, 20, 3000) 
(19,819 real changes made, 19,819 to missing)

. 
. *Remove creatinine dates if no measurements, and vice versa 
. replace creatinine_value = . if creatinine_date == . 
(0 real changes made)

. replace creatinine_date = . if creatinine_value == . 
(15,863 real changes made, 15,863 to missing)

. replace creatinine = . if creatinine_value == .
(19,819 real changes made, 19,819 to missing)

. recode creatinine .=0
(creatinine: 19819 changes made)

. tab creatinine, missing

 creatinine |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     19,819       25.13       25.13
          1 |     59,058       74.87      100.00
------------+-----------------------------------
      Total |     78,877      100.00

. tabstat creatinine_value, stat(n mean p50)

    variable |         N      mean       p50
-------------+------------------------------
creatinin~ue |     59058  136.5494  126.8663
--------------------------------------------

. 
. *Divide by 88.4 (to convert umol/l to mg/dl) 
. gen SCr_adj = creatinine_value/88.4
(19,819 missing values generated)

. 
. gen min = .
(78,877 missing values generated)

. replace min = SCr_adj/0.7 if male==0
(30,275 real changes made)

. replace min = SCr_adj/0.9 if male==1
(28,783 real changes made)

. replace min = min^-0.329  if male==0
(30,275 real changes made)

. replace min = min^-0.411  if male==1
(28,783 real changes made)

. replace min = 1 if min<1
(45,934 real changes made)

. 
. gen max=.
(78,877 missing values generated)

. replace max=SCr_adj/0.7 if male==0
(30,275 real changes made)

. replace max=SCr_adj/0.9 if male==1
(28,783 real changes made)

. replace max=max^-1.209
(59,058 real changes made)

. replace max=1 if max>1
(32,943 real changes made)

. 
. gen egfr=min*max*141
(19,819 missing values generated)

. replace egfr=egfr*(0.993^age)
(59,058 real changes made)

. replace egfr=egfr*1.018 if male==0
(30,275 real changes made)

. label var egfr "egfr calculated using CKD-EPI formula with no ethnicity"

. 
. *Categorise into ckd stages
. egen egfr_cat_all = cut(egfr), at(0, 15, 30, 45, 60, 5000)
(19819 missing values generated)

. recode egfr_cat_all 0 = 5 15 = 4 30 = 3 45 = 2 60 = 0, generate(ckd_egfr)
(59058 differences between egfr_cat_all and ckd_egfr)

. 
. gen egfr_cat = .
(78,877 missing values generated)

. recode egfr_cat . = 3 if egfr < 30
(egfr_cat: 13964 changes made)

. recode egfr_cat . = 2 if egfr < 60
(egfr_cat: 20768 changes made)

. recode egfr_cat . = 1 if egfr < .
(egfr_cat: 24326 changes made)

. replace egfr_cat = .u if egfr >= .
(19,819 real changes made, 19,819 to missing)

. 
. label define egfr_cat   1 ">=60"                ///
>                                                 2 "30-59"               ///
>                                                 3 "<30"                 ///
>                                                 .u "Missing"

.                                         
. label values egfr_cat egfr_cat

. lab var egfr_cat "eGFR"

. tab egfr_cat, missing

       eGFR |      Freq.     Percent        Cum.
------------+-----------------------------------
       >=60 |     24,326       30.84       30.84
      30-59 |     20,768       26.33       57.17
        <30 |     13,964       17.70       74.87
    Missing |     19,819       25.13      100.00
------------+-----------------------------------
      Total |     78,877      100.00

. 
. *If missing eGFR, assume normal
. gen egfr_cat_nomiss = egfr_cat
(19,819 missing values generated)

. replace egfr_cat_nomiss = 1 if egfr_cat == .u
(19,819 real changes made)

. 
. label define egfr_cat_nomiss    1 ">=60/missing"        ///
>                                                                 2 "30-59"    
>                    ///
>                                                                 3 "<30" 

. label values egfr_cat_nomiss egfr_cat_nomiss

. lab var egfr_cat_nomiss "eGFR"

. 
. gen egfr_date = creatinine_date
(19,819 missing values generated)

. format egfr_date %td

. 
. *Add in end stage renal failure and create a single CKD variable 
. *Missing assumed to not have CKD 
. gen ckd = 0

. replace ckd = 1 if ckd_egfr != . & ckd_egfr >= 1
(34,732 real changes made)

. replace ckd = 1 if esrf == 1
(8,835 real changes made)

. 
. label define ckd 0 "No CKD" 1 "CKD"

. label values ckd ckd

. label var ckd "Chronic kidney disease"

. tab ckd, missing

    Chronic |
     kidney |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
     No CKD |     35,310       44.77       44.77
        CKD |     43,567       55.23      100.00
------------+-----------------------------------
      Total |     78,877      100.00

. 
. *Create date (most recent measure prior to index)
. gen temp1_ckd_date = creatinine_date if ckd_egfr >=1
(44,145 missing values generated)

. gen temp2_ckd_date = esrf_date if esrf == 1
(63,057 missing values generated)

. gen ckd_date = max(temp1_ckd_date,temp2_ckd_date) 
(35,310 missing values generated)

. format ckd_date %td 

. 
. drop temp1_ckd_date temp2_ckd_date SCr_adj min max ckd_egfr egfr_cat_all

. 
. ***HbA1c
. *Set zero or negative to missing
. replace hba1c_percentage   = . if hba1c_percentage <= 0
(4,391 real changes made, 4,391 to missing)

. replace hba1c_mmol_per_mol = . if hba1c_mmol_per_mol <= 0
(5,615 real changes made, 5,615 to missing)

. 
. *Change implausible values to missing
. replace hba1c_percentage   = . if !inrange(hba1c_percentage, 1, 20)
(1,211 real changes made, 1,211 to missing)

. replace hba1c_mmol_per_mol = . if !inrange(hba1c_mmol_per_mol, 10, 200)
(3,428 real changes made, 3,428 to missing)

. 
. *Set most recent values of >24 months prior to EIA diagnosis date to missing
. replace hba1c_percentage   = . if (eia_code_date - hba1c_percentage_date) > 2
> 4*30 & hba1c_percentage_date != .
(70,972 real changes made, 70,972 to missing)

. replace hba1c_mmol_per_mol = . if (eia_code_date - hba1c_mmol_per_mol_date) >
>  24*30 & hba1c_mmol_per_mol_date != .
(67,461 real changes made, 67,461 to missing)

. 
. *Clean up dates
. replace hba1c_percentage_date = . if hba1c_percentage == .
(72,651 real changes made, 72,651 to missing)

. replace hba1c_mmol_per_mol_date = . if hba1c_mmol_per_mol == .
(72,580 real changes made, 72,580 to missing)

. 
. *Express  HbA1c as percentage
. *Express all values as perecentage 
. noi summ hba1c_percentage hba1c_mmol_per_mol 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hba1c_per~ge |      2,303    5.116021    1.870001   1.000183   11.44872
hba1c_mmol~l |      2,373    42.08883    17.57456   10.04276   109.5527

. gen     hba1c_pct = hba1c_percentage 
(76,574 missing values generated)

. replace hba1c_pct = (hba1c_mmol_per_mol/10.929)+2.15 if hba1c_mmol_per_mol<. 
(2,373 real changes made)

. 
. *Valid % range between 0-20  
. replace hba1c_pct = . if !inrange(hba1c_pct, 1, 20) 
(0 real changes made)

. replace hba1c_pct = round(hba1c_pct, 0.1)
(4,596 real changes made)

. 
. *Categorise HbA1c and diabetes
. *Group hba1c pct
. gen     hba1ccat = 0 if hba1c_pct <  6.5
(75,701 missing values generated)

. replace hba1ccat = 1 if hba1c_pct >= 6.5  & hba1c_pct < 7.5
(737 real changes made)

. replace hba1ccat = 2 if hba1c_pct >= 7.5  & hba1c_pct < 8
(242 real changes made)

. replace hba1ccat = 3 if hba1c_pct >= 8    & hba1c_pct < 9
(285 real changes made)

. replace hba1ccat = 4 if hba1c_pct >= 9    & hba1c_pct !=.
(156 real changes made)

. label define hba1ccat 0 "<6.5%" 1">=6.5-7.4" 2">=7.5-7.9" 3">=8-8.9" 4">=9"

. label values hba1ccat hba1ccat

. tab hba1ccat, missing

   hba1ccat |      Freq.     Percent        Cum.
------------+-----------------------------------
      <6.5% |      3,176        4.03        4.03
  >=6.5-7.4 |        737        0.93        4.96
  >=7.5-7.9 |        242        0.31        5.27
    >=8-8.9 |        285        0.36        5.63
        >=9 |        156        0.20        5.83
          . |     74,281       94.17      100.00
------------+-----------------------------------
      Total |     78,877      100.00

. 
. *Express all values as mmol
. gen hba1c_mmol = hba1c_mmol_per_mol
(76,504 missing values generated)

. replace hba1c_mmol = (hba1c_percentage*10.929)-23.5 if hba1c_percentage<. & h
> ba1c_mmol==.
(2,223 real changes made)

. 
. *Group hba1c mmol
. gen     hba1ccatmm = 0 if hba1c_mmol < 58
(74,962 missing values generated)

. replace hba1ccatmm = 1 if hba1c_mmol >= 58 & hba1c_mmol !=.
(681 real changes made)

. replace hba1ccatmm =.u if hba1ccatmm==. 
(74,281 real changes made, 74,281 to missing)

. label define hba1ccatmm 0 "HbA1c <58mmol/mol" 1 "HbA1c >=58mmol/mol" .u "Miss
> ing"

. label values hba1ccatmm hba1ccatmm

. lab var hba1ccatmm "HbA1c"

. tab hba1ccatmm, missing

             HbA1c |      Freq.     Percent        Cum.
-------------------+-----------------------------------
 HbA1c <58mmol/mol |      3,915        4.96        4.96
HbA1c >=58mmol/mol |        681        0.86        5.83
           Missing |     74,281       94.17      100.00
-------------------+-----------------------------------
             Total |     78,877      100.00

. 
. *Create diabetes, split by control/not (assumes missing = no diabetes)
. gen     diabcat = 1 if diabetes==0
(15,789 missing values generated)

. replace diabcat = 2 if diabetes==1 & inlist(hba1ccat, 0, 1)
(809 real changes made)

. replace diabcat = 3 if diabetes==1 & inlist(hba1ccat, 2, 3, 4)
(142 real changes made)

. replace diabcat = 4 if diabetes==1 & !inlist(hba1ccat, 0, 1, 2, 3, 4)
(14,838 real changes made)

. 
. label define diabcat    1 "No diabetes"                         ///
>                                                 2 "Controlled diabetes"      
>    ///
>                                                 3 "Uncontrolled diabetes"    
>    ///
>                                                 4 "Diabetes, no hba1c measure
> "

. label values diabcat diabcat

. 
. *Create cancer variable 'other cancer currently', includes carcinoma of the h
> ead and neck - need to confirm if this excludes NMSC
. gen cancer =0

. replace cancer =1 if lung_cancer ==1 | haem_cancer ==1 | other_cancer ==1
(38,328 real changes made)

. lab var cancer "Cancer"

. tab cancer, missing

     Cancer |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     40,549       51.41       51.41
          1 |     38,328       48.59      100.00
------------+-----------------------------------
      Total |     78,877      100.00

. 
. *Create other comorbid variables
. gen combined_cv_comorbid =1 if chronic_cardiac_disease ==1 | stroke==1
(50,465 missing values generated)

. recode combined_cv_comorbid .=0
(combined_cv_comorbid: 50465 changes made)

. 
. *Delete unneeded variables
. drop hba1c_pct hba1c_percentage hba1c_mmol_per_mol

. 
. *Label variables
. lab var hypertension "Hypertension"

. lab var diabetes "Diabetes"

. lab var stroke "Stroke"

. lab var chronic_resp_disease "Chronic respiratory disease"

. lab var copd "COPD"

. lab var esrf "End-stage renal failure"

. lab var chronic_liver_disease "Chronic liver disease"

. lab var chronic_cardiac_disease "Chronic cardiac disease"

. 
. *Refine diagnostic window====================================================
> =========*/
. 
. **All patients should have EIA code
. tab eia_code, missing

   eia_code |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        796        1.01        1.01
          1 |     78,081       98.99      100.00
------------+-----------------------------------
      Total |     78,877      100.00

. keep if eia_code==1
(796 observations deleted)

. 
. **Keep patients with first EIA code in GP record if code was after 1st March 
> 2019
. keep if eia_code_date>=date("$start_date", "DMY") & eia_code_date!=. 
(18,372 observations deleted)

. tab eia_code

   eia_code |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     59,709      100.00      100.00
------------+-----------------------------------
      Total |     59,709      100.00

. 
. **Month/Year of EIA code
. gen year_diag=year(eia_code_date)

. format year_diag %ty

. gen month_diag=month(eia_code_date)

. gen mo_year_diagn=ym(year_diag, month_diag)

. format mo_year_diagn %tm

. 
. *Include only most recent EIA sub-diagnosis==================================
> ===========*/
. 
. replace ra_code =0 if psa_code_date >= ra_code_date & psa_code_date !=.
(29,229 real changes made)

. replace ra_code =0 if anksp_code_date >= ra_code_date & anksp_code_date !=.
(9,850 real changes made)

. replace psa_code =0 if ra_code_date >= psa_code_date & ra_code_date !=.
(29,302 real changes made)

. replace psa_code =0 if anksp_code_date >= psa_code_date & anksp_code_date !=.
(10,074 real changes made)

. replace anksp_code =0 if psa_code_date >= anksp_code_date & psa_code_date !=.
(29,140 real changes made)

. replace anksp_code =0 if ra_code_date >= anksp_code_date & ra_code_date !=.
(10,095 real changes made)

. gen eia_diagnosis=1 if ra_code==1
(39,685 missing values generated)

. replace eia_diagnosis=2 if psa_code==1
(19,710 real changes made)

. replace eia_diagnosis=3 if anksp_code==1
(19,906 real changes made)

. lab define eia_diagnosis 1 "RA" 2 "PsA" 3 "AxSpA", modify

. lab val eia_diagnosis eia_diagnosis

. tab eia_diagnosis, missing

eia_diagnos |
         is |      Freq.     Percent        Cum.
------------+-----------------------------------
         RA |     20,024       33.54       33.54
        PsA |     19,710       33.01       66.55
      AxSpA |     19,906       33.34       99.88
          . |         69        0.12      100.00
------------+-----------------------------------
      Total |     59,709      100.00

. drop if eia_diagnosis==.
(69 observations deleted)

. 
. *Define drugs and dates=====================================================*
> /
. 
. **csDMARDs (not including high cost MTX; wouldn't be shared care)
. gen csdmard=1 if hydroxychloroquine==1 | leflunomide==1 | methotrexate==1 | m
> ethotrexate_inj==1 | sulfasalazine==1
(35,354 missing values generated)

. recode csdmard .=0 
(csdmard: 35354 changes made)

. tab csdmard, missing

    csdmard |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     35,354       59.28       59.28
          1 |     24,286       40.72      100.00
------------+-----------------------------------
      Total |     59,640      100.00

. bys eia_diagnosis: tab csdmard

-------------------------------------------------------------------------------
-> eia_diagnosis = RA

    csdmard |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     11,859       59.22       59.22
          1 |      8,165       40.78      100.00
------------+-----------------------------------
      Total |     20,024      100.00

-------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    csdmard |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     11,733       59.53       59.53
          1 |      7,977       40.47      100.00
------------+-----------------------------------
      Total |     19,710      100.00

-------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    csdmard |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     11,762       59.09       59.09
          1 |      8,144       40.91      100.00
------------+-----------------------------------
      Total |     19,906      100.00


. 
. **csDMARDs (including high cost MTX)
. gen csdmard_hcd=1 if hydroxychloroquine==1 | leflunomide==1 | methotrexate==1
>  | methotrexate_inj==1 | methotrexate_hcd==1 | sulfasalazine==1
(31,808 missing values generated)

. recode csdmard_hcd .=0 
(csdmard_hcd: 31808 changes made)

. tab csdmard_hcd, missing

csdmard_hcd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     31,808       53.33       53.33
          1 |     27,832       46.67      100.00
------------+-----------------------------------
      Total |     59,640      100.00

. bys eia_diagnosis: tab csdmard_hcd, missing

-------------------------------------------------------------------------------
-> eia_diagnosis = RA

csdmard_hcd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,726       53.57       53.57
          1 |      9,298       46.43      100.00
------------+-----------------------------------
      Total |     20,024      100.00

-------------------------------------------------------------------------------
-> eia_diagnosis = PsA

csdmard_hcd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,570       53.63       53.63
          1 |      9,140       46.37      100.00
------------+-----------------------------------
      Total |     19,710      100.00

-------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

csdmard_hcd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,512       52.81       52.81
          1 |      9,394       47.19      100.00
------------+-----------------------------------
      Total |     19,906      100.00


. 
. **Date of first csDMARD script (not including high cost MTX prescriptions)
. gen csdmard_date=min(hydroxychloroquine_date, leflunomide_date, methotrexate_
> date, methotrexate_inj_date, sulfasalazine_date)
(35,354 missing values generated)

. format %td csdmard_date

. 
. **Date of first csDMARD script (including high cost MTX prescriptions)
. gen csdmard_hcd_date=min(hydroxychloroquine_date, leflunomide_date, methotrex
> ate_date, methotrexate_inj_date, methotrexate_hcd_date, sulfasalazine_date)
(31,808 missing values generated)

. format %td csdmard_hcd_date

. 
. **Biologic use
. gen biologic=1 if abatacept==1 | adalimumab==1 | baricitinib==1 | certolizuma
> b==1 | etanercept==1 | golimumab==1 | guselkumab==1 | infliximab==1 | ixekizu
> mab==1 | rituximab==1 | sarilumab==1 | secukinumab==1 | tocilizumab==1 | tofa
> citinib==1 | upadacitinib==1 | ustekinumab==1 
(11,030 missing values generated)

. recode biologic .=0
(biologic: 11030 changes made)

. tab biologic, missing

   biologic |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     11,030       18.49       18.49
          1 |     48,610       81.51      100.00
------------+-----------------------------------
      Total |     59,640      100.00

. bys eia_diagnosis: tab biologic, missing 

-------------------------------------------------------------------------------
-> eia_diagnosis = RA

   biologic |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,747       18.71       18.71
          1 |     16,277       81.29      100.00
------------+-----------------------------------
      Total |     20,024      100.00

-------------------------------------------------------------------------------
-> eia_diagnosis = PsA

   biologic |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,630       18.42       18.42
          1 |     16,080       81.58      100.00
------------+-----------------------------------
      Total |     19,710      100.00

-------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

   biologic |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,653       18.35       18.35
          1 |     16,253       81.65      100.00
------------+-----------------------------------
      Total |     19,906      100.00


. 
. **Date of first biologic script
. gen biologic_date=min(abatacept_date, adalimumab_date, baricitinib_date, cert
> olizumab_date, etanercept_date, golimumab_date, guselkumab_date, infliximab_d
> ate, ixekizumab_date, rituximab_date, sarilumab_date, secukinumab_date, tocil
> izumab_date, tofacitinib_date, upadacitinib_date, ustekinumab_date)
(11,030 missing values generated)

. format %td biologic_date

. 
. **Exclude if first csdmard or biologic was before first rheum appt
. ***Nb. could introduce leeway e.g. 30 days?
. tab csdmard if rheum_appt_date!=. & csdmard_date!=. & csdmard_date<rheum_appt
> _date

    csdmard |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      8,719      100.00      100.00
------------+-----------------------------------
      Total |      8,719      100.00

. drop if rheum_appt_date!=. & csdmard_date!=. & csdmard_date<rheum_appt_date
(8,719 observations deleted)

. tab biologic if rheum_appt_date!=. & biologic_date!=. & biologic_date<rheum_a
> ppt_date 

   biologic |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     15,533      100.00      100.00
------------+-----------------------------------
      Total |     15,533      100.00

. drop if rheum_appt_date!=. & biologic_date!=. & biologic_date<rheum_appt_date
>  
(15,533 observations deleted)

. 
. *Number of EIA diagnoses in 1-year time windows==============================
> ===========*/
. 
. gen diagnosis_year=1 if eia_code_date>=td(01mar2019) & eia_code_date<td(01mar
> 2020)
(24,026 missing values generated)

. replace diagnosis_year=2 if eia_code_date>=td(01mar2020) & eia_code_date<td(0
> 1mar2021)
(11,213 real changes made)

. replace diagnosis_year=3 if eia_code_date>=td(01mar2021) & eia_code_date<td(0
> 1mar2022)
(11,194 real changes made)

. lab define diagnosis_year 1 "March 2019-March 2020" 2 "March 2020-March 2021"
>  3 "March 2021-March 2022", modify

. lab val diagnosis_year diagnosis_year

. lab var diagnosis_year "Year of diagnosis"

. tab diagnosis_year, missing

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |     11,362       32.11       32.11
March 2020-March 2021 |     11,213       31.69       63.79
March 2021-March 2022 |     11,194       31.63       95.43
                    . |      1,619        4.57      100.00
----------------------+-----------------------------------
                Total |     35,388      100.00

. bys eia_diagnosis: tab diagnosis_year, missing

-------------------------------------------------------------------------------
-> eia_diagnosis = RA

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |      3,822       32.15       32.15
March 2020-March 2021 |      3,708       31.19       63.34
March 2021-March 2022 |      3,784       31.83       95.17
                    . |        574        4.83      100.00
----------------------+-----------------------------------
                Total |     11,888      100.00

-------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |      3,750       32.16       32.16
March 2020-March 2021 |      3,765       32.29       64.45
March 2021-March 2022 |      3,652       31.32       95.76
                    . |        494        4.24      100.00
----------------------+-----------------------------------
                Total |     11,661      100.00

-------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |      3,790       32.01       32.01
March 2020-March 2021 |      3,740       31.59       63.60
March 2021-March 2022 |      3,758       31.74       95.35
                    . |        551        4.65      100.00
----------------------+-----------------------------------
                Total |     11,839      100.00


. 
. **Proportion of patients with at least 6 or 12 months of GP follow-up after E
> IA code
. tab has_6m_follow_up

has_6m_foll |
      ow_up |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,790        5.06        5.06
          1 |     33,598       94.94      100.00
------------+-----------------------------------
      Total |     35,388      100.00

. tab has_12m_follow_up

has_12m_fol |
     low_up |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,516        9.94        9.94
          1 |     31,872       90.06      100.00
------------+-----------------------------------
      Total |     35,388      100.00

. tab mo_year_diagn has_6m_follow_up

mo_year_di |   has_6m_follow_up
       agn |         0          1 |     Total
-----------+----------------------+----------
    2019m3 |        37        911 |       948 
    2019m4 |        53        913 |       966 
    2019m5 |        55        909 |       964 
    2019m6 |        43        880 |       923 
    2019m7 |        38        916 |       954 
    2019m8 |        54        896 |       950 
    2019m9 |        48        890 |       938 
   2019m10 |        49        910 |       959 
   2019m11 |        50        903 |       953 
   2019m12 |        39        930 |       969 
    2020m1 |        40        904 |       944 
    2020m2 |        50        844 |       894 
    2020m3 |        47        863 |       910 
    2020m4 |        55        851 |       906 
    2020m5 |        53        937 |       990 
    2020m6 |        52        860 |       912 
    2020m7 |        42        944 |       986 
    2020m8 |        42        917 |       959 
    2020m9 |        52        873 |       925 
   2020m10 |        44        924 |       968 
   2020m11 |        48        906 |       954 
   2020m12 |        46        883 |       929 
    2021m1 |        42        920 |       962 
    2021m2 |        37        775 |       812 
    2021m3 |        44        853 |       897 
    2021m4 |        52        922 |       974 
    2021m5 |        61        902 |       963 
    2021m6 |        51        850 |       901 
    2021m7 |        47        890 |       937 
    2021m8 |        70        920 |       990 
    2021m9 |        47        842 |       889 
   2021m10 |        40        897 |       937 
   2021m11 |        40        866 |       906 
   2021m12 |        51        930 |       981 
    2022m1 |        52        878 |       930 
    2022m2 |        36        853 |       889 
    2022m3 |        57        900 |       957 
    2022m4 |        26        636 |       662 
-----------+----------------------+----------
     Total |     1,790     33,598 |    35,388 

. tab mo_year_diagn has_12m_follow_up

mo_year_di |   has_12m_follow_up
       agn |         0          1 |     Total
-----------+----------------------+----------
    2019m3 |        89        859 |       948 
    2019m4 |        86        880 |       966 
    2019m5 |       112        852 |       964 
    2019m6 |        83        840 |       923 
    2019m7 |        94        860 |       954 
    2019m8 |       101        849 |       950 
    2019m9 |        90        848 |       938 
   2019m10 |        88        871 |       959 
   2019m11 |        99        854 |       953 
   2019m12 |       100        869 |       969 
    2020m1 |        95        849 |       944 
    2020m2 |        97        797 |       894 
    2020m3 |        98        812 |       910 
    2020m4 |       103        803 |       906 
    2020m5 |        93        897 |       990 
    2020m6 |        96        816 |       912 
    2020m7 |        73        913 |       986 
    2020m8 |        89        870 |       959 
    2020m9 |        97        828 |       925 
   2020m10 |        93        875 |       968 
   2020m11 |        81        873 |       954 
   2020m12 |       106        823 |       929 
    2021m1 |        94        868 |       962 
    2021m2 |        89        723 |       812 
    2021m3 |        87        810 |       897 
    2021m4 |        93        881 |       974 
    2021m5 |        87        876 |       963 
    2021m6 |        87        814 |       901 
    2021m7 |        92        845 |       937 
    2021m8 |        96        894 |       990 
    2021m9 |        98        791 |       889 
   2021m10 |        83        854 |       937 
   2021m11 |        88        818 |       906 
   2021m12 |        91        890 |       981 
    2022m1 |       110        820 |       930 
    2022m2 |        99        790 |       889 
    2022m3 |        92        865 |       957 
    2022m4 |        67        595 |       662 
-----------+----------------------+----------
     Total |     3,516     31,872 |    35,388 

. tab diagnosis_year if has_6m_follow_up==1, missing

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |     10,806       32.16       32.16
March 2020-March 2021 |     10,653       31.71       63.87
March 2021-March 2022 |     10,603       31.56       95.43
                    . |      1,536        4.57      100.00
----------------------+-----------------------------------
                Total |     33,598      100.00

. bys eia_diagnosis: tab diagnosis_year if has_6m_follow_up==1, missing

-------------------------------------------------------------------------------
-> eia_diagnosis = RA

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |      3,635       32.18       32.18
March 2020-March 2021 |      3,521       31.17       63.36
March 2021-March 2022 |      3,585       31.74       95.10
                    . |        554        4.90      100.00
----------------------+-----------------------------------
                Total |     11,295      100.00

-------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |      3,567       32.22       32.22
March 2020-March 2021 |      3,581       32.35       64.57
March 2021-March 2022 |      3,459       31.24       95.81
                    . |        464        4.19      100.00
----------------------+-----------------------------------
                Total |     11,071      100.00

-------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |      3,604       32.09       32.09
March 2020-March 2021 |      3,551       31.62       63.70
March 2021-March 2022 |      3,559       31.69       95.39
                    . |        518        4.61      100.00
----------------------+-----------------------------------
                Total |     11,232      100.00


. tab diagnosis_year if has_12m_follow_up==1, missing

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |     10,228       32.09       32.09
March 2020-March 2021 |     10,101       31.69       63.78
March 2021-March 2022 |     10,083       31.64       95.42
                    . |      1,460        4.58      100.00
----------------------+-----------------------------------
                Total |     31,872      100.00

. bys eia_diagnosis: tab diagnosis_year if has_12m_follow_up==1, missing

-------------------------------------------------------------------------------
-> eia_diagnosis = RA

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |      3,477       32.31       32.31
March 2020-March 2021 |      3,363       31.25       63.56
March 2021-March 2022 |      3,411       31.70       95.26
                    . |        510        4.74      100.00
----------------------+-----------------------------------
                Total |     10,761      100.00

-------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |      3,366       32.16       32.16
March 2020-March 2021 |      3,364       32.14       64.30
March 2021-March 2022 |      3,294       31.47       95.77
                    . |        443        4.23      100.00
----------------------+-----------------------------------
                Total |     10,467      100.00

-------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |      3,385       31.80       31.80
March 2020-March 2021 |      3,374       31.70       63.50
March 2021-March 2022 |      3,378       31.74       95.24
                    . |        507        4.76      100.00
----------------------+-----------------------------------
                Total |     10,644      100.00


. 
. *Define appointments and referrals======================================*/
. **Nb. not excluding those without 6m+ follow-up
. 
. **Rheumatology appt 
. tab rheum_appt  //proportion with first rheum outpatient date in the year bef
> ore EIA code appears in GP record (could change to two years)

 rheum_appt |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,036       17.06       17.06
          1 |     29,352       82.94      100.00
------------+-----------------------------------
      Total |     35,388      100.00

. tab rheum_appt if rheum_appt_date<eia_code_date & rheum_appt_date!=. //confir
> m proportion who had rheum appt (i.e. not missing) and appt before EIA code (
> should be accounted for by Python code)

 rheum_appt |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     23,830      100.00      100.00
------------+-----------------------------------
      Total |     23,830      100.00

. 
. **Rheumatology referrals
. tab referral_rheum_prerheum //last rheum referral in the year before rheumato
> logy outpatient (requires rheum appt to have been present, and rheum appt to 
> be before EIA code)

referral_rh |
eum_prerheu |
          m |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,572       10.09       10.09
          1 |     31,816       89.91      100.00
------------+-----------------------------------
      Total |     35,388      100.00

. tab referral_rheum_prerheum if rheum_appt!=0  //last rheum referral in the ye
> ar before rheumatology outpatient if rheum appt date present

referral_rh |
eum_prerheu |
          m |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,995       10.20       10.20
          1 |     26,357       89.80      100.00
------------+-----------------------------------
      Total |     29,352      100.00

. tab referral_rheum_prerheum if rheum_appt!=0 & referral_rheum_prerheum_date<r
> heum_appt_date  //last rheum referral in the year before rheumatology outpati
> ent, assuming ref date before rheum appt date (should be accounted for by Pyt
> hon code)

referral_rh |
eum_prerheu |
          m |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      8,664      100.00      100.00
------------+-----------------------------------
      Total |      8,664      100.00

. tab referral_rheum_precode //last rheum referral in the year before EIA code 
> (could use if rheum appt missing)

referral_rh |
eum_precode |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,636       10.27       10.27
          1 |     31,752       89.73      100.00
------------+-----------------------------------
      Total |     35,388      100.00

. gen referral_rheum_comb_date = referral_rheum_prerheum_date if referral_rheum
> _prerheum_date!=.
(3,572 missing values generated)

. replace referral_rheum_comb_date = referral_rheum_precode_date if referral_rh
> eum_prerheum_date==. & referral_rheum_precode_date!=.
(3,187 real changes made)

. format %td referral_rheum_comb_date

. codebook referral_rheum_comb_date

-------------------------------------------------------------------------------
referral_rheum_comb_date                                            (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric daily date (float)

                 range:  [21260,22756]                units:  1
       or equivalently:  [17mar2018,21apr2022]        units:  days
         unique values:  1,497                    missing .:  385/35,388

                  mean:   22003.3 = 29mar2020 (+ 8 hours)
              std. dev:    432.05

           percentiles:        10%       25%       50%       75%       90%
                             21406     21629     22001     22376     22603
                         10aug2018 21mar2019 27mar2020 06apr2021 19nov2021

. 
. **GP appointments
. tab last_gp_refrheum //proportion with last GP appointment in year before rhe
> um referral (pre-rheum appt); requires there to have been a rheum referral, b
> efore a rheum appt, before an EIA code

last_gp_ref |
      rheum |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,492        9.87        9.87
          1 |     31,896       90.13      100.00
------------+-----------------------------------
      Total |     35,388      100.00

. gen all_appts=1 if last_gp_refrheum==1 & referral_rheum_prerheum==1 & rheum_a
> ppt==1 & eia_code==1 & last_gp_refrheum_date<referral_rheum_prerheum_date & r
> eferral_rheum_prerheum_date<rheum_appt_date & rheum_appt_date<eia_code_date 
(34,401 missing values generated)

. recode all_appts .=0
(all_appts: 34401 changes made)

. tab all_appts, missing //KEY - proportion who had a last gp appt, then rheum 
> ref, then rheum appt, then EIA code 

  all_appts |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     34,401       97.21       97.21
          1 |        987        2.79      100.00
------------+-----------------------------------
      Total |     35,388      100.00

. tab last_gp_refcode //last GP appointment before rheum ref (i.e. pre-eia code
>  ref); requires there to have been a rheum referral before an EIA code (i.e. 
> rheum appt could have been missing)

last_gp_ref |
       code |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,545       10.02       10.02
          1 |     31,843       89.98      100.00
------------+-----------------------------------
      Total |     35,388      100.00

. tab last_gp_prerheum //last GP appointment before rheum appt; requires there 
> to have been a rheum appt before and EIA code

last_gp_pre |
      rheum |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,513        9.93        9.93
          1 |     31,875       90.07      100.00
------------+-----------------------------------
      Total |     35,388      100.00

. tab last_gp_precode //last GP appointment before EIA code

last_gp_pre |
       code |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,589       10.14       10.14
          1 |     31,799       89.86      100.00
------------+-----------------------------------
      Total |     35,388      100.00

. 
. **For sensitivity analyses for those without rheum_appt, replace diagnosis da
> te as EIA code date if rheum appt pre-code is missing or after
. gen eia_diagnosis_date_nomiss=rheum_appt_date if rheum_appt_date!=.
(6,036 missing values generated)

. format %td eia_diagnosis_date_nomiss

. replace eia_diagnosis_date_nomiss=eia_code_date if (rheum_appt_date==. | rheu
> m_appt_date>eia_code_date) & eia_code_date!=.
(11,545 real changes made)

. gen eia_diagnosis_nomiss=1 if eia_diagnosis_date_nomiss!=.

. recode eia_diagnosis_nomiss .=0
(eia_diagnosis_nomiss: 0 changes made)

. tab eia_diagnosis_nomiss

eia_diagnos |
  is_nomiss |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     35,388      100.00      100.00
------------+-----------------------------------
      Total |     35,388      100.00

. 
. *Time to referral, appointment and EIA code==================================
> ===========*/
. 
. **Time from last GP to rheum ref before rheum appt (i.e. if appts are present
>  and in correct time order) //Note - referral could (in theory) be coded just
>  before GP appt
. gen time_gp_rheum_ref_appt = (referral_rheum_prerheum_date - last_gp_refrheum
> _date) if referral_rheum_prerheum_date!=. & last_gp_refrheum_date!=. & rheum_
> appt_date!=. & referral_rheum_prerheum_date>last_gp_refrheum_date & referral_
> rheum_prerheum_date<rheum_appt_date & rheum_appt_date<eia_code_date
(34,401 missing values generated)

. tabstat time_gp_rheum_ref_appt, stats (n mean p50 p25 p75) //all patients (sh
> ould be same number as all_appts)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~t |       987  234.1125       180        88       330
----------------------------------------------------------------

. bys eia_diagnosis: tabstat time_gp_rheum_ref_appt, stats (n mean p50 p25 p75)
>  //by eia diagnosis

-------------------------------------------------------------------------------
-> eia_diagnosis = RA

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~t |       342  225.0965     163.5        83       319
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~t |       318  246.6006     197.5        91       344
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~t |       327  231.3976       180        87       324
----------------------------------------------------------------

. bys diagnosis_year: tabstat time_gp_rheum_ref_appt, stats (n mean p50 p25 p75
> ) //by diagnosis year

-------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~t |        88  139.9432       118        67       196
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~t |       281  192.0712       170        68       279
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~t |       522  263.0057       203        96       386
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> diagnosis_year = .

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~t |        96  286.3854     240.5       109       417
----------------------------------------------------------------

. bys nuts_region: tabstat time_gp_rheum_ref_appt, stats (n mean p50 p25 p75) /
> /by region

-------------------------------------------------------------------------------
-> nuts_region = East Midlands

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~t |        91  254.7363       215        98       374
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = East of England

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~t |       121  253.1157       228       107       342
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = London

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~t |       189       233       189        95       295
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = North East

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~t |        93  264.6989       211       123       397
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = North West

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~t |       101  241.5446       172        86       356
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = South East

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~t |       210  212.0286     153.5        66       309
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = West Midlands

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~t |        91  204.6264       164        73       315
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~t |        91  231.4725       178        80       368
----------------------------------------------------------------

. 
. gen gp_ref_cat=1 if time_gp_rheum_ref_appt<=3 & time_gp_rheum_ref_appt!=. 
(35,378 missing values generated)

. replace gp_ref_cat=2 if time_gp_rheum_ref_appt<=7 & time_gp_rheum_ref_appt!=.
>  & gp_ref_cat==.
(7 real changes made)

. replace gp_ref_cat=3 if time_gp_rheum_ref_appt>7 & time_gp_rheum_ref_appt!=. 
> & gp_ref_cat==.
(970 real changes made)

. lab define gp_ref_cat 1 "Referred within 3 days" 2 "Referred within 7 days" 3
>  "Referral delay >7 days", modify

. lab val gp_ref_cat gp_ref_cat

. lab var gp_ref_cat "Time to GP referral"

. tab gp_ref_cat, missing

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |         10        0.03        0.03
Referred within 7 days |          7        0.02        0.05
Referral delay >7 days |        970        2.74        2.79
                     . |     34,401       97.21      100.00
-----------------------+-----------------------------------
                 Total |     35,388      100.00

. tab gp_ref_cat

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |         10        1.01        1.01
Referred within 7 days |          7        0.71        1.72
Referral delay >7 days |        970       98.28      100.00
-----------------------+-----------------------------------
                 Total |        987      100.00

. bys eia_diagnosis: tab gp_ref_cat, missing

-------------------------------------------------------------------------------
-> eia_diagnosis = RA

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          5        0.04        0.04
Referred within 7 days |          4        0.03        0.08
Referral delay >7 days |        333        2.80        2.88
                     . |     11,546       97.12      100.00
-----------------------+-----------------------------------
                 Total |     11,888      100.00

-------------------------------------------------------------------------------
-> eia_diagnosis = PsA

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          3        0.03        0.03
Referral delay >7 days |        315        2.70        2.73
                     . |     11,343       97.27      100.00
-----------------------+-----------------------------------
                 Total |     11,661      100.00

-------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          2        0.02        0.02
Referred within 7 days |          3        0.03        0.04
Referral delay >7 days |        322        2.72        2.76
                     . |     11,512       97.24      100.00
-----------------------+-----------------------------------
                 Total |     11,839      100.00


. bys eia_diagnosis: tab gp_ref_cat

-------------------------------------------------------------------------------
-> eia_diagnosis = RA

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          5        1.46        1.46
Referred within 7 days |          4        1.17        2.63
Referral delay >7 days |        333       97.37      100.00
-----------------------+-----------------------------------
                 Total |        342      100.00

-------------------------------------------------------------------------------
-> eia_diagnosis = PsA

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          3        0.94        0.94
Referral delay >7 days |        315       99.06      100.00
-----------------------+-----------------------------------
                 Total |        318      100.00

-------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          2        0.61        0.61
Referred within 7 days |          3        0.92        1.53
Referral delay >7 days |        322       98.47      100.00
-----------------------+-----------------------------------
                 Total |        327      100.00


. bys diagnosis_year: tab gp_ref_cat, missing

-------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        0.01        0.01
Referred within 7 days |          2        0.02        0.03
Referral delay >7 days |         85        0.75        0.77
                     . |     11,274       99.23      100.00
-----------------------+-----------------------------------
                 Total |     11,362      100.00

-------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          2        0.02        0.02
Referred within 7 days |          3        0.03        0.04
Referral delay >7 days |        276        2.46        2.51
                     . |     10,932       97.49      100.00
-----------------------+-----------------------------------
                 Total |     11,213      100.00

-------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          6        0.05        0.05
Referred within 7 days |          1        0.01        0.06
Referral delay >7 days |        515        4.60        4.66
                     . |     10,672       95.34      100.00
-----------------------+-----------------------------------
                 Total |     11,194      100.00

-------------------------------------------------------------------------------
-> diagnosis_year = .

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        0.06        0.06
Referred within 7 days |          1        0.06        0.12
Referral delay >7 days |         94        5.81        5.93
                     . |      1,523       94.07      100.00
-----------------------+-----------------------------------
                 Total |      1,619      100.00


. bys diagnosis_year: tab gp_ref_cat

-------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        1.14        1.14
Referred within 7 days |          2        2.27        3.41
Referral delay >7 days |         85       96.59      100.00
-----------------------+-----------------------------------
                 Total |         88      100.00

-------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          2        0.71        0.71
Referred within 7 days |          3        1.07        1.78
Referral delay >7 days |        276       98.22      100.00
-----------------------+-----------------------------------
                 Total |        281      100.00

-------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          6        1.15        1.15
Referred within 7 days |          1        0.19        1.34
Referral delay >7 days |        515       98.66      100.00
-----------------------+-----------------------------------
                 Total |        522      100.00

-------------------------------------------------------------------------------
-> diagnosis_year = .

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        1.04        1.04
Referred within 7 days |          1        1.04        2.08
Referral delay >7 days |         94       97.92      100.00
-----------------------+-----------------------------------
                 Total |         96      100.00


. bys nuts_region: tab gp_ref_cat, missing

-------------------------------------------------------------------------------
-> nuts_region = East Midlands

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        0.03        0.03
Referral delay >7 days |         90        2.50        2.53
                     . |      3,506       97.47      100.00
-----------------------+-----------------------------------
                 Total |      3,597      100.00

-------------------------------------------------------------------------------
-> nuts_region = East of England

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          2        0.06        0.06
Referral delay >7 days |        119        3.37        3.43
                     . |      3,406       96.57      100.00
-----------------------+-----------------------------------
                 Total |      3,527      100.00

-------------------------------------------------------------------------------
-> nuts_region = London

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        0.01        0.01
Referred within 7 days |          2        0.03        0.04
Referral delay >7 days |        186        2.60        2.64
                     . |      6,958       97.36      100.00
-----------------------+-----------------------------------
                 Total |      7,147      100.00

-------------------------------------------------------------------------------
-> nuts_region = North East

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        0.03        0.03
Referral delay >7 days |         92        2.62        2.64
                     . |      3,424       97.36      100.00
-----------------------+-----------------------------------
                 Total |      3,517      100.00

-------------------------------------------------------------------------------
-> nuts_region = North West

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        0.03        0.03
Referral delay >7 days |        100        2.85        2.88
                     . |      3,407       97.12      100.00
-----------------------+-----------------------------------
                 Total |      3,508      100.00

-------------------------------------------------------------------------------
-> nuts_region = South East

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          3        0.04        0.04
Referred within 7 days |          2        0.03        0.07
Referral delay >7 days |        205        2.91        2.98
                     . |      6,840       97.02      100.00
-----------------------+-----------------------------------
                 Total |      7,050      100.00

-------------------------------------------------------------------------------
-> nuts_region = West Midlands

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        0.03        0.03
Referred within 7 days |          1        0.03        0.06
Referral delay >7 days |         89        2.47        2.53
                     . |      3,508       97.47      100.00
-----------------------+-----------------------------------
                 Total |      3,599      100.00

-------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 7 days |          2        0.06        0.06
Referral delay >7 days |         89        2.58        2.64
                     . |      3,352       97.36      100.00
-----------------------+-----------------------------------
                 Total |      3,443      100.00


. bys nuts_region: tab gp_ref_cat

-------------------------------------------------------------------------------
-> nuts_region = East Midlands

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        1.10        1.10
Referral delay >7 days |         90       98.90      100.00
-----------------------+-----------------------------------
                 Total |         91      100.00

-------------------------------------------------------------------------------
-> nuts_region = East of England

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          2        1.65        1.65
Referral delay >7 days |        119       98.35      100.00
-----------------------+-----------------------------------
                 Total |        121      100.00

-------------------------------------------------------------------------------
-> nuts_region = London

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        0.53        0.53
Referred within 7 days |          2        1.06        1.59
Referral delay >7 days |        186       98.41      100.00
-----------------------+-----------------------------------
                 Total |        189      100.00

-------------------------------------------------------------------------------
-> nuts_region = North East

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        1.08        1.08
Referral delay >7 days |         92       98.92      100.00
-----------------------+-----------------------------------
                 Total |         93      100.00

-------------------------------------------------------------------------------
-> nuts_region = North West

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        0.99        0.99
Referral delay >7 days |        100       99.01      100.00
-----------------------+-----------------------------------
                 Total |        101      100.00

-------------------------------------------------------------------------------
-> nuts_region = South East

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          3        1.43        1.43
Referred within 7 days |          2        0.95        2.38
Referral delay >7 days |        205       97.62      100.00
-----------------------+-----------------------------------
                 Total |        210      100.00

-------------------------------------------------------------------------------
-> nuts_region = West Midlands

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        1.10        1.10
Referred within 7 days |          1        1.10        2.20
Referral delay >7 days |         89       97.80      100.00
-----------------------+-----------------------------------
                 Total |         91      100.00

-------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 7 days |          2        2.20        2.20
Referral delay >7 days |         89       97.80      100.00
-----------------------+-----------------------------------
                 Total |         91      100.00


. 
. gen gp_ref_3d=1 if time_gp_rheum_ref_appt<=3 & time_gp_rheum_ref_appt!=. 
(35,378 missing values generated)

. replace gp_ref_3d=2 if time_gp_rheum_ref_appt>3 & time_gp_rheum_ref_appt!=.
(977 real changes made)

. lab define gp_ref_3d 1 "Referred within 3 days" 2 "Referral delay >3 days", m
> odify

. lab val gp_ref_3d gp_ref_3d

. lab var gp_ref_3d "Time to GP referral"

. tab gp_ref_3d, missing

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |         10        0.03        0.03
Referral delay >3 days |        977        2.76        2.79
                     . |     34,401       97.21      100.00
-----------------------+-----------------------------------
                 Total |     35,388      100.00

. tab gp_ref_3d

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |         10        1.01        1.01
Referral delay >3 days |        977       98.99      100.00
-----------------------+-----------------------------------
                 Total |        987      100.00

. bys eia_diagnosis: tab gp_ref_3d, missing

-------------------------------------------------------------------------------
-> eia_diagnosis = RA

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          5        0.04        0.04
Referral delay >3 days |        337        2.83        2.88
                     . |     11,546       97.12      100.00
-----------------------+-----------------------------------
                 Total |     11,888      100.00

-------------------------------------------------------------------------------
-> eia_diagnosis = PsA

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          3        0.03        0.03
Referral delay >3 days |        315        2.70        2.73
                     . |     11,343       97.27      100.00
-----------------------+-----------------------------------
                 Total |     11,661      100.00

-------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          2        0.02        0.02
Referral delay >3 days |        325        2.75        2.76
                     . |     11,512       97.24      100.00
-----------------------+-----------------------------------
                 Total |     11,839      100.00


. bys eia_diagnosis: tab gp_ref_3d

-------------------------------------------------------------------------------
-> eia_diagnosis = RA

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          5        1.46        1.46
Referral delay >3 days |        337       98.54      100.00
-----------------------+-----------------------------------
                 Total |        342      100.00

-------------------------------------------------------------------------------
-> eia_diagnosis = PsA

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          3        0.94        0.94
Referral delay >3 days |        315       99.06      100.00
-----------------------+-----------------------------------
                 Total |        318      100.00

-------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          2        0.61        0.61
Referral delay >3 days |        325       99.39      100.00
-----------------------+-----------------------------------
                 Total |        327      100.00


. bys diagnosis_year: tab gp_ref_3d, missing

-------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        0.01        0.01
Referral delay >3 days |         87        0.77        0.77
                     . |     11,274       99.23      100.00
-----------------------+-----------------------------------
                 Total |     11,362      100.00

-------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          2        0.02        0.02
Referral delay >3 days |        279        2.49        2.51
                     . |     10,932       97.49      100.00
-----------------------+-----------------------------------
                 Total |     11,213      100.00

-------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          6        0.05        0.05
Referral delay >3 days |        516        4.61        4.66
                     . |     10,672       95.34      100.00
-----------------------+-----------------------------------
                 Total |     11,194      100.00

-------------------------------------------------------------------------------
-> diagnosis_year = .

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        0.06        0.06
Referral delay >3 days |         95        5.87        5.93
                     . |      1,523       94.07      100.00
-----------------------+-----------------------------------
                 Total |      1,619      100.00


. bys diagnosis_year: tab gp_ref_3d

-------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        1.14        1.14
Referral delay >3 days |         87       98.86      100.00
-----------------------+-----------------------------------
                 Total |         88      100.00

-------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          2        0.71        0.71
Referral delay >3 days |        279       99.29      100.00
-----------------------+-----------------------------------
                 Total |        281      100.00

-------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          6        1.15        1.15
Referral delay >3 days |        516       98.85      100.00
-----------------------+-----------------------------------
                 Total |        522      100.00

-------------------------------------------------------------------------------
-> diagnosis_year = .

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        1.04        1.04
Referral delay >3 days |         95       98.96      100.00
-----------------------+-----------------------------------
                 Total |         96      100.00


. bys nuts_region: tab gp_ref_3d, missing

-------------------------------------------------------------------------------
-> nuts_region = East Midlands

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        0.03        0.03
Referral delay >3 days |         90        2.50        2.53
                     . |      3,506       97.47      100.00
-----------------------+-----------------------------------
                 Total |      3,597      100.00

-------------------------------------------------------------------------------
-> nuts_region = East of England

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          2        0.06        0.06
Referral delay >3 days |        119        3.37        3.43
                     . |      3,406       96.57      100.00
-----------------------+-----------------------------------
                 Total |      3,527      100.00

-------------------------------------------------------------------------------
-> nuts_region = London

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        0.01        0.01
Referral delay >3 days |        188        2.63        2.64
                     . |      6,958       97.36      100.00
-----------------------+-----------------------------------
                 Total |      7,147      100.00

-------------------------------------------------------------------------------
-> nuts_region = North East

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        0.03        0.03
Referral delay >3 days |         92        2.62        2.64
                     . |      3,424       97.36      100.00
-----------------------+-----------------------------------
                 Total |      3,517      100.00

-------------------------------------------------------------------------------
-> nuts_region = North West

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        0.03        0.03
Referral delay >3 days |        100        2.85        2.88
                     . |      3,407       97.12      100.00
-----------------------+-----------------------------------
                 Total |      3,508      100.00

-------------------------------------------------------------------------------
-> nuts_region = South East

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          3        0.04        0.04
Referral delay >3 days |        207        2.94        2.98
                     . |      6,840       97.02      100.00
-----------------------+-----------------------------------
                 Total |      7,050      100.00

-------------------------------------------------------------------------------
-> nuts_region = West Midlands

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        0.03        0.03
Referral delay >3 days |         90        2.50        2.53
                     . |      3,508       97.47      100.00
-----------------------+-----------------------------------
                 Total |      3,599      100.00

-------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referral delay >3 days |         91        2.64        2.64
                     . |      3,352       97.36      100.00
-----------------------+-----------------------------------
                 Total |      3,443      100.00


. bys nuts_region: tab gp_ref_3d

-------------------------------------------------------------------------------
-> nuts_region = East Midlands

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        1.10        1.10
Referral delay >3 days |         90       98.90      100.00
-----------------------+-----------------------------------
                 Total |         91      100.00

-------------------------------------------------------------------------------
-> nuts_region = East of England

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          2        1.65        1.65
Referral delay >3 days |        119       98.35      100.00
-----------------------+-----------------------------------
                 Total |        121      100.00

-------------------------------------------------------------------------------
-> nuts_region = London

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        0.53        0.53
Referral delay >3 days |        188       99.47      100.00
-----------------------+-----------------------------------
                 Total |        189      100.00

-------------------------------------------------------------------------------
-> nuts_region = North East

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        1.08        1.08
Referral delay >3 days |         92       98.92      100.00
-----------------------+-----------------------------------
                 Total |         93      100.00

-------------------------------------------------------------------------------
-> nuts_region = North West

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        0.99        0.99
Referral delay >3 days |        100       99.01      100.00
-----------------------+-----------------------------------
                 Total |        101      100.00

-------------------------------------------------------------------------------
-> nuts_region = South East

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          3        1.43        1.43
Referral delay >3 days |        207       98.57      100.00
-----------------------+-----------------------------------
                 Total |        210      100.00

-------------------------------------------------------------------------------
-> nuts_region = West Midlands

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        1.10        1.10
Referral delay >3 days |         90       98.90      100.00
-----------------------+-----------------------------------
                 Total |         91      100.00

-------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referral delay >3 days |         91      100.00      100.00
-----------------------+-----------------------------------
                 Total |         91      100.00


. 
. **Time from last GP to rheum ref before eia code (sensitivity analysis; inclu
> des those with no rheum appt)
. gen time_gp_rheum_ref_code = (referral_rheum_precode_date - last_gp_refcode_d
> ate) if referral_rheum_precode_date!=. & last_gp_refcode_date!=. & referral_r
> heum_precode_date>last_gp_refcode_date & referral_rheum_precode_date<eia_code
> _date
(29,367 missing values generated)

. tabstat time_gp_rheum_ref_code, stats (n mean p50 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~e |      6021  382.8359       317       143       564
----------------------------------------------------------------

. bys eia_diagnosis: tabstat time_gp_rheum_ref_code, stats (n mean p50 p25 p75)

-------------------------------------------------------------------------------
-> eia_diagnosis = RA

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~e |      2060  384.0354       322     146.5       559
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~e |      1940   386.982     321.5       144       569
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~e |      2021  377.6333       312       140       563
----------------------------------------------------------------

. 
. **Time from last GP to rheum ref (combined - sensitivity analysis; includes t
> hose with no rheum appt)
. gen time_gp_rheum_ref_comb = time_gp_rheum_ref_appt 
(34,401 missing values generated)

. replace time_gp_rheum_ref_comb = time_gp_rheum_ref_code if time_gp_rheum_ref_
> appt==. & time_gp_rheum_ref_code!=.
(5,779 real changes made)

. tabstat time_gp_rheum_ref_comb, stats (n mean p50 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~b |      6766  359.3958       289       129       528
----------------------------------------------------------------

. bys eia_diagnosis: tabstat time_gp_rheum_ref_comb, stats (n mean p50 p25 p75)

-------------------------------------------------------------------------------
-> eia_diagnosis = RA

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~b |      2328  358.7564       289       128       528
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~b |      2173  365.2016       295       133       531
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~b |      2265   354.483       285       126       521
----------------------------------------------------------------

. 
. **Time from last GP pre-rheum appt to first rheum appt (key sensitivity analy
> sis; includes those with no rheum ref)
. gen time_gp_rheum_appt = (rheum_appt_date - last_gp_prerheum_date) if rheum_a
> ppt_date!=. & last_gp_prerheum_date!=. & rheum_appt_date>last_gp_prerheum_dat
> e & rheum_appt_date<eia_code_date
(29,889 missing values generated)

. tabstat time_gp_rheum_appt, stats (n mean p50 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_~m_appt |      5499  290.5483       229       104       419
----------------------------------------------------------------

. bys eia_diagnosis: tabstat time_gp_rheum_appt, stats (n mean p50 p25 p75)

-------------------------------------------------------------------------------
-> eia_diagnosis = RA

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_~m_appt |      1832  281.2669     228.5       103       408
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_~m_appt |      1809  299.0409       236       109       423
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_~m_appt |      1858  291.4311       224       102       427
----------------------------------------------------------------

. bys diagnosis_year: tabstat time_gp_rheum_appt, stats (n mean p50 p25 p75) //
> by diagnosis year

-------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_~m_appt |       879  172.3595       150        69       254
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_~m_appt |      1788  272.4306     227.5       105       393
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_~m_appt |      2436   333.491       271       122     492.5
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> diagnosis_year = .

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_~m_appt |       396  370.5328       292     118.5     560.5
----------------------------------------------------------------

. bys nuts_region: tabstat time_gp_rheum_appt, stats (n mean p50 p25 p75) //by 
> region

-------------------------------------------------------------------------------
-> nuts_region = East Midlands

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_~m_appt |       547  287.8062       238       107       414
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = East of England

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_~m_appt |       559  277.3417       218        99       412
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = London

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_~m_appt |      1134   291.873     233.5       105       420
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = North East

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_~m_appt |       535  280.9738       221        94       403
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = North West

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_~m_appt |       521  300.3954       237       107       453
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = South East

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_~m_appt |      1115  293.3238       231       105       411
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = West Midlands

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_~m_appt |       556  280.4353       223      97.5       403
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_~m_appt |       532  309.1579     241.5     114.5     453.5
----------------------------------------------------------------

. 
. **Time from last GP pre-code to EIA code (sensitivity analysis; includes thos
> e with no rheum ref and/or no rheum appt)
. gen time_gp_eia_code = (eia_code_date - last_gp_precode_date) if eia_code_dat
> e!=. & last_gp_precode_date!=. & eia_code_date>last_gp_precode_date
(15,763 missing values generated)

. tabstat time_gp_eia_code, stats (n mean p50 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_ei~e |     19625  520.4104       470       229       769
----------------------------------------------------------------

. bys eia_diagnosis: tabstat time_gp_eia_code, stats (n mean p50 p25 p75)

-------------------------------------------------------------------------------
-> eia_diagnosis = RA

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_ei~e |      6626  520.4591       470       229       770
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_ei~e |      6411  521.0468       467       231       775
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_ei~e |      6588  519.7421       475     225.5       763
----------------------------------------------------------------

. 
. **Time from last GP to EIA diagnosis (combined - sensitivity analysis; includ
> es those with no rheum appt)
. gen time_gp_eia_diag = time_gp_rheum_appt
(29,889 missing values generated)

. replace time_gp_eia_diag = time_gp_eia_code if time_gp_rheum_appt==. & time_g
> p_eia_code!=.
(16,160 real changes made)

. tabstat time_gp_eia_diag, stats (n mean p50 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_ei~g |     21659  453.4373       384       177       674
----------------------------------------------------------------

. bys eia_diagnosis: tabstat time_gp_eia_diag, stats (n mean p50 p25 p75)

-------------------------------------------------------------------------------
-> eia_diagnosis = RA

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_ei~g |      7305   451.584       387       177       668
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_ei~g |      7096  454.6576       380       178       678
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_ei~g |      7258  454.1095     383.5       177       674
----------------------------------------------------------------

. 
. **Time from rheum ref to rheum appt (i.e. if appts are present and in correct
>  time order)
. gen time_ref_rheum_appt = (rheum_appt_date - referral_rheum_prerheum_date) if
>  rheum_appt_date!=. & referral_rheum_prerheum_date!=. & referral_rheum_prerhe
> um_date<rheum_appt_date & rheum_appt_date<eia_code_date
(29,913 missing values generated)

. tabstat time_ref_rheum_appt, stats (n mean p50 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~t |      5475  298.5936       238       109       426
----------------------------------------------------------------

. bys eia_diagnosis: tabstat time_ref_rheum_appt, stats (n mean p50 p25 p75)

-------------------------------------------------------------------------------
-> eia_diagnosis = RA

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~t |      1868  297.2281       235     111.5     423.5
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~t |      1780  300.9281     234.5     107.5       428
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~t |      1827  297.7154       243       109       425
----------------------------------------------------------------

. bys diagnosis_year: tabstat time_ref_rheum_appt, stats (n mean p50 p25 p75) /
> /all patients by diagnosis year

-------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~t |       835  169.7569       142        61       256
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~t |      1764  267.4274     225.5       106       392
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~t |      2489  349.8907       278       132       509
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> diagnosis_year = .

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~t |       387  388.7158       312       146       523
----------------------------------------------------------------

. bys nuts_region: tabstat time_ref_rheum_appt, stats (n mean p50 p25 p75) //by
>  region

-------------------------------------------------------------------------------
-> nuts_region = East Midlands

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~t |       549  300.5428       245       119       395
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = East of England

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~t |       540  273.9944     214.5      85.5       392
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = London

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~t |      1095  303.2676       250       112       431
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = North East

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~t |       539   289.167       228        93       395
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = North West

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~t |       549  308.8725       226       113       438
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = South East

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~t |      1103  295.5512       232       103       441
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = West Midlands

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~t |       536  300.8713     248.5       118     428.5
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~t |       564  313.9628     246.5     117.5       452
----------------------------------------------------------------

. 
. gen ref_appt_cat=1 if time_ref_rheum_appt<=21 & time_ref_rheum_appt!=. 
(35,094 missing values generated)

. replace ref_appt_cat=2 if time_ref_rheum_appt<=42 & time_ref_rheum_appt!=. & 
> ref_appt_cat==.
(286 real changes made)

. replace ref_appt_cat=3 if time_ref_rheum_appt>42 & time_ref_rheum_appt!=. & r
> ef_appt_cat==.
(4,895 real changes made)

. lab define ref_appt_cat 1 "Seen within 3 weeks" 2 "Seen within 6 weeks" 3 "As
> sessment delay >6 weeks", modify

. lab val ref_appt_cat ref_appt_cat

. lab var ref_appt_cat "Time to rheumatology assessment"

. tab ref_appt_cat, missing

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |        294        0.83        0.83
      Seen within 6 weeks |        286        0.81        1.64
Assessment delay >6 weeks |      4,895       13.83       15.47
                        . |     29,913       84.53      100.00
--------------------------+-----------------------------------
                    Total |     35,388      100.00

. tab ref_appt_cat

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |        294        5.37        5.37
      Seen within 6 weeks |        286        5.22       10.59
Assessment delay >6 weeks |      4,895       89.41      100.00
--------------------------+-----------------------------------
                    Total |      5,475      100.00

. bys eia_diagnosis: tab ref_appt_cat, missing

-------------------------------------------------------------------------------
-> eia_diagnosis = RA

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         97        0.82        0.82
      Seen within 6 weeks |         98        0.82        1.64
Assessment delay >6 weeks |      1,673       14.07       15.71
                        . |     10,020       84.29      100.00
--------------------------+-----------------------------------
                    Total |     11,888      100.00

-------------------------------------------------------------------------------
-> eia_diagnosis = PsA

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         91        0.78        0.78
      Seen within 6 weeks |         86        0.74        1.52
Assessment delay >6 weeks |      1,603       13.75       15.26
                        . |      9,881       84.74      100.00
--------------------------+-----------------------------------
                    Total |     11,661      100.00

-------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |        106        0.90        0.90
      Seen within 6 weeks |        102        0.86        1.76
Assessment delay >6 weeks |      1,619       13.68       15.43
                        . |     10,012       84.57      100.00
--------------------------+-----------------------------------
                    Total |     11,839      100.00


. bys eia_diagnosis: tab ref_appt_cat

-------------------------------------------------------------------------------
-> eia_diagnosis = RA

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         97        5.19        5.19
      Seen within 6 weeks |         98        5.25       10.44
Assessment delay >6 weeks |      1,673       89.56      100.00
--------------------------+-----------------------------------
                    Total |      1,868      100.00

-------------------------------------------------------------------------------
-> eia_diagnosis = PsA

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         91        5.11        5.11
      Seen within 6 weeks |         86        4.83        9.94
Assessment delay >6 weeks |      1,603       90.06      100.00
--------------------------+-----------------------------------
                    Total |      1,780      100.00

-------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |        106        5.80        5.80
      Seen within 6 weeks |        102        5.58       11.38
Assessment delay >6 weeks |      1,619       88.62      100.00
--------------------------+-----------------------------------
                    Total |      1,827      100.00


. bys diagnosis_year: tab ref_appt_cat, missing

-------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         75        0.66        0.66
      Seen within 6 weeks |         74        0.65        1.31
Assessment delay >6 weeks |        686        6.04        7.35
                        . |     10,527       92.65      100.00
--------------------------+-----------------------------------
                    Total |     11,362      100.00

-------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         97        0.87        0.87
      Seen within 6 weeks |         90        0.80        1.67
Assessment delay >6 weeks |      1,577       14.06       15.73
                        . |      9,449       84.27      100.00
--------------------------+-----------------------------------
                    Total |     11,213      100.00

-------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |        106        0.95        0.95
      Seen within 6 weeks |        106        0.95        1.89
Assessment delay >6 weeks |      2,277       20.34       22.24
                        . |      8,705       77.76      100.00
--------------------------+-----------------------------------
                    Total |     11,194      100.00

-------------------------------------------------------------------------------
-> diagnosis_year = .

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         16        0.99        0.99
      Seen within 6 weeks |         16        0.99        1.98
Assessment delay >6 weeks |        355       21.93       23.90
                        . |      1,232       76.10      100.00
--------------------------+-----------------------------------
                    Total |      1,619      100.00


. bys diagnosis_year: tab ref_appt_cat

-------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         75        8.98        8.98
      Seen within 6 weeks |         74        8.86       17.84
Assessment delay >6 weeks |        686       82.16      100.00
--------------------------+-----------------------------------
                    Total |        835      100.00

-------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         97        5.50        5.50
      Seen within 6 weeks |         90        5.10       10.60
Assessment delay >6 weeks |      1,577       89.40      100.00
--------------------------+-----------------------------------
                    Total |      1,764      100.00

-------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |        106        4.26        4.26
      Seen within 6 weeks |        106        4.26        8.52
Assessment delay >6 weeks |      2,277       91.48      100.00
--------------------------+-----------------------------------
                    Total |      2,489      100.00

-------------------------------------------------------------------------------
-> diagnosis_year = .

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         16        4.13        4.13
      Seen within 6 weeks |         16        4.13        8.27
Assessment delay >6 weeks |        355       91.73      100.00
--------------------------+-----------------------------------
                    Total |        387      100.00


. bys nuts_region: tab ref_appt_cat, missing

-------------------------------------------------------------------------------
-> nuts_region = East Midlands

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         29        0.81        0.81
      Seen within 6 weeks |         21        0.58        1.39
Assessment delay >6 weeks |        499       13.87       15.26
                        . |      3,048       84.74      100.00
--------------------------+-----------------------------------
                    Total |      3,597      100.00

-------------------------------------------------------------------------------
-> nuts_region = East of England

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         33        0.94        0.94
      Seen within 6 weeks |         42        1.19        2.13
Assessment delay >6 weeks |        465       13.18       15.31
                        . |      2,987       84.69      100.00
--------------------------+-----------------------------------
                    Total |      3,527      100.00

-------------------------------------------------------------------------------
-> nuts_region = London

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         50        0.70        0.70
      Seen within 6 weeks |         57        0.80        1.50
Assessment delay >6 weeks |        988       13.82       15.32
                        . |      6,052       84.68      100.00
--------------------------+-----------------------------------
                    Total |      7,147      100.00

-------------------------------------------------------------------------------
-> nuts_region = North East

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         33        0.94        0.94
      Seen within 6 weeks |         27        0.77        1.71
Assessment delay >6 weeks |        479       13.62       15.33
                        . |      2,978       84.67      100.00
--------------------------+-----------------------------------
                    Total |      3,517      100.00

-------------------------------------------------------------------------------
-> nuts_region = North West

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         22        0.63        0.63
      Seen within 6 weeks |         30        0.86        1.48
Assessment delay >6 weeks |        497       14.17       15.65
                        . |      2,959       84.35      100.00
--------------------------+-----------------------------------
                    Total |      3,508      100.00

-------------------------------------------------------------------------------
-> nuts_region = South East

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         73        1.04        1.04
      Seen within 6 weeks |         59        0.84        1.87
Assessment delay >6 weeks |        971       13.77       15.65
                        . |      5,947       84.35      100.00
--------------------------+-----------------------------------
                    Total |      7,050      100.00

-------------------------------------------------------------------------------
-> nuts_region = West Midlands

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         27        0.75        0.75
      Seen within 6 weeks |         24        0.67        1.42
Assessment delay >6 weeks |        485       13.48       14.89
                        . |      3,063       85.11      100.00
--------------------------+-----------------------------------
                    Total |      3,599      100.00

-------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         27        0.78        0.78
      Seen within 6 weeks |         26        0.76        1.54
Assessment delay >6 weeks |        511       14.84       16.38
                        . |      2,879       83.62      100.00
--------------------------+-----------------------------------
                    Total |      3,443      100.00


. bys nuts_region: tab ref_appt_cat

-------------------------------------------------------------------------------
-> nuts_region = East Midlands

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         29        5.28        5.28
      Seen within 6 weeks |         21        3.83        9.11
Assessment delay >6 weeks |        499       90.89      100.00
--------------------------+-----------------------------------
                    Total |        549      100.00

-------------------------------------------------------------------------------
-> nuts_region = East of England

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         33        6.11        6.11
      Seen within 6 weeks |         42        7.78       13.89
Assessment delay >6 weeks |        465       86.11      100.00
--------------------------+-----------------------------------
                    Total |        540      100.00

-------------------------------------------------------------------------------
-> nuts_region = London

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         50        4.57        4.57
      Seen within 6 weeks |         57        5.21        9.77
Assessment delay >6 weeks |        988       90.23      100.00
--------------------------+-----------------------------------
                    Total |      1,095      100.00

-------------------------------------------------------------------------------
-> nuts_region = North East

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         33        6.12        6.12
      Seen within 6 weeks |         27        5.01       11.13
Assessment delay >6 weeks |        479       88.87      100.00
--------------------------+-----------------------------------
                    Total |        539      100.00

-------------------------------------------------------------------------------
-> nuts_region = North West

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         22        4.01        4.01
      Seen within 6 weeks |         30        5.46        9.47
Assessment delay >6 weeks |        497       90.53      100.00
--------------------------+-----------------------------------
                    Total |        549      100.00

-------------------------------------------------------------------------------
-> nuts_region = South East

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         73        6.62        6.62
      Seen within 6 weeks |         59        5.35       11.97
Assessment delay >6 weeks |        971       88.03      100.00
--------------------------+-----------------------------------
                    Total |      1,103      100.00

-------------------------------------------------------------------------------
-> nuts_region = West Midlands

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         27        5.04        5.04
      Seen within 6 weeks |         24        4.48        9.51
Assessment delay >6 weeks |        485       90.49      100.00
--------------------------+-----------------------------------
                    Total |        536      100.00

-------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         27        4.79        4.79
      Seen within 6 weeks |         26        4.61        9.40
Assessment delay >6 weeks |        511       90.60      100.00
--------------------------+-----------------------------------
                    Total |        564      100.00


. 
. gen ref_appt_3w=1 if time_ref_rheum_appt<=21 & time_ref_rheum_appt!=. 
(35,094 missing values generated)

. replace ref_appt_3w=2 if time_ref_rheum_appt>21 & time_ref_rheum_appt!=.
(5,181 real changes made)

. lab define ref_appt_3w 1 "Seen within 3 weeks" 2 "Assessment delay >3 weeks",
>  modify

. lab val ref_appt_3w ref_appt_3w

. lab var ref_appt_3w "Time to rheumatology assessment"

. tab ref_appt_3w, missing

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |        294        0.83        0.83
Assessment delay >3 weeks |      5,181       14.64       15.47
                        . |     29,913       84.53      100.00
--------------------------+-----------------------------------
                    Total |     35,388      100.00

. tab ref_appt_3w

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |        294        5.37        5.37
Assessment delay >3 weeks |      5,181       94.63      100.00
--------------------------+-----------------------------------
                    Total |      5,475      100.00

. bys eia_diagnosis: tab ref_appt_3w, missing

-------------------------------------------------------------------------------
-> eia_diagnosis = RA

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         97        0.82        0.82
Assessment delay >3 weeks |      1,771       14.90       15.71
                        . |     10,020       84.29      100.00
--------------------------+-----------------------------------
                    Total |     11,888      100.00

-------------------------------------------------------------------------------
-> eia_diagnosis = PsA

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         91        0.78        0.78
Assessment delay >3 weeks |      1,689       14.48       15.26
                        . |      9,881       84.74      100.00
--------------------------+-----------------------------------
                    Total |     11,661      100.00

-------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |        106        0.90        0.90
Assessment delay >3 weeks |      1,721       14.54       15.43
                        . |     10,012       84.57      100.00
--------------------------+-----------------------------------
                    Total |     11,839      100.00


. bys eia_diagnosis: tab ref_appt_3w

-------------------------------------------------------------------------------
-> eia_diagnosis = RA

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         97        5.19        5.19
Assessment delay >3 weeks |      1,771       94.81      100.00
--------------------------+-----------------------------------
                    Total |      1,868      100.00

-------------------------------------------------------------------------------
-> eia_diagnosis = PsA

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         91        5.11        5.11
Assessment delay >3 weeks |      1,689       94.89      100.00
--------------------------+-----------------------------------
                    Total |      1,780      100.00

-------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |        106        5.80        5.80
Assessment delay >3 weeks |      1,721       94.20      100.00
--------------------------+-----------------------------------
                    Total |      1,827      100.00


. bys diagnosis_year: tab ref_appt_3w, missing

-------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         75        0.66        0.66
Assessment delay >3 weeks |        760        6.69        7.35
                        . |     10,527       92.65      100.00
--------------------------+-----------------------------------
                    Total |     11,362      100.00

-------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         97        0.87        0.87
Assessment delay >3 weeks |      1,667       14.87       15.73
                        . |      9,449       84.27      100.00
--------------------------+-----------------------------------
                    Total |     11,213      100.00

-------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |        106        0.95        0.95
Assessment delay >3 weeks |      2,383       21.29       22.24
                        . |      8,705       77.76      100.00
--------------------------+-----------------------------------
                    Total |     11,194      100.00

-------------------------------------------------------------------------------
-> diagnosis_year = .

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         16        0.99        0.99
Assessment delay >3 weeks |        371       22.92       23.90
                        . |      1,232       76.10      100.00
--------------------------+-----------------------------------
                    Total |      1,619      100.00


. bys diagnosis_year: tab ref_appt_3w

-------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         75        8.98        8.98
Assessment delay >3 weeks |        760       91.02      100.00
--------------------------+-----------------------------------
                    Total |        835      100.00

-------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         97        5.50        5.50
Assessment delay >3 weeks |      1,667       94.50      100.00
--------------------------+-----------------------------------
                    Total |      1,764      100.00

-------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |        106        4.26        4.26
Assessment delay >3 weeks |      2,383       95.74      100.00
--------------------------+-----------------------------------
                    Total |      2,489      100.00

-------------------------------------------------------------------------------
-> diagnosis_year = .

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         16        4.13        4.13
Assessment delay >3 weeks |        371       95.87      100.00
--------------------------+-----------------------------------
                    Total |        387      100.00


. bys nuts_region: tab ref_appt_3w, missing

-------------------------------------------------------------------------------
-> nuts_region = East Midlands

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         29        0.81        0.81
Assessment delay >3 weeks |        520       14.46       15.26
                        . |      3,048       84.74      100.00
--------------------------+-----------------------------------
                    Total |      3,597      100.00

-------------------------------------------------------------------------------
-> nuts_region = East of England

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         33        0.94        0.94
Assessment delay >3 weeks |        507       14.37       15.31
                        . |      2,987       84.69      100.00
--------------------------+-----------------------------------
                    Total |      3,527      100.00

-------------------------------------------------------------------------------
-> nuts_region = London

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         50        0.70        0.70
Assessment delay >3 weeks |      1,045       14.62       15.32
                        . |      6,052       84.68      100.00
--------------------------+-----------------------------------
                    Total |      7,147      100.00

-------------------------------------------------------------------------------
-> nuts_region = North East

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         33        0.94        0.94
Assessment delay >3 weeks |        506       14.39       15.33
                        . |      2,978       84.67      100.00
--------------------------+-----------------------------------
                    Total |      3,517      100.00

-------------------------------------------------------------------------------
-> nuts_region = North West

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         22        0.63        0.63
Assessment delay >3 weeks |        527       15.02       15.65
                        . |      2,959       84.35      100.00
--------------------------+-----------------------------------
                    Total |      3,508      100.00

-------------------------------------------------------------------------------
-> nuts_region = South East

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         73        1.04        1.04
Assessment delay >3 weeks |      1,030       14.61       15.65
                        . |      5,947       84.35      100.00
--------------------------+-----------------------------------
                    Total |      7,050      100.00

-------------------------------------------------------------------------------
-> nuts_region = West Midlands

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         27        0.75        0.75
Assessment delay >3 weeks |        509       14.14       14.89
                        . |      3,063       85.11      100.00
--------------------------+-----------------------------------
                    Total |      3,599      100.00

-------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         27        0.78        0.78
Assessment delay >3 weeks |        537       15.60       16.38
                        . |      2,879       83.62      100.00
--------------------------+-----------------------------------
                    Total |      3,443      100.00


. bys nuts_region: tab ref_appt_3w

-------------------------------------------------------------------------------
-> nuts_region = East Midlands

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         29        5.28        5.28
Assessment delay >3 weeks |        520       94.72      100.00
--------------------------+-----------------------------------
                    Total |        549      100.00

-------------------------------------------------------------------------------
-> nuts_region = East of England

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         33        6.11        6.11
Assessment delay >3 weeks |        507       93.89      100.00
--------------------------+-----------------------------------
                    Total |        540      100.00

-------------------------------------------------------------------------------
-> nuts_region = London

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         50        4.57        4.57
Assessment delay >3 weeks |      1,045       95.43      100.00
--------------------------+-----------------------------------
                    Total |      1,095      100.00

-------------------------------------------------------------------------------
-> nuts_region = North East

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         33        6.12        6.12
Assessment delay >3 weeks |        506       93.88      100.00
--------------------------+-----------------------------------
                    Total |        539      100.00

-------------------------------------------------------------------------------
-> nuts_region = North West

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         22        4.01        4.01
Assessment delay >3 weeks |        527       95.99      100.00
--------------------------+-----------------------------------
                    Total |        549      100.00

-------------------------------------------------------------------------------
-> nuts_region = South East

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         73        6.62        6.62
Assessment delay >3 weeks |      1,030       93.38      100.00
--------------------------+-----------------------------------
                    Total |      1,103      100.00

-------------------------------------------------------------------------------
-> nuts_region = West Midlands

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         27        5.04        5.04
Assessment delay >3 weeks |        509       94.96      100.00
--------------------------+-----------------------------------
                    Total |        536      100.00

-------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         27        4.79        4.79
Assessment delay >3 weeks |        537       95.21      100.00
--------------------------+-----------------------------------
                    Total |        564      100.00


. 
. **Time from rheum ref or last GP to rheum appt (combined - sensitivity analys
> is; includes those with no rheum ref)
. gen time_refgp_rheum_appt = time_ref_rheum_appt
(29,913 missing values generated)

. replace time_refgp_rheum_appt = time_gp_rheum_appt if time_ref_rheum_appt==. 
> & time_gp_rheum_appt!=.
(3,572 real changes made)

. bys eia_diagnosis: tabstat time_refgp_rheum_appt, stats (n mean p50 p25 p75)

-------------------------------------------------------------------------------
-> eia_diagnosis = RA

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_refgp~t |      3050  277.8282       221       101       397
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_refgp~t |      2961  282.9527       220       101       398
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_refgp~t |      3036  275.5952       216      96.5       396
----------------------------------------------------------------

. bys diagnosis_year: tabstat time_refgp_rheum_appt, stats (n mean p50 p25 p75)
>  //all patients by diagnosis year

-------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_refgp~t |      1529  167.0576       142        62       251
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_refgp~t |      2998  262.5454       220       101       383
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_refgp~t |      3932  323.7803       255       116     469.5
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> diagnosis_year = .

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_refgp~t |       588  350.7823       278       119     499.5
----------------------------------------------------------------

. bys nuts_region: tabstat time_refgp_rheum_appt, stats (n mean p50 p25 p75) //
> by region

-------------------------------------------------------------------------------
-> nuts_region = East Midlands

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_refgp~t |       900  279.8367       232       107     382.5
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = East of England

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_refgp~t |       903  263.0033       213        86       380
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = London

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_refgp~t |      1831  281.4719       224       104       394
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = North East

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_refgp~t |       906  269.9415     206.5        90       375
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = North West

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_refgp~t |       881  287.7299       212       104       422
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = South East

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_refgp~t |      1825  277.4011       216        97       407
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = West Midlands

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_refgp~t |       906  276.5155     221.5        98       392
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_refgp~t |       895  293.1274       224       103       422
----------------------------------------------------------------

. 
. **Time from rheum ref to EIA code (sensitivity analysis; includes those with 
> no rheum appt)
. gen time_ref_rheum_eia = (eia_code_date - referral_rheum_precode_date) if eia
> _code_date!=. & referral_rheum_precode_date!=. & referral_rheum_precode_date<
> eia_code_date  
(15,816 missing values generated)

. tabstat time_ref_rheum_eia, stats (n mean p50 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~a |     19572  524.3526       470     231.5       777
----------------------------------------------------------------

. bys eia_diagnosis: tabstat time_ref_rheum_eia, stats (n mean p50 p25 p75)

-------------------------------------------------------------------------------
-> eia_diagnosis = RA

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~a |      6556  525.7506       469       233       784
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~a |      6433  518.0858       471       232       763
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~a |      6583  529.0845       471       230       785
----------------------------------------------------------------

. 
. **Time from rheum ref to EIA diagnosis (combined - sensitivity analysis; incl
> udes those with no rheum appt)
. gen time_ref_rheum_eia_comb = time_ref_rheum_appt
(29,913 missing values generated)

. replace time_ref_rheum_eia_comb = time_ref_rheum_eia if time_ref_rheum_appt==
> . & time_ref_rheum_eia!=.
(16,129 real changes made)

. tabstat time_ref_rheum_eia_comb, stats (n mean p50 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~b |     21604  459.9522       389       177       686
----------------------------------------------------------------

. bys eia_diagnosis: tabstat time_ref_rheum_eia_comb, stats (n mean p50 p25 p75
> )

-------------------------------------------------------------------------------
-> eia_diagnosis = RA

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~b |      7266  456.9773       386       175       682
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~b |      7088   457.819       389       177       680
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~b |      7250  465.0193       392       181       694
----------------------------------------------------------------

. 
. **Time from rheum appt to EIA code (i.e. if appts are present and in correct 
> time order)
. gen time_rheum_eia_code = (eia_code_date - rheum_appt_date) if eia_code_date!
> =. & rheum_appt_date!=. & rheum_appt_date<eia_code_date 
(11,558 missing values generated)

. tabstat time_rheum_eia_code, stats (n mean p50 p25 p75) 

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_rheum~e |     23830   602.957       574       315       872
----------------------------------------------------------------

. bys eia_diagnosis: tabstat time_rheum_eia_code, stats (n mean p50 p25 p75) 

-------------------------------------------------------------------------------
-> eia_diagnosis = RA

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_rheum~e |      8002  605.7503       579       318       879
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_rheum~e |      7822  596.4225       566       309       859
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_rheum~e |      8006  606.5493       578       319       878
----------------------------------------------------------------

. 
. *Time to first csDMARD prescriptions - all of the below are shared care presc
> riptions, aside from those with MTX_high cost drug data included=============
> =========================================================*/
. 
. *All patients below must have at least six months of GP registration after EI
> A code
. 
. **Time to first csDMARD script for RA patients, whereby first rheum appt is c
> lassed as diagnosis date (if rheum appt present and before csDMARD date; not 
> including high cost MTX prescriptions)
. gen time_to_csdmard=(csdmard_date-rheum_appt_date) if csdmard==1 & rheum_appt
> _date!=. & csdmard_date>rheum_appt_date 
(25,273 missing values generated)

. tabstat time_to_csdmard if ra_code==1 & has_6m_follow_up==1, stats (n mean p5
> 0 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_cs~d |      3234  568.4131       534       284       827
----------------------------------------------------------------

. bys diagnosis_year: tabstat time_to_csdmard if ra_code==1 & has_6m_follow_up=
> =1, stats (n mean p50 p25 p75) //by diagnosis year

-------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_cs~d |      1039  567.0914       535       286       810
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_cs~d |      1013  556.7364       519       263       816
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_cs~d |      1041  574.8453       545       298       839
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> diagnosis_year = .

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_cs~d |       141  614.5532       610       361       854
----------------------------------------------------------------

. bys nuts_region: tabstat time_to_csdmard if ra_code==1 & has_6m_follow_up==1,
>  stats (n mean p50 p25 p75) //by region

-------------------------------------------------------------------------------
-> nuts_region = East Midlands

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_cs~d |       298   597.849       569       312       855
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = East of England

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_cs~d |       336   566.375       528       313       807
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = London

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_cs~d |       689  571.4586       552       252       869
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = North East

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_cs~d |       332  565.4036       551       250       852
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = North West

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_cs~d |       317  566.9211       534       263       811
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = South East

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_cs~d |       634  544.3927       501       276       783
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = West Midlands

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_cs~d |       321  589.9003       558       337       820
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_cs~d |       307  567.1694       542       284       833
----------------------------------------------------------------

. 
. **Time to first csDMARD script for RA patients (including high cost MTX presc
> riptions)
. gen time_to_csdmard_hcd=(csdmard_hcd_date-rheum_appt_date) if csdmard_hcd==1 
> & rheum_appt_date!=. & csdmard_hcd_date>rheum_appt_date 
(23,895 missing values generated)

. tabstat time_to_csdmard_hcd if ra_code==1 & has_6m_follow_up==1, stats (n mea
> n p50 p25 p75) 

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_c~cd |      3648  560.7876     525.5       278       814
----------------------------------------------------------------

. 
. **Time to first csDMARD script for PsA patients (not including high cost MTX 
> prescriptions)
. tabstat time_to_csdmard if psa_code==1 & has_6m_follow_up==1, stats (n mean p
> 50 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_c~rd |      3105  559.6251       510       287       812
----------------------------------------------------------------

. bys diagnosis_year: tabstat time_to_csdmard if psa_code==1 & has_6m_follow_up
> ==1, stats (n mean p50 p25 p75) //by diagnosis year

-------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_c~rd |      1022  566.9511       524       296       814
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_c~rd |       998  572.0721     524.5       290       830
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_c~rd |       969  545.5046       489       273       795
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> diagnosis_year = .

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_c~rd |       116  505.9483       478       262       690
----------------------------------------------------------------

. bys nuts_region: tabstat time_to_csdmard if psa_code==1 & has_6m_follow_up==1
> , stats (n mean p50 p25 p75) //by region

-------------------------------------------------------------------------------
-> nuts_region = East Midlands

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_c~rd |       304  501.3355     446.5     231.5       690
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = East of England

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_c~rd |       311  588.7749       525       307       852
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = London

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_c~rd |       627  570.3716       530       293       831
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = North East

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_c~rd |       327  561.1346       529       275       833
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = North West

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_c~rd |       306  599.1536     568.5       330       885
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = South East

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_c~rd |       609  544.8933       502       270       762
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = West Midlands

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_c~rd |       317  557.9054       487       298       825
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_c~rd |       304  555.8224       494       303     797.5
----------------------------------------------------------------

. 
. **Time to first csDMARD script for PsA patients (including high cost MTX pres
> criptions)
. tabstat time_to_csdmard_hcd if psa_code==1 & has_6m_follow_up==1, stats (n me
> an p50 p25 p75) 

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_c~cd |      3533  554.6793       508       281       804
----------------------------------------------------------------

. 
. **csDMARD time categories for RA patients (not including high cost MTX prescr
> iptions)
. gen csdmard_3m=1 if time_to_csdmard<=90 & time_to_csdmard!=. 
(34,669 missing values generated)

. replace csdmard_3m=2 if time_to_csdmard>90 & time_to_csdmard!=.
(9,396 real changes made)

. lab define csdmard_3m 1 "Yes" 2 "No", modify

. lab val csdmard_3m csdmard_3m

. lab var csdmard_3m "csDMARD within 3 months" 

. tab csdmard_3m if ra_code==1 & has_6m_follow_up==1, missing //missing will be
>  patients with no rheum appt and/or rheum appt after csDMARD script

    csDMARD |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        235        2.08        2.08
         No |      2,999       26.55       28.63
          . |      8,061       71.37      100.00
------------+-----------------------------------
      Total |     11,295      100.00

. tab csdmard_3m if ra_code==1 & has_6m_follow_up==1

    csDMARD |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        235        7.27        7.27
         No |      2,999       92.73      100.00
------------+-----------------------------------
      Total |      3,234      100.00

. gen csdmard_6m=1 if time_to_csdmard<=180 & time_to_csdmard!=. 
(33,883 missing values generated)

. replace csdmard_6m=2 if time_to_csdmard>180 & time_to_csdmard!=.
(8,610 real changes made)

. lab define csdmard_6m 1 "Yes" 2 "No", modify

. lab val csdmard_6m csdmard_6m

. lab var csdmard_6m "csDMARD within 6 months" 

. tab csdmard_6m if ra_code==1 & has_6m_follow_up==1, missing //missing will be
>  patients with no rheum appt and/or rheum appt after csDMARD script

    csDMARD |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        498        4.41        4.41
         No |      2,736       24.22       28.63
          . |      8,061       71.37      100.00
------------+-----------------------------------
      Total |     11,295      100.00

. tab csdmard_6m if ra_code==1 & has_6m_follow_up==1

    csDMARD |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        498       15.40       15.40
         No |      2,736       84.60      100.00
------------+-----------------------------------
      Total |      3,234      100.00

. gen csdmard_12m=1 if time_to_csdmard<=365 & time_to_csdmard!=. 
(31,990 missing values generated)

. replace csdmard_12m=2 if time_to_csdmard>365 & time_to_csdmard!=.
(6,717 real changes made)

. lab define csdmard_12m 1 "Yes" 2 "No", modify

. lab val csdmard_12m csdmard_12m

. lab var csdmard_12m "csDMARD within 12 months" 

. tab csdmard_12m if ra_code==1 & has_12m_follow_up==1, missing //missing will 
> be patients with no rheum appt and/or rheum appt after csDMARD script

    csDMARD |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,028        9.55        9.55
         No |      2,045       19.00       28.56
          . |      7,688       71.44      100.00
------------+-----------------------------------
      Total |     10,761      100.00

. tab csdmard_12m if ra_code==1 & has_12m_follow_up==1 //for patients with at l
> east 12m registration

    csDMARD |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,028       33.45       33.45
         No |      2,045       66.55      100.00
------------+-----------------------------------
      Total |      3,073      100.00

. 
. **csDMARD time categories for RA patients (including high cost MTX prescripti
> ons)
. gen csdmard_hcd_3m=1 if time_to_csdmard_hcd<=90 & time_to_csdmard_hcd!=. 
(34,570 missing values generated)

. replace csdmard_hcd_3m=2 if time_to_csdmard_hcd>90 & time_to_csdmard_hcd!=.
(10,675 real changes made)

. lab define csdmard_hcd_3m 1 "Yes" 2 "No", modify

. lab val csdmard_hcd_3m csdmard_hcd_3m

. lab var csdmard_hcd_3m "csDMARD within 3 months" 

. tab csdmard_hcd_3m if ra_code==1 & has_6m_follow_up==1, missing //missing wil
> l be patients with no rheum appt and/or rheum appt after csDMARD script

    csDMARD |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        271        2.40        2.40
         No |      3,377       29.90       32.30
          . |      7,647       67.70      100.00
------------+-----------------------------------
      Total |     11,295      100.00

. tab csdmard_hcd_3m if ra_code==1 & has_6m_follow_up==1

    csDMARD |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        271        7.43        7.43
         No |      3,377       92.57      100.00
------------+-----------------------------------
      Total |      3,648      100.00

. gen csdmard_hcd_6m=1 if time_to_csdmard_hcd<=180 & time_to_csdmard_hcd!=. 
(33,658 missing values generated)

. replace csdmard_hcd_6m=2 if time_to_csdmard_hcd>180 & time_to_csdmard_hcd!=.
(9,763 real changes made)

. lab define csdmard_hcd_6m 1 "Yes" 2 "No", modify

. lab val csdmard_hcd_6m csdmard_hcd_6m

. lab var csdmard_hcd_6m "csDMARD within 6 months" 

. tab csdmard_hcd_6m if ra_code==1 & has_6m_follow_up==1, missing //missing wil
> l be patients with no rheum appt and/or rheum appt after csDMARD script

    csDMARD |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        574        5.08        5.08
         No |      3,074       27.22       32.30
          . |      7,647       67.70      100.00
------------+-----------------------------------
      Total |     11,295      100.00

. tab csdmard_hcd_6m if ra_code==1 & has_6m_follow_up==1

    csDMARD |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        574       15.73       15.73
         No |      3,074       84.27      100.00
------------+-----------------------------------
      Total |      3,648      100.00

. gen csdmard_hcd_12m=1 if time_to_csdmard_hcd<=365 & time_to_csdmard_hcd!=. 
(31,485 missing values generated)

. replace csdmard_hcd_12m=2 if time_to_csdmard_hcd>365 & time_to_csdmard_hcd!=.
(7,590 real changes made)

. lab define csdmard_hcd_12m 1 "Yes" 2 "No", modify

. lab val csdmard_hcd_12m csdmard_hcd_12m

. lab var csdmard_hcd_12m "csDMARD within 12 months" 

. tab csdmard_hcd_12m if ra_code==1 & has_12m_follow_up==1, missing //missing w
> ill be patients with no rheum appt and/or rheum appt after csDMARD script

    csDMARD |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,198       11.13       11.13
         No |      2,277       21.16       32.29
          . |      7,286       67.71      100.00
------------+-----------------------------------
      Total |     10,761      100.00

. tab csdmard_hcd_12m if ra_code==1 & has_12m_follow_up==1 //for patients with 
> at least 12m registration

    csDMARD |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,198       34.47       34.47
         No |      2,277       65.53      100.00
------------+-----------------------------------
      Total |      3,475      100.00

. 
. **csDMARD time categories for PsA patients (not including high cost MTX presc
> riptions)
. tab csdmard_3m if psa_code==1 & has_6m_follow_up==1, missing

    csDMARD |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        225        2.03        2.03
         No |      2,880       26.01       28.05
          . |      7,966       71.95      100.00
------------+-----------------------------------
      Total |     11,071      100.00

. tab csdmard_6m if psa_code==1 & has_6m_follow_up==1, missing

    csDMARD |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        461        4.16        4.16
         No |      2,644       23.88       28.05
          . |      7,966       71.95      100.00
------------+-----------------------------------
      Total |     11,071      100.00

. tab csdmard_12m if psa_code==1 & has_12m_follow_up==1, missing

    csDMARD |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,010        9.65        9.65
         No |      1,924       18.38       28.03
          . |      7,533       71.97      100.00
------------+-----------------------------------
      Total |     10,467      100.00

. 
. **csDMARD time categories for PsA patients (including high cost MTX prescript
> ions)
. tab csdmard_hcd_3m if psa_code==1 & has_6m_follow_up==1, missing

    csDMARD |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        254        2.29        2.29
         No |      3,279       29.62       31.91
          . |      7,538       68.09      100.00
------------+-----------------------------------
      Total |     11,071      100.00

. tab csdmard_hcd_6m if psa_code==1 & has_6m_follow_up==1, missing

    csDMARD |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        533        4.81        4.81
         No |      3,000       27.10       31.91
          . |      7,538       68.09      100.00
------------+-----------------------------------
      Total |     11,071      100.00

. tab csdmard_hcd_12m if psa_code==1 & has_12m_follow_up==1, missing

    csDMARD |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,144       10.93       10.93
         No |      2,183       20.86       31.79
          . |      7,140       68.21      100.00
------------+-----------------------------------
      Total |     10,467      100.00

. 
. **What was first shared care csDMARD (not including high cost MTX prescriptio
> ns)
. gen first_csD=""
(35,388 missing values generated)

. foreach var of varlist hydroxychloroquine_date leflunomide_date methotrexate_
> date methotrexate_inj_date sulfasalazine_date {
  2.         replace first_csD="`var'" if csdmard_date==`var' & csdmard_date!=.
  3.         }
variable first_csD was str1 now str23
(2,485 real changes made)
(2,594 real changes made)
(2,490 real changes made)
(2,519 real changes made)
(2,541 real changes made)

. gen first_csDMARD = substr(first_csD, 1, length(first_csD) - 5) if first_csD!
> =""
(22,760 missing values generated)

. drop first_csD

. tab first_csDMARD if ra_code==1 & has_6m_follow_up==1 //for RA patients

     first_csDMARD |      Freq.     Percent        Cum.
-------------------+-----------------------------------
hydroxychloroquine |        783       19.30       19.30
       leflunomide |        821       20.24       39.55
      methotrexate |        800       19.72       59.27
  methotrexate_inj |        800       19.72       78.99
     sulfasalazine |        852       21.01      100.00
-------------------+-----------------------------------
             Total |      4,056      100.00

. tab first_csDMARD if psa_code==1 & has_6m_follow_up==1 //for PsA patients

     first_csDMARD |      Freq.     Percent        Cum.
-------------------+-----------------------------------
hydroxychloroquine |        744       19.15       19.15
       leflunomide |        802       20.64       39.78
      methotrexate |        796       20.48       60.27
  methotrexate_inj |        783       20.15       80.42
     sulfasalazine |        761       19.58      100.00
-------------------+-----------------------------------
             Total |      3,886      100.00

. 
. **What was first csDMARD (including high cost MTX prescriptions)
. gen first_csD_hcd=""
(35,388 missing values generated)

. foreach var of varlist hydroxychloroquine_date leflunomide_date methotrexate_
> date methotrexate_inj_date methotrexate_hcd_date sulfasalazine_date {
  2.         replace first_csD_hcd="`var'" if csdmard_hcd_date==`var' & csdmard
> _hcd_date!=.
  3.         }
variable first_csD_hcd was str1 now str23
(2,352 real changes made)
(2,459 real changes made)
(2,376 real changes made)
(2,369 real changes made)
(2,943 real changes made)
(2,420 real changes made)

. gen first_csDMARD_hcd = substr(first_csD_hcd, 1, length(first_csD_hcd) - 5) i
> f first_csD_hcd!=""
(20,472 missing values generated)

. drop first_csD_hcd

. tab first_csDMARD_hcd if ra_code==1 & has_6m_follow_up==1 //for RA patients

 first_csDMARD_hcd |      Freq.     Percent        Cum.
-------------------+-----------------------------------
hydroxychloroquine |        745       15.68       15.68
       leflunomide |        778       16.38       32.06
      methotrexate |        762       16.04       48.11
  methotrexate_hcd |        920       19.37       67.47
  methotrexate_inj |        745       15.68       83.16
     sulfasalazine |        800       16.84      100.00
-------------------+-----------------------------------
             Total |      4,750      100.00

. tab first_csDMARD_hcd if psa_code==1 & has_6m_follow_up==1 //for PsA patients

 first_csDMARD_hcd |      Freq.     Percent        Cum.
-------------------+-----------------------------------
hydroxychloroquine |        698       15.19       15.19
       leflunomide |        754       16.41       31.61
      methotrexate |        766       16.67       48.28
  methotrexate_hcd |        914       19.90       68.18
  methotrexate_inj |        733       15.96       84.13
     sulfasalazine |        729       15.87      100.00
-------------------+-----------------------------------
             Total |      4,594      100.00

.  
. **Methotrexate use (not including high cost MTX prescriptions)
. gen mtx=1 if methotrexate==1 | methotrexate_inj==1
(29,595 missing values generated)

. recode mtx .=0 
(mtx: 29595 changes made)

. tab mtx if ra_code==1 & has_6m_follow_up==1 //for RA patients; Nb. this is ju
> st a check; need time-to-MTX instead (below)

        mtx |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      9,444       83.61       83.61
          1 |      1,851       16.39      100.00
------------+-----------------------------------
      Total |     11,295      100.00

. tab mtx if psa_code==1 & has_6m_follow_up==1 //for PsA patients

        mtx |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      9,261       83.65       83.65
          1 |      1,810       16.35      100.00
------------+-----------------------------------
      Total |     11,071      100.00

. 
. **Methotrexate use (including high cost MTX prescriptions)
. gen mtx_hcd=1 if methotrexate==1 | methotrexate_inj==1 | methotrexate_hcd==1
(26,604 missing values generated)

. recode mtx_hcd .=0 
(mtx_hcd: 26604 changes made)

. tab mtx_hcd if ra_code==1 & has_6m_follow_up==1 //for RA patients

    mtx_hcd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,524       75.47       75.47
          1 |      2,771       24.53      100.00
------------+-----------------------------------
      Total |     11,295      100.00

. tab mtx_hcd if psa_code==1 & has_6m_follow_up==1 //for PsA patients

    mtx_hcd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,325       75.20       75.20
          1 |      2,746       24.80      100.00
------------+-----------------------------------
      Total |     11,071      100.00

. 
. **Date of first methotrexate script (not including high cost MTX prescription
> s)
. gen mtx_date=min(methotrexate_date, methotrexate_inj_date)
(29,595 missing values generated)

. format %td mtx_date

. 
. **Date of first methotrexate script (including high cost MTX prescriptions)
. gen mtx_hcd_date=min(methotrexate_date, methotrexate_inj_date, methotrexate_h
> cd_date)
(26,604 missing values generated)

. format %td mtx_hcd_date

. 
. **Time to first methotrexate script for RA patients (not including high cost 
> MTX prescriptions)
. gen time_to_mtx=(mtx_date-rheum_appt_date) if mtx==1 & rheum_appt_date!=. & m
> tx_date>rheum_appt_date 
(30,752 missing values generated)

. tabstat time_to_mtx if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p2
> 5 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |      1483  592.9595       566       305       861
----------------------------------------------------------------

. bys diagnosis_year: tabstat time_to_mtx if ra_code==1 & has_6m_follow_up==1, 
> stats (n mean p50 p25 p75) //by diagnosis year

-------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       453  594.8366       564       333       845
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       477  575.7191       545       282       833
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       490     605.4     588.5       312       902
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> diagnosis_year = .

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |        63  613.2381       560       376       864
----------------------------------------------------------------

. bys nuts_region: tabstat time_to_mtx if ra_code==1 & has_6m_follow_up==1, sta
> ts (n mean p50 p25 p75) //by region

-------------------------------------------------------------------------------
-> nuts_region = East Midlands

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       128  646.7266     625.5     388.5       868
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = East of England

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       169  590.1065       543       348       833
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = London

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       318  576.2044     554.5       240       880
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = North East

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       149   584.047       568       225       890
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = North West

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       145  566.7724       536       302       788
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = South East

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       302  604.7517     563.5       313       880
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = West Midlands

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       147  627.6395       700       353       880
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       125   556.112       542       284       818
----------------------------------------------------------------

. 
. **Time to first methotrexate script for RA patients (including high cost MTX 
> prescriptions)
. gen time_to_mtx_hcd=(mtx_hcd_date-rheum_appt_date) if mtx_hcd==1 & rheum_appt
> _date!=. & mtx_hcd_date>rheum_appt_date 
(28,820 missing values generated)

. tabstat time_to_mtx_hcd if ra_code==1 & has_6m_follow_up==1, stats (n mean p5
> 0 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_mt~d |      2071  583.8098       557       294       849
----------------------------------------------------------------

. 
. **Time to first methotrexate script for PsA patients (not including high cost
>  MTX prescriptions)
. tabstat time_to_mtx if psa_code==1 & has_6m_follow_up==1, stats (n mean p50 p
> 25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |      1439  589.3183       552       315       857
----------------------------------------------------------------

. bys diagnosis_year: tabstat time_to_mtx if psa_code==1 & has_6m_follow_up==1,
>  stats (n mean p50 p25 p75) //by diagnosis year

-------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       465  591.7054       556       329       840
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       462  606.1515     570.5       334       854
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       459  578.6166       528       285       881
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> diagnosis_year = .

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |        53  514.3208       472       263       677
----------------------------------------------------------------

. bys nuts_region: tabstat time_to_mtx if psa_code==1 & has_6m_follow_up==1, st
> ats (n mean p50 p25 p75) //by region

-------------------------------------------------------------------------------
-> nuts_region = East Midlands

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       142  573.3521       565       297       795
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = East of England

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       142  627.9577       591       349       878
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = London

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       289  604.7682       568       309       898
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = North East

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       140  545.7714       498       274       811
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = North West

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       150  626.4933     595.5       350       918
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = South East

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       290  566.3207       523       296       815
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = West Midlands

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       145  598.1862       563       323       881
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       141  576.6879       504       327       838
----------------------------------------------------------------

. 
. **Time to first methotrexate script for PsA patients (including high cost MTX
>  prescriptions)
. tabstat time_to_mtx_hcd if psa_code==1 & has_6m_follow_up==1, stats (n mean p
> 50 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_mt~d |      2050  589.0746       562       314       857
----------------------------------------------------------------

. 
. **Methotrexate time categories for RA patients (not including high-cost MTX) 
> //Nb. this is time period from rheum appt (i.e. diagnosis) to shared care, no
> t from referral to first script 
. gen mtx_3m=1 if time_to_mtx<=90 & time_to_mtx!=. 
(35,098 missing values generated)

. replace mtx_3m=2 if time_to_mtx>90 & time_to_mtx!=.
(4,346 real changes made)

. lab define mtx_3m 1 "Yes" 2 "No", modify

. lab val mtx_3m mtx_3m

. lab var mtx_3m "Methotrexate within 3 months" 

. tab mtx_3m if ra_code==1 & has_6m_follow_up==1, missing //missing will be pat
> ients with no rheum appt and/or rheum appt after csDMARD script

Methotrexat |
 e within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        100        0.89        0.89
         No |      1,383       12.24       13.13
          . |      9,812       86.87      100.00
------------+-----------------------------------
      Total |     11,295      100.00

. tab mtx_3m if ra_code==1 & has_6m_follow_up==1

Methotrexat |
 e within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        100        6.74        6.74
         No |      1,383       93.26      100.00
------------+-----------------------------------
      Total |      1,483      100.00

. gen mtx_6m=1 if time_to_mtx<=180 & time_to_mtx!=. 
(34,785 missing values generated)

. replace mtx_6m=2 if time_to_mtx>180 & time_to_mtx!=.
(4,033 real changes made)

. lab define mtx_6m 1 "Yes" 2 "No", modify

. lab val mtx_6m mtx_6m

. lab var mtx_6m "Methotrexate within 6 months" 

. tab mtx_6m if ra_code==1 & has_6m_follow_up==1, missing //missing will be pat
> ients with no rheum appt and/or rheum appt after csDMARD script

Methotrexat |
 e within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        200        1.77        1.77
         No |      1,283       11.36       13.13
          . |      9,812       86.87      100.00
------------+-----------------------------------
      Total |     11,295      100.00

. tab mtx_6m if ra_code==1 & has_6m_follow_up==1

Methotrexat |
 e within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        200       13.49       13.49
         No |      1,283       86.51      100.00
------------+-----------------------------------
      Total |      1,483      100.00

. gen mtx_12m=1 if time_to_mtx<=365 & time_to_mtx!=. 
(33,974 missing values generated)

. replace mtx_12m=2 if time_to_mtx>365 & time_to_mtx!=.
(3,222 real changes made)

. lab define mtx_12m 1 "Yes" 2 "No", modify

. lab val mtx_12m mtx_12m

. lab var mtx_12m "Methotrexate within 12 months" 

. tab mtx_12m if ra_code==1 & has_12m_follow_up==1, missing //missing will be p
> atients with no rheum appt and/or rheum appt after mtx script

Methotrexat |
e within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        439        4.08        4.08
         No |        972        9.03       13.11
          . |      9,350       86.89      100.00
------------+-----------------------------------
      Total |     10,761      100.00

. tab mtx_12m if ra_code==1 & has_12m_follow_up==1 //for patients with at least
>  12m registration

Methotrexat |
e within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        439       31.11       31.11
         No |        972       68.89      100.00
------------+-----------------------------------
      Total |      1,411      100.00

. 
. **Methotrexate time categories for RA patients (including high-cost MTX)
. gen mtx_hcd_3m=1 if time_to_mtx_hcd<=90 & time_to_mtx_hcd!=. 
(34,973 missing values generated)

. replace mtx_hcd_3m=2 if time_to_mtx_hcd>90 & time_to_mtx_hcd!=.
(6,153 real changes made)

. lab define mtx_hcd_3m 1 "Yes" 2 "No", modify

. lab val mtx_hcd_3m mtx_hcd_3m

. lab var mtx_hcd_3m "Methotrexate within 3 months" 

. tab mtx_hcd_3m if ra_code==1 & has_6m_follow_up==1, missing //missing will be
>  patients with no rheum appt and/or rheum appt after csDMARD script

Methotrexat |
 e within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        144        1.27        1.27
         No |      1,927       17.06       18.34
          . |      9,224       81.66      100.00
------------+-----------------------------------
      Total |     11,295      100.00

. tab mtx_hcd_3m if ra_code==1 & has_6m_follow_up==1

Methotrexat |
 e within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        144        6.95        6.95
         No |      1,927       93.05      100.00
------------+-----------------------------------
      Total |      2,071      100.00

. gen mtx_hcd_6m=1 if time_to_mtx_hcd<=180 & time_to_mtx_hcd!=. 
(34,517 missing values generated)

. replace mtx_hcd_6m=2 if time_to_mtx_hcd>180 & time_to_mtx_hcd!=.
(5,697 real changes made)

. lab define mtx_hcd_6m 1 "Yes" 2 "No", modify

. lab val mtx_hcd_6m mtx_hcd_6m

. lab var mtx_hcd_6m "Methotrexate within 6 months" 

. tab mtx_hcd_6m if ra_code==1 & has_6m_follow_up==1, missing //missing will be
>  patients with no rheum appt and/or rheum appt after csDMARD script

Methotrexat |
 e within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        291        2.58        2.58
         No |      1,780       15.76       18.34
          . |      9,224       81.66      100.00
------------+-----------------------------------
      Total |     11,295      100.00

. tab mtx_hcd_6m if ra_code==1 & has_6m_follow_up==1

Methotrexat |
 e within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        291       14.05       14.05
         No |      1,780       85.95      100.00
------------+-----------------------------------
      Total |      2,071      100.00

. gen mtx_hcd_12m=1 if time_to_mtx_hcd<=365 & time_to_mtx_hcd!=. 
(33,373 missing values generated)

. replace mtx_hcd_12m=2 if time_to_mtx_hcd>365 & time_to_mtx_hcd!=.
(4,553 real changes made)

. lab define mtx_hcd_12m 1 "Yes" 2 "No", modify

. lab val mtx_hcd_12m mtx_hcd_12m

. lab var mtx_hcd_12m "Methotrexate within 12 months" 

. tab mtx_hcd_12m if ra_code==1 & has_12m_follow_up==1, missing //missing will 
> be patients with no rheum appt and/or rheum appt after csDMARD script

Methotrexat |
e within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        644        5.98        5.98
         No |      1,335       12.41       18.39
          . |      8,782       81.61      100.00
------------+-----------------------------------
      Total |     10,761      100.00

. tab mtx_hcd_12m if ra_code==1 & has_12m_follow_up==1 //for patients with at l
> east 12m registration

Methotrexat |
e within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        644       32.54       32.54
         No |      1,335       67.46      100.00
------------+-----------------------------------
      Total |      1,979      100.00

. 
. **Methotrexate time categories for PsA patients (not including high-cost MTX)
. tab mtx_3m if psa_code==1 & has_6m_follow_up==1, missing

Methotrexat |
 e within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         96        0.87        0.87
         No |      1,343       12.13       13.00
          . |      9,632       87.00      100.00
------------+-----------------------------------
      Total |     11,071      100.00

. tab mtx_6m if psa_code==1 & has_6m_follow_up==1, missing

Methotrexat |
 e within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        192        1.73        1.73
         No |      1,247       11.26       13.00
          . |      9,632       87.00      100.00
------------+-----------------------------------
      Total |     11,071      100.00

. tab mtx_12m if psa_code==1 & has_12m_follow_up==1, missing //with a least 12m
>  registration

Methotrexat |
e within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        425        4.06        4.06
         No |        928        8.87       12.93
          . |      9,114       87.07      100.00
------------+-----------------------------------
      Total |     10,467      100.00

. 
. **Methotrexate time categories for PsA patients (including high-cost MTX)
. tab mtx_hcd_3m if psa_code==1 & has_6m_follow_up==1, missing

Methotrexat |
 e within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        133        1.20        1.20
         No |      1,917       17.32       18.52
          . |      9,021       81.48      100.00
------------+-----------------------------------
      Total |     11,071      100.00

. tab mtx_hcd_6m if psa_code==1 & has_6m_follow_up==1, missing

Methotrexat |
 e within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        277        2.50        2.50
         No |      1,773       16.01       18.52
          . |      9,021       81.48      100.00
------------+-----------------------------------
      Total |     11,071      100.00

. tab mtx_hcd_12m if psa_code==1 & has_12m_follow_up==1, missing //with a least
>  12m registration

Methotrexat |
e within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        587        5.61        5.61
         No |      1,334       12.74       18.35
          . |      8,546       81.65      100.00
------------+-----------------------------------
      Total |     10,467      100.00

. 
. **Sulfasalazine use
. gen time_to_ssz=(sulfasalazine_date-rheum_appt_date) if sulfasalazine==1 & rh
> eum_appt_date!=. & sulfasalazine_date>rheum_appt_date 
(32,966 missing values generated)

. tabstat time_to_ssz if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p2
> 5 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |       804   596.352       580     312.5     856.5
----------------------------------------------------------------

. bys diagnosis_year: tabstat time_to_ssz if ra_code==1 & has_6m_follow_up==1, 
> stats (n mean p50 p25 p75) //by diagnosis year for RA

-------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |       276  609.1268       621     303.5       865
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |       243   596.893       568       307       870
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |       256  580.4336       554     312.5       849
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> diagnosis_year = .

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |        29  610.7586       609       391       863
----------------------------------------------------------------

. bys diagnosis_year: tabstat time_to_ssz if psa_code==1 & has_6m_follow_up==1,
>  stats (n mean p50 p25 p75) //by diagnosis year for PsA

-------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |       242  606.6818       580       306       853
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |       243  617.7984       551       293       910
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |       235  618.2766       587       326       926
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> diagnosis_year = .

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |        28  619.4286     619.5       321       839
----------------------------------------------------------------

. bys nuts_region: tabstat time_to_ssz if ra_code==1 & has_6m_follow_up==1, sta
> ts (n mean p50 p25 p75) //by region for RA

-------------------------------------------------------------------------------
-> nuts_region = East Midlands

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |        72  585.9306       641     261.5     855.5
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = East of England

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |        80  550.1375       503     231.5       817
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = London

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |       165  630.6364       639       360       885
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = North East

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |        83  635.3012       642       345       968
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = North West

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |        76  610.6184     606.5       282       917
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = South East

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |       161  557.4224       526       324       747
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = West Midlands

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |        90  635.0667     560.5       371       862
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |        77  560.7273       484       255       852
----------------------------------------------------------------

. bys nuts_region: tabstat time_to_ssz if psa_code==1 & has_6m_follow_up==1, st
> ats (n mean p50 p25 p75) //by region for PsA

-------------------------------------------------------------------------------
-> nuts_region = East Midlands

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |        82  548.9878     485.5       261       801
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = East of England

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |        78  608.2436       543       334       906
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = London

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |       150    605.36     546.5       261       930
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = North East

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |        74  636.6622       639       354       865
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = North West

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |        72  706.6528       674       446     981.5
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = South East

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |       155  631.1677       598       350       905
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = West Midlands

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |        77  596.6494       569       302       863
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |        60  575.8667       549     309.5     744.5
----------------------------------------------------------------

. 
. **Sulfasalazine time categories for RA patients //Nb. this is time period fro
> m rheum appt (i.e. diagnosis) to shared care, not from referral to first scri
> pt 
. gen ssz_3m=1 if time_to_ssz<=90 & time_to_ssz!=. 
(35,239 missing values generated)

. replace ssz_3m=2 if time_to_ssz>90 & time_to_ssz!=.
(2,273 real changes made)

. lab define ssz_3m 1 "Yes" 2 "No", modify

. lab val ssz_3m ssz_3m

. lab var ssz_3m "Sulfasalazine within 3 months" 

. tab ssz_3m if ra_code==1 & has_6m_follow_up==1, missing //missing will be pat
> ients with no rheum appt and/or rheum appt after csDMARD script

Sulfasalazi |
ne within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         45        0.40        0.40
         No |        759        6.72        7.12
          . |     10,491       92.88      100.00
------------+-----------------------------------
      Total |     11,295      100.00

. tab ssz_3m if ra_code==1 & has_6m_follow_up==1

Sulfasalazi |
ne within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         45        5.60        5.60
         No |        759       94.40      100.00
------------+-----------------------------------
      Total |        804      100.00

. gen ssz_6m=1 if time_to_ssz<=180 & time_to_ssz!=. 
(35,068 missing values generated)

. replace ssz_6m=2 if time_to_ssz>180 & time_to_ssz!=.
(2,102 real changes made)

. lab define ssz_6m 1 "Yes" 2 "No", modify

. lab val ssz_6m ssz_6m

. lab var ssz_6m "Sulfasalazine within 6 months" 

. tab ssz_6m if ra_code==1 & has_6m_follow_up==1, missing //missing will be pat
> ients with no rheum appt and/or rheum appt after csDMARD script

Sulfasalazi |
ne within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        107        0.95        0.95
         No |        697        6.17        7.12
          . |     10,491       92.88      100.00
------------+-----------------------------------
      Total |     11,295      100.00

. tab ssz_6m if ra_code==1 & has_6m_follow_up==1

Sulfasalazi |
ne within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        107       13.31       13.31
         No |        697       86.69      100.00
------------+-----------------------------------
      Total |        804      100.00

. gen ssz_12m=1 if time_to_ssz<=365 & time_to_ssz!=. 
(34,668 missing values generated)

. replace ssz_12m=2 if time_to_ssz>365 & time_to_ssz!=.
(1,702 real changes made)

. lab define ssz_12m 1 "Yes" 2 "No", modify

. lab val ssz_12m ssz_12m

. lab var ssz_12m "Sulfasalazine within 12 months" 

. tab ssz_12m if ra_code==1 & has_12m_follow_up==1, missing //missing will be p
> atients with no rheum appt and/or rheum appt after ssz script

Sulfasalazi |
  ne within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        235        2.18        2.18
         No |        529        4.92        7.10
          . |      9,997       92.90      100.00
------------+-----------------------------------
      Total |     10,761      100.00

. tab ssz_12m if ra_code==1 & has_12m_follow_up==1 //for patients with at least
>  12m registration

Sulfasalazi |
  ne within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        235       30.76       30.76
         No |        529       69.24      100.00
------------+-----------------------------------
      Total |        764      100.00

. 
. **Sulfasalazine time categories for PsA patients
. tab ssz_3m if psa_code==1 & has_6m_follow_up==1, missing

Sulfasalazi |
ne within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         40        0.36        0.36
         No |        708        6.40        6.76
          . |     10,323       93.24      100.00
------------+-----------------------------------
      Total |     11,071      100.00

. tab ssz_6m if psa_code==1 & has_6m_follow_up==1, missing

Sulfasalazi |
ne within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         91        0.82        0.82
         No |        657        5.93        6.76
          . |     10,323       93.24      100.00
------------+-----------------------------------
      Total |     11,071      100.00

. tab ssz_12m if psa_code==1 & has_12m_follow_up==1, missing //with a least 12m
>  registration

Sulfasalazi |
  ne within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        216        2.06        2.06
         No |        481        4.60        6.66
          . |      9,770       93.34      100.00
------------+-----------------------------------
      Total |     10,467      100.00

. 
. **Hydroxychloroquine use
. gen time_to_hcq=(hydroxychloroquine_date-rheum_appt_date) if hydroxychloroqui
> ne==1 & rheum_appt_date!=. & hydroxychloroquine_date>rheum_appt_date 
(32,985 missing values generated)

. tabstat time_to_hcq if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p2
> 5 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |       755  629.9232       629       338       895
----------------------------------------------------------------

. bys diagnosis_year: tabstat time_to_hcq if ra_code==1 & has_6m_follow_up==1, 
> stats (n mean p50 p25 p75) //by diagnosis year for RA

-------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |       241  618.6224       624       311       880
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |       227  633.3612       651       343       918
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |       252  624.8611     611.5       346       883
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> diagnosis_year = .

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |        35  721.8857       747       284      1115
----------------------------------------------------------------

. bys diagnosis_year: tabstat time_to_hcq if psa_code==1 & has_6m_follow_up==1,
>  stats (n mean p50 p25 p75) //by diagnosis year for PsA

-------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |       246  610.9309     579.5       317       841
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |       229   628.607       636       305       939
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |       224  566.9911       509       319       796
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> diagnosis_year = .

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |        22  567.2727     501.5       334       947
----------------------------------------------------------------

. bys nuts_region: tabstat time_to_hcq if ra_code==1 & has_6m_follow_up==1, sta
> ts (n mean p50 p25 p75) //by region for RA

-------------------------------------------------------------------------------
-> nuts_region = East Midlands

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |        72   632.125       615     344.5     886.5
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = East of England

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |        71  643.5352       638       360       918
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = London

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |       168  623.7202     618.5     321.5       906
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = North East

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |        75  568.9867       566       262       863
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = North West

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |        81  605.5185       592       257       907
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = South East

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |       136  641.0441       626     343.5       953
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = West Midlands

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |        82   679.878       697       446       922
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |        70  642.1429     673.5       365       839
----------------------------------------------------------------

. bys nuts_region: tabstat time_to_hcq if psa_code==1 & has_6m_follow_up==1, st
> ats (n mean p50 p25 p75) //by region for PsA

-------------------------------------------------------------------------------
-> nuts_region = East Midlands

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |        75  540.3067       459       275       764
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = East of England

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |        72  635.6111     543.5       372     873.5
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = London

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |       148  662.2973       610     363.5       966
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = North East

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |        75    571.96       525       268       869
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = North West

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |        61  519.0656       491       269       766
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = South East

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |       149  581.7718       572       281       842
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = West Midlands

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |        76  647.1842     646.5       342       951
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |        65  599.8308       602       307       838
----------------------------------------------------------------

. 
. **Hydroxychloroquine time categories for RA patients //Nb. this is time perio
> d from rheum appt (i.e. diagnosis) to shared care, not from referral to first
>  script 
. gen hcq_3m=1 if time_to_hcq<=90 & time_to_hcq!=. 
(35,238 missing values generated)

. replace hcq_3m=2 if time_to_hcq>90 & time_to_hcq!=.
(2,253 real changes made)

. lab define hcq_3m 1 "Yes" 2 "No", modify

. lab val hcq_3m hcq_3m

. lab var hcq_3m "Hydroxychloroquine within 3 months" 

. tab hcq_3m if ra_code==1 & has_6m_follow_up==1, missing //missing will be pat
> ients with no rheum appt and/or rheum appt after csDMARD script

Hydroxychlo |
    roquine |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         50        0.44        0.44
         No |        705        6.24        6.68
          . |     10,540       93.32      100.00
------------+-----------------------------------
      Total |     11,295      100.00

. tab hcq_3m if ra_code==1 & has_6m_follow_up==1

Hydroxychlo |
    roquine |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         50        6.62        6.62
         No |        705       93.38      100.00
------------+-----------------------------------
      Total |        755      100.00

. gen hcq_6m=1 if time_to_hcq<=180 & time_to_hcq!=. 
(35,086 missing values generated)

. replace hcq_6m=2 if time_to_hcq>180 & time_to_hcq!=.
(2,101 real changes made)

. lab define hcq_6m 1 "Yes" 2 "No", modify

. lab val hcq_6m hcq_6m

. lab var hcq_6m "Hydroxychloroquine within 6 months" 

. tab hcq_6m if ra_code==1 & has_6m_follow_up==1, missing //missing will be pat
> ients with no rheum appt and/or rheum appt after csDMARD script

Hydroxychlo |
    roquine |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         99        0.88        0.88
         No |        656        5.81        6.68
          . |     10,540       93.32      100.00
------------+-----------------------------------
      Total |     11,295      100.00

. tab hcq_6m if ra_code==1 & has_6m_follow_up==1

Hydroxychlo |
    roquine |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         99       13.11       13.11
         No |        656       86.89      100.00
------------+-----------------------------------
      Total |        755      100.00

. gen hcq_12m=1 if time_to_hcq<=365 & time_to_hcq!=. 
(34,679 missing values generated)

. replace hcq_12m=2 if time_to_hcq>365 & time_to_hcq!=.
(1,694 real changes made)

. lab define hcq_12m 1 "Yes" 2 "No", modify

. lab val hcq_12m hcq_12m

. lab var hcq_12m "Hydroxychloroquine within 12 months" 

. tab hcq_12m if ra_code==1 & has_12m_follow_up==1, missing //missing will be p
> atients with no rheum appt and/or rheum appt after hcq script

Hydroxychlo |
    roquine |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        199        1.85        1.85
         No |        524        4.87        6.72
          . |     10,038       93.28      100.00
------------+-----------------------------------
      Total |     10,761      100.00

. tab hcq_12m if ra_code==1 & has_12m_follow_up==1 //for patients with at least
>  12m registration

Hydroxychlo |
    roquine |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        199       27.52       27.52
         No |        524       72.48      100.00
------------+-----------------------------------
      Total |        723      100.00

. 
. **Hydroxychloroquine time categories for PsA patients
. tab hcq_3m if psa_code==1 & has_6m_follow_up==1, missing

Hydroxychlo |
    roquine |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         44        0.40        0.40
         No |        677        6.12        6.51
          . |     10,350       93.49      100.00
------------+-----------------------------------
      Total |     11,071      100.00

. tab hcq_6m if psa_code==1 & has_6m_follow_up==1, missing

Hydroxychlo |
    roquine |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         94        0.85        0.85
         No |        627        5.66        6.51
          . |     10,350       93.49      100.00
------------+-----------------------------------
      Total |     11,071      100.00

. tab hcq_12m if psa_code==1 & has_12m_follow_up==1, missing //with a least 12m
>  registration

Hydroxychlo |
    roquine |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        212        2.03        2.03
         No |        478        4.57        6.59
          . |      9,777       93.41      100.00
------------+-----------------------------------
      Total |     10,467      100.00

. 
. **Leflunomide use
. gen time_to_lef=(leflunomide_date-rheum_appt_date) if leflunomide==1 & rheum_
> appt_date!=. & leflunomide_date>rheum_appt_date 
(32,919 missing values generated)

. tabstat time_to_lef if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p2
> 5 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |       777  604.1068       572       312       875
----------------------------------------------------------------

. bys diagnosis_year: tabstat time_to_lef if ra_code==1 & has_6m_follow_up==1, 
> stats (n mean p50 p25 p75) //by diagnosis year for RA

-------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |       281  603.4484       592       323       852
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |       250   590.052       541       276       865
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |       208  617.6587     562.5       306       931
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> diagnosis_year = .

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |        38  627.2632     670.5       361       823
----------------------------------------------------------------

. bys diagnosis_year: tabstat time_to_lef if psa_code==1 & has_6m_follow_up==1,
>  stats (n mean p50 p25 p75) //by diagnosis year for PsA

-------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |       247  601.8543       564       316       853
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |       244  602.5164       578       333     840.5
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |       226  603.9513     568.5       345       820
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> diagnosis_year = .

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |        31  491.9032       456       278       740
----------------------------------------------------------------

. bys nuts_region: tabstat time_to_lef if ra_code==1 & has_6m_follow_up==1, sta
> ts (n mean p50 p25 p75) //by region for RA

-------------------------------------------------------------------------------
-> nuts_region = East Midlands

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |        75  630.7867       592       305       906
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = East of England

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |        77  596.8701       534       325       841
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = London

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |       160   623.175       641     305.5     903.5
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = North East

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |        74  606.4324     565.5       315       851
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = North West

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |        71  637.7746       696       317       960
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = South East

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |       165  558.1333       519       263       823
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = West Midlands

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |        76  629.6974       593       368       917
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |        79  586.1772       526       312       833
----------------------------------------------------------------

. bys nuts_region: tabstat time_to_lef if psa_code==1 & has_6m_follow_up==1, st
> ats (n mean p50 p25 p75) //by region for PsA

-------------------------------------------------------------------------------
-> nuts_region = East Midlands

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |        76  584.1316       480     233.5     862.5
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = East of England

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |        76  607.3684     622.5     285.5     912.5
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = London

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |       153  597.7124       579       351       824
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = North East

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |        90  614.0222       603       357       853
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = North West

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |        68  638.5735     567.5       356       884
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = South East

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |       131  594.9389       593       340       810
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = West Midlands

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |        68  506.6324     450.5     238.5     796.5
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |        86  631.8256     574.5       360       877
----------------------------------------------------------------

. 
. **Leflunomide time categories for RA patients //Nb. this is time period from 
> rheum appt (i.e. diagnosis) to shared care, not from referral to first script
>  
. gen lef_3m=1 if time_to_lef<=90 & time_to_lef!=. 
(35,244 missing values generated)

. replace lef_3m=2 if time_to_lef>90 & time_to_lef!=.
(2,325 real changes made)

. lab define lef_3m 1 "Yes" 2 "No", modify

. lab val lef_3m lef_3m

. lab var lef_3m "Leflunomide within 3 months" 

. tab lef_3m if ra_code==1 & has_6m_follow_up==1, missing //missing will be pat
> ients with no rheum appt and/or rheum appt after csDMARD script

Leflunomide |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         46        0.41        0.41
         No |        731        6.47        6.88
          . |     10,518       93.12      100.00
------------+-----------------------------------
      Total |     11,295      100.00

. tab lef_3m if ra_code==1 & has_6m_follow_up==1

Leflunomide |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         46        5.92        5.92
         No |        731       94.08      100.00
------------+-----------------------------------
      Total |        777      100.00

. gen lef_6m=1 if time_to_lef<=180 & time_to_lef!=. 
(35,067 missing values generated)

. replace lef_6m=2 if time_to_lef>180 & time_to_lef!=.
(2,148 real changes made)

. lab define lef_6m 1 "Yes" 2 "No", modify

. lab val lef_6m lef_6m

. lab var lef_6m "Leflunomide within 6 months" 

. tab lef_6m if ra_code==1 & has_6m_follow_up==1, missing //missing will be pat
> ients with no rheum appt and/or rheum appt after csDMARD script

Leflunomide |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        107        0.95        0.95
         No |        670        5.93        6.88
          . |     10,518       93.12      100.00
------------+-----------------------------------
      Total |     11,295      100.00

. tab lef_6m if ra_code==1 & has_6m_follow_up==1

Leflunomide |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        107       13.77       13.77
         No |        670       86.23      100.00
------------+-----------------------------------
      Total |        777      100.00

. gen lef_12m=1 if time_to_lef<=365 & time_to_lef!=. 
(34,637 missing values generated)

. replace lef_12m=2 if time_to_lef>365 & time_to_lef!=.
(1,718 real changes made)

. lab define lef_12m 1 "Yes" 2 "No", modify

. lab val lef_12m lef_12m

. lab var lef_12m "Leflunomide within 12 months" 

. tab lef_12m if ra_code==1 & has_12m_follow_up==1, missing //missing will be p
> atients with no rheum appt and/or rheum appt after lef script

Leflunomide |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        218        2.03        2.03
         No |        527        4.90        6.92
          . |     10,016       93.08      100.00
------------+-----------------------------------
      Total |     10,761      100.00

. tab lef_12m if ra_code==1 & has_12m_follow_up==1 //for patients with at least
>  12m registration

Leflunomide |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        218       29.26       29.26
         No |        527       70.74      100.00
------------+-----------------------------------
      Total |        745      100.00

. 
. **Leflunomide time categories for PsA patients
. tab lef_3m if psa_code==1 & has_6m_follow_up==1, missing

Leflunomide |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         48        0.43        0.43
         No |        700        6.32        6.76
          . |     10,323       93.24      100.00
------------+-----------------------------------
      Total |     11,071      100.00

. tab lef_6m if psa_code==1 & has_6m_follow_up==1, missing

Leflunomide |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         93        0.84        0.84
         No |        655        5.92        6.76
          . |     10,323       93.24      100.00
------------+-----------------------------------
      Total |     11,071      100.00

. tab lef_12m if psa_code==1 & has_12m_follow_up==1, missing //with a least 12m
>  registration

Leflunomide |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        211        2.02        2.02
         No |        509        4.86        6.88
          . |      9,747       93.12      100.00
------------+-----------------------------------
      Total |     10,467      100.00

. 
. **Time to first biologic script, whereby first rheum appt is classed as diagn
> osis date (assumes rheum appt present); high_cost drug data available to Nov 
> 2020======================================================================*/
. 
. *Below analyses are only for patients with at least 12 months of follow-up av
> ailable after EIA code
. gen time_to_biologic=(biologic_date-rheum_appt_date) if biologic==1 & rheum_a
> ppt_date!=. & biologic_date>rheum_appt_date 
(14,374 missing values generated)

. tabstat time_to_biologic if has_12m_follow_up==1, stats (n mean p50 p25 p75) 
> //for all EIA patients

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_bi~c |     18903  461.1855       408       203       663
----------------------------------------------------------------

. bys eia_diagnosis: tabstat time_to_biologic if has_12m_follow_up==1, stats (n
>  mean p50 p25 p75) 

-------------------------------------------------------------------------------
-> eia_diagnosis = RA

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_bi~c |      6355  461.1366       409       204       660
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_bi~c |      6214  461.1617     402.5       202       666
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_bi~c |      6334   461.258       411       203       664
----------------------------------------------------------------

. bys diagnosis_year: tabstat time_to_biologic if ra_code==1 & has_12m_follow_u
> p==1, stats (n mean p50 p25 p75) //by diagnosis year

-------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_bi~c |      2054  467.1032     420.5       211       664
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_bi~c |      1977  453.9616       398       204       651
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_bi~c |      2018  462.5689       409       196       662
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> diagnosis_year = .

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_bi~c |       306  457.9967       391       197       669
----------------------------------------------------------------

. bys nuts_region: tabstat time_to_biologic if ra_code==1 & has_12m_follow_up==
> 1, stats (n mean p50 p25 p75) //by region

-------------------------------------------------------------------------------
-> nuts_region = East Midlands

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_bi~c |       658  461.9924     419.5       186       671
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = East of England

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_bi~c |       621  438.8454       379       188       633
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = London

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_bi~c |      1315  462.0913       409       192       671
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = North East

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_bi~c |       642  473.4595       423       217       688
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = North West

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_bi~c |       610  443.9574     397.5       203       628
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = South East

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_bi~c |      1242  465.2915       413       219       652
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = West Midlands

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_bi~c |       657  455.7808       403       210       654
----------------------------------------------------------------

-------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_bi~c |       610  482.3672     426.5       212       668
----------------------------------------------------------------

. 
. **What was first biologic
. gen first_bio=""
(35,388 missing values generated)

. foreach var of varlist abatacept_date adalimumab_date baricitinib_date certol
> izumab_date etanercept_date golimumab_date guselkumab_date infliximab_date ix
> ekizumab_date rituximab_date sarilumab_date secukinumab_date tocilizumab_date
>  tofacitinib_date upadacitinib_date ustekinumab_date {
  2.         replace first_bio="`var'" if biologic_date==`var' & biologic_date!
> =.
  3.         }
variable first_bio was str1 now str14
(1,636 real changes made)
variable first_bio was str14 now str15
(1,599 real changes made)
variable first_bio was str15 now str16
(1,618 real changes made)
variable first_bio was str16 now str17
(1,672 real changes made)
(1,689 real changes made)
(1,652 real changes made)
(1,689 real changes made)
(1,635 real changes made)
(1,702 real changes made)
(1,631 real changes made)
(1,658 real changes made)
(1,634 real changes made)
(1,649 real changes made)
(1,657 real changes made)
(1,656 real changes made)
(1,702 real changes made)

. gen first_biologic = substr(first_bio, 1, length(first_bio) - 5)        
(9,460 missing values generated)

. drop first_bio

. tab first_biologic if has_12m_follow_up==1 //for all EIA patients

first_biolog |
          ic |      Freq.     Percent        Cum.
-------------+-----------------------------------
   abatacept |      1,417        6.07        6.07
  adalimumab |      1,374        5.88       11.95
 baricitinib |      1,407        6.02       17.97
certolizumab |      1,438        6.16       24.13
  etanercept |      1,504        6.44       30.57
   golimumab |      1,465        6.27       36.84
  guselkumab |      1,485        6.36       43.19
  infliximab |      1,447        6.19       49.39
  ixekizumab |      1,503        6.43       55.82
   rituximab |      1,438        6.16       61.98
   sarilumab |      1,464        6.27       68.24
 secukinumab |      1,458        6.24       74.49
 tocilizumab |      1,467        6.28       80.77
 tofacitinib |      1,481        6.34       87.11
upadacitinib |      1,480        6.34       93.44
 ustekinumab |      1,532        6.56      100.00
-------------+-----------------------------------
       Total |     23,360      100.00

. bys eia_diagnosis: tab first_biologic if has_12m_follow_up==1

-------------------------------------------------------------------------------
-> eia_diagnosis = RA

first_biolog |
          ic |      Freq.     Percent        Cum.
-------------+-----------------------------------
   abatacept |        483        6.14        6.14
  adalimumab |        441        5.60       11.74
 baricitinib |        482        6.12       17.87
certolizumab |        449        5.71       23.57
  etanercept |        493        6.26       29.83
   golimumab |        513        6.52       36.35
  guselkumab |        505        6.42       42.77
  infliximab |        510        6.48       49.25
  ixekizumab |        508        6.45       55.71
   rituximab |        472        6.00       61.70
   sarilumab |        500        6.35       68.06
 secukinumab |        486        6.18       74.23
 tocilizumab |        497        6.32       80.55
 tofacitinib |        485        6.16       86.71
upadacitinib |        512        6.51       93.21
 ustekinumab |        534        6.79      100.00
-------------+-----------------------------------
       Total |      7,870      100.00

-------------------------------------------------------------------------------
-> eia_diagnosis = PsA

first_biolog |
          ic |      Freq.     Percent        Cum.
-------------+-----------------------------------
   abatacept |        479        6.27        6.27
  adalimumab |        447        5.85       12.12
 baricitinib |        450        5.89       18.00
certolizumab |        478        6.25       24.26
  etanercept |        490        6.41       30.67
   golimumab |        470        6.15       36.82
  guselkumab |        474        6.20       43.02
  infliximab |        476        6.23       49.25
  ixekizumab |        514        6.73       55.97
   rituximab |        484        6.33       62.31
   sarilumab |        483        6.32       68.62
 secukinumab |        480        6.28       74.91
 tocilizumab |        476        6.23       81.13
 tofacitinib |        502        6.57       87.70
upadacitinib |        474        6.20       93.90
 ustekinumab |        466        6.10      100.00
-------------+-----------------------------------
       Total |      7,643      100.00

-------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

first_biolog |
          ic |      Freq.     Percent        Cum.
-------------+-----------------------------------
   abatacept |        455        5.80        5.80
  adalimumab |        486        6.19       11.99
 baricitinib |        475        6.05       18.05
certolizumab |        511        6.51       24.56
  etanercept |        521        6.64       31.20
   golimumab |        482        6.14       37.34
  guselkumab |        506        6.45       43.79
  infliximab |        461        5.87       49.66
  ixekizumab |        481        6.13       55.79
   rituximab |        482        6.14       61.93
   sarilumab |        481        6.13       68.06
 secukinumab |        492        6.27       74.33
 tocilizumab |        494        6.30       80.63
 tofacitinib |        494        6.30       86.92
upadacitinib |        494        6.30       93.22
 ustekinumab |        532        6.78      100.00
-------------+-----------------------------------
       Total |      7,847      100.00


. 
. **Biologic time categories (for all patients)
. gen biologic_3m=1 if time_to_biologic<=90 & time_to_biologic!=. 
(33,101 missing values generated)

. replace biologic_3m=2 if time_to_biologic>90 & time_to_biologic!=.
(18,727 real changes made)

. lab define biologic_3m 1 "Yes" 2 "No", modify

. lab val biologic_3m biologic_3m

. lab var biologic_3m "bDMARD/tsDMARD within 3 months" 

. bys eia_diagnosis: tab biologic_3m if has_6m_follow_up==1, missing //missing 
> will be patients with no rheum appt and/or rheum appt after bDMARD/tsDMARD sc
> ript

-------------------------------------------------------------------------------
-> eia_diagnosis = RA

bDMARD/tsDM |
 ARD within |
   3 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        727        6.44        6.44
         No |      5,954       52.71       59.15
          . |      4,614       40.85      100.00
------------+-----------------------------------
      Total |     11,295      100.00

-------------------------------------------------------------------------------
-> eia_diagnosis = PsA

bDMARD/tsDM |
 ARD within |
   3 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        712        6.43        6.43
         No |      5,874       53.06       59.49
          . |      4,485       40.51      100.00
------------+-----------------------------------
      Total |     11,071      100.00

-------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

bDMARD/tsDM |
 ARD within |
   3 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        735        6.54        6.54
         No |      5,960       53.06       59.61
          . |      4,537       40.39      100.00
------------+-----------------------------------
      Total |     11,232      100.00


. bys eia_diagnosis: tab biologic_3m if has_6m_follow_up==1

-------------------------------------------------------------------------------
-> eia_diagnosis = RA

bDMARD/tsDM |
 ARD within |
   3 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        727       10.88       10.88
         No |      5,954       89.12      100.00
------------+-----------------------------------
      Total |      6,681      100.00

-------------------------------------------------------------------------------
-> eia_diagnosis = PsA

bDMARD/tsDM |
 ARD within |
   3 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        712       10.81       10.81
         No |      5,874       89.19      100.00
------------+-----------------------------------
      Total |      6,586      100.00

-------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

bDMARD/tsDM |
 ARD within |
   3 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        735       10.98       10.98
         No |      5,960       89.02      100.00
------------+-----------------------------------
      Total |      6,695      100.00


. gen biologic_6m=1 if time_to_biologic<=180 & time_to_biologic!=. 
(30,755 missing values generated)

. replace biologic_6m=2 if time_to_biologic>180 & time_to_biologic!=.
(16,381 real changes made)

. lab define biologic_6m 1 "Yes" 2 "No", modify

. lab val biologic_6m biologic_6m

. lab var biologic_6m "bDMARD/tsDMARD within 6 months" 

. bys eia_diagnosis: tab biologic_6m if has_6m_follow_up==1, missing //missing 
> will be patients with no rheum appt and/or rheum appt after bDMARD/tsDMARD sc
> ript

-------------------------------------------------------------------------------
-> eia_diagnosis = RA

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,432       12.68       12.68
         No |      5,249       46.47       59.15
          . |      4,614       40.85      100.00
------------+-----------------------------------
      Total |     11,295      100.00

-------------------------------------------------------------------------------
-> eia_diagnosis = PsA

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,477       13.34       13.34
         No |      5,109       46.15       59.49
          . |      4,485       40.51      100.00
------------+-----------------------------------
      Total |     11,071      100.00

-------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,482       13.19       13.19
         No |      5,213       46.41       59.61
          . |      4,537       40.39      100.00
------------+-----------------------------------
      Total |     11,232      100.00


. bys eia_diagnosis: tab biologic_6m if has_6m_follow_up==1

-------------------------------------------------------------------------------
-> eia_diagnosis = RA

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,432       21.43       21.43
         No |      5,249       78.57      100.00
------------+-----------------------------------
      Total |      6,681      100.00

-------------------------------------------------------------------------------
-> eia_diagnosis = PsA

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,477       22.43       22.43
         No |      5,109       77.57      100.00
------------+-----------------------------------
      Total |      6,586      100.00

-------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,482       22.14       22.14
         No |      5,213       77.86      100.00
------------+-----------------------------------
      Total |      6,695      100.00


. gen biologic_12m=1 if time_to_biologic<=365 & time_to_biologic!=. 
(25,912 missing values generated)

. replace biologic_12m=2 if time_to_biologic>365 & time_to_biologic!=.
(11,538 real changes made)

. lab define biologic_12m 1 "Yes" 2 "No", modify

. lab val biologic_12m biologic_12m

. lab var biologic_12m "bDMARD/tsDMARD within 12 months" 

. bys eia_diagnosis: tab biologic_12m if has_12m_follow_up==1, missing //missin
> g will be patients with no rheum appt and/or rheum appt after bDMARD/tsDMARD 
> script

-------------------------------------------------------------------------------
-> eia_diagnosis = RA

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      2,850       26.48       26.48
         No |      3,505       32.57       59.06
          . |      4,406       40.94      100.00
------------+-----------------------------------
      Total |     10,761      100.00

-------------------------------------------------------------------------------
-> eia_diagnosis = PsA

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      2,824       26.98       26.98
         No |      3,390       32.39       59.37
          . |      4,253       40.63      100.00
------------+-----------------------------------
      Total |     10,467      100.00

-------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      2,856       26.83       26.83
         No |      3,478       32.68       59.51
          . |      4,310       40.49      100.00
------------+-----------------------------------
      Total |     10,644      100.00


. bys eia_diagnosis: tab biologic_12m if has_12m_follow_up==1 //for patients wi
> th at least 12m registration

-------------------------------------------------------------------------------
-> eia_diagnosis = RA

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      2,850       44.85       44.85
         No |      3,505       55.15      100.00
------------+-----------------------------------
      Total |      6,355      100.00

-------------------------------------------------------------------------------
-> eia_diagnosis = PsA

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      2,824       45.45       45.45
         No |      3,390       54.55      100.00
------------+-----------------------------------
      Total |      6,214      100.00

-------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      2,856       45.09       45.09
         No |      3,478       54.91      100.00
------------+-----------------------------------
      Total |      6,334      100.00


. 
. **Biologic time categories (by year)
. bys diagnosis_year: tab biologic_6m if has_6m_follow_up==1, missing //for all
>  EIA patients with at least 6m follow-up

-------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,381       12.78       12.78
         No |      5,052       46.75       59.53
          . |      4,373       40.47      100.00
------------+-----------------------------------
      Total |     10,806      100.00

-------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,406       13.20       13.20
         No |      4,917       46.16       59.35
          . |      4,330       40.65      100.00
------------+-----------------------------------
      Total |     10,653      100.00

-------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,393       13.14       13.14
         No |      4,891       46.13       59.27
          . |      4,319       40.73      100.00
------------+-----------------------------------
      Total |     10,603      100.00

-------------------------------------------------------------------------------
-> diagnosis_year = .

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        211       13.74       13.74
         No |        711       46.29       60.03
          . |        614       39.97      100.00
------------+-----------------------------------
      Total |      1,536      100.00


. bys diagnosis_year eia_diagnosis: tab biologic_6m if has_6m_follow_up==1, mis
> sing //for each diagnosis with at least 6m follow-up

-------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020, eia_diagnosis = RA

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        436       11.99       11.99
         No |      1,708       46.99       58.98
          . |      1,491       41.02      100.00
------------+-----------------------------------
      Total |      3,635      100.00

-------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020, eia_diagnosis = PsA

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        488       13.68       13.68
         No |      1,678       47.04       60.72
          . |      1,401       39.28      100.00
------------+-----------------------------------
      Total |      3,567      100.00

-------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020, eia_diagnosis = AxSpA

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        457       12.68       12.68
         No |      1,666       46.23       58.91
          . |      1,481       41.09      100.00
------------+-----------------------------------
      Total |      3,604      100.00

-------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021, eia_diagnosis = RA

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        450       12.78       12.78
         No |      1,621       46.04       58.82
          . |      1,450       41.18      100.00
------------+-----------------------------------
      Total |      3,521      100.00

-------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021, eia_diagnosis = PsA

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        471       13.15       13.15
         No |      1,649       46.05       59.20
          . |      1,461       40.80      100.00
------------+-----------------------------------
      Total |      3,581      100.00

-------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021, eia_diagnosis = AxSpA

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        485       13.66       13.66
         No |      1,647       46.38       60.04
          . |      1,419       39.96      100.00
------------+-----------------------------------
      Total |      3,551      100.00

-------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022, eia_diagnosis = RA

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        469       13.08       13.08
         No |      1,662       46.36       59.44
          . |      1,454       40.56      100.00
------------+-----------------------------------
      Total |      3,585      100.00

-------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022, eia_diagnosis = PsA

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        455       13.15       13.15
         No |      1,573       45.48       58.63
          . |      1,431       41.37      100.00
------------+-----------------------------------
      Total |      3,459      100.00

-------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022, eia_diagnosis = AxSpA

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        469       13.18       13.18
         No |      1,656       46.53       59.71
          . |      1,434       40.29      100.00
------------+-----------------------------------
      Total |      3,559      100.00

-------------------------------------------------------------------------------
-> diagnosis_year = ., eia_diagnosis = RA

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         77       13.90       13.90
         No |        258       46.57       60.47
          . |        219       39.53      100.00
------------+-----------------------------------
      Total |        554      100.00

-------------------------------------------------------------------------------
-> diagnosis_year = ., eia_diagnosis = PsA

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         63       13.58       13.58
         No |        209       45.04       58.62
          . |        192       41.38      100.00
------------+-----------------------------------
      Total |        464      100.00

-------------------------------------------------------------------------------
-> diagnosis_year = ., eia_diagnosis = AxSpA

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         71       13.71       13.71
         No |        244       47.10       60.81
          . |        203       39.19      100.00
------------+-----------------------------------
      Total |        518      100.00


. bys diagnosis_year: tab biologic_12m if has_12m_follow_up==1, missing //for a
> ll EIA patients

-------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      2,775       27.13       27.13
         No |      3,318       32.44       59.57
          . |      4,135       40.43      100.00
------------+-----------------------------------
      Total |     10,228      100.00

-------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      2,687       26.60       26.60
         No |      3,309       32.76       59.36
          . |      4,105       40.64      100.00
------------+-----------------------------------
      Total |     10,101      100.00

-------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      2,667       26.45       26.45
         No |      3,275       32.48       58.93
          . |      4,141       41.07      100.00
------------+-----------------------------------
      Total |     10,083      100.00

-------------------------------------------------------------------------------
-> diagnosis_year = .

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        401       27.47       27.47
         No |        471       32.26       59.73
          . |        588       40.27      100.00
------------+-----------------------------------
      Total |      1,460      100.00


. bys diagnosis_year eia_diagnosis: tab biologic_12m if has_12m_follow_up==1, m
> issing //for each diagnosis

-------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020, eia_diagnosis = RA

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        884       25.42       25.42
         No |      1,170       33.65       59.07
          . |      1,423       40.93      100.00
------------+-----------------------------------
      Total |      3,477      100.00

-------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020, eia_diagnosis = PsA

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        984       29.23       29.23
         No |      1,063       31.58       60.81
          . |      1,319       39.19      100.00
------------+-----------------------------------
      Total |      3,366      100.00

-------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020, eia_diagnosis = AxSpA

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        907       26.79       26.79
         No |      1,085       32.05       58.85
          . |      1,393       41.15      100.00
------------+-----------------------------------
      Total |      3,385      100.00

-------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021, eia_diagnosis = RA

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        917       27.27       27.27
         No |      1,060       31.52       58.79
          . |      1,386       41.21      100.00
------------+-----------------------------------
      Total |      3,363      100.00

-------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021, eia_diagnosis = PsA

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        865       25.71       25.71
         No |      1,125       33.44       59.16
          . |      1,374       40.84      100.00
------------+-----------------------------------
      Total |      3,364      100.00

-------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021, eia_diagnosis = AxSpA

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        905       26.82       26.82
         No |      1,124       33.31       60.14
          . |      1,345       39.86      100.00
------------+-----------------------------------
      Total |      3,374      100.00

-------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022, eia_diagnosis = RA

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        905       26.53       26.53
         No |      1,113       32.63       59.16
          . |      1,393       40.84      100.00
------------+-----------------------------------
      Total |      3,411      100.00

-------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022, eia_diagnosis = PsA

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        856       25.99       25.99
         No |      1,062       32.24       58.23
          . |      1,376       41.77      100.00
------------+-----------------------------------
      Total |      3,294      100.00

-------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022, eia_diagnosis = AxSpA

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        906       26.82       26.82
         No |      1,100       32.56       59.38
          . |      1,372       40.62      100.00
------------+-----------------------------------
      Total |      3,378      100.00

-------------------------------------------------------------------------------
-> diagnosis_year = ., eia_diagnosis = RA

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        144       28.24       28.24
         No |        162       31.76       60.00
          . |        204       40.00      100.00
------------+-----------------------------------
      Total |        510      100.00

-------------------------------------------------------------------------------
-> diagnosis_year = ., eia_diagnosis = PsA

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        119       26.86       26.86
         No |        140       31.60       58.47
          . |        184       41.53      100.00
------------+-----------------------------------
      Total |        443      100.00

-------------------------------------------------------------------------------
-> diagnosis_year = ., eia_diagnosis = AxSpA

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        138       27.22       27.22
         No |        169       33.33       60.55
          . |        200       39.45      100.00
------------+-----------------------------------
      Total |        507      100.00


. 
. save "$projectdir/output/data/file_eia_all", replace
(note: file /workspace/output/data/file_eia_all.dta not found)
file /workspace/output/data/file_eia_all.dta saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/cleaning_dataset.log
  log type:  text
 closed on:   6 Apr 2022, 14:51:18
-------------------------------------------------------------------------------
