{smcl}
{txt}{sf}{ul off}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/workspace/logs/cleaning_dataset.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 1 Apr 2022, 16:01:03
{txt}
{com}. 
. **Set Ado file path
. adopath + "$projectdir/analysis/extra_ados"
{txt}  [1]  (BASE)      "{res}/usr/local/stata/ado/base/{txt}"
  [2]  (SITE)      "{res}/usr/local/ado/{txt}"
  [3]              "{res}.{txt}"
  [4]  (PERSONAL)  "{res}~/ado/personal/{txt}"
  [5]  (PLUS)      "{res}~/ado/plus/{txt}"
  [6]  (OLDPLACE)  "{res}~/ado/{txt}"
  [7]              "{res}/workspace/analysis/extra_ados{txt}"

{com}. 
. **Set index dates ===========================================================*/
. global year_preceding = "01/03/2018"
{txt}
{com}. global start_date = "01/03/2019"
{txt}
{com}. global end_date = "01/03/2022"
{txt}
{com}. 
. **Rename variables (some are too long for Stata to handle) =======================================*/
. rename chronic_respiratory_disease chronic_resp_disease
{res}{txt}
{com}. 
. **Convert date strings to dates ====================================================*/
. ***Some dates are given with month/year only, so adding day 15 to enable them to be processed as dates 
. 
. foreach var of varlist   hba1c_mmol_per_mol_date                        ///
>                                                  hba1c_percentage_date                          ///
>                                                  creatinine_date                                ///
>                                                  bmi_date_measured                          ///
>                                                  abatacept                                                      ///
>                                                  adalimumab                                                     ///     
>                                                  baricitinib                                            ///
>                                                  certolizumab                                           ///
>                                                  etanercept                                                     ///
>                                                  golimumab                                                      ///
>                                                  guselkumab                                                     ///     
>                                                  infliximab                                                     ///
>                                                  ixekizumab                                                     ///
>                                                  methotrexate_hcd                                       ///
>                                                  rituximab                                                      ///
>                                                  sarilumab                                                      ///
>                                                  secukinumab                                            ///     
>                                                  tocilizumab                                            ///
>                                                  tofacitinib                                            ///
>                                                  upadacitinib                                           ///
>                                                  ustekinumab                                            ///
>                                                  {c -(}
{txt}  2{com}.                                                         
.                 capture confirm string variable `var'
{txt}  3{com}.                 if _rc!=0 {c -(}
{txt}  4{com}.                         assert `var'==.
{txt}  5{com}.                         rename `var' `var'_date
{txt}  6{com}.                 {c )-}
{txt}  7{com}.         
.                 else {c -(}
{txt}  8{com}.                                 replace `var' = `var' + "-15"
{txt}  9{com}.                                 rename `var' `var'_dstr
{txt} 10{com}.                                 replace `var'_dstr = " " if `var'_dstr == "-15"
{txt} 11{com}.                                 gen `var'_date = date(`var'_dstr, "YMD") 
{txt} 12{com}.                                 order `var'_date, after(`var'_dstr)
{txt} 13{com}.                                 drop `var'_dstr
{txt} 14{com}.                 {c )-}
{txt} 15{com}.         
.         format `var'_date %td
{txt} 16{com}. {c )-}
{txt}variable {bf}hba1c_mmol_per_mol_date{sf} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(5,000 real changes made)
(5,000 missing values generated)
variable {bf}hba1c_percentage_date{sf} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(5,000 real changes made)
(5,000 missing values generated)
variable {bf}creatinine_date{sf} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(5,000 real changes made)
(5,000 missing values generated)
variable {bf}bmi_date_measured{sf} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(40,000 real changes made)
(40,000 missing values generated)
variable {bf}abatacept{sf} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}adalimumab{sf} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}baricitinib{sf} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}certolizumab{sf} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}etanercept{sf} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}golimumab{sf} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}guselkumab{sf} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}infliximab{sf} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}ixekizumab{sf} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}methotrexate_hcd{sf} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}rituximab{sf} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}sarilumab{sf} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}secukinumab{sf} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}tocilizumab{sf} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}tofacitinib{sf} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}upadacitinib{sf} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}ustekinumab{sf} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)

{com}. 
. **Conversion for dates with day already included ====================================================*/
. 
. foreach var of varlist   died_date_ons                                          ///
>                                              eia_code_date                                              ///
>                                                  rheum_appt_date                                        ///
>                                              ra_code_date                                               ///
>                                                  psa_code_date                                          ///
>                                                  anksp_code_date                                        ///
>                                                  last_gp_prerheum_date                          ///
>                                                  last_gp_precode_date                           ///     
>                                                  last_gp_refrheum_date                          ///
>                                                  last_gp_refcode_date                           ///
>                                                  referral_rheum_prerheum                        ///
>                                                  referral_rheum_precode                         ///     
>                                                  chronic_cardiac_disease                        ///
>                                                  diabetes                                                       ///
>                                                  hypertension                                           ///     
>                                                  chronic_resp_disease                           ///
>                                                  copd                                                           ///
>                                                  chronic_liver_disease                          ///
>                                                  stroke                                                         ///
>                                                  lung_cancer                                            ///
>                                                  haem_cancer                                            ///
>                                                  other_cancer                                           ///
>                                                  esrf                                                           ///
>                                                  organ_transplant                                       ///
>                                                  hydroxychloroquine                                     ///
>                                                  leflunomide                                            ///
>                                                  methotrexate                                           ///
>                                                  methotrexate_inj                                       ///
>                                                  sulfasalazine                                          ///
>                                                  {c -(}
{txt}  2{com}.                                                                  
.                 capture confirm string variable `var'
{txt}  3{com}.                 if _rc!=0 {c -(}
{txt}  4{com}.                         assert `var'==.
{txt}  5{com}.                         rename `var' `var'_date
{txt}  6{com}.                 {c )-}
{txt}  7{com}.         
.                 else {c -(}
{txt}  8{com}.                                 rename `var' `var'_dstr
{txt}  9{com}.                                 gen `var'_date = date(`var'_dstr, "YMD") 
{txt} 10{com}.                                 order `var'_date, after(`var'_dstr)
{txt} 11{com}.                                 drop `var'_dstr
{txt} 12{com}.                                 gen `var'_date15 = `var'_date+15
{txt} 13{com}.                                 order `var'_date15, after(`var'_date)
{txt} 14{com}.                                 drop `var'_date
{txt} 15{com}.                                 rename `var'_date15 `var'_date
{txt} 16{com}.                 {c )-}
{txt} 17{com}.         
.         format `var'_date %td
{txt} 18{com}. {c )-}
{res}{txt}(90,000 missing values generated)
(90,000 missing values generated)
{res}{txt}(1,000 missing values generated)
(1,000 missing values generated)
{res}{txt}(9,999 missing values generated)
(9,999 missing values generated)
{res}{txt}(1,000 missing values generated)
(1,000 missing values generated)
{res}{txt}(1,000 missing values generated)
(1,000 missing values generated)
{res}{txt}(1,000 missing values generated)
(1,000 missing values generated)
{res}{txt}(9,999 missing values generated)
(9,999 missing values generated)
{res}{txt}(9,999 missing values generated)
(9,999 missing values generated)
{res}{txt}(9,999 missing values generated)
(9,999 missing values generated)
{res}{txt}(9,999 missing values generated)
(9,999 missing values generated)
{res}{txt}(9,999 missing values generated)
(9,999 missing values generated)
{res}{txt}(9,999 missing values generated)
(9,999 missing values generated)
{res}{txt}(80,000 missing values generated)
(80,000 missing values generated)
{res}{txt}(80,000 missing values generated)
(80,000 missing values generated)
{res}{txt}(80,000 missing values generated)
(80,000 missing values generated)
{res}{txt}(80,000 missing values generated)
(80,000 missing values generated)
{res}{txt}(80,000 missing values generated)
(80,000 missing values generated)
{res}{txt}(80,000 missing values generated)
(80,000 missing values generated)
{res}{txt}(80,000 missing values generated)
(80,000 missing values generated)
{res}{txt}(80,000 missing values generated)
(80,000 missing values generated)
{res}{txt}(80,000 missing values generated)
(80,000 missing values generated)
{res}{txt}(80,000 missing values generated)
(80,000 missing values generated)
{res}{txt}(80,000 missing values generated)
(80,000 missing values generated)
{res}{txt}(80,000 missing values generated)
(80,000 missing values generated)
{res}{txt}(90,000 missing values generated)
(90,000 missing values generated)
{res}{txt}(90,000 missing values generated)
(90,000 missing values generated)
{res}{txt}(90,000 missing values generated)
(90,000 missing values generated)
{res}{txt}(90,000 missing values generated)
(90,000 missing values generated)
{res}{txt}(90,000 missing values generated)
(90,000 missing values generated)
{res}{txt}
{com}.                                                  
. **Rename variables with extra 'date' added to the end of variable names===========================================================*/ 
. rename rheum_appt_date_date rheum_appt_date
{res}{txt}
{com}. rename eia_code_date_date eia_code_date
{res}{txt}
{com}. rename ra_code_date_date ra_code_date
{res}{txt}
{com}. rename psa_code_date_date psa_code_date
{res}{txt}
{com}. rename anksp_code_date_date anksp_code_date
{res}{txt}
{com}. rename died_date_ons_date died_ons_date
{res}{txt}
{com}. rename last_gp_prerheum_date_date last_gp_prerheum_date
{res}{txt}
{com}. rename last_gp_refrheum_date_date last_gp_refrheum_date
{res}{txt}
{com}. rename last_gp_refcode_date_date last_gp_refcode_date
{res}{txt}
{com}. rename last_gp_precode_date_date last_gp_precode_date
{res}{txt}
{com}. rename hba1c_mmol_per_mol_date_date hba1c_mmol_per_mol_date
{res}{txt}
{com}. rename hba1c_percentage_date_date hba1c_percentage_date
{res}{txt}
{com}. rename creatinine_date_date creatinine_date
{res}{txt}
{com}. rename creatinine creatinine_value 
{res}{txt}
{com}. rename bmi_date_measured_date bmi_date
{res}{txt}
{com}. rename bmi bmi_value
{res}{txt}
{com}. 
. **Create binary indicator variables for relevant conditions ====================================================*/
. 
. foreach var of varlist   eia_code_date                                          ///
>                                                  rheum_appt_date                                        ///
>                                              ra_code_date                                               ///
>                                                  psa_code_date                                          ///
>                                                  anksp_code_date                                        ///
>                                                  died_ons_date                                          ///
>                                                  last_gp_prerheum_date                          ///
>                                                  last_gp_precode_date                           ///     
>                                                  last_gp_refrheum_date                          ///
>                                                  last_gp_refcode_date                           ///
>                                                  referral_rheum_prerheum_date           ///
>                                                  referral_rheum_precode_date            ///     
>                                                  chronic_cardiac_disease_date           ///
>                                                  diabetes_date                                          ///
>                                                  hypertension_date                                      ///
>                                                  chronic_resp_disease_date                      ///
>                                                  copd_date                                                      ///
>                                                  chronic_liver_disease_date                     ///
>                                                  stroke_date                                            ///
>                                                  lung_cancer_date                                       ///
>                                                  haem_cancer_date                                       ///             
>                                                  other_cancer_date                                      ///
>                                                  esrf_date                                                      ///
>                                                  creatinine_date                                        ///
>                                                  organ_transplant_date                          ///
>                                                  hydroxychloroquine_date                        ///     
>                                                  leflunomide_date                                       ///
>                                                  methotrexate_date                                      ///
>                                                  methotrexate_inj_date                          ///             
>                                                  sulfasalazine_date                                     ///
>                                                  abatacept_date                                         ///
>                                                  adalimumab_date                                        ///
>                                                  baricitinib_date                                       ///
>                                                  certolizumab_date                                      ///
>                                                  etanercept_date                                        ///
>                                                  golimumab_date                                         ///
>                                                  guselkumab_date                                        ///
>                                                  infliximab_date                                        ///
>                                                  ixekizumab_date                                        ///
>                                                  methotrexate_hcd_date                          ///
>                                                  rituximab_date                                         ///             
>                                                  sarilumab_date                                         ///
>                                                  secukinumab_date                                       ///
>                                                  tocilizumab_date                                       ///             
>                                                  tofacitinib_date                                       ///
>                                                  upadacitinib_date                                      ///
>                                                  ustekinumab_date   {c -(}                           
{txt}  2{com}.         /*date ranges are applied in python, so presence of date indicates presence of 
>           disease in the correct time frame*/ 
.         local newvar =  substr("`var'", 1, length("`var'") - 5)
{txt}  3{com}.         gen `newvar' = (`var'!=. )
{txt}  4{com}.         order `newvar', after(`var')
{txt}  5{com}. {c )-}
{txt}
{com}. 
. *Refine diagnostic window=============================================================*/
. 
. **All patients should have EIA code
. tab eia_code

   {txt}eia_code {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      1,000        1.00        1.00
{txt}          1 {c |}{res}     99,000       99.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}    100,000      100.00
{txt}
{com}. keep if eia_code==1
{txt}(1,000 observations deleted)

{com}. 
. **Keep patients with first EIA code in GP record if code was after 1st March 2019
. keep if eia_code_date>=date("$start_date", "DMY") & eia_code_date!=. 
{txt}(25,825 observations deleted)

{com}. tab eia_code

   {txt}eia_code {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}     73,175      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     73,175      100.00
{txt}
{com}. 
. **Month/Year of diagnosis
. gen year_diag=year(eia_code_date)
{txt}
{com}. format year_diag %ty
{txt}
{com}. gen month_diag=month(eia_code_date)
{txt}
{com}. gen mo_year_diagn=ym(year_diag, month_diag)
{txt}
{com}. format mo_year_diagn %tm
{txt}
{com}. 
. *Include only most recent EIA sub-diagnosis
. replace ra_code =0 if psa_code_date >= ra_code_date & psa_code_date !=.
{txt}(35,912 real changes made)

{com}. replace ra_code =0 if anksp_code_date >= ra_code_date & anksp_code_date !=.
{txt}(12,174 real changes made)

{com}. replace psa_code =0 if ra_code_date >= psa_code_date & ra_code_date !=.
{txt}(35,816 real changes made)

{com}. replace psa_code =0 if anksp_code_date >= psa_code_date & anksp_code_date !=.
{txt}(12,193 real changes made)

{com}. replace anksp_code =0 if psa_code_date >= anksp_code_date & psa_code_date !=.
{txt}(36,054 real changes made)

{com}. replace anksp_code =0 if ra_code_date >= anksp_code_date & ra_code_date !=.
{txt}(12,046 real changes made)

{com}. gen eia_diagnosis=1 if ra_code==1
{txt}(48,838 missing values generated)

{com}. replace eia_diagnosis=2 if psa_code==1
{txt}(24,425 real changes made)

{com}. replace eia_diagnosis=3 if anksp_code==1
{txt}(24,341 real changes made)

{com}. lab define eia_diagnosis 1 "RA" 2 "PsA" 3 "AxSpA", modify
{txt}
{com}. lab val eia_diagnosis eia_diagnosis
{txt}
{com}. tab eia_diagnosis

{txt}eia_diagnos {c |}
         is {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
         RA {c |}{res}     24,337       33.29       33.29
{txt}        PsA {c |}{res}     24,425       33.41       66.70
{txt}      AxSpA {c |}{res}     24,341       33.30      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     73,103      100.00
{txt}
{com}. drop if eia_diagnosis==.
{txt}(72 observations deleted)

{com}. 
. *Define appointments and referrals======================================*/
. 
. **Rheumatology appt 
. tab rheum_appt  //proportion with first rheum outpatient date in the year before EIA code appears in GP record 

 {txt}rheum_appt {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      7,291        9.97        9.97
{txt}          1 {c |}{res}     65,812       90.03      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     73,103      100.00
{txt}
{com}. tab rheum_appt if rheum_appt_date<eia_code_date & rheum_appt_date!=. //confirm proportion who had rheum appt (i.e. not missing) and appt before EIA code 

 {txt}rheum_appt {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}     40,548      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     40,548      100.00
{txt}
{com}. 
. **Rheumatology referrals
. tab referral_rheum_prerheum //last rheum referral in the year before rheumatology outpatient (requires rheum appt to have been present)

{txt}referral_rh {c |}
eum_prerheu {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      7,334       10.03       10.03
{txt}          1 {c |}{res}     65,769       89.97      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     73,103      100.00
{txt}
{com}. tab referral_rheum_prerheum if rheum_appt!=0  //last rheum referral in the year before rheumatology outpatient if rheum appt date present

{txt}referral_rh {c |}
eum_prerheu {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      6,597       10.02       10.02
{txt}          1 {c |}{res}     59,215       89.98      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     65,812      100.00
{txt}
{com}. tab referral_rheum_prerheum if rheum_appt!=0 & referral_rheum_prerheum_date<rheum_appt_date  //last rheum referral in the year before rheumatology outpatient, assuming ref date before rheum appt date

{txt}referral_rh {c |}
eum_prerheu {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}     29,807      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     29,807      100.00
{txt}
{com}. tab referral_rheum_precode //last rheum referral in the year before EIA code (could use if rheum appt missing)

{txt}referral_rh {c |}
eum_precode {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      7,311       10.00       10.00
{txt}          1 {c |}{res}     65,792       90.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     73,103      100.00
{txt}
{com}. gen referral_rheum_comb_date = referral_rheum_prerheum_date if referral_rheum_prerheum_date!=.
{txt}(7,334 missing values generated)

{com}. replace referral_rheum_comb_date = referral_rheum_precode_date if referral_rheum_prerheum_date==. & referral_rheum_precode_date!=.
{txt}(6,597 real changes made)

{com}. format %td referral_rheum_comb_date
{txt}
{com}. 
. **GP appointments
. tab last_gp_refrheum //proportion with last GP appointment in year before rheum referral (pre-rheum appt)

{txt}last_gp_ref {c |}
      rheum {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      7,383       10.10       10.10
{txt}          1 {c |}{res}     65,720       89.90      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     73,103      100.00
{txt}
{com}. gen all_appts=1 if last_gp_refrheum==1 & referral_rheum_prerheum==1 & rheum_appt==1 & eia_code==1 & last_gp_refrheum_date<referral_rheum_prerheum_date & referral_rheum_prerheum_date<rheum_appt_date & rheum_appt_date<eia_code_date 
{txt}(70,195 missing values generated)

{com}. recode all_appts .=0
{txt}(all_appts: 70195 changes made)

{com}. tab all_appts //KEY - proportion who had a last gp appt, then rheum ref, then rheum appt, then EIA code 

  {txt}all_appts {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     70,195       96.02       96.02
{txt}          1 {c |}{res}      2,908        3.98      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     73,103      100.00
{txt}
{com}. tab last_gp_refcode     if referral_rheum_precode!=0 //last GP appointment before rheum ref if present (pre-eia code ref)

{txt}last_gp_ref {c |}
       code {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      6,581       10.00       10.00
{txt}          1 {c |}{res}     59,211       90.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     65,792      100.00
{txt}
{com}. tab last_gp_prerheum if rheum_appt!=0 //last GP appointment before rheum appt (if present)

{txt}last_gp_pre {c |}
      rheum {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      6,629       10.07       10.07
{txt}          1 {c |}{res}     59,183       89.93      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     65,812      100.00
{txt}
{com}. tab last_gp_precode //last GP appointment before EIA code

{txt}last_gp_pre {c |}
       code {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      7,353       10.06       10.06
{txt}          1 {c |}{res}     65,750       89.94      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     73,103      100.00
{txt}
{com}. 
. **For sensitivity analyses for those without rheum_appt, replace diagnosis date as EIA code date if rheum appt pre-code is missing or after
. gen eia_diagnosis_date_nomiss=rheum_appt_date if rheum_appt_date!=.
{txt}(7,291 missing values generated)

{com}. format %td eia_diagnosis_date_nomiss
{txt}
{com}. replace eia_diagnosis_date_nomiss=eia_code_date if (rheum_appt_date==. | rheum_appt_date>eia_code_date) & eia_code_date!=.
{txt}(32,512 real changes made)

{com}. gen eia_diagnosis_nomiss=1 if eia_diagnosis_date_nomiss!=.
{txt}
{com}. recode eia_diagnosis_nomiss .=0
{txt}(eia_diagnosis_nomiss: 0 changes made)

{com}. tab eia_diagnosis_nomiss

{txt}eia_diagnos {c |}
  is_nomiss {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}     73,103      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     73,103      100.00
{txt}
{com}. 
. *Define drugs and dates=====================================================*/
. 
. **csDMARDs (not including high cost MTX; wouldn't be shared care)
. gen csdmard=1 if hydroxychloroquine==1 | leflunomide==1 | methotrexate==1 | methotrexate_inj==1 | sulfasalazine==1
{txt}(43,112 missing values generated)

{com}. recode csdmard .=0 
{txt}(csdmard: 43112 changes made)

{com}. tab csdmard 

    {txt}csdmard {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     43,112       58.97       58.97
{txt}          1 {c |}{res}     29,991       41.03      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     73,103      100.00
{txt}
{com}. bys eia_diagnosis: tab csdmard

{txt}{hline}
-> eia_diagnosis = RA

    csdmard {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     14,395       59.15       59.15
{txt}          1 {c |}{res}      9,942       40.85      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     24,337      100.00

{txt}{hline}
-> eia_diagnosis = PsA

    csdmard {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     14,334       58.69       58.69
{txt}          1 {c |}{res}     10,091       41.31      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     24,425      100.00

{txt}{hline}
-> eia_diagnosis = AxSpA

    csdmard {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     14,383       59.09       59.09
{txt}          1 {c |}{res}      9,958       40.91      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     24,341      100.00

{txt}
{com}. 
. **csDMARDs (including high cost MTX)
. gen csdmard_hcd=1 if hydroxychloroquine==1 | leflunomide==1 | methotrexate==1 | methotrexate_inj==1 | methotrexate_hcd==1 | sulfasalazine==1
{txt}(38,864 missing values generated)

{com}. recode csdmard_hcd .=0 
{txt}(csdmard_hcd: 38864 changes made)

{com}. tab csdmard_hcd

{txt}csdmard_hcd {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     38,864       53.16       53.16
{txt}          1 {c |}{res}     34,239       46.84      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     73,103      100.00
{txt}
{com}. bys eia_diagnosis: tab csdmard_hcd 

{txt}{hline}
-> eia_diagnosis = RA

csdmard_hcd {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     12,921       53.09       53.09
{txt}          1 {c |}{res}     11,416       46.91      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     24,337      100.00

{txt}{hline}
-> eia_diagnosis = PsA

csdmard_hcd {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     12,965       53.08       53.08
{txt}          1 {c |}{res}     11,460       46.92      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     24,425      100.00

{txt}{hline}
-> eia_diagnosis = AxSpA

csdmard_hcd {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     12,978       53.32       53.32
{txt}          1 {c |}{res}     11,363       46.68      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     24,341      100.00

{txt}
{com}. 
. **Date of first csDMARD script (not including high cost MTX prescriptions)
. gen csdmard_date=min(hydroxychloroquine_date, leflunomide_date, methotrexate_date, methotrexate_inj_date, sulfasalazine_date)
{txt}(43,112 missing values generated)

{com}. format %td csdmard_date
{txt}
{com}. 
. **Date of first csDMARD script (including high cost MTX prescriptions)
. gen csdmard_hcd_date=min(hydroxychloroquine_date, leflunomide_date, methotrexate_date, methotrexate_inj_date, methotrexate_hcd_date, sulfasalazine_date)
{txt}(38,864 missing values generated)

{com}. format %td csdmard_hcd_date
{txt}
{com}. 
. **Biologic use
. gen biologic=1 if abatacept==1 | adalimumab==1 | baricitinib==1 | certolizumab==1 | etanercept==1 | golimumab==1 | guselkumab==1 | infliximab==1 | ixekizumab==1 | rituximab==1 | sarilumab==1 | secukinumab==1 | tocilizumab==1 | tofacitinib==1 | upadacitinib==1 | ustekinumab==1 
{txt}(13,459 missing values generated)

{com}. recode biologic .=0
{txt}(biologic: 13459 changes made)

{com}. tab biologic 

   {txt}biologic {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     13,459       18.41       18.41
{txt}          1 {c |}{res}     59,644       81.59      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     73,103      100.00
{txt}
{com}. bys eia_diagnosis: tab biologic 

{txt}{hline}
-> eia_diagnosis = RA

   biologic {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      4,475       18.39       18.39
{txt}          1 {c |}{res}     19,862       81.61      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     24,337      100.00

{txt}{hline}
-> eia_diagnosis = PsA

   biologic {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      4,496       18.41       18.41
{txt}          1 {c |}{res}     19,929       81.59      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     24,425      100.00

{txt}{hline}
-> eia_diagnosis = AxSpA

   biologic {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      4,488       18.44       18.44
{txt}          1 {c |}{res}     19,853       81.56      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     24,341      100.00

{txt}
{com}. 
. **Date of first biologic script
. gen biologic_date=min(abatacept_date, adalimumab_date, baricitinib_date, certolizumab_date, etanercept_date, golimumab_date, guselkumab_date, infliximab_date, ixekizumab_date, rituximab_date, sarilumab_date, secukinumab_date, tocilizumab_date, tofacitinib_date, upadacitinib_date, ustekinumab_date)
{txt}(13,459 missing values generated)

{com}. format %td biologic_date
{txt}
{com}. 
. **Exclude if first csdmard or biologic was before first rheum appt
. ***Nb. could introduce leeway e.g. 30 days?
. tab csdmard if rheum_appt_date!=. & csdmard_date!=. & csdmard_date<rheum_appt_date

    {txt}csdmard {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}     10,894      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     10,894      100.00
{txt}
{com}. drop if rheum_appt_date!=. & csdmard_date!=. & csdmard_date<rheum_appt_date
{txt}(10,894 observations deleted)

{com}. tab biologic if rheum_appt_date!=. & biologic_date!=. & biologic_date<rheum_appt_date 

   {txt}biologic {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}     19,010      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     19,010      100.00
{txt}
{com}. drop if rheum_appt_date!=. & biologic_date!=. & biologic_date<rheum_appt_date 
{txt}(19,010 observations deleted)

{com}. 
. *Number of EIA diagnoses in 1-year time windows=========================================*/
. 
. gen diagnosis_year=1 if eia_code_date>=td(01mar2019) & eia_code_date<td(01mar2020)
{txt}(29,306 missing values generated)

{com}. replace diagnosis_year=2 if eia_code_date>=td(01mar2020) & eia_code_date<td(01mar2021)
{txt}(13,907 real changes made)

{com}. replace diagnosis_year=3 if eia_code_date>=td(01mar2021) & eia_code_date<td(01mar2022)
{txt}(13,600 real changes made)

{com}. lab define diagnosis_year 1 "March 2019-March 2020" 2 "March 2020-March 2021" 3 "March 2021-March 2022", modify
{txt}
{com}. lab val diagnosis_year diagnosis_year
{txt}
{com}. lab var diagnosis_year "Year of diagnosis"
{txt}
{com}. tab diagnosis_year

    {txt}Year of diagnosis {c |}      Freq.     Percent        Cum.
{hline 22}{c +}{hline 35}
March 2019-March 2020 {c |}{res}     13,893       33.56       33.56
{txt}March 2020-March 2021 {c |}{res}     13,907       33.59       67.15
{txt}March 2021-March 2022 {c |}{res}     13,600       32.85      100.00
{txt}{hline 22}{c +}{hline 35}
                Total {c |}{res}     41,400      100.00
{txt}
{com}. bys eia_diagnosis: tab diagnosis_year

{txt}{hline}
-> eia_diagnosis = RA

    Year of diagnosis {c |}      Freq.     Percent        Cum.
{hline 22}{c +}{hline 35}
March 2019-March 2020 {c |}{res}      4,639       33.59       33.59
{txt}March 2020-March 2021 {c |}{res}      4,664       33.77       67.36
{txt}March 2021-March 2022 {c |}{res}      4,507       32.64      100.00
{txt}{hline 22}{c +}{hline 35}
                Total {c |}{res}     13,810      100.00

{txt}{hline}
-> eia_diagnosis = PsA

    Year of diagnosis {c |}      Freq.     Percent        Cum.
{hline 22}{c +}{hline 35}
March 2019-March 2020 {c |}{res}      4,606       33.30       33.30
{txt}March 2020-March 2021 {c |}{res}      4,690       33.90       67.20
{txt}March 2021-March 2022 {c |}{res}      4,537       32.80      100.00
{txt}{hline 22}{c +}{hline 35}
                Total {c |}{res}     13,833      100.00

{txt}{hline}
-> eia_diagnosis = AxSpA

    Year of diagnosis {c |}      Freq.     Percent        Cum.
{hline 22}{c +}{hline 35}
March 2019-March 2020 {c |}{res}      4,648       33.79       33.79
{txt}March 2020-March 2021 {c |}{res}      4,553       33.10       66.88
{txt}March 2021-March 2022 {c |}{res}      4,556       33.12      100.00
{txt}{hline 22}{c +}{hline 35}
                Total {c |}{res}     13,757      100.00

{txt}
{com}. 
. *Time to referral, appointment and EIA code=============================================*/
. 
. **Time from last GP to rheum ref before rheum appt (i.e. if appts are present and in correct time order) //Note - referral could be coded before GP appt?
. gen time_gp_rheum_ref_appt = (referral_rheum_prerheum_date - last_gp_refrheum_date) if referral_rheum_prerheum_date!=. & last_gp_refrheum_date!=. & rheum_appt_date!=. & referral_rheum_prerheum_date>last_gp_refrheum_date & referral_rheum_prerheum_date<rheum_appt_date & rheum_appt_date<eia_code_date
{txt}(42,027 missing values generated)

{com}. tabstat time_gp_rheum_ref_appt, stats (n mean p50 p25 p75) //all patients

{txt}{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_rh~t} {...}
{c |}{...}
 {res}     1172  240.5111       184        77       350
{txt}{hline 13}{c BT}{hline 50}

{com}. bys eia_diagnosis: tabstat time_gp_rheum_ref_appt, stats (n mean p50 p25 p75)

{txt}{hline}
-> eia_diagnosis = RA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_rh~t} {...}
{c |}{...}
 {res}      389  248.4036       178        78       361
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = PsA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_rh~t} {...}
{c |}{...}
 {res}      398   226.294     180.5        73       343
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = AxSpA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_rh~t} {...}
{c |}{...}
 {res}      385  247.2338       195        84       343
{txt}{hline 13}{c BT}{hline 50}

{com}. 
. **Time from last GP to rheum ref before eia code (sensitivity analysis; includes those with no rheum appt)
. gen time_gp_rheum_ref_code = (referral_rheum_precode_date - last_gp_refcode_date) if referral_rheum_precode_date!=. & last_gp_refcode_date!=. & referral_rheum_precode_date>last_gp_refcode_date & referral_rheum_precode_date<eia_code_date
{txt}(35,740 missing values generated)

{com}. tabstat time_gp_rheum_ref_code, stats (n mean p50 p25 p75)

{txt}{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_rh~e} {...}
{c |}{...}
 {res}     7459  379.4851       315       140       563
{txt}{hline 13}{c BT}{hline 50}

{com}. bys eia_diagnosis: tabstat time_gp_rheum_ref_code, stats (n mean p50 p25 p75)

{txt}{hline}
-> eia_diagnosis = RA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_rh~e} {...}
{c |}{...}
 {res}     2519  386.0282       323       142       569
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = PsA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_rh~e} {...}
{c |}{...}
 {res}     2479   369.315       298       139       550
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = AxSpA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_rh~e} {...}
{c |}{...}
 {res}     2461  383.0321       323       138       576
{txt}{hline 13}{c BT}{hline 50}

{com}. 
. **Time from last GP to rheum ref (combined - sensitivity analysis; includes those with no rheum appt)
. gen time_gp_rheum_ref_comb = time_gp_rheum_ref_appt 
{txt}(42,027 missing values generated)

{com}. replace time_gp_rheum_ref_comb = time_gp_rheum_ref_code if time_gp_rheum_ref_appt==. & time_gp_rheum_ref_code!=.
{txt}(7,193 real changes made)

{com}. tabstat time_gp_rheum_ref_comb, stats (n mean p50 p25 p75)

{txt}{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_rh~b} {...}
{c |}{...}
 {res}     8365  359.0964       293       129       534
{txt}{hline 13}{c BT}{hline 50}

{com}. bys eia_diagnosis: tabstat time_gp_rheum_ref_comb, stats (n mean p50 p25 p75)

{txt}{hline}
-> eia_diagnosis = RA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_rh~b} {...}
{c |}{...}
 {res}     2819  367.6087       300       131       547
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = PsA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_rh~b} {...}
{c |}{...}
 {res}     2781  347.5458       281       129       518
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = AxSpA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_rh~b} {...}
{c |}{...}
 {res}     2765  362.0351       302       128       540
{txt}{hline 13}{c BT}{hline 50}

{com}. 
. **Time from last GP pre-rheum appt to first rheum appt (sensitivity analysis; includes those with no rheum ref)
. gen time_gp_rheum_appt = (rheum_appt_date - last_gp_prerheum_date) if rheum_appt_date!=. & last_gp_prerheum_date!=. & rheum_appt_date>last_gp_prerheum_date & rheum_appt_date<eia_code_date
{txt}(36,564 missing values generated)

{com}. tabstat time_gp_rheum_appt, stats (n mean p50 p25 p75)

{txt}{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_~m_appt} {...}
{c |}{...}
 {res}     6635  291.6482       229       103       415
{txt}{hline 13}{c BT}{hline 50}

{com}. bys eia_diagnosis: tabstat time_gp_rheum_appt, stats (n mean p50 p25 p75)

{txt}{hline}
-> eia_diagnosis = RA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_~m_appt} {...}
{c |}{...}
 {res}     2237  288.5324       220        98       415
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = PsA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_~m_appt} {...}
{c |}{...}
 {res}     2227  294.8159       235       107       417
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = AxSpA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_~m_appt} {...}
{c |}{...}
 {res}     2171  291.6094       228       105       414
{txt}{hline 13}{c BT}{hline 50}

{com}. 
. **Time from last GP pre-code to EIA code (sensitivity analysis; includes those with no rheum ref and/or no rheum appt)
. gen time_gp_eia_code = (eia_code_date - last_gp_precode_date) if eia_code_date!=. & last_gp_precode_date!=. & eia_code_date>last_gp_precode_date
{txt}(19,226 missing values generated)

{com}. tabstat time_gp_eia_code, stats (n mean p50 p25 p75)

{txt}{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_ei~e} {...}
{c |}{...}
 {res}    23973  519.9612       469       231       768
{txt}{hline 13}{c BT}{hline 50}

{com}. bys eia_diagnosis: tabstat time_gp_eia_code, stats (n mean p50 p25 p75)

{txt}{hline}
-> eia_diagnosis = RA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_ei~e} {...}
{c |}{...}
 {res}     7989  521.9777       474       234       770
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = PsA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_ei~e} {...}
{c |}{...}
 {res}     7985  521.8681       469       235       772
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = AxSpA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_ei~e} {...}
{c |}{...}
 {res}     7999  516.0435       461       224       765
{txt}{hline 13}{c BT}{hline 50}

{com}. 
. **Time from last GP to EIA diagnosis (combined - sensitivity analysis; includes those with no rheum appt)
. gen time_gp_eia_diag = time_gp_rheum_appt
{txt}(36,564 missing values generated)

{com}. replace time_gp_eia_diag = time_gp_eia_code if time_gp_rheum_appt==. & time_gp_eia_code!=.
{txt}(19,796 real changes made)

{com}. tabstat time_gp_eia_diag, stats (n mean p50 p25 p75)

{txt}{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_ei~g} {...}
{c |}{...}
 {res}    26431  456.2475       385       179       679
{txt}{hline 13}{c BT}{hline 50}

{com}. bys eia_diagnosis: tabstat time_gp_eia_diag, stats (n mean p50 p25 p75)

{txt}{hline}
-> eia_diagnosis = RA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_ei~g} {...}
{c |}{...}
 {res}     8790  455.1742       385       177       677
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = PsA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_ei~g} {...}
{c |}{...}
 {res}     8806  456.7573       387       183       675
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = AxSpA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_ei~g} {...}
{c |}{...}
 {res}     8835  456.8071       384       176       686
{txt}{hline 13}{c BT}{hline 50}

{com}. 
. **Time from rheum ref to rheum appt (i.e. if appts are present and in correct time order)
. gen time_ref_rheum_appt = (rheum_appt_date - referral_rheum_prerheum_date) if rheum_appt_date!=. & referral_rheum_prerheum_date!=. & referral_rheum_prerheum_date<rheum_appt_date & rheum_appt_date<eia_code_date
{txt}(36,413 missing values generated)

{com}. tabstat time_ref_rheum_appt, stats (n mean p50 p25 p75)

{txt}{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_ref_r~t} {...}
{c |}{...}
 {res}     6786  292.2809       233       101       420
{txt}{hline 13}{c BT}{hline 50}

{com}. bys eia_diagnosis: tabstat time_ref_rheum_appt, stats (n mean p50 p25 p75)

{txt}{hline}
-> eia_diagnosis = RA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_ref_r~t} {...}
{c |}{...}
 {res}     2265  290.2901       226        99       421
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = PsA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_ref_r~t} {...}
{c |}{...}
 {res}     2268  306.1892       243       108     442.5
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = AxSpA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_ref_r~t} {...}
{c |}{...}
 {res}     2253  280.2814       229        94       401
{txt}{hline 13}{c BT}{hline 50}

{com}. 
. **Time from rheum ref to EIA code (sensitivity analysis; includes those with no rheum appt)
. gen time_ref_rheum_eia = (eia_code_date - referral_rheum_precode_date) if eia_code_date!=. & referral_rheum_precode_date!=. & referral_rheum_precode_date<eia_code_date  
{txt}(19,177 missing values generated)

{com}. tabstat time_ref_rheum_eia, stats (n mean p50 p25 p75)

{txt}{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_ref_r~a} {...}
{c |}{...}
 {res}    24022  518.3501       464       228       765
{txt}{hline 13}{c BT}{hline 50}

{com}. bys eia_diagnosis: tabstat time_ref_rheum_eia, stats (n mean p50 p25 p75)

{txt}{hline}
-> eia_diagnosis = RA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_ref_r~a} {...}
{c |}{...}
 {res}     8052  517.7875       464       223       765
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = PsA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_ref_r~a} {...}
{c |}{...}
 {res}     8043  519.6535       466       234       764
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = AxSpA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_ref_r~a} {...}
{c |}{...}
 {res}     7927   517.599       461       227       766
{txt}{hline 13}{c BT}{hline 50}

{com}. 
. **Time from rheum ref to EIA diagnosis (combined - sensitivity analysis; includes those with no rheum appt)
. gen time_ref_rheum_eia_comb = time_ref_rheum_appt
{txt}(36,413 missing values generated)

{com}. replace time_ref_rheum_eia_comb = time_ref_rheum_eia if time_ref_rheum_appt==. & time_ref_rheum_eia!=.
{txt}(19,746 real changes made)

{com}. tabstat time_ref_rheum_eia_comb, stats (n mean p50 p25 p75)

{txt}{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_ref_r~b} {...}
{c |}{...}
 {res}    26532  453.2208       383       174       673
{txt}{hline 13}{c BT}{hline 50}

{com}. bys eia_diagnosis: tabstat time_ref_rheum_eia_comb, stats (n mean p50 p25 p75)

{txt}{hline}
-> eia_diagnosis = RA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_ref_r~b} {...}
{c |}{...}
 {res}     8863  451.2342       380       168       672
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = PsA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_ref_r~b} {...}
{c |}{...}
 {res}     8878  459.0408     393.5       182       677
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = AxSpA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_ref_r~b} {...}
{c |}{...}
 {res}     8791   449.346       374       173       670
{txt}{hline 13}{c BT}{hline 50}

{com}. 
. **Time from rheum appt to EIA code (i.e. if appts are present and in correct time order)
. gen time_rheum_eia_code = (eia_code_date - rheum_appt_date) if eia_code_date!=. & rheum_appt_date!=. & rheum_appt_date<eia_code_date 
{txt}(14,094 missing values generated)

{com}. tabstat time_rheum_eia_code, stats (n mean p50 p25 p75) 

{txt}{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_rheum~e} {...}
{c |}{...}
 {res}    29105   599.484       569       315       865
{txt}{hline 13}{c BT}{hline 50}

{com}. bys eia_diagnosis: tabstat time_rheum_eia_code, stats (n mean p50 p25 p75) 

{txt}{hline}
-> eia_diagnosis = RA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_rheum~e} {...}
{c |}{...}
 {res}     9756  597.0038     568.5       315       859
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = PsA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_rheum~e} {...}
{c |}{...}
 {res}     9691  596.5027       567       312       861
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = AxSpA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_rheum~e} {...}
{c |}{...}
 {res}     9658  604.9809       572       319       876
{txt}{hline 13}{c BT}{hline 50}

{com}. 
. ***************************************************************************************************************************
. *Time to first prescription - all of the below are shared care prescriptions, aside from those with MTX_high cost drug data included
. 
. **Time to first csDMARD script for RA patients, whereby first rheum appt is classed as diagnosis date (assumes rheum appt present; not including high cost MTX prescriptions)
. gen time_to_csdmard=(csdmard_date-rheum_appt_date) if csdmard==1 & rheum_appt_date!=. & csdmard_date>rheum_appt_date 
{txt}(30,704 missing values generated)

{com}. tabstat time_to_csdmard if ra_code==1, stats (n mean p50 p25 p75)

{txt}{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_cs~d} {...}
{c |}{...}
 {res}     4113  560.4328       509       273       819
{txt}{hline 13}{c BT}{hline 50}

{com}. 
. **Time to first csDMARD script for RA patients (including high cost MTX prescriptions)
. gen time_to_csdmard_hcd=(csdmard_hcd_date-rheum_appt_date) if csdmard_hcd==1 & rheum_appt_date!=. & csdmard_hcd_date>rheum_appt_date 
{txt}(29,121 missing values generated)

{com}. tabstat time_to_csdmard_hcd if ra_code==1, stats (n mean p50 p25 p75) 

{txt}{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_c~cd} {...}
{c |}{...}
 {res}     4674  553.7903       497       266       815
{txt}{hline 13}{c BT}{hline 50}

{com}. 
. **Time to first csDMARD script for PsA patients (not including high cost MTX prescriptions)
. tabstat time_to_csdmard if psa_code==1, stats (n mean p50 p25 p75)

{txt}{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_c~rd} {...}
{c |}{...}
 {res}     4244  557.7651       519       267       817
{txt}{hline 13}{c BT}{hline 50}

{com}. tab csdmard if rheum_appt_date!=. & csdmard_date<rheum_appt_date & psa_code==1 
{txt}no observations

{com}. 
. **Time to first csDMARD script for PsA patients (including high cost MTX prescriptions)
. tabstat time_to_csdmard_hcd if psa_code==1, stats (n mean p50 p25 p75) 

{txt}{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_c~cd} {...}
{c |}{...}
 {res}     4759   553.921       511       265       816
{txt}{hline 13}{c BT}{hline 50}

{com}. tab csdmard_hcd if rheum_appt_date!=. & csdmard_hcd_date<rheum_appt_date & psa_code==1  

{txt}csdmard_hcd {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}        235      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        235      100.00
{txt}
{com}. 
. **csDMARD time categories for RA patients (not including high cost MTX prescriptions)
. gen csdmard_6w=1 if time_to_csdmard<=42 & time_to_csdmard!=. 
{txt}(42,764 missing values generated)

{com}. recode csdmard_6w .=0
{txt}(csdmard_6w: 42764 changes made)

{com}. tab csdmard_6w if ra_code==1

 {txt}csdmard_6w {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     14,272       98.97       98.97
{txt}          1 {c |}{res}        148        1.03      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,420      100.00
{txt}
{com}. gen csdmard_3m=1 if time_to_csdmard<=90 & time_to_csdmard!=. 
{txt}(42,283 missing values generated)

{com}. recode csdmard_3m .=0
{txt}(csdmard_3m: 42283 changes made)

{com}. tab csdmard_3m if ra_code==1

 {txt}csdmard_3m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     14,111       97.86       97.86
{txt}          1 {c |}{res}        309        2.14      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,420      100.00
{txt}
{com}. gen csdmard_6m=1 if time_to_csdmard<=180 & time_to_csdmard!=. 
{txt}(41,289 missing values generated)

{com}. recode csdmard_6m .=0
{txt}(csdmard_6m: 41289 changes made)

{com}. tab csdmard_6m if ra_code==1

 {txt}csdmard_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     13,759       95.42       95.42
{txt}          1 {c |}{res}        661        4.58      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,420      100.00
{txt}
{com}. gen csdmard_12m=1 if time_to_csdmard<=365 & time_to_csdmard!=. 
{txt}(38,931 missing values generated)

{com}. recode csdmard_12m .=0
{txt}(csdmard_12m: 38931 changes made)

{com}. tab csdmard_12m if ra_code==1

{txt}csdmard_12m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     13,001       90.16       90.16
{txt}          1 {c |}{res}      1,419        9.84      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,420      100.00
{txt}
{com}. 
. **csDMARD time categories for RA patients (including high cost MTX prescriptions)
. gen csdmard_hcd_6w=1 if time_to_csdmard_hcd<=42 & time_to_csdmard_hcd!=.
{txt}(42,697 missing values generated)

{com}. recode csdmard_hcd_6w .=0
{txt}(csdmard_hcd_6w: 42697 changes made)

{com}. tab csdmard_hcd_6w if ra_code==1

{txt}csdmard_hcd {c |}
        _6w {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     14,247       98.80       98.80
{txt}          1 {c |}{res}        173        1.20      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,420      100.00
{txt}
{com}. gen csdmard_hcd_3m=1 if time_to_csdmard_hcd<=90 & time_to_csdmard_hcd!=.
{txt}(42,144 missing values generated)

{com}. recode csdmard_hcd_3m .=0
{txt}(csdmard_hcd_3m: 42144 changes made)

{com}. tab csdmard_hcd_3m if ra_code==1

{txt}csdmard_hcd {c |}
        _3m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     14,058       97.49       97.49
{txt}          1 {c |}{res}        362        2.51      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,420      100.00
{txt}
{com}. gen csdmard_hcd_6m=1 if time_to_csdmard_hcd<=180 & time_to_csdmard_hcd!=.
{txt}(40,976 missing values generated)

{com}. recode csdmard_hcd_6m .=0
{txt}(csdmard_hcd_6m: 40976 changes made)

{com}. tab csdmard_hcd_6m if ra_code==1

{txt}csdmard_hcd {c |}
        _6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     13,653       94.68       94.68
{txt}          1 {c |}{res}        767        5.32      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,420      100.00
{txt}
{com}. gen csdmard_hcd_12m=1 if time_to_csdmard_hcd<=365 & time_to_csdmard_hcd!=.
{txt}(38,288 missing values generated)

{com}. recode csdmard_hcd_12m .=0
{txt}(csdmard_hcd_12m: 38288 changes made)

{com}. tab csdmard_hcd_12m if ra_code==1

{txt}csdmard_hcd {c |}
       _12m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     12,757       88.47       88.47
{txt}          1 {c |}{res}      1,663       11.53      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,420      100.00
{txt}
{com}. 
. **csDMARD time categories for PsA patients (not including high cost MTX prescriptions)
. tab csdmard_6w if psa_code==1

 {txt}csdmard_6w {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     14,277       98.97       98.97
{txt}          1 {c |}{res}        148        1.03      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,425      100.00
{txt}
{com}. tab csdmard_3m if psa_code==1

 {txt}csdmard_3m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     14,105       97.78       97.78
{txt}          1 {c |}{res}        320        2.22      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,425      100.00
{txt}
{com}. tab csdmard_6m if psa_code==1

 {txt}csdmard_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     13,763       95.41       95.41
{txt}          1 {c |}{res}        662        4.59      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,425      100.00
{txt}
{com}. tab csdmard_12m if psa_code==1

{txt}csdmard_12m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     12,928       89.62       89.62
{txt}          1 {c |}{res}      1,497       10.38      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,425      100.00
{txt}
{com}. 
. **csDMARD time categories for PsA patients (including high cost MTX prescriptions)
. tab csdmard_hcd_6w if psa_code==1

{txt}csdmard_hcd {c |}
        _6w {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     14,249       98.78       98.78
{txt}          1 {c |}{res}        176        1.22      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,425      100.00
{txt}
{com}. tab csdmard_hcd_3m if psa_code==1

{txt}csdmard_hcd {c |}
        _3m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     14,068       97.53       97.53
{txt}          1 {c |}{res}        357        2.47      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,425      100.00
{txt}
{com}. tab csdmard_hcd_6m if psa_code==1

{txt}csdmard_hcd {c |}
        _6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     13,659       94.69       94.69
{txt}          1 {c |}{res}        766        5.31      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,425      100.00
{txt}
{com}. tab csdmard_hcd_12m if psa_code==1

{txt}csdmard_hcd {c |}
       _12m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     12,727       88.23       88.23
{txt}          1 {c |}{res}      1,698       11.77      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,425      100.00
{txt}
{com}. 
. **What was first shared care csDMARD (not including high cost MTX prescriptions)
. gen first_csD=""
{txt}(43,199 missing values generated)

{com}. foreach var of varlist hydroxychloroquine_date leflunomide_date methotrexate_date methotrexate_inj_date sulfasalazine_date {c -(}
{txt}  2{com}.         replace first_csD="`var'" if csdmard_date==`var' & csdmard_date!=.
{txt}  3{com}.         {c )-}
{txt}variable {bf}first_csD{sf} was {bf}{res}str1{sf}{txt} now {bf}{res}str23{sf}
{txt}(3,001 real changes made)
(3,124 real changes made)
(3,201 real changes made)
(3,079 real changes made)
(3,073 real changes made)

{com}. gen first_csDMARD = substr(first_csD, 1, length(first_csD) - 5) if first_csD!=""
{txt}(27,723 missing values generated)

{com}. drop first_csD
{txt}
{com}. tab first_csDMARD if ra_code==1 //for RA patients

     {txt}first_csDMARD {c |}      Freq.     Percent        Cum.
{hline 19}{c +}{hline 35}
hydroxychloroquine {c |}{res}        985       19.25       19.25
{txt}       leflunomide {c |}{res}      1,037       20.27       39.52
{txt}      methotrexate {c |}{res}      1,022       19.97       59.49
{txt}  methotrexate_inj {c |}{res}      1,034       20.21       79.70
{txt}     sulfasalazine {c |}{res}      1,039       20.30      100.00
{txt}{hline 19}{c +}{hline 35}
             Total {c |}{res}      5,117      100.00
{txt}
{com}. tab first_csDMARD if psa_code==1 //for PsA patients

     {txt}first_csDMARD {c |}      Freq.     Percent        Cum.
{hline 19}{c +}{hline 35}
hydroxychloroquine {c |}{res}        987       18.87       18.87
{txt}       leflunomide {c |}{res}      1,103       21.09       39.95
{txt}      methotrexate {c |}{res}      1,088       20.80       60.75
{txt}  methotrexate_inj {c |}{res}      1,047       20.02       80.77
{txt}     sulfasalazine {c |}{res}      1,006       19.23      100.00
{txt}{hline 19}{c +}{hline 35}
             Total {c |}{res}      5,231      100.00
{txt}
{com}. 
. 
. **What was first csDMARD (including high cost MTX prescriptions)
. gen first_csD_hcd=""
{txt}(43,199 missing values generated)

{com}. foreach var of varlist hydroxychloroquine_date leflunomide_date methotrexate_date methotrexate_inj_date methotrexate_hcd_date sulfasalazine_date {c -(}
{txt}  2{com}.         replace first_csD_hcd="`var'" if csdmard_hcd_date==`var' & csdmard_hcd_date!=.
{txt}  3{com}.         {c )-}
{txt}variable {bf}first_csD_hcd{sf} was {bf}{res}str1{sf}{txt} now {bf}{res}str23{sf}
{txt}(2,843 real changes made)
(2,973 real changes made)
(3,034 real changes made)
(2,899 real changes made)
(3,565 real changes made)
(2,885 real changes made)

{com}. gen first_csDMARD_hcd = substr(first_csD_hcd, 1, length(first_csD_hcd) - 5) if first_csD_hcd!=""
{txt}(25,004 missing values generated)

{com}. drop first_csD_hcd
{txt}
{com}. tab first_csDMARD_hcd if ra_code==1 //for RA patients

 {txt}first_csDMARD_hcd {c |}      Freq.     Percent        Cum.
{hline 19}{c +}{hline 35}
hydroxychloroquine {c |}{res}        940       15.52       15.52
{txt}       leflunomide {c |}{res}        979       16.16       31.68
{txt}      methotrexate {c |}{res}        975       16.09       47.77
{txt}  methotrexate_hcd {c |}{res}      1,222       20.17       67.94
{txt}  methotrexate_inj {c |}{res}        973       16.06       84.00
{txt}     sulfasalazine {c |}{res}        969       16.00      100.00
{txt}{hline 19}{c +}{hline 35}
             Total {c |}{res}      6,058      100.00
{txt}
{com}. tab first_csDMARD_hcd if psa_code==1 //for PsA patients

 {txt}first_csDMARD_hcd {c |}      Freq.     Percent        Cum.
{hline 19}{c +}{hline 35}
hydroxychloroquine {c |}{res}        937       15.32       15.32
{txt}       leflunomide {c |}{res}      1,054       17.24       32.56
{txt}      methotrexate {c |}{res}      1,022       16.71       49.27
{txt}  methotrexate_hcd {c |}{res}      1,161       18.99       68.26
{txt}  methotrexate_inj {c |}{res}        984       16.09       84.35
{txt}     sulfasalazine {c |}{res}        957       15.65      100.00
{txt}{hline 19}{c +}{hline 35}
             Total {c |}{res}      6,115      100.00
{txt}
{com}.  
. **Methotrexate use (not including high cost MTX prescriptions)
. gen mtx=1 if methotrexate==1 | methotrexate_inj==1
{txt}(36,007 missing values generated)

{com}. recode mtx .=0 
{txt}(mtx: 36007 changes made)

{com}. tab mtx if ra_code==1 //for RA patients

        {txt}mtx {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     12,056       83.61       83.61
{txt}          1 {c |}{res}      2,364       16.39      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,420      100.00
{txt}
{com}. tab mtx if psa_code==1 //for PsA patients

        {txt}mtx {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     11,978       83.04       83.04
{txt}          1 {c |}{res}      2,447       16.96      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,425      100.00
{txt}
{com}. 
. **Methotrexate use (including high cost MTX prescriptions)
. gen mtx_hcd=1 if methotrexate==1 | methotrexate_inj==1 | methotrexate_hcd==1
{txt}(32,489 missing values generated)

{com}. recode mtx_hcd .=0 
{txt}(mtx_hcd: 32489 changes made)

{com}. tab mtx_hcd if ra_code==1 //for RA patients

    {txt}mtx_hcd {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     10,846       75.21       75.21
{txt}          1 {c |}{res}      3,574       24.79      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,420      100.00
{txt}
{com}. tab mtx_hcd if psa_code==1 //for PsA patients

    {txt}mtx_hcd {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     10,861       75.29       75.29
{txt}          1 {c |}{res}      3,564       24.71      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,425      100.00
{txt}
{com}. 
. **Date of first methotrexate script (not including high cost MTX prescriptions)
. gen mtx_date=min(methotrexate_date, methotrexate_inj_date)
{txt}(36,007 missing values generated)

{com}. format %td mtx_date
{txt}
{com}. 
. **Date of first methotrexate script (including high cost MTX prescriptions)
. gen mtx_hcd_date=min(methotrexate_date, methotrexate_inj_date, methotrexate_hcd_date)
{txt}(32,489 missing values generated)

{com}. format %td mtx_hcd_date
{txt}
{com}. 
. **Time to first methotrexate script for RA patients (not including high cost MTX prescriptions)
. gen time_to_mtx=(mtx_date-rheum_appt_date) if mtx==1 & rheum_appt_date!=. & mtx_date>rheum_appt_date 
{txt}(37,389 missing values generated)

{com}. tabstat time_to_mtx if ra_code==1, stats (n mean p50 p25 p75)

{txt}{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_mtx} {...}
{c |}{...}
 {res}     1917   590.663       549       301       853
{txt}{hline 13}{c BT}{hline 50}

{com}. 
. **Time to first methotrexate script for RA patients (including high cost MTX prescriptions)
. gen time_to_mtx_hcd=(mtx_hcd_date-rheum_appt_date) if mtx_hcd==1 & rheum_appt_date!=. & mtx_hcd_date>rheum_appt_date 
{txt}(35,169 missing values generated)

{com}. tabstat time_to_mtx_hcd if ra_code==1, stats (n mean p50 p25 p75)

{txt}{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_mt~d} {...}
{c |}{...}
 {res}     2693  578.9343       529       291       846
{txt}{hline 13}{c BT}{hline 50}

{com}. 
. **Time to first methotrexate script for PsA patients (not including high cost MTX prescriptions)
. tabstat time_to_mtx if psa_code==1, stats (n mean p50 p25 p75)

{txt}{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_mtx} {...}
{c |}{...}
 {res}     1997  584.6319       552       291       855
{txt}{hline 13}{c BT}{hline 50}

{com}. tab mtx if rheum_appt_date!=. & mtx_date<rheum_appt_date & psa_code==1 //how many patients had precriptions pre-rheum appt
{txt}no observations

{com}. 
. **Time to first methotrexate script for PsA patients (including high cost MTX prescriptions)
. tabstat time_to_mtx_hcd if psa_code==1, stats (n mean p50 p25 p75)

{txt}{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_mt~d} {...}
{c |}{...}
 {res}     2693  576.3071       542       286       846
{txt}{hline 13}{c BT}{hline 50}

{com}. tab mtx_hcd if rheum_appt_date!=. & mtx_hcd_date<rheum_appt_date & psa_code==1 //how many patients had precriptions pre-rheum appt

    {txt}mtx_hcd {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}        235      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        235      100.00
{txt}
{com}. 
. **Methotrexate time categories for RA patients (not including high-cost MTX) //Nb. this is time period from rheum appt (i.e. diagnosis) to shared care, not from referral to first script 
. gen mtx_6w=1 if time_to_mtx<=42 & time_to_mtx!=.
{txt}(43,025 missing values generated)

{com}. recode mtx_6w .=0
{txt}(mtx_6w: 43025 changes made)

{com}. tab mtx_6w if ra_code==1

     {txt}mtx_6w {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     14,375       99.69       99.69
{txt}          1 {c |}{res}         45        0.31      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,420      100.00
{txt}
{com}. gen mtx_3m=1 if time_to_mtx<=90 & time_to_mtx!=.
{txt}(42,818 missing values generated)

{com}. recode mtx_3m .=0
{txt}(mtx_3m: 42818 changes made)

{com}. tab mtx_3m if ra_code==1

     {txt}mtx_3m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     14,313       99.26       99.26
{txt}          1 {c |}{res}        107        0.74      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,420      100.00
{txt}
{com}. gen mtx_6m=1 if time_to_mtx<=180 & time_to_mtx!=.
{txt}(42,406 missing values generated)

{com}. recode mtx_6m .=0
{txt}(mtx_6m: 42406 changes made)

{com}. tab mtx_6m if ra_code==1

     {txt}mtx_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     14,151       98.13       98.13
{txt}          1 {c |}{res}        269        1.87      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,420      100.00
{txt}
{com}. gen mtx_12m=1 if time_to_mtx<=365 & time_to_mtx!=.
{txt}(41,361 missing values generated)

{com}. recode mtx_12m .=0
{txt}(mtx_12m: 41361 changes made)

{com}. tab mtx_12m if ra_code==1

    {txt}mtx_12m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     13,825       95.87       95.87
{txt}          1 {c |}{res}        595        4.13      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,420      100.00
{txt}
{com}. 
. **Methotrexate time categories for RA patients (including high-cost MTX)
. gen mtx_hcd_6w=1 if time_to_mtx_hcd<=42 & time_to_mtx_hcd!=.
{txt}(42,951 missing values generated)

{com}. recode mtx_hcd_6w .=0
{txt}(mtx_hcd_6w: 42951 changes made)

{com}. tab mtx_hcd_6w if ra_code==1

 {txt}mtx_hcd_6w {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     14,348       99.50       99.50
{txt}          1 {c |}{res}         72        0.50      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,420      100.00
{txt}
{com}. gen mtx_hcd_3m=1 if time_to_mtx_hcd<=90 & time_to_mtx_hcd!=.
{txt}(42,658 missing values generated)

{com}. recode mtx_hcd_3m .=0
{txt}(mtx_hcd_3m: 42658 changes made)

{com}. tab mtx_hcd_3m if ra_code==1

 {txt}mtx_hcd_3m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     14,255       98.86       98.86
{txt}          1 {c |}{res}        165        1.14      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,420      100.00
{txt}
{com}. gen mtx_hcd_6m=1 if time_to_mtx_hcd<=180 & time_to_mtx_hcd!=.
{txt}(42,036 missing values generated)

{com}. recode mtx_hcd_6m .=0
{txt}(mtx_hcd_6m: 42036 changes made)

{com}. tab mtx_hcd_6m if ra_code==1

 {txt}mtx_hcd_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     14,033       97.32       97.32
{txt}          1 {c |}{res}        387        2.68      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,420      100.00
{txt}
{com}. gen mtx_hcd_12m=1 if time_to_mtx_hcd<=365 & time_to_mtx_hcd!=.
{txt}(40,572 missing values generated)

{com}. recode mtx_hcd_12m .=0
{txt}(mtx_hcd_12m: 40572 changes made)

{com}. tab mtx_hcd_12m if ra_code==1

{txt}mtx_hcd_12m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     13,535       93.86       93.86
{txt}          1 {c |}{res}        885        6.14      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,420      100.00
{txt}
{com}. 
. **Methotrexate time categories for PsA patients (not including high-cost MTX)
. tab mtx_6w if psa_code==1

     {txt}mtx_6w {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     14,355       99.51       99.51
{txt}          1 {c |}{res}         70        0.49      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,425      100.00
{txt}
{com}. tab mtx_3m if psa_code==1

     {txt}mtx_3m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     14,279       98.99       98.99
{txt}          1 {c |}{res}        146        1.01      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,425      100.00
{txt}
{com}. tab mtx_6m if psa_code==1

     {txt}mtx_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     14,151       98.10       98.10
{txt}          1 {c |}{res}        274        1.90      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,425      100.00
{txt}
{com}. tab mtx_12m if psa_code==1

    {txt}mtx_12m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     13,782       95.54       95.54
{txt}          1 {c |}{res}        643        4.46      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,425      100.00
{txt}
{com}. 
. **Methotrexate time categories for PsA patients (including high-cost MTX)
. tab mtx_hcd_6w if psa_code==1

 {txt}mtx_hcd_6w {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     14,323       99.29       99.29
{txt}          1 {c |}{res}        102        0.71      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,425      100.00
{txt}
{com}. tab mtx_hcd_3m if psa_code==1

 {txt}mtx_hcd_3m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     14,233       98.67       98.67
{txt}          1 {c |}{res}        192        1.33      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,425      100.00
{txt}
{com}. tab mtx_hcd_6m if psa_code==1

 {txt}mtx_hcd_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     14,025       97.23       97.23
{txt}          1 {c |}{res}        400        2.77      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,425      100.00
{txt}
{com}. tab mtx_hcd_12m if psa_code==1

{txt}mtx_hcd_12m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     13,535       93.83       93.83
{txt}          1 {c |}{res}        890        6.17      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,425      100.00
{txt}
{com}. 
. **Time to first biologic script, whereby first rheum appt is classed as diagnosis date (assumes rheum appt present)
. gen time_to_biologic=(biologic_date-rheum_appt_date) if biologic==1 & rheum_appt_date!=. & biologic_date>rheum_appt_date 
{txt}(17,454 missing values generated)

{com}. tabstat time_to_biologic, stats (n mean p50 p25 p75) //for all EIA patients

{txt}{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_bi~c} {...}
{c |}{...}
 {res}    25745  460.6367       400       207       665
{txt}{hline 13}{c BT}{hline 50}

{com}. bys eia_diagnosis: tabstat time_to_biologic, stats (n mean p50 p25 p75) 

{txt}{hline}
-> eia_diagnosis = RA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_bi~c} {...}
{c |}{...}
 {res}     8638  461.6401       398       210       661
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = PsA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_bi~c} {...}
{c |}{...}
 {res}     8584  460.4275       405       206       667
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = AxSpA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_bi~c} {...}
{c |}{...}
 {res}     8523  459.8306       399       203       667
{txt}{hline 13}{c BT}{hline 50}

{com}. 
. **What was first biologic
. gen first_bio=""
{txt}(43,199 missing values generated)

{com}. foreach var of varlist abatacept_date adalimumab_date baricitinib_date certolizumab_date etanercept_date golimumab_date guselkumab_date infliximab_date ixekizumab_date rituximab_date sarilumab_date secukinumab_date tocilizumab_date tofacitinib_date upadacitinib_date ustekinumab_date {c -(}
{txt}  2{com}.         replace first_bio="`var'" if biologic_date==`var' & biologic_date!=.
{txt}  3{com}.         {c )-}
{txt}variable {bf}first_bio{sf} was {bf}{res}str1{sf}{txt} now {bf}{res}str14{sf}
{txt}(2,045 real changes made)
variable {bf}first_bio{sf} was {bf}{res}str14{sf}{txt} now {bf}{res}str15{sf}
{txt}(1,996 real changes made)
variable {bf}first_bio{sf} was {bf}{res}str15{sf}{txt} now {bf}{res}str16{sf}
{txt}(2,033 real changes made)
variable {bf}first_bio{sf} was {bf}{res}str16{sf}{txt} now {bf}{res}str17{sf}
{txt}(1,969 real changes made)
(2,033 real changes made)
(2,047 real changes made)
(2,032 real changes made)
(1,981 real changes made)
(2,109 real changes made)
(2,043 real changes made)
(2,037 real changes made)
(1,990 real changes made)
(2,017 real changes made)
(2,002 real changes made)
(2,007 real changes made)
(2,057 real changes made)

{com}. gen first_biologic = substr(first_bio, 1, length(first_bio) - 5)        
{txt}(11,434 missing values generated)

{com}. drop first_bio
{txt}
{com}. tab first_biologic //for all EIA patients

{txt}first_biolog {c |}
          ic {c |}      Freq.     Percent        Cum.
{hline 13}{c +}{hline 35}
   abatacept {c |}{res}      1,961        6.17        6.17
{txt}  adalimumab {c |}{res}      1,929        6.07       12.25
{txt} baricitinib {c |}{res}      1,959        6.17       18.41
{txt}certolizumab {c |}{res}      1,920        6.04       24.46
{txt}  etanercept {c |}{res}      1,963        6.18       30.64
{txt}   golimumab {c |}{res}      2,002        6.30       36.94
{txt}  guselkumab {c |}{res}      1,980        6.23       43.17
{txt}  infliximab {c |}{res}      1,939        6.10       49.28
{txt}  ixekizumab {c |}{res}      2,066        6.50       55.78
{txt}   rituximab {c |}{res}      2,007        6.32       62.10
{txt}   sarilumab {c |}{res}      2,014        6.34       68.44
{txt} secukinumab {c |}{res}      1,972        6.21       74.65
{txt} tocilizumab {c |}{res}      2,005        6.31       80.96
{txt} tofacitinib {c |}{res}      1,988        6.26       87.22
{txt}upadacitinib {c |}{res}      2,003        6.31       93.52
{txt} ustekinumab {c |}{res}      2,057        6.48      100.00
{txt}{hline 13}{c +}{hline 35}
       Total {c |}{res}     31,765      100.00
{txt}
{com}. bys eia_diagnosis: tab first_biologic 

{txt}{hline}
-> eia_diagnosis = RA

first_biolog {c |}
          ic {c |}      Freq.     Percent        Cum.
{hline 13}{c +}{hline 35}
   abatacept {c |}{res}        626        5.90        5.90
{txt}  adalimumab {c |}{res}        644        6.07       11.97
{txt} baricitinib {c |}{res}        627        5.91       17.89
{txt}certolizumab {c |}{res}        668        6.30       24.18
{txt}  etanercept {c |}{res}        637        6.01       30.19
{txt}   golimumab {c |}{res}        674        6.35       36.55
{txt}  guselkumab {c |}{res}        672        6.34       42.88
{txt}  infliximab {c |}{res}        665        6.27       49.15
{txt}  ixekizumab {c |}{res}        677        6.38       55.53
{txt}   rituximab {c |}{res}        665        6.27       61.80
{txt}   sarilumab {c |}{res}        665        6.27       68.07
{txt} secukinumab {c |}{res}        662        6.24       74.32
{txt} tocilizumab {c |}{res}        688        6.49       80.80
{txt} tofacitinib {c |}{res}        652        6.15       86.95
{txt}upadacitinib {c |}{res}        707        6.67       93.62
{txt} ustekinumab {c |}{res}        677        6.38      100.00
{txt}{hline 13}{c +}{hline 35}
       Total {c |}{res}     10,606      100.00

{txt}{hline}
-> eia_diagnosis = PsA

first_biolog {c |}
          ic {c |}      Freq.     Percent        Cum.
{hline 13}{c +}{hline 35}
   abatacept {c |}{res}        674        6.37        6.37
{txt}  adalimumab {c |}{res}        621        5.87       12.23
{txt} baricitinib {c |}{res}        674        6.37       18.60
{txt}certolizumab {c |}{res}        641        6.05       24.65
{txt}  etanercept {c |}{res}        642        6.06       30.72
{txt}   golimumab {c |}{res}        684        6.46       37.18
{txt}  guselkumab {c |}{res}        642        6.06       43.24
{txt}  infliximab {c |}{res}        640        6.05       49.29
{txt}  ixekizumab {c |}{res}        702        6.63       55.92
{txt}   rituximab {c |}{res}        680        6.42       62.34
{txt}   sarilumab {c |}{res}        680        6.42       68.76
{txt} secukinumab {c |}{res}        629        5.94       74.70
{txt} tocilizumab {c |}{res}        666        6.29       81.00
{txt} tofacitinib {c |}{res}        662        6.25       87.25
{txt}upadacitinib {c |}{res}        655        6.19       93.44
{txt} ustekinumab {c |}{res}        695        6.56      100.00
{txt}{hline 13}{c +}{hline 35}
       Total {c |}{res}     10,587      100.00

{txt}{hline}
-> eia_diagnosis = AxSpA

first_biolog {c |}
          ic {c |}      Freq.     Percent        Cum.
{hline 13}{c +}{hline 35}
   abatacept {c |}{res}        661        6.25        6.25
{txt}  adalimumab {c |}{res}        664        6.28       12.53
{txt} baricitinib {c |}{res}        658        6.22       18.76
{txt}certolizumab {c |}{res}        611        5.78       24.54
{txt}  etanercept {c |}{res}        684        6.47       31.01
{txt}   golimumab {c |}{res}        644        6.09       37.10
{txt}  guselkumab {c |}{res}        666        6.30       43.40
{txt}  infliximab {c |}{res}        634        6.00       49.39
{txt}  ixekizumab {c |}{res}        687        6.50       55.89
{txt}   rituximab {c |}{res}        662        6.26       62.15
{txt}   sarilumab {c |}{res}        669        6.33       68.48
{txt} secukinumab {c |}{res}        681        6.44       74.92
{txt} tocilizumab {c |}{res}        651        6.16       81.08
{txt} tofacitinib {c |}{res}        674        6.38       87.46
{txt}upadacitinib {c |}{res}        641        6.06       93.52
{txt} ustekinumab {c |}{res}        685        6.48      100.00
{txt}{hline 13}{c +}{hline 35}
       Total {c |}{res}     10,572      100.00

{txt}
{com}. 
. **Biologic time categories (for all patients)
. gen biologic_6m=1 if time_to_biologic<=180 & time_to_biologic!=.
{txt}(37,653 missing values generated)

{com}. recode biologic_6m .=0
{txt}(biologic_6m: 37653 changes made)

{com}. tab biologic_6m //for all EIA patients

{txt}biologic_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     37,653       87.16       87.16
{txt}          1 {c |}{res}      5,546       12.84      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     43,199      100.00
{txt}
{com}. bys eia_diagnosis: tab biologic_6m 

{txt}{hline}
-> eia_diagnosis = RA

biologic_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     12,615       87.48       87.48
{txt}          1 {c |}{res}      1,805       12.52      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,420      100.00

{txt}{hline}
-> eia_diagnosis = PsA

biologic_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     12,580       87.21       87.21
{txt}          1 {c |}{res}      1,845       12.79      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,425      100.00

{txt}{hline}
-> eia_diagnosis = AxSpA

biologic_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     12,458       86.79       86.79
{txt}          1 {c |}{res}      1,896       13.21      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,354      100.00

{txt}
{com}. gen biologic_12m=1 if time_to_biologic<=365 & time_to_biologic!=.
{txt}(31,473 missing values generated)

{com}. recode biologic_12m .=0
{txt}(biologic_12m: 31473 changes made)

{com}. tab biologic_12m //for all EIA patients

{txt}biologic_12 {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     31,473       72.86       72.86
{txt}          1 {c |}{res}     11,726       27.14      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     43,199      100.00
{txt}
{com}. bys eia_diagnosis: tab biologic_12m 

{txt}{hline}
-> eia_diagnosis = RA

biologic_12 {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     10,473       72.63       72.63
{txt}          1 {c |}{res}      3,947       27.37      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,420      100.00

{txt}{hline}
-> eia_diagnosis = PsA

biologic_12 {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     10,547       73.12       73.12
{txt}          1 {c |}{res}      3,878       26.88      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,425      100.00

{txt}{hline}
-> eia_diagnosis = AxSpA

biologic_12 {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     10,453       72.82       72.82
{txt}          1 {c |}{res}      3,901       27.18      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,354      100.00

{txt}
{com}. 
. **Biologic time categories (by year)
. bys diagnosis_year: tab biologic_6m //for all EIA patients

{txt}{hline}
-> diagnosis_year = March 2019-March 2020

biologic_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     12,053       86.76       86.76
{txt}          1 {c |}{res}      1,840       13.24      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     13,893      100.00

{txt}{hline}
-> diagnosis_year = March 2020-March 2021

biologic_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     12,111       87.09       87.09
{txt}          1 {c |}{res}      1,796       12.91      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     13,907      100.00

{txt}{hline}
-> diagnosis_year = March 2021-March 2022

biologic_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     11,908       87.56       87.56
{txt}          1 {c |}{res}      1,692       12.44      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     13,600      100.00

{txt}{hline}
-> diagnosis_year = .

biologic_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      1,581       87.88       87.88
{txt}          1 {c |}{res}        218       12.12      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,799      100.00

{txt}
{com}. bys diagnosis_year eia_diagnosis: tab biologic_6m //for each diagnosis

{txt}{hline}
-> diagnosis_year = March 2019-March 2020, eia_diagnosis = RA

biologic_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      4,038       87.04       87.04
{txt}          1 {c |}{res}        601       12.96      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      4,639      100.00

{txt}{hline}
-> diagnosis_year = March 2019-March 2020, eia_diagnosis = PsA

biologic_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      3,996       86.76       86.76
{txt}          1 {c |}{res}        610       13.24      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      4,606      100.00

{txt}{hline}
-> diagnosis_year = March 2019-March 2020, eia_diagnosis = AxSpA

biologic_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      4,019       86.47       86.47
{txt}          1 {c |}{res}        629       13.53      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      4,648      100.00

{txt}{hline}
-> diagnosis_year = March 2020-March 2021, eia_diagnosis = RA

biologic_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      4,117       88.27       88.27
{txt}          1 {c |}{res}        547       11.73      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      4,664      100.00

{txt}{hline}
-> diagnosis_year = March 2020-March 2021, eia_diagnosis = PsA

biologic_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      4,073       86.84       86.84
{txt}          1 {c |}{res}        617       13.16      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      4,690      100.00

{txt}{hline}
-> diagnosis_year = March 2020-March 2021, eia_diagnosis = AxSpA

biologic_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      3,921       86.12       86.12
{txt}          1 {c |}{res}        632       13.88      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      4,553      100.00

{txt}{hline}
-> diagnosis_year = March 2021-March 2022, eia_diagnosis = RA

biologic_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      3,926       87.11       87.11
{txt}          1 {c |}{res}        581       12.89      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      4,507      100.00

{txt}{hline}
-> diagnosis_year = March 2021-March 2022, eia_diagnosis = PsA

biologic_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      3,992       87.99       87.99
{txt}          1 {c |}{res}        545       12.01      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      4,537      100.00

{txt}{hline}
-> diagnosis_year = March 2021-March 2022, eia_diagnosis = AxSpA

biologic_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      3,990       87.58       87.58
{txt}          1 {c |}{res}        566       12.42      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      4,556      100.00

{txt}{hline}
-> diagnosis_year = ., eia_diagnosis = RA

biologic_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}        534       87.54       87.54
{txt}          1 {c |}{res}         76       12.46      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        610      100.00

{txt}{hline}
-> diagnosis_year = ., eia_diagnosis = PsA

biologic_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}        519       87.67       87.67
{txt}          1 {c |}{res}         73       12.33      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        592      100.00

{txt}{hline}
-> diagnosis_year = ., eia_diagnosis = AxSpA

biologic_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}        528       88.44       88.44
{txt}          1 {c |}{res}         69       11.56      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        597      100.00

{txt}
{com}. bys diagnosis_year: tab biologic_12m //for all EIA patients

{txt}{hline}
-> diagnosis_year = March 2019-March 2020

biologic_12 {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     10,069       72.48       72.48
{txt}          1 {c |}{res}      3,824       27.52      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     13,893      100.00

{txt}{hline}
-> diagnosis_year = March 2020-March 2021

biologic_12 {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     10,119       72.76       72.76
{txt}          1 {c |}{res}      3,788       27.24      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     13,907      100.00

{txt}{hline}
-> diagnosis_year = March 2021-March 2022

biologic_12 {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      9,973       73.33       73.33
{txt}          1 {c |}{res}      3,627       26.67      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     13,600      100.00

{txt}{hline}
-> diagnosis_year = .

biologic_12 {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      1,312       72.93       72.93
{txt}          1 {c |}{res}        487       27.07      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,799      100.00

{txt}
{com}. bys diagnosis_year eia_diagnosis: tab biologic_12m //for each diagnosis

{txt}{hline}
-> diagnosis_year = March 2019-March 2020, eia_diagnosis = RA

biologic_12 {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      3,367       72.58       72.58
{txt}          1 {c |}{res}      1,272       27.42      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      4,639      100.00

{txt}{hline}
-> diagnosis_year = March 2019-March 2020, eia_diagnosis = PsA

biologic_12 {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      3,312       71.91       71.91
{txt}          1 {c |}{res}      1,294       28.09      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      4,606      100.00

{txt}{hline}
-> diagnosis_year = March 2019-March 2020, eia_diagnosis = AxSpA

biologic_12 {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      3,390       72.93       72.93
{txt}          1 {c |}{res}      1,258       27.07      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      4,648      100.00

{txt}{hline}
-> diagnosis_year = March 2020-March 2021, eia_diagnosis = RA

biologic_12 {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      3,412       73.16       73.16
{txt}          1 {c |}{res}      1,252       26.84      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      4,664      100.00

{txt}{hline}
-> diagnosis_year = March 2020-March 2021, eia_diagnosis = PsA

biologic_12 {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      3,453       73.62       73.62
{txt}          1 {c |}{res}      1,237       26.38      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      4,690      100.00

{txt}{hline}
-> diagnosis_year = March 2020-March 2021, eia_diagnosis = AxSpA

biologic_12 {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      3,254       71.47       71.47
{txt}          1 {c |}{res}      1,299       28.53      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      4,553      100.00

{txt}{hline}
-> diagnosis_year = March 2021-March 2022, eia_diagnosis = RA

biologic_12 {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      3,255       72.22       72.22
{txt}          1 {c |}{res}      1,252       27.78      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      4,507      100.00

{txt}{hline}
-> diagnosis_year = March 2021-March 2022, eia_diagnosis = PsA

biologic_12 {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      3,352       73.88       73.88
{txt}          1 {c |}{res}      1,185       26.12      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      4,537      100.00

{txt}{hline}
-> diagnosis_year = March 2021-March 2022, eia_diagnosis = AxSpA

biologic_12 {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      3,366       73.88       73.88
{txt}          1 {c |}{res}      1,190       26.12      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      4,556      100.00

{txt}{hline}
-> diagnosis_year = ., eia_diagnosis = RA

biologic_12 {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}        439       71.97       71.97
{txt}          1 {c |}{res}        171       28.03      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        610      100.00

{txt}{hline}
-> diagnosis_year = ., eia_diagnosis = PsA

biologic_12 {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}        430       72.64       72.64
{txt}          1 {c |}{res}        162       27.36      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        592      100.00

{txt}{hline}
-> diagnosis_year = ., eia_diagnosis = AxSpA

biologic_12 {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}        443       74.20       74.20
{txt}          1 {c |}{res}        154       25.80      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        597      100.00

{txt}
{com}. 
. **Create and label variables ===========================================================*/
. 
. **Demographics
. ***Sex
. gen male = 1 if sex == "M"
{txt}(21,964 missing values generated)

{com}. replace male = 0 if sex == "F"
{txt}(21,964 real changes made)

{com}. lab var male "Male"
{txt}
{com}. 
. ***Ethnicity
. replace ethnicity = .u if ethnicity == .
{txt}(10,741 real changes made, 10,741 to missing)

{com}. ****rearrange in order of prevalence
. recode ethnicity 2=6 /* mixed to 6 */
{txt}(ethnicity: 6569 changes made)

{com}. recode ethnicity 3=2 /* south asian to 2 */
{txt}(ethnicity: 3314 changes made)

{com}. recode ethnicity 4=3 /* black to 3 */
{txt}(ethnicity: 3183 changes made)

{com}. recode ethnicity 6=4 /* mixed to 4 */
{txt}(ethnicity: 6569 changes made)

{com}. recode ethnicity 5=4 /* other to 4 */
{txt}(ethnicity: 3224 changes made)

{com}. 
. label define ethnicity  1 "White"                                       ///
>                                                 2 "Asian/Asian British"         ///
>                                                 3 "Black"                                       ///
>                                                 4 "Mixed/Other"                         ///
>                                                 .u "Missing"
{txt}
{com}. label values ethnicity ethnicity
{txt}
{com}. lab var ethnicity "Ethnicity"
{txt}
{com}. 
. ***STP 
. rename stp stp_old
{res}{txt}
{com}. bysort stp_old: gen stp = 1 if _n==1
{txt}(43,197 missing values generated)

{com}. replace stp = sum(stp) //
{txt}(43,198 real changes made)

{com}. drop stp_old
{txt}
{com}. 
. ***IMD
. *Group into 5 groups
. rename imd imd_o
{res}{txt}
{com}. egen imd = cut(imd_o), group(5) icodes 
{txt}
{com}. *Add one to create groups 1-5 
. replace imd = imd + 1
{txt}(43,199 real changes made)

{com}. *-1 is missing, should be excluded from population 
. replace imd = .u if imd_o == -1
{txt}(0 real changes made)

{com}. drop imd_o
{txt}
{com}. *Reverse the order (so high is more deprived)
. recode imd 5 = 1 4 = 2 3 = 3 2 = 4 1 = 5 .u = .u
{txt}(imd: 43199 changes made)

{com}. label define imd 1 "1 least deprived" 2 "2" 3 "3" 4 "4" 5 "5 most deprived" .u "Missing"
{txt}
{com}. label values imd imd 
{txt}
{com}. lab var imd "Index of multiple deprivation"
{txt}
{com}. 
. ***Age variables
. *Nb. works if ages 18 and over
. *Create categorised age
. drop if age<18 & age !=.
{txt}(9,179 observations deleted)

{com}. drop if age>109 & age !=.
{txt}(0 observations deleted)

{com}. drop if age==.
{txt}(0 observations deleted)

{com}. lab var age "Age"
{txt}
{com}. 
. recode age 18/39.9999 = 1 /// 
>            40/49.9999 = 2 ///
>                    50/59.9999 = 3 ///
>                60/69.9999 = 4 ///
>                    70/79.9999 = 5 ///
>                    80/max = 6, gen(agegroup) 
{txt}(34020 differences between age and agegroup)

{com}. 
. label define agegroup   1 "18-39" ///
>                                                 2 "40-49" ///
>                                                 3 "50-59" ///
>                                                 4 "60-69" ///
>                                                 5 "70-79" ///
>                                                 6 "80+"
{txt}
{com}.                                                 
. label values agegroup agegroup
{txt}
{com}. lab var agegroup "Age group"
{txt}
{com}. 
. *Create binary age
. recode age min/69.999 = 0 ///
>            70/max = 1, gen(age70)
{txt}(34020 differences between age and age70)

{com}. 
. *Create restricted cubic splines for age
. mkspline age = age, cubic nknots(4)
{txt}
{com}. 
. ***Body Mass Index
. *Recode strange values 
. replace bmi_value = . if bmi_value == 0 
{txt}(13,661 real changes made, 13,661 to missing)

{com}. replace bmi_value = . if !inrange(bmi_value, 10, 80)
{txt}(133 real changes made, 133 to missing)

{com}. 
. *Restrict to within 10 years of EIA diagnosis date and aged>16 
. gen bmi_time = (eia_code_date - bmi_date)/365.25
{txt}(13,661 missing values generated)

{com}. gen bmi_age = age - bmi_time
{txt}(13,661 missing values generated)

{com}. replace bmi_value = . if bmi_age < 16 
{txt}(14,569 real changes made, 14,569 to missing)

{com}. replace bmi_value = . if bmi_time > 10 & bmi_time != . 
{txt}(3,784 real changes made, 3,784 to missing)

{com}. 
. *Set to missing if no date, and vice versa 
. replace bmi_value = . if bmi_date == . 
{txt}(0 real changes made)

{com}. replace bmi_date = . if bmi_value == . 
{txt}(18,486 real changes made, 18,486 to missing)

{com}. replace bmi_time = . if bmi_value == . 
{txt}(18,486 real changes made, 18,486 to missing)

{com}. replace bmi_age = . if bmi_value == . 
{txt}(18,486 real changes made, 18,486 to missing)

{com}. 
. *Create BMI categories
. gen     bmicat = .
{txt}(34,020 missing values generated)

{com}. recode  bmicat . = 1 if bmi_value < 18.5
{txt}(bmicat: 83 changes made)

{com}. recode  bmicat . = 2 if bmi_value < 25
{txt}(bmicat: 199 changes made)

{com}. recode  bmicat . = 3 if bmi_value < 30
{txt}(bmicat: 287 changes made)

{com}. recode  bmicat . = 4 if bmi_value < 35
{txt}(bmicat: 338 changes made)

{com}. recode  bmicat . = 5 if bmi_value < 40
{txt}(bmicat: 349 changes made)

{com}. recode  bmicat . = 6 if bmi_value < .
{txt}(bmicat: 617 changes made)

{com}. replace bmicat = .u if bmi_value >= .
{txt}(32,147 real changes made, 32,147 to missing)

{com}. 
. label define bmicat 1 "Underweight (<18.5)"     ///
>                                         2 "Normal (18.5-24.9)"          ///
>                                         3 "Overweight (25-29.9)"        ///
>                                         4 "Obese I (30-34.9)"           ///
>                                         5 "Obese II (35-39.9)"          ///
>                                         6 "Obese III (40+)"                     ///
>                                         .u "Missing"
{txt}
{com}.                                         
. label values bmicat bmicat
{txt}
{com}. lab var bmicat "BMI"
{txt}
{com}. 
. *Create less granular categorisation
. recode bmicat 1/3 .u = 1 4 = 2 5 = 3 6 = 4, gen(obese4cat)
{txt}(33937 differences between bmicat and obese4cat)

{com}. 
. label define obese4cat  1 "No record of obesity"        ///
>                                                 2 "Obese I (30-34.9)"           ///
>                                                 3 "Obese II (35-39.9)"          ///
>                                                 4 "Obese III (40+)"             
{txt}
{com}. 
. label values obese4cat obese4cat
{txt}
{com}. order obese4cat, after(bmicat)
{txt}
{com}. 
. ***Smoking 
. label define smoke 1 "Never" 2 "Former" 3 "Current" .u "Missing"
{txt}
{com}. 
. gen     smoke = 1  if smoking_status == "N"
{txt}(30,608 missing values generated)

{com}. replace smoke = 2  if smoking_status == "E"
{txt}(1,675 real changes made)

{com}. replace smoke = 3  if smoking_status == "S"
{txt}(10,140 real changes made)

{com}. replace smoke = .u if smoking_status == "M"
{txt}(1,770 real changes made, 1,770 to missing)

{com}. replace smoke = .u if smoking_status == "" 
{txt}(17,023 real changes made, 17,023 to missing)

{com}. 
. label values smoke smoke
{txt}
{com}. lab var smoke "Smoking status"
{txt}
{com}. drop smoking_status
{txt}
{com}. 
. *Create non-missing 3-category variable for current smoking (assumes missing smoking is never smoking)
. recode smoke .u = 1, gen(smoke_nomiss)
{txt}(18793 differences between smoke and smoke_nomiss)

{com}. order smoke_nomiss, after(smoke)
{txt}
{com}. label values smoke_nomiss smoke
{txt}
{com}. 
. **Clinical comorbidities
. ***eGFR
. *Set implausible creatinine values to missing (Note: zero changed to missing)
. replace creatinine_value = . if !inrange(creatinine_value, 20, 3000) 
{txt}(8,521 real changes made, 8,521 to missing)

{com}. 
. *Remove creatinine dates if no measurements, and vice versa 
. replace creatinine_value = . if creatinine_date == . 
{txt}(0 real changes made)

{com}. replace creatinine_date = . if creatinine_value == . 
{txt}(6,822 real changes made, 6,822 to missing)

{com}. replace creatinine = . if creatinine_value == .
{txt}(8,521 real changes made, 8,521 to missing)

{com}. recode creatinine .=0
{txt}(creatinine: 8521 changes made)

{com}. 
. *Divide by 88.4 (to convert umol/l to mg/dl) 
. gen SCr_adj = creatinine_value/88.4
{txt}(8,521 missing values generated)

{com}. 
. gen min = .
{txt}(34,020 missing values generated)

{com}. replace min = SCr_adj/0.7 if male==0
{txt}(12,979 real changes made)

{com}. replace min = SCr_adj/0.9 if male==1
{txt}(12,520 real changes made)

{com}. replace min = min^-0.329  if male==0
{txt}(12,979 real changes made)

{com}. replace min = min^-0.411  if male==1
{txt}(12,520 real changes made)

{com}. replace min = 1 if min<1
{txt}(19,917 real changes made)

{com}. 
. gen max=.
{txt}(34,020 missing values generated)

{com}. replace max=SCr_adj/0.7 if male==0
{txt}(12,979 real changes made)

{com}. replace max=SCr_adj/0.9 if male==1
{txt}(12,520 real changes made)

{com}. replace max=max^-1.209
{txt}(25,499 real changes made)

{com}. replace max=1 if max>1
{txt}(14,103 real changes made)

{com}. 
. gen egfr=min*max*141
{txt}(8,521 missing values generated)

{com}. replace egfr=egfr*(0.993^age)
{txt}(25,499 real changes made)

{com}. replace egfr=egfr*1.018 if male==0
{txt}(12,979 real changes made)

{com}. label var egfr "egfr calculated using CKD-EPI formula with no ethnicity"
{txt}
{com}. 
. *Categorise into ckd stages
. egen egfr_cat_all = cut(egfr), at(0, 15, 30, 45, 60, 5000)
{txt}(8521 missing values generated)

{com}. recode egfr_cat_all 0 = 5 15 = 4 30 = 3 45 = 2 60 = 0, generate(ckd_egfr)
{txt}(25499 differences between egfr_cat_all and ckd_egfr)

{com}. 
. gen egfr_cat = .
{txt}(34,020 missing values generated)

{com}. recode egfr_cat . = 3 if egfr < 30
{txt}(egfr_cat: 6071 changes made)

{com}. recode egfr_cat . = 2 if egfr < 60
{txt}(egfr_cat: 8920 changes made)

{com}. recode egfr_cat . = 1 if egfr < .
{txt}(egfr_cat: 10508 changes made)

{com}. replace egfr_cat = .u if egfr >= .
{txt}(8,521 real changes made, 8,521 to missing)

{com}. 
. label define egfr_cat   1 ">=60"                ///
>                                                 2 "30-59"               ///
>                                                 3 "<30"                 ///
>                                                 .u "Missing"
{txt}
{com}.                                         
. label values egfr_cat egfr_cat
{txt}
{com}. lab var egfr_cat "eGFR"
{txt}
{com}. 
. *If missing eGFR, assume normal
. gen egfr_cat_nomiss = egfr_cat
{txt}(8,521 missing values generated)

{com}. replace egfr_cat_nomiss = 1 if egfr_cat == .u
{txt}(8,521 real changes made)

{com}. 
. label define egfr_cat_nomiss    1 ">=60/missing"        ///
>                                                                 2 "30-59"                       ///
>                                                                 3 "<30" 
{txt}
{com}. label values egfr_cat_nomiss egfr_cat_nomiss
{txt}
{com}. lab var egfr_cat_nomiss "eGFR"
{txt}
{com}. 
. gen egfr_date = creatinine_date
{txt}(8,521 missing values generated)

{com}. format egfr_date %td
{txt}
{com}. 
. *Add in end stage renal failure and create a single CKD variable 
. *Missing assumed to not have CKD 
. gen ckd = 0
{txt}
{com}. replace ckd = 1 if ckd_egfr != . & ckd_egfr >= 1
{txt}(14,991 real changes made)

{com}. replace ckd = 1 if esrf == 1
{txt}(3,771 real changes made)

{com}. 
. label define ckd 0 "No CKD" 1 "CKD"
{txt}
{com}. label values ckd ckd
{txt}
{com}. label var ckd "Chronic kidney disease"
{txt}
{com}. 
. *Create date (most recent measure prior to index)
. gen temp1_ckd_date = creatinine_date if ckd_egfr >=1
{txt}(19,029 missing values generated)

{com}. gen temp2_ckd_date = esrf_date if esrf == 1
{txt}(27,209 missing values generated)

{com}. gen ckd_date = max(temp1_ckd_date,temp2_ckd_date) 
{txt}(15,258 missing values generated)

{com}. format ckd_date %td 
{txt}
{com}. 
. drop temp1_ckd_date temp2_ckd_date SCr_adj min max ckd_egfr egfr_cat_all
{txt}
{com}. 
. ***HbA1c
. *Set zero or negative to missing
. replace hba1c_percentage   = . if hba1c_percentage <= 0
{txt}(1,893 real changes made, 1,893 to missing)

{com}. replace hba1c_mmol_per_mol = . if hba1c_mmol_per_mol <= 0
{txt}(2,392 real changes made, 2,392 to missing)

{com}. 
. *Change implausible values to missing
. replace hba1c_percentage   = . if !inrange(hba1c_percentage, 1, 20)
{txt}(531 real changes made, 531 to missing)

{com}. replace hba1c_mmol_per_mol = . if !inrange(hba1c_mmol_per_mol, 10, 200)
{txt}(1,469 real changes made, 1,469 to missing)

{com}. 
. *Set most recent values of >24 months prior to EIA diagnosis date to missing
. replace hba1c_percentage   = . if (eia_code_date - hba1c_percentage_date) > 24*30 & hba1c_percentage_date != .
{txt}(30,674 real changes made, 30,674 to missing)

{com}. replace hba1c_mmol_per_mol = . if (eia_code_date - hba1c_mmol_per_mol_date) > 24*30 & hba1c_mmol_per_mol_date != .
{txt}(29,287 real changes made, 29,287 to missing)

{com}. 
. *Clean up dates
. replace hba1c_percentage_date = . if hba1c_percentage == .
{txt}(31,415 real changes made, 31,415 to missing)

{com}. replace hba1c_mmol_per_mol_date = . if hba1c_mmol_per_mol == .
{txt}(31,468 real changes made, 31,468 to missing)

{com}. 
. *Express  HbA1c as percentage
. *Express all values as perecentage 
. noi summ hba1c_percentage hba1c_mmol_per_mol 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
hba1c_per~ge {c |}{res}        922    4.915925    1.870883   1.053969    11.9156
{txt}hba1c_mmol~l {c |}{res}        872    43.21007    17.70632   10.55143   109.6413
{txt}
{com}. gen     hba1c_pct = hba1c_percentage 
{txt}(33,098 missing values generated)

{com}. replace hba1c_pct = (hba1c_mmol_per_mol/10.929)+2.15 if hba1c_mmol_per_mol<. 
{txt}(872 real changes made)

{com}. 
. *Valid % range between 0-20  
. replace hba1c_pct = . if !inrange(hba1c_pct, 1, 20) 
{txt}(0 real changes made)

{com}. replace hba1c_pct = round(hba1c_pct, 0.1)
{txt}(1,766 real changes made)

{com}. 
. *Categorise HbA1c and diabetes
. *Group hba1c pct
. gen     hba1ccat = 0 if hba1c_pct <  6.5
{txt}(32,799 missing values generated)

{com}. replace hba1ccat = 1 if hba1c_pct >= 6.5  & hba1c_pct < 7.5
{txt}(280 real changes made)

{com}. replace hba1ccat = 2 if hba1c_pct >= 7.5  & hba1c_pct < 8
{txt}(111 real changes made)

{com}. replace hba1ccat = 3 if hba1c_pct >= 8    & hba1c_pct < 9
{txt}(90 real changes made)

{com}. replace hba1ccat = 4 if hba1c_pct >= 9    & hba1c_pct !=.
{txt}(64 real changes made)

{com}. label define hba1ccat 0 "<6.5%" 1">=6.5-7.4" 2">=7.5-7.9" 3">=8-8.9" 4">=9"
{txt}
{com}. label values hba1ccat hba1ccat
{txt}
{com}. 
. *Express all values as mmol
. gen hba1c_mmol = hba1c_mmol_per_mol
{txt}(33,148 missing values generated)

{com}. replace hba1c_mmol = (hba1c_percentage*10.929)-23.5 if hba1c_percentage<. & hba1c_mmol==.
{txt}(894 real changes made)

{com}. 
. *Group hba1c mmol
. gen     hba1ccatmm = 0 if hba1c_mmol < 58
{txt}(32,517 missing values generated)

{com}. replace hba1ccatmm = 1 if hba1c_mmol >= 58 & hba1c_pct !=.
{txt}(263 real changes made)

{com}. replace hba1ccatmm =.u if hba1ccatmm==. 
{txt}(32,254 real changes made, 32,254 to missing)

{com}. label define hba1ccatmm 0 "HbA1c <58mmol/mol" 1 "HbA1c >=58mmol/mol" .u "Missing"
{txt}
{com}. label values hba1ccatmm hba1ccatmm
{txt}
{com}. lab var hba1ccatmm "HbA1c"
{txt}
{com}. 
. *Create diabetes, split by control/not (assumes missing = no diabetes)
. gen     diabcat = 1 if diabetes==0
{txt}(6,764 missing values generated)

{com}. replace diabcat = 2 if diabetes==1 & inlist(hba1ccat, 0, 1)
{txt}(297 real changes made)

{com}. replace diabcat = 3 if diabetes==1 & inlist(hba1ccat, 2, 3, 4)
{txt}(57 real changes made)

{com}. replace diabcat = 4 if diabetes==1 & !inlist(hba1ccat, 0, 1, 2, 3, 4)
{txt}(6,410 real changes made)

{com}. 
. label define diabcat    1 "No diabetes"                         ///
>                                                 2 "Controlled diabetes"         ///
>                                                 3 "Uncontrolled diabetes"       ///
>                                                 4 "Diabetes, no hba1c measure"
{txt}
{com}. label values diabcat diabcat
{txt}
{com}. 
. *Create cancer variable 'other cancer currently', includes carcinoma of the head and neck - need to confirm if this excludes NMSC
. gen cancer =0
{txt}
{com}. replace cancer =1 if lung_cancer ==1 | haem_cancer ==1 | other_cancer ==1
{txt}(16,659 real changes made)

{com}. lab var cancer "Cancer"
{txt}
{com}. 
. *Create other comorbid variables
. gen combined_cv_comorbid =1 if chronic_cardiac_disease ==1 | stroke==1
{txt}(21,864 missing values generated)

{com}. recode combined_cv_comorbid .=0
{txt}(combined_cv_comorbid: 21864 changes made)

{com}. 
. *Delete unneeded variables
. drop hba1c_pct hba1c_percentage hba1c_mmol_per_mol
{txt}
{com}. 
. *Label variables
. lab var hypertension "Hypertension"
{txt}
{com}. lab var diabetes "Diabetes"
{txt}
{com}. lab var stroke "Stroke"
{txt}
{com}. lab var chronic_resp_disease "Chronic respiratory disease"
{txt}
{com}. lab var copd "COPD"
{txt}
{com}. lab var esrf "End-stage renal failure"
{txt}
{com}. lab var chronic_liver_disease "Chronic liver disease"
{txt}
{com}. lab var chronic_cardiac_disease "Chronic cardiac disease"
{txt}
{com}. 
. save "$projectdir/output/data/file_eia_all.dta", replace        
{txt}(note: file /workspace/output/data/file_eia_all.dta not found)
{err}{p 0 4 2}
file /workspace/output/data/file_eia_all.dta
could not be opened
{p_end}
{txt}{search r(603), local:r(603);}

end of do-file
{search r(603), local:r(603);}

end of do-file

{search r(603), local:r(603);}


{com}. 