-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/cleaning_dataset.log
  log type:  text
 opened on:   7 Apr 2022, 09:53:29

. 
. di "$projectdir"
/workspace

. di "$logdir"
/workspace/logs

. 
. import delimited "$projectdir/output/input.csv", clear
(65 vars, 100,000 obs)

. 
. **Set Ado file path
. adopath + "$projectdir/analysis/extra_ados"
  [1]  (BASE)      "/usr/local/stata/ado/base/"
  [2]  (SITE)      "/usr/local/ado/"
  [3]              "."
  [4]  (PERSONAL)  "~/ado/personal/"
  [5]  (PLUS)      "~/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "/workspace/analysis/extra_ados"

. 
. **Set index dates ===========================================================
> */
. global year_preceding = "01/03/2018"

. global start_date = "01/03/2019"

. global end_date = "01/03/2022"

. 
. **Rename variables (some are too long for Stata to handle) ==================
> =====================*/
. rename chronic_respiratory_disease chronic_resp_disease

. 
. **Convert date strings to dates =============================================
> =======*/
. ***Some dates are given with month/year only, so adding day 15 to enable them
>  to be processed as dates 
. 
. foreach var of varlist   hba1c_mmol_per_mol_date                        ///
>                                                  hba1c_percentage_date       
>                    ///
>                                                  creatinine_date             
>                    ///
>                                                  bmi_date_measured           
>                ///
>                                                  abatacept                   
>                                    ///
>                                                  adalimumab                  
>                                    ///     
>                                                  baricitinib                 
>                            ///
>                                                  certolizumab                
>                            ///
>                                                  etanercept                  
>                                    ///
>                                                  golimumab                   
>                                    ///
>                                                  guselkumab                  
>                                    ///     
>                                                  infliximab                  
>                                    ///
>                                                  ixekizumab                  
>                                    ///
>                                                  methotrexate_hcd            
>                            ///
>                                                  rituximab                   
>                                    ///
>                                                  sarilumab                   
>                                    ///
>                                                  secukinumab                 
>                            ///     
>                                                  tocilizumab                 
>                            ///
>                                                  tofacitinib                 
>                            ///
>                                                  upadacitinib                
>                            ///
>                                                  ustekinumab                 
>                            ///
>                                                  {
  2.                                                         
.                 capture confirm string variable `var'
  3.                 if _rc!=0 {
  4.                         assert `var'==.
  5.                         rename `var' `var'_date
  6.                 }
  7.         
.                 else {
  8.                                 replace `var' = `var' + "-15"
  9.                                 rename `var' `var'_dstr
 10.                                 replace `var'_dstr = " " if `var'_dstr == 
> "-15"
 11.                                 gen `var'_date = date(`var'_dstr, "YMD") 
 12.                                 order `var'_date, after(`var'_dstr)
 13.                                 drop `var'_dstr
 14.                 }
 15.         
.         format `var'_date %td
 16. }
variable hba1c_mmol_per_mol_date was str7 now str10
(100,000 real changes made)
(5,000 real changes made)
(5,000 missing values generated)
variable hba1c_percentage_date was str7 now str10
(100,000 real changes made)
(5,000 real changes made)
(5,000 missing values generated)
variable creatinine_date was str7 now str10
(100,000 real changes made)
(5,000 real changes made)
(5,000 missing values generated)
variable bmi_date_measured was str7 now str10
(100,000 real changes made)
(40,000 real changes made)
(40,000 missing values generated)
variable abatacept was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable adalimumab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable baricitinib was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable certolizumab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable etanercept was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable golimumab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable guselkumab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable infliximab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable ixekizumab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable methotrexate_hcd was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable rituximab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable sarilumab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable secukinumab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable tocilizumab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable tofacitinib was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable upadacitinib was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable ustekinumab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)

. 
. **Conversion for dates with day already included ============================
> ========================*/
. 
. foreach var of varlist   died_date_ons                                       
>    ///
>                                              eia_code_date                   
>                            ///
>                                                  rheum_appt_date             
>                            ///
>                                              ra_code_date                    
>                            ///
>                                                  psa_code_date               
>                            ///
>                                                  anksp_code_date             
>                            ///
>                                                  last_gp_prerheum_date       
>                    ///
>                                                  last_gp_precode_date        
>                    ///     
>                                                  last_gp_refrheum_date       
>                    ///
>                                                  last_gp_refcode_date        
>                    ///
>                                                  referral_rheum_prerheum     
>                    ///
>                                                  referral_rheum_precode      
>                    ///     
>                                                  chronic_cardiac_disease     
>                    ///
>                                                  diabetes                    
>                                    ///
>                                                  hypertension                
>                            ///     
>                                                  chronic_resp_disease        
>                    ///
>                                                  copd                        
>                                    ///
>                                                  chronic_liver_disease       
>                    ///
>                                                  stroke                      
>                                    ///
>                                                  lung_cancer                 
>                            ///
>                                                  haem_cancer                 
>                            ///
>                                                  other_cancer                
>                            ///
>                                                  esrf                        
>                                    ///
>                                                  organ_transplant            
>                            ///
>                                                  hydroxychloroquine          
>                            ///
>                                                  leflunomide                 
>                            ///
>                                                  methotrexate                
>                            ///
>                                                  methotrexate_inj            
>                            ///
>                                                  sulfasalazine               
>                            ///
>                                                  {
  2.                                                                  
.                 capture confirm string variable `var'
  3.                 if _rc!=0 {
  4.                         assert `var'==.
  5.                         rename `var' `var'_date
  6.                 }
  7.         
.                 else {
  8.                                 rename `var' `var'_dstr
  9.                                 gen `var'_date = date(`var'_dstr, "YMD") 
 10.                                 order `var'_date, after(`var'_dstr)
 11.                                 drop `var'_dstr
 12.                                 gen `var'_date15 = `var'_date+15
 13.                                 order `var'_date15, after(`var'_date)
 14.                                 drop `var'_date
 15.                                 rename `var'_date15 `var'_date
 16.                 }
 17.         
.         format `var'_date %td
 18. }
(90,000 missing values generated)
(90,000 missing values generated)
(1,000 missing values generated)
(1,000 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(1,000 missing values generated)
(1,000 missing values generated)
(1,000 missing values generated)
(1,000 missing values generated)
(1,000 missing values generated)
(1,000 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(90,000 missing values generated)
(90,000 missing values generated)
(90,000 missing values generated)
(90,000 missing values generated)
(90,000 missing values generated)
(90,000 missing values generated)
(90,000 missing values generated)
(90,000 missing values generated)
(90,000 missing values generated)
(90,000 missing values generated)

.                                                  
. **Rename variables with extra 'date' added to the end of variable names======
> =====================================================*/ 
. rename rheum_appt_date_date rheum_appt_date

. rename eia_code_date_date eia_code_date

. rename ra_code_date_date ra_code_date

. rename psa_code_date_date psa_code_date

. rename anksp_code_date_date anksp_code_date

. rename died_date_ons_date died_ons_date

. rename last_gp_prerheum_date_date last_gp_prerheum_date

. rename last_gp_refrheum_date_date last_gp_refrheum_date

. rename last_gp_refcode_date_date last_gp_refcode_date

. rename last_gp_precode_date_date last_gp_precode_date

. rename hba1c_mmol_per_mol_date_date hba1c_mmol_per_mol_date

. rename hba1c_percentage_date_date hba1c_percentage_date

. rename creatinine_date_date creatinine_date

. rename creatinine creatinine_value 

. rename bmi_date_measured_date bmi_date

. rename bmi bmi_value

. 
. **Create binary indicator variables for relevant conditions =================
> ===================================*/
. 
. foreach var of varlist   eia_code_date                                       
>    ///
>                                                  rheum_appt_date             
>                            ///
>                                              ra_code_date                    
>                            ///
>                                                  psa_code_date               
>                            ///
>                                                  anksp_code_date             
>                            ///
>                                                  died_ons_date               
>                            ///
>                                                  last_gp_prerheum_date       
>                    ///
>                                                  last_gp_precode_date        
>                    ///     
>                                                  last_gp_refrheum_date       
>                    ///
>                                                  last_gp_refcode_date        
>                    ///
>                                                  referral_rheum_prerheum_date
>            ///
>                                                  referral_rheum_precode_date 
>            ///     
>                                                  chronic_cardiac_disease_date
>            ///
>                                                  diabetes_date               
>                            ///
>                                                  hypertension_date           
>                            ///
>                                                  chronic_resp_disease_date   
>                    ///
>                                                  copd_date                   
>                                    ///
>                                                  chronic_liver_disease_date  
>                    ///
>                                                  stroke_date                 
>                            ///
>                                                  lung_cancer_date            
>                            ///
>                                                  haem_cancer_date            
>                            ///             
>                                                  other_cancer_date           
>                            ///
>                                                  esrf_date                   
>                                    ///
>                                                  creatinine_date             
>                            ///
>                                                  organ_transplant_date       
>                    ///
>                                                  hydroxychloroquine_date     
>                    ///     
>                                                  leflunomide_date            
>                            ///
>                                                  methotrexate_date           
>                            ///
>                                                  methotrexate_inj_date       
>                    ///             
>                                                  sulfasalazine_date          
>                            ///
>                                                  abatacept_date              
>                            ///
>                                                  adalimumab_date             
>                            ///
>                                                  baricitinib_date            
>                            ///
>                                                  certolizumab_date           
>                            ///
>                                                  etanercept_date             
>                            ///
>                                                  golimumab_date              
>                            ///
>                                                  guselkumab_date             
>                            ///
>                                                  infliximab_date             
>                            ///
>                                                  ixekizumab_date             
>                            ///
>                                                  methotrexate_hcd_date       
>                    ///
>                                                  rituximab_date              
>                            ///             
>                                                  sarilumab_date              
>                            ///
>                                                  secukinumab_date            
>                            ///
>                                                  tocilizumab_date            
>                            ///             
>                                                  tofacitinib_date            
>                            ///
>                                                  upadacitinib_date           
>                            ///
>                                                  ustekinumab_date   {        
>                    
  2.         /*date ranges are applied in python, so presence of date indicates
>  presence of 
>           disease in the correct time frame*/ 
.         local newvar =  substr("`var'", 1, length("`var'") - 5)
  3.         gen `newvar' = (`var'!=. )
  4.         order `newvar', after(`var')
  5. }

. 
. **Create and label variables ================================================
> ===========*/
. 
. **Demographics
. ***Sex
. gen male = 1 if sex == "M"
(51,035 missing values generated)

. replace male = 0 if sex == "F"
(51,035 real changes made)

. lab var male "Male"

. tab male, missing

       Male |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     51,035       51.03       51.03
          1 |     48,965       48.97      100.00
------------+-----------------------------------
      Total |    100,000      100.00

. 
. ***Ethnicity
. replace ethnicity = .u if ethnicity == .
(25,000 real changes made, 25,000 to missing)

. ****rearrange in order of prevalence
. recode ethnicity 2=6 /* mixed to 6 */
(ethnicity: 14993 changes made)

. recode ethnicity 3=2 /* south asian to 2 */
(ethnicity: 7643 changes made)

. recode ethnicity 4=3 /* black to 3 */
(ethnicity: 7392 changes made)

. recode ethnicity 6=4 /* mixed to 4 */
(ethnicity: 14993 changes made)

. recode ethnicity 5=4 /* other to 4 */
(ethnicity: 7563 changes made)

. 
. label define ethnicity  1 "White"                                       ///
>                                                 2 "Asian/Asian British"      
>    ///
>                                                 3 "Black"                    
>                    ///
>                                                 4 "Mixed/Other"              
>            ///
>                                                 .u "Missing"

. label values ethnicity ethnicity

. lab var ethnicity "Ethnicity"

. tab ethnicity, missing

          Ethnicity |      Freq.     Percent        Cum.
--------------------+-----------------------------------
              White |     37,409       37.41       37.41
Asian/Asian British |      7,643        7.64       45.05
              Black |      7,392        7.39       52.44
        Mixed/Other |     22,556       22.56       75.00
            Missing |     25,000       25.00      100.00
--------------------+-----------------------------------
              Total |    100,000      100.00

. 
. ***STP 
. rename stp stp_old

. bysort stp_old: gen stp = 1 if _n==1
(99,998 missing values generated)

. replace stp = sum(stp) //
(99,999 real changes made)

. drop stp_old

. 
. ***Regions
. encode region, gen(nuts_region)

. tab region, missing

                  region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
           East Midlands |      9,929        9.93        9.93
         East of England |     10,064       10.06       19.99
                  London |     19,858       19.86       39.85
              North East |     10,008       10.01       49.86
              North West |     10,210       10.21       60.07
              South East |     19,943       19.94       80.01
           West Midlands |     10,011       10.01       90.02
Yorkshire and the Humber |      9,977        9.98      100.00
-------------------------+-----------------------------------
                   Total |    100,000      100.00

. 
. ***IMD
. *Group into 5 groups
. rename imd imd_o

. egen imd = cut(imd_o), group(5) icodes 

. *Add one to create groups 1-5 
. replace imd = imd + 1
(100,000 real changes made)

. *-1 is missing, should be excluded from population 
. replace imd = .u if imd_o == -1
(0 real changes made)

. drop imd_o

. *Reverse the order (so high is more deprived)
. recode imd 5 = 1 4 = 2 3 = 3 2 = 4 1 = 5 .u = .u
(imd: 100000 changes made)

. label define imd 1 "1 least deprived" 2 "2" 3 "3" 4 "4" 5 "5 most deprived" .
> u "Missing"

. label values imd imd 

. lab var imd "Index of multiple deprivation"

. tab imd, missing

        Index of |
        multiple |
     deprivation |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |     70,084       70.08       70.08
               4 |     19,881       19.88       89.97
 5 most deprived |     10,035       10.04      100.00
-----------------+-----------------------------------
           Total |    100,000      100.00

. 
. ***Age variables
. *Nb. works if ages 18 and over
. *Create categorised age
. drop if age<18 & age !=.
(21,319 observations deleted)

. drop if age>109 & age !=.
(0 observations deleted)

. drop if age==.
(0 observations deleted)

. lab var age "Age"

. 
. recode age 18/39.9999 = 1 /// 
>            40/49.9999 = 2 ///
>                    50/59.9999 = 3 ///
>                60/69.9999 = 4 ///
>                    70/79.9999 = 5 ///
>                    80/max = 6, gen(agegroup) 
(78681 differences between age and agegroup)

. 
. label define agegroup   1 "18-39" ///
>                                                 2 "40-49" ///
>                                                 3 "50-59" ///
>                                                 4 "60-69" ///
>                                                 5 "70-79" ///
>                                                 6 "80+"

.                                                 
. label values agegroup agegroup

. lab var agegroup "Age group"

. tab agegroup, missing

  Age group |      Freq.     Percent        Cum.
------------+-----------------------------------
      18-39 |     28,566       36.31       36.31
      40-49 |     12,867       16.35       52.66
      50-59 |     13,229       16.81       69.47
      60-69 |     10,751       13.66       83.14
      70-79 |      8,317       10.57       93.71
        80+ |      4,951        6.29      100.00
------------+-----------------------------------
      Total |     78,681      100.00

. 
. *Create binary age
. recode age min/69.999 = 0 ///
>            70/max = 1, gen(age70)
(78681 differences between age and age70)

. 
. *Create restricted cubic splines for age
. mkspline age = age, cubic nknots(4)

. 
. ***Body Mass Index
. *Recode strange values 
. replace bmi_value = . if bmi_value == 0 
(31,474 real changes made, 31,474 to missing)

. replace bmi_value = . if !inrange(bmi_value, 10, 80)
(289 real changes made, 289 to missing)

. 
. *Restrict to within 10 years of EIA diagnosis date and aged>16 
. gen bmi_time = (eia_code_date - bmi_date)/365.25
(31,921 missing values generated)

. gen bmi_age = age - bmi_time
(31,921 missing values generated)

. replace bmi_value = . if bmi_age < 16 
(33,217 real changes made, 33,217 to missing)

. replace bmi_value = . if bmi_time > 10 & bmi_time != . 
(8,913 real changes made, 8,913 to missing)

. 
. *Set to missing if no date, and vice versa 
. replace bmi_value = . if bmi_date == . 
(0 real changes made)

. replace bmi_date = . if bmi_value == . 
(42,419 real changes made, 42,419 to missing)

. replace bmi_time = . if bmi_value == . 
(42,416 real changes made, 42,416 to missing)

. replace bmi_age = . if bmi_value == . 
(42,416 real changes made, 42,416 to missing)

. 
. *Create BMI categories
. gen     bmicat = .
(78,681 missing values generated)

. recode  bmicat . = 1 if bmi_value < 18.5
(bmicat: 194 changes made)

. recode  bmicat . = 2 if bmi_value < 25
(bmicat: 519 changes made)

. recode  bmicat . = 3 if bmi_value < 30
(bmicat: 778 changes made)

. recode  bmicat . = 4 if bmi_value < 35
(bmicat: 908 changes made)

. recode  bmicat . = 5 if bmi_value < 40
(bmicat: 946 changes made)

. recode  bmicat . = 6 if bmi_value < .
(bmicat: 1443 changes made)

. replace bmicat = .u if bmi_value >= .
(73,893 real changes made, 73,893 to missing)

. 
. label define bmicat 1 "Underweight (<18.5)"     ///
>                                         2 "Normal (18.5-24.9)"          ///
>                                         3 "Overweight (25-29.9)"        ///
>                                         4 "Obese I (30-34.9)"           ///
>                                         5 "Obese II (35-39.9)"          ///
>                                         6 "Obese III (40+)"                  
>    ///
>                                         .u "Missing"

.                                         
. label values bmicat bmicat

. lab var bmicat "BMI"

. tab bmicat, missing

                 BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |        194        0.25        0.25
  Normal (18.5-24.9) |        519        0.66        0.91
Overweight (25-29.9) |        778        0.99        1.89
   Obese I (30-34.9) |        908        1.15        3.05
  Obese II (35-39.9) |        946        1.20        4.25
     Obese III (40+) |      1,443        1.83        6.09
             Missing |     73,893       93.91      100.00
---------------------+-----------------------------------
               Total |     78,681      100.00

. 
. *Create less granular categorisation
. recode bmicat 1/3 .u = 1 4 = 2 5 = 3 6 = 4, gen(obese4cat)
(78487 differences between bmicat and obese4cat)

. 
. label define obese4cat  1 "No record of obesity"        ///
>                                                 2 "Obese I (30-34.9)"        
>    ///
>                                                 3 "Obese II (35-39.9)"       
>    ///
>                                                 4 "Obese III (40+)"          
>    

. 
. label values obese4cat obese4cat

. order obese4cat, after(bmicat)

. 
. ***Smoking 
. label define smoke 1 "Never" 2 "Former" 3 "Current" .u "Missing"

. 
. gen     smoke = 1  if smoking_status == "N"
(70,846 missing values generated)

. replace smoke = 2  if smoking_status == "E"
(3,894 real changes made)

. replace smoke = 3  if smoking_status == "S"
(23,731 real changes made)

. replace smoke = .u if smoking_status == "M"
(3,988 real changes made, 3,988 to missing)

. replace smoke = .u if smoking_status == "" 
(39,233 real changes made, 39,233 to missing)

. 
. label values smoke smoke

. lab var smoke "Smoking status"

. drop smoking_status

. tab smoke, missing

    Smoking |
     status |      Freq.     Percent        Cum.
------------+-----------------------------------
      Never |      7,835        9.96        9.96
     Former |      3,894        4.95       14.91
    Current |     23,731       30.16       45.07
    Missing |     43,221       54.93      100.00
------------+-----------------------------------
      Total |     78,681      100.00

. 
. *Create non-missing 3-category variable for current smoking (assumes missing 
> smoking is never smoking)
. recode smoke .u = 1, gen(smoke_nomiss)
(43221 differences between smoke and smoke_nomiss)

. order smoke_nomiss, after(smoke)

. label values smoke_nomiss smoke

. 
. **Clinical comorbidities
. ***eGFR
. *Set implausible creatinine values to missing (Note: zero changed to missing)
. replace creatinine_value = . if !inrange(creatinine_value, 20, 3000) 
(19,737 real changes made, 19,737 to missing)

. 
. *Remove creatinine dates if no measurements, and vice versa 
. replace creatinine_value = . if creatinine_date == . 
(0 real changes made)

. replace creatinine_date = . if creatinine_value == . 
(15,766 real changes made, 15,766 to missing)

. replace creatinine = . if creatinine_value == .
(19,737 real changes made, 19,737 to missing)

. recode creatinine .=0
(creatinine: 19737 changes made)

. tab creatinine, missing

 creatinine |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     19,737       25.08       25.08
          1 |     58,944       74.92      100.00
------------+-----------------------------------
      Total |     78,681      100.00

. tabstat creatinine_value, stat(n mean p50)

    variable |         N      mean       p50
-------------+------------------------------
creatinin~ue |     58944  136.5556   126.743
--------------------------------------------

. 
. *Divide by 88.4 (to convert umol/l to mg/dl) 
. gen SCr_adj = creatinine_value/88.4
(19,737 missing values generated)

. 
. gen min = .
(78,681 missing values generated)

. replace min = SCr_adj/0.7 if male==0
(30,039 real changes made)

. replace min = SCr_adj/0.9 if male==1
(28,905 real changes made)

. replace min = min^-0.329  if male==0
(30,039 real changes made)

. replace min = min^-0.411  if male==1
(28,905 real changes made)

. replace min = 1 if min<1
(46,102 real changes made)

. 
. gen max=.
(78,681 missing values generated)

. replace max=SCr_adj/0.7 if male==0
(30,039 real changes made)

. replace max=SCr_adj/0.9 if male==1
(28,905 real changes made)

. replace max=max^-1.209
(58,944 real changes made)

. replace max=1 if max>1
(32,579 real changes made)

. 
. gen egfr=min*max*141
(19,737 missing values generated)

. replace egfr=egfr*(0.993^age)
(58,944 real changes made)

. replace egfr=egfr*1.018 if male==0
(30,039 real changes made)

. label var egfr "egfr calculated using CKD-EPI formula with no ethnicity"

. 
. *Categorise into ckd stages
. egen egfr_cat_all = cut(egfr), at(0, 15, 30, 45, 60, 5000)
(19737 missing values generated)

. recode egfr_cat_all 0 = 5 15 = 4 30 = 3 45 = 2 60 = 0, generate(ckd_egfr)
(58944 differences between egfr_cat_all and ckd_egfr)

. 
. gen egfr_cat = .
(78,681 missing values generated)

. recode egfr_cat . = 3 if egfr < 30
(egfr_cat: 13850 changes made)

. recode egfr_cat . = 2 if egfr < 60
(egfr_cat: 20866 changes made)

. recode egfr_cat . = 1 if egfr < .
(egfr_cat: 24228 changes made)

. replace egfr_cat = .u if egfr >= .
(19,737 real changes made, 19,737 to missing)

. 
. label define egfr_cat   1 ">=60"                ///
>                                                 2 "30-59"               ///
>                                                 3 "<30"                 ///
>                                                 .u "Missing"

.                                         
. label values egfr_cat egfr_cat

. lab var egfr_cat "eGFR"

. tab egfr_cat, missing

       eGFR |      Freq.     Percent        Cum.
------------+-----------------------------------
       >=60 |     24,228       30.79       30.79
      30-59 |     20,866       26.52       57.31
        <30 |     13,850       17.60       74.92
    Missing |     19,737       25.08      100.00
------------+-----------------------------------
      Total |     78,681      100.00

. 
. *If missing eGFR, assume normal
. gen egfr_cat_nomiss = egfr_cat
(19,737 missing values generated)

. replace egfr_cat_nomiss = 1 if egfr_cat == .u
(19,737 real changes made)

. 
. label define egfr_cat_nomiss    1 ">=60/missing"        ///
>                                                                 2 "30-59"    
>                    ///
>                                                                 3 "<30" 

. label values egfr_cat_nomiss egfr_cat_nomiss

. lab var egfr_cat_nomiss "eGFR"

. 
. gen egfr_date = creatinine_date
(19,737 missing values generated)

. format egfr_date %td

. 
. *Add in end stage renal failure and create a single CKD variable 
. *Missing assumed to not have CKD 
. gen ckd = 0

. replace ckd = 1 if ckd_egfr != . & ckd_egfr >= 1
(34,716 real changes made)

. replace ckd = 1 if esrf == 1
(8,706 real changes made)

. 
. label define ckd 0 "No CKD" 1 "CKD"

. label values ckd ckd

. label var ckd "Chronic kidney disease"

. tab ckd, missing

    Chronic |
     kidney |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
     No CKD |     35,259       44.81       44.81
        CKD |     43,422       55.19      100.00
------------+-----------------------------------
      Total |     78,681      100.00

. 
. *Create date (most recent measure prior to index)
. gen temp1_ckd_date = creatinine_date if ckd_egfr >=1
(43,965 missing values generated)

. gen temp2_ckd_date = esrf_date if esrf == 1
(62,994 missing values generated)

. gen ckd_date = max(temp1_ckd_date,temp2_ckd_date) 
(35,259 missing values generated)

. format ckd_date %td 

. 
. drop temp1_ckd_date temp2_ckd_date SCr_adj min max ckd_egfr egfr_cat_all

. 
. ***HbA1c
. *Set zero or negative to missing
. replace hba1c_percentage   = . if hba1c_percentage <= 0
(4,419 real changes made, 4,419 to missing)

. replace hba1c_mmol_per_mol = . if hba1c_mmol_per_mol <= 0
(5,651 real changes made, 5,651 to missing)

. 
. *Change implausible values to missing
. replace hba1c_percentage   = . if !inrange(hba1c_percentage, 1, 20)
(1,236 real changes made, 1,236 to missing)

. replace hba1c_mmol_per_mol = . if !inrange(hba1c_mmol_per_mol, 10, 200)
(3,269 real changes made, 3,269 to missing)

. 
. *Set most recent values of >24 months prior to EIA diagnosis date to missing
. replace hba1c_percentage   = . if (eia_code_date - hba1c_percentage_date) > 2
> 4*30 & hba1c_percentage_date != .
(70,661 real changes made, 70,661 to missing)

. replace hba1c_mmol_per_mol = . if (eia_code_date - hba1c_mmol_per_mol_date) >
>  24*30 & hba1c_mmol_per_mol_date != .
(67,549 real changes made, 67,549 to missing)

. 
. *Clean up dates
. replace hba1c_percentage_date = . if hba1c_percentage == .
(72,367 real changes made, 72,367 to missing)

. replace hba1c_mmol_per_mol_date = . if hba1c_mmol_per_mol == .
(72,555 real changes made, 72,555 to missing)

. 
. *Express  HbA1c as percentage
. *Express all values as perecentage 
. noi summ hba1c_percentage hba1c_mmol_per_mol 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hba1c_per~ge |      2,365    5.068136    1.881361   1.004187   12.68856
hba1c_mmol~l |      2,212    42.69664    17.33553   10.21252   126.2821

. gen     hba1c_pct = hba1c_percentage 
(76,316 missing values generated)

. replace hba1c_pct = (hba1c_mmol_per_mol/10.929)+2.15 if hba1c_mmol_per_mol<. 
(2,212 real changes made)

. 
. *Valid % range between 0-20  
. replace hba1c_pct = . if !inrange(hba1c_pct, 1, 20) 
(0 real changes made)

. replace hba1c_pct = round(hba1c_pct, 0.1)
(4,501 real changes made)

. 
. *Categorise HbA1c and diabetes
. *Group hba1c pct
. gen     hba1ccat = 0 if hba1c_pct <  6.5
(75,547 missing values generated)

. replace hba1ccat = 1 if hba1c_pct >= 6.5  & hba1c_pct < 7.5
(692 real changes made)

. replace hba1ccat = 2 if hba1c_pct >= 7.5  & hba1c_pct < 8
(236 real changes made)

. replace hba1ccat = 3 if hba1c_pct >= 8    & hba1c_pct < 9
(290 real changes made)

. replace hba1ccat = 4 if hba1c_pct >= 9    & hba1c_pct !=.
(149 real changes made)

. label define hba1ccat 0 "<6.5%" 1">=6.5-7.4" 2">=7.5-7.9" 3">=8-8.9" 4">=9"

. label values hba1ccat hba1ccat

. tab hba1ccat, missing

   hba1ccat |      Freq.     Percent        Cum.
------------+-----------------------------------
      <6.5% |      3,134        3.98        3.98
  >=6.5-7.4 |        692        0.88        4.86
  >=7.5-7.9 |        236        0.30        5.16
    >=8-8.9 |        290        0.37        5.53
        >=9 |        149        0.19        5.72
          . |     74,180       94.28      100.00
------------+-----------------------------------
      Total |     78,681      100.00

. 
. *Express all values as mmol
. gen hba1c_mmol = hba1c_mmol_per_mol
(76,469 missing values generated)

. replace hba1c_mmol = (hba1c_percentage*10.929)-23.5 if hba1c_percentage<. & h
> ba1c_mmol==.
(2,289 real changes made)

. 
. *Group hba1c mmol
. gen     hba1ccatmm = 0 if hba1c_mmol < 58
(74,854 missing values generated)

. replace hba1ccatmm = 1 if hba1c_mmol >= 58 & hba1c_mmol !=.
(674 real changes made)

. replace hba1ccatmm =.u if hba1ccatmm==. 
(74,180 real changes made, 74,180 to missing)

. label define hba1ccatmm 0 "HbA1c <58mmol/mol" 1 "HbA1c >=58mmol/mol" .u "Miss
> ing"

. label values hba1ccatmm hba1ccatmm

. lab var hba1ccatmm "HbA1c"

. tab hba1ccatmm, missing

             HbA1c |      Freq.     Percent        Cum.
-------------------+-----------------------------------
 HbA1c <58mmol/mol |      3,827        4.86        4.86
HbA1c >=58mmol/mol |        674        0.86        5.72
           Missing |     74,180       94.28      100.00
-------------------+-----------------------------------
             Total |     78,681      100.00

. 
. *Create diabetes, split by control/not (assumes missing = no diabetes)
. gen     diabcat = 1 if diabetes==0
(15,658 missing values generated)

. replace diabcat = 2 if diabetes==1 & inlist(hba1ccat, 0, 1)
(754 real changes made)

. replace diabcat = 3 if diabetes==1 & inlist(hba1ccat, 2, 3, 4)
(137 real changes made)

. replace diabcat = 4 if diabetes==1 & !inlist(hba1ccat, 0, 1, 2, 3, 4)
(14,767 real changes made)

. 
. label define diabcat    1 "No diabetes"                         ///
>                                                 2 "Controlled diabetes"      
>    ///
>                                                 3 "Uncontrolled diabetes"    
>    ///
>                                                 4 "Diabetes, no hba1c measure
> "

. label values diabcat diabcat

. 
. *Create cancer variable 'other cancer currently', includes carcinoma of the h
> ead and neck - need to confirm if this excludes NMSC
. gen cancer =0

. replace cancer =1 if lung_cancer ==1 | haem_cancer ==1 | other_cancer ==1
(38,385 real changes made)

. lab var cancer "Cancer"

. tab cancer, missing

     Cancer |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     40,296       51.21       51.21
          1 |     38,385       48.79      100.00
------------+-----------------------------------
      Total |     78,681      100.00

. 
. *Create other comorbid variables
. gen combined_cv_comorbid =1 if chronic_cardiac_disease ==1 | stroke==1
(50,397 missing values generated)

. recode combined_cv_comorbid .=0
(combined_cv_comorbid: 50397 changes made)

. 
. *Label variables
. lab var hypertension "Hypertension"

. lab var diabetes "Diabetes"

. lab var stroke "Stroke"

. lab var chronic_resp_disease "Chronic respiratory disease"

. lab var copd "COPD"

. lab var esrf "End-stage renal failure"

. lab var chronic_liver_disease "Chronic liver disease"

. lab var chronic_cardiac_disease "Chronic cardiac disease"

. 
. *Refine diagnostic window====================================================
> =========*/
. 
. **All patients should have EIA code
. tab eia_code, missing

   eia_code |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        791        1.01        1.01
          1 |     77,890       98.99      100.00
------------+-----------------------------------
      Total |     78,681      100.00

. keep if eia_code==1
(791 observations deleted)

. 
. **Keep patients with first EIA code in GP record if code was after 1st March 
> 2019
. keep if eia_code_date>=date("$start_date", "DMY") & eia_code_date!=. 
(18,124 observations deleted)

. tab eia_code

   eia_code |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     59,766      100.00      100.00
------------+-----------------------------------
      Total |     59,766      100.00

. 
. **Month/Year of EIA code
. gen year_diag=year(eia_code_date)

. format year_diag %ty

. gen month_diag=month(eia_code_date)

. gen mo_year_diagn=ym(year_diag, month_diag)

. format mo_year_diagn %tm

. 
. *Include only most recent EIA sub-diagnosis==================================
> ===========*/
. 
. replace ra_code =0 if psa_code_date >= ra_code_date & psa_code_date !=.
(29,251 real changes made)

. replace ra_code =0 if anksp_code_date >= ra_code_date & anksp_code_date !=.
(9,949 real changes made)

. replace psa_code =0 if ra_code_date >= psa_code_date & ra_code_date !=.
(29,362 real changes made)

. replace psa_code =0 if anksp_code_date >= psa_code_date & anksp_code_date !=.
(10,132 real changes made)

. replace anksp_code =0 if psa_code_date >= anksp_code_date & psa_code_date !=.
(28,945 real changes made)

. replace anksp_code =0 if ra_code_date >= anksp_code_date & ra_code_date !=.
(10,130 real changes made)

. gen eia_diagnosis=1 if ra_code==1
(39,795 missing values generated)

. replace eia_diagnosis=2 if psa_code==1
(19,667 real changes made)

. replace eia_diagnosis=3 if anksp_code==1
(20,059 real changes made)

. lab define eia_diagnosis 1 "RA" 2 "PsA" 3 "AxSpA", modify

. lab val eia_diagnosis eia_diagnosis

. tab eia_diagnosis, missing

eia_diagnos |
         is |      Freq.     Percent        Cum.
------------+-----------------------------------
         RA |     19,971       33.42       33.42
        PsA |     19,667       32.91       66.32
      AxSpA |     20,059       33.56       99.88
          . |         69        0.12      100.00
------------+-----------------------------------
      Total |     59,766      100.00

. drop if eia_diagnosis==. //should be ~none
(69 observations deleted)

. 
. *Define drugs and dates=====================================================*
> /
. 
. **csDMARDs (not including high cost MTX; wouldn't be shared care)
. gen csdmard=1 if hydroxychloroquine==1 | leflunomide==1 | methotrexate==1 | m
> ethotrexate_inj==1 | sulfasalazine==1
(35,198 missing values generated)

. recode csdmard .=0 
(csdmard: 35198 changes made)

. tab csdmard, missing

    csdmard |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     35,198       58.96       58.96
          1 |     24,499       41.04      100.00
------------+-----------------------------------
      Total |     59,697      100.00

. bys eia_diagnosis: tab csdmard

-------------------------------------------------------------------------------
-> eia_diagnosis = RA

    csdmard |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     11,854       59.36       59.36
          1 |      8,117       40.64      100.00
------------+-----------------------------------
      Total |     19,971      100.00

-------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    csdmard |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     11,583       58.90       58.90
          1 |      8,084       41.10      100.00
------------+-----------------------------------
      Total |     19,667      100.00

-------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    csdmard |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     11,761       58.63       58.63
          1 |      8,298       41.37      100.00
------------+-----------------------------------
      Total |     20,059      100.00


. 
. **csDMARDs (including high cost MTX)
. gen csdmard_hcd=1 if hydroxychloroquine==1 | leflunomide==1 | methotrexate==1
>  | methotrexate_inj==1 | methotrexate_hcd==1 | sulfasalazine==1
(31,661 missing values generated)

. recode csdmard_hcd .=0 
(csdmard_hcd: 31661 changes made)

. tab csdmard_hcd, missing

csdmard_hcd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     31,661       53.04       53.04
          1 |     28,036       46.96      100.00
------------+-----------------------------------
      Total |     59,697      100.00

. bys eia_diagnosis: tab csdmard_hcd, missing

-------------------------------------------------------------------------------
-> eia_diagnosis = RA

csdmard_hcd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,635       53.25       53.25
          1 |      9,336       46.75      100.00
------------+-----------------------------------
      Total |     19,971      100.00

-------------------------------------------------------------------------------
-> eia_diagnosis = PsA

csdmard_hcd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,413       52.95       52.95
          1 |      9,254       47.05      100.00
------------+-----------------------------------
      Total |     19,667      100.00

-------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

csdmard_hcd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,613       52.91       52.91
          1 |      9,446       47.09      100.00
------------+-----------------------------------
      Total |     20,059      100.00


. 
. **Date of first csDMARD script (not including high cost MTX prescriptions)
. gen csdmard_date=min(hydroxychloroquine_date, leflunomide_date, methotrexate_
> date, methotrexate_inj_date, sulfasalazine_date)
(35,198 missing values generated)

. format %td csdmard_date

. 
. **Date of first csDMARD script (including high cost MTX prescriptions)
. gen csdmard_hcd_date=min(hydroxychloroquine_date, leflunomide_date, methotrex
> ate_date, methotrexate_inj_date, methotrexate_hcd_date, sulfasalazine_date)
(31,661 missing values generated)

. format %td csdmard_hcd_date

. 
. **Biologic use
. gen biologic=1 if abatacept==1 | adalimumab==1 | baricitinib==1 | certolizuma
> b==1 | etanercept==1 | golimumab==1 | guselkumab==1 | infliximab==1 | ixekizu
> mab==1 | rituximab==1 | sarilumab==1 | secukinumab==1 | tocilizumab==1 | tofa
> citinib==1 | upadacitinib==1 | ustekinumab==1 
(11,203 missing values generated)

. recode biologic .=0
(biologic: 11203 changes made)

. tab biologic, missing

   biologic |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     11,203       18.77       18.77
          1 |     48,494       81.23      100.00
------------+-----------------------------------
      Total |     59,697      100.00

. bys eia_diagnosis: tab biologic, missing 

-------------------------------------------------------------------------------
-> eia_diagnosis = RA

   biologic |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,763       18.84       18.84
          1 |     16,208       81.16      100.00
------------+-----------------------------------
      Total |     19,971      100.00

-------------------------------------------------------------------------------
-> eia_diagnosis = PsA

   biologic |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,684       18.73       18.73
          1 |     15,983       81.27      100.00
------------+-----------------------------------
      Total |     19,667      100.00

-------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

   biologic |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,756       18.72       18.72
          1 |     16,303       81.28      100.00
------------+-----------------------------------
      Total |     20,059      100.00


. 
. **Date of first biologic script
. gen biologic_date=min(abatacept_date, adalimumab_date, baricitinib_date, cert
> olizumab_date, etanercept_date, golimumab_date, guselkumab_date, infliximab_d
> ate, ixekizumab_date, rituximab_date, sarilumab_date, secukinumab_date, tocil
> izumab_date, tofacitinib_date, upadacitinib_date, ustekinumab_date)
(11,203 missing values generated)

. format %td biologic_date

. 
. **Exclude if first csdmard or biologic was before first rheum appt
. ***Nb. could introduce leeway e.g. 30 days?
. tab csdmard if rheum_appt_date!=. & csdmard_date!=. & csdmard_date<rheum_appt
> _date

    csdmard |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      8,963      100.00      100.00
------------+-----------------------------------
      Total |      8,963      100.00

. drop if rheum_appt_date!=. & csdmard_date!=. & csdmard_date<rheum_appt_date
(8,963 observations deleted)

. tab biologic if rheum_appt_date!=. & biologic_date!=. & biologic_date<rheum_a
> ppt_date 

   biologic |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     15,282      100.00      100.00
------------+-----------------------------------
      Total |     15,282      100.00

. drop if rheum_appt_date!=. & biologic_date!=. & biologic_date<rheum_appt_date
>  
(15,282 observations deleted)

. 
. *Number of EIA diagnoses in 1-year time windows==============================
> ===========*/
. 
. gen diagnosis_year=1 if eia_code_date>=td(01mar2019) & eia_code_date<td(01mar
> 2020)
(24,305 missing values generated)

. replace diagnosis_year=2 if eia_code_date>=td(01mar2020) & eia_code_date<td(0
> 1mar2021)
(11,321 real changes made)

. replace diagnosis_year=3 if eia_code_date>=td(01mar2021) & eia_code_date<td(0
> 1mar2022)
(11,309 real changes made)

. lab define diagnosis_year 1 "March 2019-March 2020" 2 "March 2020-March 2021"
>  3 "March 2021-March 2022", modify

. lab val diagnosis_year diagnosis_year

. lab var diagnosis_year "Year of diagnosis"

. tab diagnosis_year, missing

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |     11,147       31.44       31.44
March 2020-March 2021 |     11,321       31.93       63.38
March 2021-March 2022 |     11,309       31.90       95.28
                    . |      1,675        4.72      100.00
----------------------+-----------------------------------
                Total |     35,452      100.00

. bys eia_diagnosis: tab diagnosis_year, missing

-------------------------------------------------------------------------------
-> eia_diagnosis = RA

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |      3,749       31.54       31.54
March 2020-March 2021 |      3,800       31.97       63.50
March 2021-March 2022 |      3,797       31.94       95.44
                    . |        542        4.56      100.00
----------------------+-----------------------------------
                Total |     11,888      100.00

-------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |      3,689       31.67       31.67
March 2020-March 2021 |      3,693       31.71       63.38
March 2021-March 2022 |      3,726       31.99       95.36
                    . |        540        4.64      100.00
----------------------+-----------------------------------
                Total |     11,648      100.00

-------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |      3,709       31.13       31.13
March 2020-March 2021 |      3,828       32.12       63.25
March 2021-March 2022 |      3,786       31.77       95.02
                    . |        593        4.98      100.00
----------------------+-----------------------------------
                Total |     11,916      100.00


. 
. **Proportion of patients with at least 6 or 12 months of GP follow-up after E
> IA code
. tab has_6m_follow_up

has_6m_foll |
      ow_up |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,755        4.95        4.95
          1 |     33,697       95.05      100.00
------------+-----------------------------------
      Total |     35,452      100.00

. tab has_12m_follow_up

has_12m_fol |
     low_up |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,510        9.90        9.90
          1 |     31,942       90.10      100.00
------------+-----------------------------------
      Total |     35,452      100.00

. tab mo_year_diagn has_6m_follow_up

mo_year_di |   has_6m_follow_up
       agn |         0          1 |     Total
-----------+----------------------+----------
    2019m3 |        46        979 |     1,025 
    2019m4 |        47        859 |       906 
    2019m5 |        52        910 |       962 
    2019m6 |        50        879 |       929 
    2019m7 |        48        868 |       916 
    2019m8 |        57        857 |       914 
    2019m9 |        52        869 |       921 
   2019m10 |        31        905 |       936 
   2019m11 |        41        842 |       883 
   2019m12 |        57        847 |       904 
    2020m1 |        42        895 |       937 
    2020m2 |        36        878 |       914 
    2020m3 |        47        921 |       968 
    2020m4 |        42        864 |       906 
    2020m5 |        46        910 |       956 
    2020m6 |        57        866 |       923 
    2020m7 |        36        937 |       973 
    2020m8 |        50        934 |       984 
    2020m9 |        35        897 |       932 
   2020m10 |        46        904 |       950 
   2020m11 |        50        916 |       966 
   2020m12 |        55        913 |       968 
    2021m1 |        58        916 |       974 
    2021m2 |        34        787 |       821 
    2021m3 |        48        927 |       975 
    2021m4 |        40        902 |       942 
    2021m5 |        45        953 |       998 
    2021m6 |        47        874 |       921 
    2021m7 |        50        906 |       956 
    2021m8 |        56        897 |       953 
    2021m9 |        51        875 |       926 
   2021m10 |        64        868 |       932 
   2021m11 |        38        867 |       905 
   2021m12 |        39        932 |       971 
    2022m1 |        41        936 |       977 
    2022m2 |        52        801 |       853 
    2022m3 |        31        963 |       994 
    2022m4 |        38        643 |       681 
-----------+----------------------+----------
     Total |     1,755     33,697 |    35,452 

. tab mo_year_diagn has_12m_follow_up

mo_year_di |   has_12m_follow_up
       agn |         0          1 |     Total
-----------+----------------------+----------
    2019m3 |        89        936 |     1,025 
    2019m4 |        71        835 |       906 
    2019m5 |        96        866 |       962 
    2019m6 |        95        834 |       929 
    2019m7 |       105        811 |       916 
    2019m8 |        93        821 |       914 
    2019m9 |        80        841 |       921 
   2019m10 |       100        836 |       936 
   2019m11 |        82        801 |       883 
   2019m12 |        95        809 |       904 
    2020m1 |        89        848 |       937 
    2020m2 |        91        823 |       914 
    2020m3 |        91        877 |       968 
    2020m4 |        89        817 |       906 
    2020m5 |       104        852 |       956 
    2020m6 |        96        827 |       923 
    2020m7 |       108        865 |       973 
    2020m8 |       109        875 |       984 
    2020m9 |        89        843 |       932 
   2020m10 |       101        849 |       950 
   2020m11 |        96        870 |       966 
   2020m12 |        98        870 |       968 
    2021m1 |        90        884 |       974 
    2021m2 |        99        722 |       821 
    2021m3 |        82        893 |       975 
    2021m4 |        94        848 |       942 
    2021m5 |       111        887 |       998 
    2021m6 |       102        819 |       921 
    2021m7 |        82        874 |       956 
    2021m8 |        99        854 |       953 
    2021m9 |        83        843 |       926 
   2021m10 |        80        852 |       932 
   2021m11 |        83        822 |       905 
   2021m12 |        70        901 |       971 
    2022m1 |        91        886 |       977 
    2022m2 |        93        760 |       853 
    2022m3 |       110        884 |       994 
    2022m4 |        74        607 |       681 
-----------+----------------------+----------
     Total |     3,510     31,942 |    35,452 

. tab diagnosis_year if has_6m_follow_up==1, missing

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |     10,588       31.42       31.42
March 2020-March 2021 |     10,765       31.95       63.37
March 2021-March 2022 |     10,738       31.87       95.23
                    . |      1,606        4.77      100.00
----------------------+-----------------------------------
                Total |     33,697      100.00

. tab diagnosis_year if has_12m_follow_up==1, missing

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |     10,061       31.50       31.50
March 2020-March 2021 |     10,151       31.78       63.28
March 2021-March 2022 |     10,239       32.05       95.33
                    . |      1,491        4.67      100.00
----------------------+-----------------------------------
                Total |     31,942      100.00

. 
. *Define appointments and referrals======================================*/
. **Nb. not excluding those without 6m+ follow-up
. 
. **Rheumatology appt 
. tab rheum_appt  //proportion with first rheum outpatient date in the year bef
> ore EIA code appears in GP record (could change to two years)

 rheum_appt |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,981       16.87       16.87
          1 |     29,471       83.13      100.00
------------+-----------------------------------
      Total |     35,452      100.00

. tab rheum_appt if rheum_appt_date<eia_code_date & rheum_appt_date!=. //confir
> m proportion who had rheum appt (i.e. not missing) and appt before EIA code (
> should be accounted for by Python code)

 rheum_appt |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     23,985      100.00      100.00
------------+-----------------------------------
      Total |     23,985      100.00

. 
. **Rheumatology referrals
. tab referral_rheum_prerheum //last rheum referral in the year before rheumato
> logy outpatient (requires rheum appt to have been present, and rheum appt to 
> be before EIA code)

referral_rh |
eum_prerheu |
          m |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,521        9.93        9.93
          1 |     31,931       90.07      100.00
------------+-----------------------------------
      Total |     35,452      100.00

. tab referral_rheum_prerheum if rheum_appt!=0  //last rheum referral in the ye
> ar before rheumatology outpatient if rheum appt date present

referral_rh |
eum_prerheu |
          m |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,954       10.02       10.02
          1 |     26,517       89.98      100.00
------------+-----------------------------------
      Total |     29,471      100.00

. tab referral_rheum_prerheum if rheum_appt!=0 & referral_rheum_prerheum_date<r
> heum_appt_date  //last rheum referral in the year before rheumatology outpati
> ent, assuming ref date before rheum appt date (should be accounted for by Pyt
> hon code)

referral_rh |
eum_prerheu |
          m |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      8,760      100.00      100.00
------------+-----------------------------------
      Total |      8,760      100.00

. tab referral_rheum_precode //last rheum referral in the year before EIA code 
> (could use if rheum appt missing)

referral_rh |
eum_precode |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,580       10.10       10.10
          1 |     31,872       89.90      100.00
------------+-----------------------------------
      Total |     35,452      100.00

. gen referral_rheum_comb_date = referral_rheum_prerheum_date if referral_rheum
> _prerheum_date!=.
(3,521 missing values generated)

. replace referral_rheum_comb_date = referral_rheum_precode_date if referral_rh
> eum_prerheum_date==. & referral_rheum_precode_date!=.
(3,190 real changes made)

. format %td referral_rheum_comb_date

. codebook referral_rheum_comb_date

-------------------------------------------------------------------------------
referral_rheum_comb_date                                            (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric daily date (float)

                 range:  [21260,22757]                units:  1
       or equivalently:  [17mar2018,22apr2022]        units:  days
         unique values:  1,498                    missing .:  331/35,452

                  mean:   22011.3 = 06apr2020 (+ 7 hours)
              std. dev:   432.898

           percentiles:        10%       25%       50%       75%       90%
                             21410     21634     22013     22387     22609
                         14aug2018 26mar2019 08apr2020 17apr2021 25nov2021

. 
. **GP appointments
. tab last_gp_refrheum //proportion with last GP appointment in year before rhe
> um referral (pre-rheum appt); requires there to have been a rheum referral, b
> efore a rheum appt, before an EIA code

last_gp_ref |
      rheum |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,513        9.91        9.91
          1 |     31,939       90.09      100.00
------------+-----------------------------------
      Total |     35,452      100.00

. gen all_appts=1 if last_gp_refrheum==1 & referral_rheum_prerheum==1 & rheum_a
> ppt==1 & eia_code==1 & last_gp_refrheum_date<referral_rheum_prerheum_date & r
> eferral_rheum_prerheum_date<rheum_appt_date & rheum_appt_date<eia_code_date 
(34,405 missing values generated)

. recode all_appts .=0
(all_appts: 34405 changes made)

. tab all_appts, missing //KEY - proportion who had a last gp appt, then rheum 
> ref, then rheum appt, then EIA code 

  all_appts |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     34,405       97.05       97.05
          1 |      1,047        2.95      100.00
------------+-----------------------------------
      Total |     35,452      100.00

. tab last_gp_refcode //last GP appointment before rheum ref (i.e. pre-eia code
>  ref); requires there to have been a rheum referral before an EIA code (i.e. 
> rheum appt could have been missing)

last_gp_ref |
       code |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,576       10.09       10.09
          1 |     31,876       89.91      100.00
------------+-----------------------------------
      Total |     35,452      100.00

. tab last_gp_prerheum //last GP appointment before rheum appt; requires there 
> to have been a rheum appt before and EIA code

last_gp_pre |
      rheum |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,441        9.71        9.71
          1 |     32,011       90.29      100.00
------------+-----------------------------------
      Total |     35,452      100.00

. tab last_gp_precode //last GP appointment before EIA code

last_gp_pre |
       code |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,640       10.27       10.27
          1 |     31,812       89.73      100.00
------------+-----------------------------------
      Total |     35,452      100.00

. 
. **For sensitivity analyses for those without rheum_appt, replace diagnosis da
> te as EIA code date if rheum appt pre-code is missing or after
. gen eia_diagnosis_date_nomiss=rheum_appt_date if rheum_appt_date!=.
(5,981 missing values generated)

. format %td eia_diagnosis_date_nomiss

. replace eia_diagnosis_date_nomiss=eia_code_date if (rheum_appt_date==. | rheu
> m_appt_date>eia_code_date) & eia_code_date!=.
(11,454 real changes made)

. gen eia_diagnosis_nomiss=1 if eia_diagnosis_date_nomiss!=.

. recode eia_diagnosis_nomiss .=0
(eia_diagnosis_nomiss: 0 changes made)

. tab eia_diagnosis_nomiss

eia_diagnos |
  is_nomiss |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     35,452      100.00      100.00
------------+-----------------------------------
      Total |     35,452      100.00

. 
. *Time to referral, appointment and EIA code==================================
> ===========*/
. 
. **Time from last GP to rheum ref before rheum appt (i.e. if appts are present
>  and in correct time order) //Note - referral could (in theory) be coded just
>  before GP appt
. gen time_gp_rheum_ref_appt = (referral_rheum_prerheum_date - last_gp_refrheum
> _date) if referral_rheum_prerheum_date!=. & last_gp_refrheum_date!=. & rheum_
> appt_date!=. & referral_rheum_prerheum_date>last_gp_refrheum_date & referral_
> rheum_prerheum_date<rheum_appt_date & rheum_appt_date<eia_code_date
(34,405 missing values generated)

. tabstat time_gp_rheum_ref_appt, stats (n mean p50 p25 p75) //all patients (sh
> ould be same number as all_appts)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~t |      1047  256.5339       197        86       372
----------------------------------------------------------------

. 
. gen gp_ref_cat=1 if time_gp_rheum_ref_appt<=3 & time_gp_rheum_ref_appt!=. 
(35,440 missing values generated)

. replace gp_ref_cat=2 if time_gp_rheum_ref_appt<=7 & time_gp_rheum_ref_appt!=.
>  & gp_ref_cat==.
(17 real changes made)

. replace gp_ref_cat=3 if time_gp_rheum_ref_appt>7 & time_gp_rheum_ref_appt!=. 
> & gp_ref_cat==.
(1,018 real changes made)

. lab define gp_ref_cat 1 "Referred within 3 days" 2 "Referred within 7 days" 3
>  "Referral delay >7 days", modify

. lab val gp_ref_cat gp_ref_cat

. lab var gp_ref_cat "Time to GP referral"

. tab gp_ref_cat, missing

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |         12        0.03        0.03
Referred within 7 days |         17        0.05        0.08
Referral delay >7 days |      1,018        2.87        2.95
                     . |     34,405       97.05      100.00
-----------------------+-----------------------------------
                 Total |     35,452      100.00

. 
. gen gp_ref_3d=1 if time_gp_rheum_ref_appt<=3 & time_gp_rheum_ref_appt!=. 
(35,440 missing values generated)

. replace gp_ref_3d=2 if time_gp_rheum_ref_appt>3 & time_gp_rheum_ref_appt!=.
(1,035 real changes made)

. lab define gp_ref_3d 1 "Referred within 3 days" 2 "Referral delay >3 days", m
> odify

. lab val gp_ref_3d gp_ref_3d

. lab var gp_ref_3d "Time to GP referral"

. tab gp_ref_3d, missing

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |         12        0.03        0.03
Referral delay >3 days |      1,035        2.92        2.95
                     . |     34,405       97.05      100.00
-----------------------+-----------------------------------
                 Total |     35,452      100.00

. 
. **Time from last GP to rheum ref before eia code (sensitivity analysis; inclu
> des those with no rheum appt)
. gen time_gp_rheum_ref_code = (referral_rheum_precode_date - last_gp_refcode_d
> ate) if referral_rheum_precode_date!=. & last_gp_refcode_date!=. & referral_r
> heum_precode_date>last_gp_refcode_date & referral_rheum_precode_date<eia_code
> _date
(29,284 missing values generated)

. tabstat time_gp_rheum_ref_code, stats (n mean p50 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~e |      6168  383.3585       322       139       566
----------------------------------------------------------------

. 
. **Time from last GP to rheum ref (combined - sensitivity analysis; includes t
> hose with no rheum appt)
. gen time_gp_rheum_ref_comb = time_gp_rheum_ref_appt 
(34,405 missing values generated)

. replace time_gp_rheum_ref_comb = time_gp_rheum_ref_code if time_gp_rheum_ref_
> appt==. & time_gp_rheum_ref_code!=.
(5,918 real changes made)

. tabstat time_gp_rheum_ref_comb, stats (n mean p50 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~b |      6965  363.2027       295       127       536
----------------------------------------------------------------

. 
. **Time from last GP pre-rheum appt to first rheum appt (key sensitivity analy
> sis; includes those with no rheum ref)
. gen time_gp_rheum_appt = (rheum_appt_date - last_gp_prerheum_date) if rheum_a
> ppt_date!=. & last_gp_prerheum_date!=. & rheum_appt_date>last_gp_prerheum_dat
> e & rheum_appt_date<eia_code_date
(29,910 missing values generated)

. tabstat time_gp_rheum_appt, stats (n mean p50 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_~m_appt |      5542  295.1445       239       109       421
----------------------------------------------------------------

. 
. **Time from last GP pre-code to EIA code (sensitivity analysis; includes thos
> e with no rheum ref and/or no rheum appt)
. gen time_gp_eia_code = (eia_code_date - last_gp_precode_date) if eia_code_dat
> e!=. & last_gp_precode_date!=. & eia_code_date>last_gp_precode_date
(15,935 missing values generated)

. tabstat time_gp_eia_code, stats (n mean p50 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_ei~e |     19517  524.7604       476       234       774
----------------------------------------------------------------

. 
. **Time from last GP to EIA diagnosis (combined - sensitivity analysis; includ
> es those with no rheum appt)
. gen time_gp_eia_diag = time_gp_rheum_appt
(29,910 missing values generated)

. replace time_gp_eia_diag = time_gp_eia_code if time_gp_rheum_appt==. & time_g
> p_eia_code!=.
(16,008 real changes made)

. tabstat time_gp_eia_diag, stats (n mean p50 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_ei~g |     21550  456.6509       389       181       676
----------------------------------------------------------------

. 
. **Time from rheum ref to rheum appt (i.e. if appts are present and in correct
>  time order)
. gen time_ref_rheum_appt = (rheum_appt_date - referral_rheum_prerheum_date) if
>  rheum_appt_date!=. & referral_rheum_prerheum_date!=. & referral_rheum_prerhe
> um_date<rheum_appt_date & rheum_appt_date<eia_code_date
(29,900 missing values generated)

. tabstat time_ref_rheum_appt, stats (n mean p50 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~t |      5552  284.8927       225        98       418
----------------------------------------------------------------

. 
. gen ref_appt_cat=1 if time_ref_rheum_appt<=21 & time_ref_rheum_appt!=. 
(35,143 missing values generated)

. replace ref_appt_cat=2 if time_ref_rheum_appt<=42 & time_ref_rheum_appt!=. & 
> ref_appt_cat==.
(306 real changes made)

. replace ref_appt_cat=3 if time_ref_rheum_appt>42 & time_ref_rheum_appt!=. & r
> ef_appt_cat==.
(4,937 real changes made)

. lab define ref_appt_cat 1 "Seen within 3 weeks" 2 "Seen within 6 weeks" 3 "As
> sessment delay >6 weeks", modify

. lab val ref_appt_cat ref_appt_cat

. lab var ref_appt_cat "Time to rheumatology assessment"

. tab ref_appt_cat, missing

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |        309        0.87        0.87
      Seen within 6 weeks |        306        0.86        1.73
Assessment delay >6 weeks |      4,937       13.93       15.66
                        . |     29,900       84.34      100.00
--------------------------+-----------------------------------
                    Total |     35,452      100.00

. 
. gen ref_appt_3w=1 if time_ref_rheum_appt<=21 & time_ref_rheum_appt!=. 
(35,143 missing values generated)

. replace ref_appt_3w=2 if time_ref_rheum_appt>21 & time_ref_rheum_appt!=.
(5,243 real changes made)

. lab define ref_appt_3w 1 "Seen within 3 weeks" 2 "Assessment delay >3 weeks",
>  modify

. lab val ref_appt_3w ref_appt_3w

. lab var ref_appt_3w "Time to rheumatology assessment"

. tab ref_appt_3w, missing

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |        309        0.87        0.87
Assessment delay >3 weeks |      5,243       14.79       15.66
                        . |     29,900       84.34      100.00
--------------------------+-----------------------------------
                    Total |     35,452      100.00

. 
. **Time from rheum ref or last GP to rheum appt (combined - sensitivity analys
> is; includes those with no rheum ref)
. gen time_refgp_rheum_appt = time_ref_rheum_appt
(29,900 missing values generated)

. replace time_refgp_rheum_appt = time_gp_rheum_appt if time_ref_rheum_appt==. 
> & time_gp_rheum_appt!=.
(3,590 real changes made)

. tabstat time_refgp_rheum_appt, stats (n mean p50 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_refgp~t |      9142   272.344       216        95       392
----------------------------------------------------------------

. 
. **Time from rheum ref to EIA code (sensitivity analysis; includes those with 
> no rheum appt)
. gen time_ref_rheum_eia = (eia_code_date - referral_rheum_precode_date) if eia
> _code_date!=. & referral_rheum_precode_date!=. & referral_rheum_precode_date<
> eia_code_date  
(15,782 missing values generated)

. tabstat time_ref_rheum_eia, stats (n mean p50 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~a |     19670  522.0485       471       227       770
----------------------------------------------------------------

. 
. **Time from rheum ref to EIA diagnosis (combined - sensitivity analysis; incl
> udes those with no rheum appt)
. gen time_ref_rheum_eia_comb = time_ref_rheum_appt
(29,900 missing values generated)

. replace time_ref_rheum_eia_comb = time_ref_rheum_eia if time_ref_rheum_appt==
> . & time_ref_rheum_eia!=.
(16,203 real changes made)

. tabstat time_ref_rheum_eia_comb, stats (n mean p50 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~b |     21755  454.0267       383       173       674
----------------------------------------------------------------

. 
. **Time from rheum appt to EIA code (i.e. if appts are present and in correct 
> time order)
. gen time_rheum_eia_code = (eia_code_date - rheum_appt_date) if eia_code_date!
> =. & rheum_appt_date!=. & rheum_appt_date<eia_code_date 
(11,467 missing values generated)

. tabstat time_rheum_eia_code, stats (n mean p50 p25 p75) 

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_rheum~e |     23985   605.923       577       318       875
----------------------------------------------------------------

. 
. *Time to first csDMARD prescriptions - all of the below are shared care presc
> riptions, aside from those with MTX_high cost drug data included=============
> =========================================================*/
. 
. *All patients below must have at least six months of GP registration after EI
> A code
. 
. **Time to first csDMARD script for RA patients, whereby first rheum appt is c
> lassed as diagnosis date (if rheum appt present and before csDMARD date; not 
> including high cost MTX prescriptions)
. gen time_to_csdmard=(csdmard_date-rheum_appt_date) if csdmard==1 & rheum_appt
> _date!=. & csdmard_date>rheum_appt_date 
(25,325 missing values generated)

. tabstat time_to_csdmard if ra_code==1 & has_6m_follow_up==1, stats (n mean p5
> 0 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_cs~d |      3212  565.9019     525.5     282.5       816
----------------------------------------------------------------

. 
. **Time to first csDMARD script for RA patients (including high cost MTX presc
> riptions)
. gen time_to_csdmard_hcd=(csdmard_hcd_date-rheum_appt_date) if csdmard_hcd==1 
> & rheum_appt_date!=. & csdmard_hcd_date>rheum_appt_date 
(23,953 missing values generated)

. tabstat time_to_csdmard_hcd if ra_code==1 & has_6m_follow_up==1, stats (n mea
> n p50 p25 p75) 

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_c~cd |      3665  556.4477       508       278       807
----------------------------------------------------------------

. 
. **Time to first csDMARD script for PsA patients (not including high cost MTX 
> prescriptions)
. tabstat time_to_csdmard if psa_code==1 & has_6m_follow_up==1, stats (n mean p
> 50 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_c~rd |      3130  566.3559       521       289       810
----------------------------------------------------------------

. 
. **Time to first csDMARD script for PsA patients (including high cost MTX pres
> criptions)
. tabstat time_to_csdmard_hcd if psa_code==1 & has_6m_follow_up==1, stats (n me
> an p50 p25 p75) 

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_c~cd |      3564  560.8465       516       289       796
----------------------------------------------------------------

. 
. **csDMARD time categories for RA patients (not including high cost MTX prescr
> iptions)
. gen csdmard_3m=1 if time_to_csdmard<=90 & time_to_csdmard!=. 
(34,771 missing values generated)

. replace csdmard_3m=2 if time_to_csdmard>90 & time_to_csdmard!=.
(9,446 real changes made)

. lab define csdmard_3m 1 "Yes" 2 "No", modify

. lab val csdmard_3m csdmard_3m

. lab var csdmard_3m "csDMARD within 3 months" 

. tab csdmard_3m if ra_code==1 & has_6m_follow_up==1, missing //missing will be
>  patients with no rheum appt and/or rheum appt after csDMARD script

    csDMARD |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        223        1.97        1.97
         No |      2,989       26.43       28.41
          . |      8,095       71.59      100.00
------------+-----------------------------------
      Total |     11,307      100.00

. gen csdmard_6m=1 if time_to_csdmard<=180 & time_to_csdmard!=. 
(34,054 missing values generated)

. replace csdmard_6m=2 if time_to_csdmard>180 & time_to_csdmard!=.
(8,729 real changes made)

. lab define csdmard_6m 1 "Yes" 2 "No", modify

. lab val csdmard_6m csdmard_6m

. lab var csdmard_6m "csDMARD within 6 months" 

. tab csdmard_6m if ra_code==1 & has_6m_follow_up==1, missing //missing will be
>  patients with no rheum appt and/or rheum appt after csDMARD script

    csDMARD |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        454        4.02        4.02
         No |      2,758       24.39       28.41
          . |      8,095       71.59      100.00
------------+-----------------------------------
      Total |     11,307      100.00

. gen csdmard_12m=1 if time_to_csdmard<=365 & time_to_csdmard!=. 
(32,096 missing values generated)

. replace csdmard_12m=2 if time_to_csdmard>365 & time_to_csdmard!=.
(6,771 real changes made)

. lab define csdmard_12m 1 "Yes" 2 "No", modify

. lab val csdmard_12m csdmard_12m

. lab var csdmard_12m "csDMARD within 12 months" 

. tab csdmard_12m if ra_code==1 & has_12m_follow_up==1, missing //missing will 
> be patients with no rheum appt and/or rheum appt after csDMARD script

    csDMARD |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,038        9.74        9.74
         No |      2,001       18.77       28.51
          . |      7,622       71.49      100.00
------------+-----------------------------------
      Total |     10,661      100.00

. 
. **csDMARD time categories for RA patients (including high cost MTX prescripti
> ons)
. gen csdmard_hcd_3m=1 if time_to_csdmard_hcd<=90 & time_to_csdmard_hcd!=. 
(34,661 missing values generated)

. replace csdmard_hcd_3m=2 if time_to_csdmard_hcd>90 & time_to_csdmard_hcd!=.
(10,708 real changes made)

. lab define csdmard_hcd_3m 1 "Yes" 2 "No", modify

. lab val csdmard_hcd_3m csdmard_hcd_3m

. lab var csdmard_hcd_3m "csDMARD within 3 months" 

. tab csdmard_hcd_3m if ra_code==1 & has_6m_follow_up==1, missing //missing wil
> l be patients with no rheum appt and/or rheum appt after csDMARD script

    csDMARD |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        262        2.32        2.32
         No |      3,403       30.10       32.41
          . |      7,642       67.59      100.00
------------+-----------------------------------
      Total |     11,307      100.00

. gen csdmard_hcd_6m=1 if time_to_csdmard_hcd<=180 & time_to_csdmard_hcd!=. 
(33,832 missing values generated)

. replace csdmard_hcd_6m=2 if time_to_csdmard_hcd>180 & time_to_csdmard_hcd!=.
(9,879 real changes made)

. lab define csdmard_hcd_6m 1 "Yes" 2 "No", modify

. lab val csdmard_hcd_6m csdmard_hcd_6m

. lab var csdmard_hcd_6m "csDMARD within 6 months" 

. tab csdmard_hcd_6m if ra_code==1 & has_6m_follow_up==1, missing //missing wil
> l be patients with no rheum appt and/or rheum appt after csDMARD script

    csDMARD |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        534        4.72        4.72
         No |      3,131       27.69       32.41
          . |      7,642       67.59      100.00
------------+-----------------------------------
      Total |     11,307      100.00

. gen csdmard_hcd_12m=1 if time_to_csdmard_hcd<=365 & time_to_csdmard_hcd!=. 
(31,599 missing values generated)

. replace csdmard_hcd_12m=2 if time_to_csdmard_hcd>365 & time_to_csdmard_hcd!=.
(7,646 real changes made)

. lab define csdmard_hcd_12m 1 "Yes" 2 "No", modify

. lab val csdmard_hcd_12m csdmard_hcd_12m

. lab var csdmard_hcd_12m "csDMARD within 12 months" 

. tab csdmard_hcd_12m if ra_code==1 & has_12m_follow_up==1, missing //missing w
> ill be patients with no rheum appt and/or rheum appt after csDMARD script

    csDMARD |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,226       11.50       11.50
         No |      2,259       21.19       32.69
          . |      7,176       67.31      100.00
------------+-----------------------------------
      Total |     10,661      100.00

. 
. **csDMARD time categories for PsA patients (not including high cost MTX presc
> riptions)
. tab csdmard_3m if psa_code==1 & has_6m_follow_up==1, missing

    csDMARD |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        198        1.79        1.79
         No |      2,932       26.52       28.31
          . |      7,925       71.69      100.00
------------+-----------------------------------
      Total |     11,055      100.00

. tab csdmard_6m if psa_code==1 & has_6m_follow_up==1, missing

    csDMARD |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        432        3.91        3.91
         No |      2,698       24.41       28.31
          . |      7,925       71.69      100.00
------------+-----------------------------------
      Total |     11,055      100.00

. tab csdmard_12m if psa_code==1 & has_12m_follow_up==1, missing

    csDMARD |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        996        9.45        9.45
         No |      1,998       18.95       28.40
          . |      7,548       71.60      100.00
------------+-----------------------------------
      Total |     10,542      100.00

. 
. **csDMARD time categories for PsA patients (including high cost MTX prescript
> ions)
. tab csdmard_hcd_3m if psa_code==1 & has_6m_follow_up==1, missing

    csDMARD |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        234        2.12        2.12
         No |      3,330       30.12       32.24
          . |      7,491       67.76      100.00
------------+-----------------------------------
      Total |     11,055      100.00

. tab csdmard_hcd_6m if psa_code==1 & has_6m_follow_up==1, missing

    csDMARD |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        501        4.53        4.53
         No |      3,063       27.71       32.24
          . |      7,491       67.76      100.00
------------+-----------------------------------
      Total |     11,055      100.00

. tab csdmard_hcd_12m if psa_code==1 & has_12m_follow_up==1, missing

    csDMARD |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,132       10.74       10.74
         No |      2,276       21.59       32.33
          . |      7,134       67.67      100.00
------------+-----------------------------------
      Total |     10,542      100.00

. 
. **What was first shared care csDMARD (not including high cost MTX prescriptio
> ns)
. gen first_csD=""
(35,452 missing values generated)

. foreach var of varlist hydroxychloroquine_date leflunomide_date methotrexate_
> date methotrexate_inj_date sulfasalazine_date {
  2.         replace first_csD="`var'" if csdmard_date==`var' & csdmard_date!=.
  3.         }
variable first_csD was str1 now str23
(2,548 real changes made)
(2,496 real changes made)
(2,539 real changes made)
(2,536 real changes made)
(2,509 real changes made)

. gen first_csDMARD = substr(first_csD, 1, length(first_csD) - 5) if first_csD!
> =""
(22,828 missing values generated)

. drop first_csD

. tab first_csDMARD if ra_code==1 & has_6m_follow_up==1 //for RA patients

     first_csDMARD |      Freq.     Percent        Cum.
-------------------+-----------------------------------
hydroxychloroquine |        827       20.75       20.75
       leflunomide |        772       19.37       40.12
      methotrexate |        777       19.49       59.61
  methotrexate_inj |        828       20.77       80.38
     sulfasalazine |        782       19.62      100.00
-------------------+-----------------------------------
             Total |      3,986      100.00

. tab first_csDMARD if psa_code==1 & has_6m_follow_up==1 //for PsA patients

     first_csDMARD |      Freq.     Percent        Cum.
-------------------+-----------------------------------
hydroxychloroquine |        760       19.40       19.40
       leflunomide |        789       20.14       39.55
      methotrexate |        800       20.42       59.97
  methotrexate_inj |        766       19.56       79.53
     sulfasalazine |        802       20.47      100.00
-------------------+-----------------------------------
             Total |      3,917      100.00

. 
. **What was first csDMARD (including high cost MTX prescriptions)
. gen first_csD_hcd=""
(35,452 missing values generated)

. foreach var of varlist hydroxychloroquine_date leflunomide_date methotrexate_
> date methotrexate_inj_date methotrexate_hcd_date sulfasalazine_date {
  2.         replace first_csD_hcd="`var'" if csdmard_hcd_date==`var' & csdmard
> _hcd_date!=.
  3.         }
variable first_csD_hcd was str1 now str23
(2,437 real changes made)
(2,377 real changes made)
(2,403 real changes made)
(2,400 real changes made)
(2,897 real changes made)
(2,386 real changes made)

. gen first_csDMARD_hcd = substr(first_csD_hcd, 1, length(first_csD_hcd) - 5) i
> f first_csD_hcd!=""
(20,557 missing values generated)

. drop first_csD_hcd

. tab first_csDMARD_hcd if ra_code==1 & has_6m_follow_up==1 //for RA patients

 first_csDMARD_hcd |      Freq.     Percent        Cum.
-------------------+-----------------------------------
hydroxychloroquine |        788       16.68       16.68
       leflunomide |        727       15.39       32.07
      methotrexate |        738       15.62       47.69
  methotrexate_hcd |        944       19.98       67.68
  methotrexate_inj |        789       16.70       84.38
     sulfasalazine |        738       15.62      100.00
-------------------+-----------------------------------
             Total |      4,724      100.00

. tab first_csDMARD_hcd if psa_code==1 & has_6m_follow_up==1 //for PsA patients

 first_csDMARD_hcd |      Freq.     Percent        Cum.
-------------------+-----------------------------------
hydroxychloroquine |        723       15.59       15.59
       leflunomide |        754       16.26       31.85
      methotrexate |        753       16.24       48.09
  methotrexate_hcd |        913       19.69       67.78
  methotrexate_inj |        731       15.76       83.55
     sulfasalazine |        763       16.45      100.00
-------------------+-----------------------------------
             Total |      4,637      100.00

.  
. **Methotrexate use (not including high cost MTX prescriptions)
. gen mtx=1 if methotrexate==1 | methotrexate_inj==1
(29,656 missing values generated)

. recode mtx .=0 
(mtx: 29656 changes made)

. tab mtx if ra_code==1 & has_6m_follow_up==1 //for RA patients; Nb. this is ju
> st a check; need time-to-MTX instead (below)

        mtx |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      9,468       83.74       83.74
          1 |      1,839       16.26      100.00
------------+-----------------------------------
      Total |     11,307      100.00

. tab mtx if psa_code==1 & has_6m_follow_up==1 //for PsA patients

        mtx |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      9,246       83.64       83.64
          1 |      1,809       16.36      100.00
------------+-----------------------------------
      Total |     11,055      100.00

. 
. **Methotrexate use (including high cost MTX prescriptions)
. gen mtx_hcd=1 if methotrexate==1 | methotrexate_inj==1 | methotrexate_hcd==1
(26,745 missing values generated)

. recode mtx_hcd .=0 
(mtx_hcd: 26745 changes made)

. tab mtx_hcd if ra_code==1 & has_6m_follow_up==1 //for RA patients

    mtx_hcd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,512       75.28       75.28
          1 |      2,795       24.72      100.00
------------+-----------------------------------
      Total |     11,307      100.00

. tab mtx_hcd if psa_code==1 & has_6m_follow_up==1 //for PsA patients

    mtx_hcd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,324       75.30       75.30
          1 |      2,731       24.70      100.00
------------+-----------------------------------
      Total |     11,055      100.00

. 
. **Date of first methotrexate script (not including high cost MTX prescription
> s)
. gen mtx_date=min(methotrexate_date, methotrexate_inj_date)
(29,656 missing values generated)

. format %td mtx_date

. 
. **Date of first methotrexate script (including high cost MTX prescriptions)
. gen mtx_hcd_date=min(methotrexate_date, methotrexate_inj_date, methotrexate_h
> cd_date)
(26,745 missing values generated)

. format %td mtx_hcd_date

. 
. **Time to first methotrexate script for RA patients (not including high cost 
> MTX prescriptions)
. gen time_to_mtx=(mtx_date-rheum_appt_date) if mtx==1 & rheum_appt_date!=. & m
> tx_date>rheum_appt_date 
(30,779 missing values generated)

. tabstat time_to_mtx if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p2
> 5 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |      1499  591.9066       562       316       838
----------------------------------------------------------------

. 
. **Time to first methotrexate script for RA patients (including high cost MTX 
> prescriptions)
. gen time_to_mtx_hcd=(mtx_hcd_date-rheum_appt_date) if mtx_hcd==1 & rheum_appt
> _date!=. & mtx_hcd_date>rheum_appt_date 
(28,890 missing values generated)

. tabstat time_to_mtx_hcd if ra_code==1 & has_6m_follow_up==1, stats (n mean p5
> 0 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_mt~d |      2129  583.5007       541       303       836
----------------------------------------------------------------

. 
. **Time to first methotrexate script for PsA patients (not including high cost
>  MTX prescriptions)
. tabstat time_to_mtx if psa_code==1 & has_6m_follow_up==1, stats (n mean p50 p
> 25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |      1441  600.7578       574       319       853
----------------------------------------------------------------

. 
. **Time to first methotrexate script for PsA patients (including high cost MTX
>  prescriptions)
. tabstat time_to_mtx_hcd if psa_code==1 & has_6m_follow_up==1, stats (n mean p
> 50 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_mt~d |      2044  593.3811       569     319.5       839
----------------------------------------------------------------

. 
. **Methotrexate time categories for RA patients (not including high-cost MTX) 
> //Nb. this is time period from rheum appt (i.e. diagnosis) to shared care, no
> t from referral to first script 
. gen mtx_3m=1 if time_to_mtx<=90 & time_to_mtx!=. 
(35,166 missing values generated)

. replace mtx_3m=2 if time_to_mtx>90 & time_to_mtx!=.
(4,387 real changes made)

. lab define mtx_3m 1 "Yes" 2 "No", modify

. lab val mtx_3m mtx_3m

. lab var mtx_3m "Methotrexate within 3 months" 

. tab mtx_3m if ra_code==1 & has_6m_follow_up==1, missing //missing will be pat
> ients with no rheum appt and/or rheum appt after csDMARD script

Methotrexat |
 e within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         86        0.76        0.76
         No |      1,413       12.50       13.26
          . |      9,808       86.74      100.00
------------+-----------------------------------
      Total |     11,307      100.00

. gen mtx_6m=1 if time_to_mtx<=180 & time_to_mtx!=. 
(34,889 missing values generated)

. replace mtx_6m=2 if time_to_mtx>180 & time_to_mtx!=.
(4,110 real changes made)

. lab define mtx_6m 1 "Yes" 2 "No", modify

. lab val mtx_6m mtx_6m

. lab var mtx_6m "Methotrexate within 6 months" 

. tab mtx_6m if ra_code==1 & has_6m_follow_up==1, missing //missing will be pat
> ients with no rheum appt and/or rheum appt after csDMARD script

Methotrexat |
 e within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        181        1.60        1.60
         No |      1,318       11.66       13.26
          . |      9,808       86.74      100.00
------------+-----------------------------------
      Total |     11,307      100.00

. gen mtx_12m=1 if time_to_mtx<=365 & time_to_mtx!=. 
(34,047 missing values generated)

. replace mtx_12m=2 if time_to_mtx>365 & time_to_mtx!=.
(3,268 real changes made)

. lab define mtx_12m 1 "Yes" 2 "No", modify

. lab val mtx_12m mtx_12m

. lab var mtx_12m "Methotrexate within 12 months" 

. tab mtx_12m if ra_code==1 & has_12m_follow_up==1, missing //missing will be p
> atients with no rheum appt and/or rheum appt after mtx script

Methotrexat |
e within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        445        4.17        4.17
         No |        991        9.30       13.47
          . |      9,225       86.53      100.00
------------+-----------------------------------
      Total |     10,661      100.00

. 
. **Methotrexate time categories for RA patients (including high-cost MTX)
. gen mtx_hcd_3m=1 if time_to_mtx_hcd<=90 & time_to_mtx_hcd!=. 
(35,041 missing values generated)

. replace mtx_hcd_3m=2 if time_to_mtx_hcd>90 & time_to_mtx_hcd!=.
(6,151 real changes made)

. lab define mtx_hcd_3m 1 "Yes" 2 "No", modify

. lab val mtx_hcd_3m mtx_hcd_3m

. lab var mtx_hcd_3m "Methotrexate within 3 months" 

. tab mtx_hcd_3m if ra_code==1 & has_6m_follow_up==1, missing //missing will be
>  patients with no rheum appt and/or rheum appt after csDMARD script

Methotrexat |
 e within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        131        1.16        1.16
         No |      1,998       17.67       18.83
          . |      9,178       81.17      100.00
------------+-----------------------------------
      Total |     11,307      100.00

. gen mtx_hcd_6m=1 if time_to_mtx_hcd<=180 & time_to_mtx_hcd!=. 
(34,634 missing values generated)

. replace mtx_hcd_6m=2 if time_to_mtx_hcd>180 & time_to_mtx_hcd!=.
(5,744 real changes made)

. lab define mtx_hcd_6m 1 "Yes" 2 "No", modify

. lab val mtx_hcd_6m mtx_hcd_6m

. lab var mtx_hcd_6m "Methotrexate within 6 months" 

. tab mtx_hcd_6m if ra_code==1 & has_6m_follow_up==1, missing //missing will be
>  patients with no rheum appt and/or rheum appt after csDMARD script

Methotrexat |
 e within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        271        2.40        2.40
         No |      1,858       16.43       18.83
          . |      9,178       81.17      100.00
------------+-----------------------------------
      Total |     11,307      100.00

. gen mtx_hcd_12m=1 if time_to_mtx_hcd<=365 & time_to_mtx_hcd!=. 
(33,465 missing values generated)

. replace mtx_hcd_12m=2 if time_to_mtx_hcd>365 & time_to_mtx_hcd!=.
(4,575 real changes made)

. lab define mtx_hcd_12m 1 "Yes" 2 "No", modify

. lab val mtx_hcd_12m mtx_hcd_12m

. lab var mtx_hcd_12m "Methotrexate within 12 months" 

. tab mtx_hcd_12m if ra_code==1 & has_12m_follow_up==1, missing //missing will 
> be patients with no rheum appt and/or rheum appt after csDMARD script

Methotrexat |
e within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        658        6.17        6.17
         No |      1,387       13.01       19.18
          . |      8,616       80.82      100.00
------------+-----------------------------------
      Total |     10,661      100.00

. 
. **Methotrexate time categories for PsA patients (not including high-cost MTX)
. tab mtx_3m if psa_code==1 & has_6m_follow_up==1, missing

Methotrexat |
 e within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         89        0.81        0.81
         No |      1,352       12.23       13.03
          . |      9,614       86.97      100.00
------------+-----------------------------------
      Total |     11,055      100.00

. tab mtx_6m if psa_code==1 & has_6m_follow_up==1, missing

Methotrexat |
 e within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        172        1.56        1.56
         No |      1,269       11.48       13.03
          . |      9,614       86.97      100.00
------------+-----------------------------------
      Total |     11,055      100.00

. tab mtx_12m if psa_code==1 & has_12m_follow_up==1, missing //with a least 12m
>  registration

Methotrexat |
e within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        405        3.84        3.84
         No |        964        9.14       12.99
          . |      9,173       87.01      100.00
------------+-----------------------------------
      Total |     10,542      100.00

. 
. **Methotrexate time categories for PsA patients (including high-cost MTX)
. tab mtx_hcd_3m if psa_code==1 & has_6m_follow_up==1, missing

Methotrexat |
 e within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        129        1.17        1.17
         No |      1,915       17.32       18.49
          . |      9,011       81.51      100.00
------------+-----------------------------------
      Total |     11,055      100.00

. tab mtx_hcd_6m if psa_code==1 & has_6m_follow_up==1, missing

Methotrexat |
 e within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        254        2.30        2.30
         No |      1,790       16.19       18.49
          . |      9,011       81.51      100.00
------------+-----------------------------------
      Total |     11,055      100.00

. tab mtx_hcd_12m if psa_code==1 & has_12m_follow_up==1, missing //with a least
>  12m registration

Methotrexat |
e within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        573        5.44        5.44
         No |      1,375       13.04       18.48
          . |      8,594       81.52      100.00
------------+-----------------------------------
      Total |     10,542      100.00

. 
. **Sulfasalazine use
. gen time_to_ssz=(sulfasalazine_date-rheum_appt_date) if sulfasalazine==1 & rh
> eum_appt_date!=. & sulfasalazine_date>rheum_appt_date 
(33,062 missing values generated)

. tabstat time_to_ssz if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p2
> 5 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |       765  585.0758       559       297       841
----------------------------------------------------------------

. 
. **Sulfasalazine time categories for RA patients //Nb. this is time period fro
> m rheum appt (i.e. diagnosis) to shared care, not from referral to first scri
> pt 
. gen ssz_3m=1 if time_to_ssz<=90 & time_to_ssz!=. 
(35,319 missing values generated)

. replace ssz_3m=2 if time_to_ssz>90 & time_to_ssz!=.
(2,257 real changes made)

. lab define ssz_3m 1 "Yes" 2 "No", modify

. lab val ssz_3m ssz_3m

. lab var ssz_3m "Sulfasalazine within 3 months" 

. tab ssz_3m if ra_code==1 & has_6m_follow_up==1, missing //missing will be pat
> ients with no rheum appt and/or rheum appt after csDMARD script

Sulfasalazi |
ne within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         47        0.42        0.42
         No |        718        6.35        6.77
          . |     10,542       93.23      100.00
------------+-----------------------------------
      Total |     11,307      100.00

. gen ssz_6m=1 if time_to_ssz<=180 & time_to_ssz!=. 
(35,154 missing values generated)

. replace ssz_6m=2 if time_to_ssz>180 & time_to_ssz!=.
(2,092 real changes made)

. lab define ssz_6m 1 "Yes" 2 "No", modify

. lab val ssz_6m ssz_6m

. lab var ssz_6m "Sulfasalazine within 6 months" 

. tab ssz_6m if ra_code==1 & has_6m_follow_up==1, missing //missing will be pat
> ients with no rheum appt and/or rheum appt after csDMARD script

Sulfasalazi |
ne within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        105        0.93        0.93
         No |        660        5.84        6.77
          . |     10,542       93.23      100.00
------------+-----------------------------------
      Total |     11,307      100.00

. gen ssz_12m=1 if time_to_ssz<=365 & time_to_ssz!=. 
(34,738 missing values generated)

. replace ssz_12m=2 if time_to_ssz>365 & time_to_ssz!=.
(1,676 real changes made)

. lab define ssz_12m 1 "Yes" 2 "No", modify

. lab val ssz_12m ssz_12m

. lab var ssz_12m "Sulfasalazine within 12 months" 

. tab ssz_12m if ra_code==1 & has_12m_follow_up==1, missing //missing will be p
> atients with no rheum appt and/or rheum appt after ssz script

Sulfasalazi |
  ne within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        227        2.13        2.13
         No |        480        4.50        6.63
          . |      9,954       93.37      100.00
------------+-----------------------------------
      Total |     10,661      100.00

. 
. **Sulfasalazine time categories for PsA patients
. tab ssz_3m if psa_code==1 & has_6m_follow_up==1, missing

Sulfasalazi |
ne within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         38        0.34        0.34
         No |        716        6.48        6.82
          . |     10,301       93.18      100.00
------------+-----------------------------------
      Total |     11,055      100.00

. tab ssz_6m if psa_code==1 & has_6m_follow_up==1, missing

Sulfasalazi |
ne within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         86        0.78        0.78
         No |        668        6.04        6.82
          . |     10,301       93.18      100.00
------------+-----------------------------------
      Total |     11,055      100.00

. tab ssz_12m if psa_code==1 & has_12m_follow_up==1, missing //with a least 12m
>  registration

Sulfasalazi |
  ne within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        209        1.98        1.98
         No |        521        4.94        6.92
          . |      9,812       93.08      100.00
------------+-----------------------------------
      Total |     10,542      100.00

. 
. **Hydroxychloroquine use
. gen time_to_hcq=(hydroxychloroquine_date-rheum_appt_date) if hydroxychloroqui
> ne==1 & rheum_appt_date!=. & hydroxychloroquine_date>rheum_appt_date 
(33,036 missing values generated)

. tabstat time_to_hcq if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p2
> 5 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |       783  606.5517       577       298       891
----------------------------------------------------------------

. 
. **Hydroxychloroquine time categories for RA patients //Nb. this is time perio
> d from rheum appt (i.e. diagnosis) to shared care, not from referral to first
>  script 
. gen hcq_3m=1 if time_to_hcq<=90 & time_to_hcq!=. 
(35,309 missing values generated)

. replace hcq_3m=2 if time_to_hcq>90 & time_to_hcq!=.
(2,273 real changes made)

. lab define hcq_3m 1 "Yes" 2 "No", modify

. lab val hcq_3m hcq_3m

. lab var hcq_3m "Hydroxychloroquine within 3 months" 

. tab hcq_3m if ra_code==1 & has_6m_follow_up==1, missing //missing will be pat
> ients with no rheum appt and/or rheum appt after csDMARD script

Hydroxychlo |
    roquine |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         54        0.48        0.48
         No |        729        6.45        6.92
          . |     10,524       93.08      100.00
------------+-----------------------------------
      Total |     11,307      100.00

. gen hcq_6m=1 if time_to_hcq<=180 & time_to_hcq!=. 
(35,159 missing values generated)

. replace hcq_6m=2 if time_to_hcq>180 & time_to_hcq!=.
(2,123 real changes made)

. lab define hcq_6m 1 "Yes" 2 "No", modify

. lab val hcq_6m hcq_6m

. lab var hcq_6m "Hydroxychloroquine within 6 months" 

. tab hcq_6m if ra_code==1 & has_6m_follow_up==1, missing //missing will be pat
> ients with no rheum appt and/or rheum appt after csDMARD script

Hydroxychlo |
    roquine |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         96        0.85        0.85
         No |        687        6.08        6.92
          . |     10,524       93.08      100.00
------------+-----------------------------------
      Total |     11,307      100.00

. gen hcq_12m=1 if time_to_hcq<=365 & time_to_hcq!=. 
(34,742 missing values generated)

. replace hcq_12m=2 if time_to_hcq>365 & time_to_hcq!=.
(1,706 real changes made)

. lab define hcq_12m 1 "Yes" 2 "No", modify

. lab val hcq_12m hcq_12m

. lab var hcq_12m "Hydroxychloroquine within 12 months" 

. tab hcq_12m if ra_code==1 & has_12m_follow_up==1, missing //missing will be p
> atients with no rheum appt and/or rheum appt after hcq script

Hydroxychlo |
    roquine |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        226        2.12        2.12
         No |        522        4.90        7.02
          . |      9,913       92.98      100.00
------------+-----------------------------------
      Total |     10,661      100.00

. 
. **Hydroxychloroquine time categories for PsA patients
. tab hcq_3m if psa_code==1 & has_6m_follow_up==1, missing

Hydroxychlo |
    roquine |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         34        0.31        0.31
         No |        687        6.21        6.52
          . |     10,334       93.48      100.00
------------+-----------------------------------
      Total |     11,055      100.00

. tab hcq_6m if psa_code==1 & has_6m_follow_up==1, missing

Hydroxychlo |
    roquine |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         92        0.83        0.83
         No |        629        5.69        6.52
          . |     10,334       93.48      100.00
------------+-----------------------------------
      Total |     11,055      100.00

. tab hcq_12m if psa_code==1 & has_12m_follow_up==1, missing //with a least 12m
>  registration

Hydroxychlo |
    roquine |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        213        2.02        2.02
         No |        476        4.52        6.54
          . |      9,853       93.46      100.00
------------+-----------------------------------
      Total |     10,542      100.00

. 
. **Leflunomide use
. gen time_to_lef=(leflunomide_date-rheum_appt_date) if leflunomide==1 & rheum_
> appt_date!=. & leflunomide_date>rheum_appt_date 
(33,061 missing values generated)

. tabstat time_to_lef if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p2
> 5 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |       742  604.7493       575       313       870
----------------------------------------------------------------

. 
. **Leflunomide time categories for RA patients //Nb. this is time period from 
> rheum appt (i.e. diagnosis) to shared care, not from referral to first script
>  
. gen lef_3m=1 if time_to_lef<=90 & time_to_lef!=. 
(35,325 missing values generated)

. replace lef_3m=2 if time_to_lef>90 & time_to_lef!=.
(2,264 real changes made)

. lab define lef_3m 1 "Yes" 2 "No", modify

. lab val lef_3m lef_3m

. lab var lef_3m "Leflunomide within 3 months" 

. tab lef_3m if ra_code==1 & has_6m_follow_up==1, missing //missing will be pat
> ients with no rheum appt and/or rheum appt after csDMARD script

Leflunomide |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         40        0.35        0.35
         No |        702        6.21        6.56
          . |     10,565       93.44      100.00
------------+-----------------------------------
      Total |     11,307      100.00

. gen lef_6m=1 if time_to_lef<=180 & time_to_lef!=. 
(35,177 missing values generated)

. replace lef_6m=2 if time_to_lef>180 & time_to_lef!=.
(2,116 real changes made)

. lab define lef_6m 1 "Yes" 2 "No", modify

. lab val lef_6m lef_6m

. lab var lef_6m "Leflunomide within 6 months" 

. tab lef_6m if ra_code==1 & has_6m_follow_up==1, missing //missing will be pat
> ients with no rheum appt and/or rheum appt after csDMARD script

Leflunomide |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         87        0.77        0.77
         No |        655        5.79        6.56
          . |     10,565       93.44      100.00
------------+-----------------------------------
      Total |     11,307      100.00

. gen lef_12m=1 if time_to_lef<=365 & time_to_lef!=. 
(34,759 missing values generated)

. replace lef_12m=2 if time_to_lef>365 & time_to_lef!=.
(1,698 real changes made)

. lab define lef_12m 1 "Yes" 2 "No", modify

. lab val lef_12m lef_12m

. lab var lef_12m "Leflunomide within 12 months" 

. tab lef_12m if ra_code==1 & has_12m_follow_up==1, missing //missing will be p
> atients with no rheum appt and/or rheum appt after lef script

Leflunomide |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        206        1.93        1.93
         No |        487        4.57        6.50
          . |      9,968       93.50      100.00
------------+-----------------------------------
      Total |     10,661      100.00

. 
. **Leflunomide time categories for PsA patients
. tab lef_3m if psa_code==1 & has_6m_follow_up==1, missing

Leflunomide |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         38        0.34        0.34
         No |        711        6.43        6.78
          . |     10,306       93.22      100.00
------------+-----------------------------------
      Total |     11,055      100.00

. tab lef_6m if psa_code==1 & has_6m_follow_up==1, missing

Leflunomide |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         87        0.79        0.79
         No |        662        5.99        6.78
          . |     10,306       93.22      100.00
------------+-----------------------------------
      Total |     11,055      100.00

. tab lef_12m if psa_code==1 & has_12m_follow_up==1, missing //with a least 12m
>  registration

Leflunomide |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        217        2.06        2.06
         No |        504        4.78        6.84
          . |      9,821       93.16      100.00
------------+-----------------------------------
      Total |     10,542      100.00

. 
. **Time to first biologic script, whereby first rheum appt is classed as diagn
> osis date (assumes rheum appt present); high_cost drug data available to Nov 
> 2020======================================================================*/
. 
. *Below analyses are only for patients with at least 12 months of follow-up av
> ailable after EIA code
. gen time_to_biologic=(biologic_date-rheum_appt_date) if biologic==1 & rheum_a
> ppt_date!=. & biologic_date>rheum_appt_date 
(14,378 missing values generated)

. tabstat time_to_biologic if has_12m_follow_up==1, stats (n mean p50 p25 p75) 
> //for all EIA patients

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_bi~c |     19059  462.5162       409       210       665
----------------------------------------------------------------

. 
. **What was first biologic
. gen first_bio=""
(35,452 missing values generated)

. foreach var of varlist abatacept_date adalimumab_date baricitinib_date certol
> izumab_date etanercept_date golimumab_date guselkumab_date infliximab_date ix
> ekizumab_date rituximab_date sarilumab_date secukinumab_date tocilizumab_date
>  tofacitinib_date upadacitinib_date ustekinumab_date {
  2.         replace first_bio="`var'" if biologic_date==`var' & biologic_date!
> =.
  3.         }
variable first_bio was str1 now str14
(1,657 real changes made)
variable first_bio was str14 now str15
(1,636 real changes made)
variable first_bio was str15 now str16
(1,684 real changes made)
variable first_bio was str16 now str17
(1,649 real changes made)
(1,665 real changes made)
(1,657 real changes made)
(1,601 real changes made)
(1,677 real changes made)
(1,690 real changes made)
(1,630 real changes made)
(1,634 real changes made)
(1,725 real changes made)
(1,639 real changes made)
(1,640 real changes made)
(1,689 real changes made)
(1,636 real changes made)

. gen first_biologic = substr(first_bio, 1, length(first_bio) - 5)        
(9,453 missing values generated)

. drop first_bio

. tab first_biologic if has_12m_follow_up==1 //for all EIA patients

first_biolog |
          ic |      Freq.     Percent        Cum.
-------------+-----------------------------------
   abatacept |      1,472        6.27        6.27
  adalimumab |      1,446        6.16       12.44
 baricitinib |      1,447        6.17       18.60
certolizumab |      1,437        6.12       24.73
  etanercept |      1,433        6.11       30.83
   golimumab |      1,468        6.26       37.09
  guselkumab |      1,404        5.98       43.07
  infliximab |      1,470        6.26       49.34
  ixekizumab |      1,507        6.42       55.76
   rituximab |      1,462        6.23       61.99
   sarilumab |      1,449        6.18       68.17
 secukinumab |      1,558        6.64       74.81
 tocilizumab |      1,479        6.30       81.11
 tofacitinib |      1,450        6.18       87.29
upadacitinib |      1,516        6.46       93.75
 ustekinumab |      1,466        6.25      100.00
-------------+-----------------------------------
       Total |     23,464      100.00

. 
. **Biologic time categories (for all patients)
. gen biologic_3m=1 if time_to_biologic<=90 & time_to_biologic!=. 
(33,280 missing values generated)

. replace biologic_3m=2 if time_to_biologic>90 & time_to_biologic!=.
(18,902 real changes made)

. lab define biologic_3m 1 "Yes" 2 "No", modify

. lab val biologic_3m biologic_3m

. lab var biologic_3m "bDMARD/tsDMARD within 3 months" 

. tab biologic_3m if has_6m_follow_up==1, missing //missing will be patients wi
> th no rheum appt and/or rheum appt after bDMARD/tsDMARD script

bDMARD/tsDM |
 ARD within |
   3 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      2,067        6.13        6.13
         No |     17,980       53.36       59.49
          . |     13,650       40.51      100.00
------------+-----------------------------------
      Total |     33,697      100.00

. gen biologic_6m=1 if time_to_biologic<=180 & time_to_biologic!=. 
(30,970 missing values generated)

. replace biologic_6m=2 if time_to_biologic>180 & time_to_biologic!=.
(16,592 real changes made)

. lab define biologic_6m 1 "Yes" 2 "No", modify

. lab val biologic_6m biologic_6m

. lab var biologic_6m "bDMARD/tsDMARD within 6 months" 

. tab biologic_6m if has_6m_follow_up==1, missing //missing will be patients wi
> th no rheum appt and/or rheum appt after bDMARD/tsDMARD script

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      4,278       12.70       12.70
         No |     15,769       46.80       59.49
          . |     13,650       40.51      100.00
------------+-----------------------------------
      Total |     33,697      100.00

. gen biologic_12m=1 if time_to_biologic<=365 & time_to_biologic!=. 
(25,999 missing values generated)

. replace biologic_12m=2 if time_to_biologic>365 & time_to_biologic!=.
(11,621 real changes made)

. lab define biologic_12m 1 "Yes" 2 "No", modify

. lab val biologic_12m biologic_12m

. lab var biologic_12m "bDMARD/tsDMARD within 12 months" 

. tab biologic_12m if has_12m_follow_up==1, missing //missing will be patients 
> with no rheum appt and/or rheum appt after bDMARD/tsDMARD script

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      8,538       26.73       26.73
         No |     10,521       32.94       59.67
          . |     12,883       40.33      100.00
------------+-----------------------------------
      Total |     31,942      100.00

. 
. **Biologic time categories (by year)
. bys diagnosis_year: tab biologic_6m if has_6m_follow_up==1, missing //for all
>  EIA patients with at least 6m follow-up

-------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,344       12.69       12.69
         No |      4,918       46.45       59.14
          . |      4,326       40.86      100.00
------------+-----------------------------------
      Total |     10,588      100.00

-------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,335       12.40       12.40
         No |      5,006       46.50       58.90
          . |      4,424       41.10      100.00
------------+-----------------------------------
      Total |     10,765      100.00

-------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,398       13.02       13.02
         No |      5,080       47.31       60.33
          . |      4,260       39.67      100.00
------------+-----------------------------------
      Total |     10,738      100.00

-------------------------------------------------------------------------------
-> diagnosis_year = .

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        201       12.52       12.52
         No |        765       47.63       60.15
          . |        640       39.85      100.00
------------+-----------------------------------
      Total |      1,606      100.00


. bys diagnosis_year: tab biologic_12m if has_12m_follow_up==1, missing //for a
> ll EIA patients

-------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      2,701       26.85       26.85
         No |      3,312       32.92       59.77
          . |      4,048       40.23      100.00
------------+-----------------------------------
      Total |     10,061      100.00

-------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      2,627       25.88       25.88
         No |      3,357       33.07       58.95
          . |      4,167       41.05      100.00
------------+-----------------------------------
      Total |     10,151      100.00

-------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      2,792       27.27       27.27
         No |      3,371       32.92       60.19
          . |      4,076       39.81      100.00
------------+-----------------------------------
      Total |     10,239      100.00

-------------------------------------------------------------------------------
-> diagnosis_year = .

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        418       28.03       28.03
         No |        481       32.26       60.30
          . |        592       39.70      100.00
------------+-----------------------------------
      Total |      1,491      100.00


. 
. save "$projectdir/output/data/file_eia_all", replace
(note: file /workspace/output/data/file_eia_all.dta not found)
file /workspace/output/data/file_eia_all.dta saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/cleaning_dataset.log
  log type:  text
 closed on:   7 Apr 2022, 09:53:40
-------------------------------------------------------------------------------
