{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:/Users/k1754142/OneDrive/PhD Project/OpenSAFELY/Github Practice/logs/cleaning_dataset.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 4 Apr 2022, 16:56:11
{txt}
{com}. 
. di "$projectdir"
{res}C:/Users/k1754142/OneDrive/PhD Project/OpenSAFELY/Github Practice
{txt}
{com}. di "$logdir"
{res}C:/Users/k1754142/OneDrive/PhD Project/OpenSAFELY/Github Practice/logs
{txt}
{com}. 
. import delimited "$projectdir/output/input.csv", clear
{res}{txt}(encoding automatically selected: ISO-8859-1)
{res}{text}(65 vars, 100,000 obs)

{com}. 
. **Set Ado file path
. adopath + "$projectdir/analysis/extra_ados"
{txt}  [1]  (BASE)      "{res}C:\Program Files\Stata17\ado\base/{txt}"
  [2]  (SITE)      "{res}C:\Program Files\Stata17\ado\site/{txt}"
  [3]              "{res}.{txt}"
  [4]  (PERSONAL)  "{res}C:\Users\k1754142\ado\personal/{txt}"
  [5]  (PLUS)      "{res}C:\Users\k1754142\ado\plus/{txt}"
  [6]  (OLDPLACE)  "{res}c:\ado/{txt}"
  [7]              "{res}C:/Users/k1754142/OneDrive/PhD Project/OpenSAFELY/Github Practice/analysis/extra_ados{txt}"

{com}. 
. **Set index dates ===========================================================*/
. global year_preceding = "01/03/2018"
{txt}
{com}. global start_date = "01/03/2019"
{txt}
{com}. global end_date = "01/03/2022"
{txt}
{com}. 
. **Rename variables (some are too long for Stata to handle) =======================================*/
. rename chronic_respiratory_disease chronic_resp_disease
{res}{txt}
{com}. 
. **Convert date strings to dates ====================================================*/
. ***Some dates are given with month/year only, so adding day 15 to enable them to be processed as dates 
. 
. foreach var of varlist   hba1c_mmol_per_mol_date                        ///
>                                                  hba1c_percentage_date                          ///
>                                                  creatinine_date                                ///
>                                                  bmi_date_measured                          ///
>                                                  abatacept                                                      ///
>                                                  adalimumab                                                     ///     
>                                                  baricitinib                                            ///
>                                                  certolizumab                                           ///
>                                                  etanercept                                                     ///
>                                                  golimumab                                                      ///
>                                                  guselkumab                                                     ///     
>                                                  infliximab                                                     ///
>                                                  ixekizumab                                                     ///
>                                                  methotrexate_hcd                                       ///
>                                                  rituximab                                                      ///
>                                                  sarilumab                                                      ///
>                                                  secukinumab                                            ///     
>                                                  tocilizumab                                            ///
>                                                  tofacitinib                                            ///
>                                                  upadacitinib                                           ///
>                                                  ustekinumab                                            ///
>                                                  {c -(}
{txt}  2{com}.                                                         
.                 capture confirm string variable `var'
{txt}  3{com}.                 if _rc!=0 {c -(}
{txt}  4{com}.                         assert `var'==.
{txt}  5{com}.                         rename `var' `var'_date
{txt}  6{com}.                 {c )-}
{txt}  7{com}.         
.                 else {c -(}
{txt}  8{com}.                                 replace `var' = `var' + "-15"
{txt}  9{com}.                                 rename `var' `var'_dstr
{txt} 10{com}.                                 replace `var'_dstr = " " if `var'_dstr == "-15"
{txt} 11{com}.                                 gen `var'_date = date(`var'_dstr, "YMD") 
{txt} 12{com}.                                 order `var'_date, after(`var'_dstr)
{txt} 13{com}.                                 drop `var'_dstr
{txt} 14{com}.                 {c )-}
{txt} 15{com}.         
.         format `var'_date %td
{txt} 16{com}. {c )-}
{txt}variable {bf}{res}hba1c_mmol_per_mol_date{sf}{txt} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(5,000 real changes made)
(5,000 missing values generated)
variable {bf}{res}hba1c_percentage_date{sf}{txt} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(5,000 real changes made)
(5,000 missing values generated)
variable {bf}{res}creatinine_date{sf}{txt} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(5,000 real changes made)
(5,000 missing values generated)
variable {bf}{res}bmi_date_measured{sf}{txt} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(40,000 real changes made)
(40,000 missing values generated)
variable {bf}{res}abatacept{sf}{txt} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}{res}adalimumab{sf}{txt} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}{res}baricitinib{sf}{txt} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}{res}certolizumab{sf}{txt} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}{res}etanercept{sf}{txt} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}{res}golimumab{sf}{txt} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}{res}guselkumab{sf}{txt} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}{res}infliximab{sf}{txt} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}{res}ixekizumab{sf}{txt} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}{res}methotrexate_hcd{sf}{txt} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}{res}rituximab{sf}{txt} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}{res}sarilumab{sf}{txt} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}{res}secukinumab{sf}{txt} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}{res}tocilizumab{sf}{txt} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}{res}tofacitinib{sf}{txt} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}{res}upadacitinib{sf}{txt} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}{res}ustekinumab{sf}{txt} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)

{com}. 
. **Conversion for dates with day already included ====================================================*/
. 
. foreach var of varlist   died_date_ons                                          ///
>                                              eia_code_date                                              ///
>                                                  rheum_appt_date                                        ///
>                                              ra_code_date                                               ///
>                                                  psa_code_date                                          ///
>                                                  anksp_code_date                                        ///
>                                                  last_gp_prerheum_date                          ///
>                                                  last_gp_precode_date                           ///     
>                                                  last_gp_refrheum_date                          ///
>                                                  last_gp_refcode_date                           ///
>                                                  referral_rheum_prerheum                        ///
>                                                  referral_rheum_precode                         ///     
>                                                  chronic_cardiac_disease                        ///
>                                                  diabetes                                                       ///
>                                                  hypertension                                           ///     
>                                                  chronic_resp_disease                           ///
>                                                  copd                                                           ///
>                                                  chronic_liver_disease                          ///
>                                                  stroke                                                         ///
>                                                  lung_cancer                                            ///
>                                                  haem_cancer                                            ///
>                                                  other_cancer                                           ///
>                                                  esrf                                                           ///
>                                                  organ_transplant                                       ///
>                                                  hydroxychloroquine                                     ///
>                                                  leflunomide                                            ///
>                                                  methotrexate                                           ///
>                                                  methotrexate_inj                                       ///
>                                                  sulfasalazine                                          ///
>                                                  {c -(}
{txt}  2{com}.                                                                  
.                 capture confirm string variable `var'
{txt}  3{com}.                 if _rc!=0 {c -(}
{txt}  4{com}.                         assert `var'==.
{txt}  5{com}.                         rename `var' `var'_date
{txt}  6{com}.                 {c )-}
{txt}  7{com}.         
.                 else {c -(}
{txt}  8{com}.                                 rename `var' `var'_dstr
{txt}  9{com}.                                 gen `var'_date = date(`var'_dstr, "YMD") 
{txt} 10{com}.                                 order `var'_date, after(`var'_dstr)
{txt} 11{com}.                                 drop `var'_dstr
{txt} 12{com}.                                 gen `var'_date15 = `var'_date+15
{txt} 13{com}.                                 order `var'_date15, after(`var'_date)
{txt} 14{com}.                                 drop `var'_date
{txt} 15{com}.                                 rename `var'_date15 `var'_date
{txt} 16{com}.                 {c )-}
{txt} 17{com}.         
.         format `var'_date %td
{txt} 18{com}. {c )-}
{res}{txt}(90,000 missing values generated)
(90,000 missing values generated)
{res}{txt}(1,000 missing values generated)
(1,000 missing values generated)
{res}{txt}(9,999 missing values generated)
(9,999 missing values generated)
{res}{txt}(1,000 missing values generated)
(1,000 missing values generated)
{res}{txt}(1,000 missing values generated)
(1,000 missing values generated)
{res}{txt}(1,000 missing values generated)
(1,000 missing values generated)
{res}{txt}(9,999 missing values generated)
(9,999 missing values generated)
{res}{txt}(9,999 missing values generated)
(9,999 missing values generated)
{res}{txt}(9,999 missing values generated)
(9,999 missing values generated)
{res}{txt}(9,999 missing values generated)
(9,999 missing values generated)
{res}{txt}(9,999 missing values generated)
(9,999 missing values generated)
{res}{txt}(9,999 missing values generated)
(9,999 missing values generated)
{res}{txt}(80,000 missing values generated)
(80,000 missing values generated)
{res}{txt}(80,000 missing values generated)
(80,000 missing values generated)
{res}{txt}(80,000 missing values generated)
(80,000 missing values generated)
{res}{txt}(80,000 missing values generated)
(80,000 missing values generated)
{res}{txt}(80,000 missing values generated)
(80,000 missing values generated)
{res}{txt}(80,000 missing values generated)
(80,000 missing values generated)
{res}{txt}(80,000 missing values generated)
(80,000 missing values generated)
{res}{txt}(80,000 missing values generated)
(80,000 missing values generated)
{res}{txt}(80,000 missing values generated)
(80,000 missing values generated)
{res}{txt}(80,000 missing values generated)
(80,000 missing values generated)
{res}{txt}(80,000 missing values generated)
(80,000 missing values generated)
{res}{txt}(80,000 missing values generated)
(80,000 missing values generated)
{res}{txt}(90,000 missing values generated)
(90,000 missing values generated)
{res}{txt}(90,000 missing values generated)
(90,000 missing values generated)
{res}{txt}(90,000 missing values generated)
(90,000 missing values generated)
{res}{txt}(90,000 missing values generated)
(90,000 missing values generated)
{res}{txt}(90,000 missing values generated)
(90,000 missing values generated)
{res}{txt}
{com}.                                                  
. **Rename variables with extra 'date' added to the end of variable names===========================================================*/ 
. rename rheum_appt_date_date rheum_appt_date
{res}{txt}
{com}. rename eia_code_date_date eia_code_date
{res}{txt}
{com}. rename ra_code_date_date ra_code_date
{res}{txt}
{com}. rename psa_code_date_date psa_code_date
{res}{txt}
{com}. rename anksp_code_date_date anksp_code_date
{res}{txt}
{com}. rename died_date_ons_date died_ons_date
{res}{txt}
{com}. rename last_gp_prerheum_date_date last_gp_prerheum_date
{res}{txt}
{com}. rename last_gp_refrheum_date_date last_gp_refrheum_date
{res}{txt}
{com}. rename last_gp_refcode_date_date last_gp_refcode_date
{res}{txt}
{com}. rename last_gp_precode_date_date last_gp_precode_date
{res}{txt}
{com}. rename hba1c_mmol_per_mol_date_date hba1c_mmol_per_mol_date
{res}{txt}
{com}. rename hba1c_percentage_date_date hba1c_percentage_date
{res}{txt}
{com}. rename creatinine_date_date creatinine_date
{res}{txt}
{com}. rename creatinine creatinine_value 
{res}{txt}
{com}. rename bmi_date_measured_date bmi_date
{res}{txt}
{com}. rename bmi bmi_value
{res}{txt}
{com}. 
. **Create binary indicator variables for relevant conditions ====================================================*/
. 
. foreach var of varlist   eia_code_date                                          ///
>                                                  rheum_appt_date                                        ///
>                                              ra_code_date                                               ///
>                                                  psa_code_date                                          ///
>                                                  anksp_code_date                                        ///
>                                                  died_ons_date                                          ///
>                                                  last_gp_prerheum_date                          ///
>                                                  last_gp_precode_date                           ///     
>                                                  last_gp_refrheum_date                          ///
>                                                  last_gp_refcode_date                           ///
>                                                  referral_rheum_prerheum_date           ///
>                                                  referral_rheum_precode_date            ///     
>                                                  chronic_cardiac_disease_date           ///
>                                                  diabetes_date                                          ///
>                                                  hypertension_date                                      ///
>                                                  chronic_resp_disease_date                      ///
>                                                  copd_date                                                      ///
>                                                  chronic_liver_disease_date                     ///
>                                                  stroke_date                                            ///
>                                                  lung_cancer_date                                       ///
>                                                  haem_cancer_date                                       ///             
>                                                  other_cancer_date                                      ///
>                                                  esrf_date                                                      ///
>                                                  creatinine_date                                        ///
>                                                  organ_transplant_date                          ///
>                                                  hydroxychloroquine_date                        ///     
>                                                  leflunomide_date                                       ///
>                                                  methotrexate_date                                      ///
>                                                  methotrexate_inj_date                          ///             
>                                                  sulfasalazine_date                                     ///
>                                                  abatacept_date                                         ///
>                                                  adalimumab_date                                        ///
>                                                  baricitinib_date                                       ///
>                                                  certolizumab_date                                      ///
>                                                  etanercept_date                                        ///
>                                                  golimumab_date                                         ///
>                                                  guselkumab_date                                        ///
>                                                  infliximab_date                                        ///
>                                                  ixekizumab_date                                        ///
>                                                  methotrexate_hcd_date                          ///
>                                                  rituximab_date                                         ///             
>                                                  sarilumab_date                                         ///
>                                                  secukinumab_date                                       ///
>                                                  tocilizumab_date                                       ///             
>                                                  tofacitinib_date                                       ///
>                                                  upadacitinib_date                                      ///
>                                                  ustekinumab_date   {c -(}                           
{txt}  2{com}.         /*date ranges are applied in python, so presence of date indicates presence of 
>           disease in the correct time frame*/ 
.         local newvar =  substr("`var'", 1, length("`var'") - 5)
{txt}  3{com}.         gen `newvar' = (`var'!=. )
{txt}  4{com}.         order `newvar', after(`var')
{txt}  5{com}. {c )-}
{txt}
{com}. 
. **Create and label variables ===========================================================*/
. 
. **Demographics
. ***Sex
. gen male = 1 if sex == "M"
{txt}(51,158 missing values generated)

{com}. replace male = 0 if sex == "F"
{txt}(51,158 real changes made)

{com}. lab var male "Male"
{txt}
{com}. 
. ***Ethnicity
. replace ethnicity = .u if ethnicity == .
{txt}(25,000 real changes made, 25,000 to missing)

{com}. ****rearrange in order of prevalence
. recode ethnicity 2=6 /* mixed to 6 */
{txt}(14893 changes made to {bf:ethnicity})

{com}. recode ethnicity 3=2 /* south asian to 2 */
{txt}(7580 changes made to {bf:ethnicity})

{com}. recode ethnicity 4=3 /* black to 3 */
{txt}(7558 changes made to {bf:ethnicity})

{com}. recode ethnicity 6=4 /* mixed to 4 */
{txt}(14893 changes made to {bf:ethnicity})

{com}. recode ethnicity 5=4 /* other to 4 */
{txt}(7471 changes made to {bf:ethnicity})

{com}. 
. label define ethnicity  1 "White"                                       ///
>                                                 2 "Asian/Asian British"         ///
>                                                 3 "Black"                                       ///
>                                                 4 "Mixed/Other"                         ///
>                                                 .u "Missing"
{txt}
{com}. label values ethnicity ethnicity
{txt}
{com}. lab var ethnicity "Ethnicity"
{txt}
{com}. 
. ***STP 
. rename stp stp_old
{res}{txt}
{com}. bysort stp_old: gen stp = 1 if _n==1
{txt}(99,998 missing values generated)

{com}. replace stp = sum(stp) //
{txt}(99,999 real changes made)

{com}. drop stp_old
{txt}
{com}. 
. ***Regions
. encode region, gen(nuts_region)
{txt}
{com}. 
. ***IMD
. *Group into 5 groups
. rename imd imd_o
{res}{txt}
{com}. egen imd = cut(imd_o), group(5) icodes 
{txt}
{com}. *Add one to create groups 1-5 
. replace imd = imd + 1
{txt}(100,000 real changes made)

{com}. *-1 is missing, should be excluded from population 
. replace imd = .u if imd_o == -1
{txt}(0 real changes made)

{com}. drop imd_o
{txt}
{com}. *Reverse the order (so high is more deprived)
. recode imd 5 = 1 4 = 2 3 = 3 2 = 4 1 = 5 .u = .u
{txt}(100000 changes made to {bf:imd})

{com}. label define imd 1 "1 least deprived" 2 "2" 3 "3" 4 "4" 5 "5 most deprived" .u "Missing"
{txt}
{com}. label values imd imd 
{txt}
{com}. lab var imd "Index of multiple deprivation"
{txt}
{com}. 
. ***Age variables
. *Nb. works if ages 18 and over
. *Create categorised age
. drop if age<18 & age !=.
{txt}(21,170 observations deleted)

{com}. drop if age>109 & age !=.
{txt}(0 observations deleted)

{com}. drop if age==.
{txt}(0 observations deleted)

{com}. lab var age "Age"
{txt}
{com}. 
. recode age 18/39.9999 = 1 /// 
>            40/49.9999 = 2 ///
>                    50/59.9999 = 3 ///
>                60/69.9999 = 4 ///
>                    70/79.9999 = 5 ///
>                    80/max = 6, gen(agegroup) 
{txt}(78830 differences between {bf:age} and {bf:agegroup})

{com}. 
. label define agegroup   1 "18-39" ///
>                                                 2 "40-49" ///
>                                                 3 "50-59" ///
>                                                 4 "60-69" ///
>                                                 5 "70-79" ///
>                                                 6 "80+"
{txt}
{com}.                                                 
. label values agegroup agegroup
{txt}
{com}. lab var agegroup "Age group"
{txt}
{com}. 
. *Create binary age
. recode age min/69.999 = 0 ///
>            70/max = 1, gen(age70)
{txt}(78830 differences between {bf:age} and {bf:age70})

{com}. 
. *Create restricted cubic splines for age
. mkspline age = age, cubic nknots(4)
{txt}
{com}. 
. ***Body Mass Index
. *Recode strange values 
. replace bmi_value = . if bmi_value == 0 
{txt}(31,423 real changes made, 31,423 to missing)

{com}. replace bmi_value = . if !inrange(bmi_value, 10, 80)
{txt}(264 real changes made, 264 to missing)

{com}. 
. *Restrict to within 10 years of EIA diagnosis date and aged>16 
. gen bmi_time = (eia_code_date - bmi_date)/365.25
{txt}(31,884 missing values generated)

{com}. gen bmi_age = age - bmi_time
{txt}(31,884 missing values generated)

{com}. replace bmi_value = . if bmi_age < 16 
{txt}(33,409 real changes made, 33,409 to missing)

{com}. replace bmi_value = . if bmi_time > 10 & bmi_time != . 
{txt}(8,822 real changes made, 8,822 to missing)

{com}. 
. *Set to missing if no date, and vice versa 
. replace bmi_value = . if bmi_date == . 
{txt}(0 real changes made)

{com}. replace bmi_date = . if bmi_value == . 
{txt}(42,495 real changes made, 42,495 to missing)

{com}. replace bmi_time = . if bmi_value == . 
{txt}(42,492 real changes made, 42,492 to missing)

{com}. replace bmi_age = . if bmi_value == . 
{txt}(42,492 real changes made, 42,492 to missing)

{com}. 
. *Create BMI categories
. gen     bmicat = .
{txt}(78,830 missing values generated)

{com}. recode  bmicat . = 1 if bmi_value < 18.5
{txt}(211 changes made to {bf:bmicat})

{com}. recode  bmicat . = 2 if bmi_value < 25
{txt}(529 changes made to {bf:bmicat})

{com}. recode  bmicat . = 3 if bmi_value < 30
{txt}(733 changes made to {bf:bmicat})

{com}. recode  bmicat . = 4 if bmi_value < 35
{txt}(926 changes made to {bf:bmicat})

{com}. recode  bmicat . = 5 if bmi_value < 40
{txt}(942 changes made to {bf:bmicat})

{com}. recode  bmicat . = 6 if bmi_value < .
{txt}(1571 changes made to {bf:bmicat})

{com}. replace bmicat = .u if bmi_value >= .
{txt}(73,918 real changes made, 73,918 to missing)

{com}. 
. label define bmicat 1 "Underweight (<18.5)"     ///
>                                         2 "Normal (18.5-24.9)"          ///
>                                         3 "Overweight (25-29.9)"        ///
>                                         4 "Obese I (30-34.9)"           ///
>                                         5 "Obese II (35-39.9)"          ///
>                                         6 "Obese III (40+)"                     ///
>                                         .u "Missing"
{txt}
{com}.                                         
. label values bmicat bmicat
{txt}
{com}. lab var bmicat "BMI"
{txt}
{com}. 
. *Create less granular categorisation
. recode bmicat 1/3 .u = 1 4 = 2 5 = 3 6 = 4, gen(obese4cat)
{txt}(78619 differences between {bf:bmicat} and {bf:obese4cat})

{com}. 
. label define obese4cat  1 "No record of obesity"        ///
>                                                 2 "Obese I (30-34.9)"           ///
>                                                 3 "Obese II (35-39.9)"          ///
>                                                 4 "Obese III (40+)"             
{txt}
{com}. 
. label values obese4cat obese4cat
{txt}
{com}. order obese4cat, after(bmicat)
{txt}
{com}. 
. ***Smoking 
. label define smoke 1 "Never" 2 "Former" 3 "Current" .u "Missing"
{txt}
{com}. 
. gen     smoke = 1  if smoking_status == "N"
{txt}(70,950 missing values generated)

{com}. replace smoke = 2  if smoking_status == "E"
{txt}(3,842 real changes made)

{com}. replace smoke = 3  if smoking_status == "S"
{txt}(23,670 real changes made)

{com}. replace smoke = .u if smoking_status == "M"
{txt}(3,993 real changes made, 3,993 to missing)

{com}. replace smoke = .u if smoking_status == "" 
{txt}(39,445 real changes made, 39,445 to missing)

{com}. 
. label values smoke smoke
{txt}
{com}. lab var smoke "Smoking status"
{txt}
{com}. drop smoking_status
{txt}
{com}. 
. *Create non-missing 3-category variable for current smoking (assumes missing smoking is never smoking)
. recode smoke .u = 1, gen(smoke_nomiss)
{txt}(43438 differences between {bf:smoke} and {bf:smoke_nomiss})

{com}. order smoke_nomiss, after(smoke)
{txt}
{com}. label values smoke_nomiss smoke
{txt}
{com}. 
. **Clinical comorbidities
. ***eGFR
. *Set implausible creatinine values to missing (Note: zero changed to missing)
. replace creatinine_value = . if !inrange(creatinine_value, 20, 3000) 
{txt}(19,652 real changes made, 19,652 to missing)

{com}. 
. *Remove creatinine dates if no measurements, and vice versa 
. replace creatinine_value = . if creatinine_date == . 
{txt}(0 real changes made)

{com}. replace creatinine_date = . if creatinine_value == . 
{txt}(15,730 real changes made, 15,730 to missing)

{com}. replace creatinine = . if creatinine_value == .
{txt}(19,652 real changes made, 19,652 to missing)

{com}. recode creatinine .=0
{txt}(19652 changes made to {bf:creatinine})

{com}. 
. *Divide by 88.4 (to convert umol/l to mg/dl) 
. gen SCr_adj = creatinine_value/88.4
{txt}(19,652 missing values generated)

{com}. 
. gen min = .
{txt}(78,830 missing values generated)

{com}. replace min = SCr_adj/0.7 if male==0
{txt}(30,283 real changes made)

{com}. replace min = SCr_adj/0.9 if male==1
{txt}(28,895 real changes made)

{com}. replace min = min^-0.329  if male==0
{txt}(30,283 real changes made)

{com}. replace min = min^-0.411  if male==1
{txt}(28,895 real changes made)

{com}. replace min = 1 if min<1
{txt}(46,250 real changes made)

{com}. 
. gen max=.
{txt}(78,830 missing values generated)

{com}. replace max=SCr_adj/0.7 if male==0
{txt}(30,283 real changes made)

{com}. replace max=SCr_adj/0.9 if male==1
{txt}(28,895 real changes made)

{com}. replace max=max^-1.209
{txt}(59,178 real changes made)

{com}. replace max=1 if max>1
{txt}(32,580 real changes made)

{com}. 
. gen egfr=min*max*141
{txt}(19,652 missing values generated)

{com}. replace egfr=egfr*(0.993^age)
{txt}(59,178 real changes made)

{com}. replace egfr=egfr*1.018 if male==0
{txt}(30,283 real changes made)

{com}. label var egfr "egfr calculated using CKD-EPI formula with no ethnicity"
{txt}
{com}. 
. *Categorise into ckd stages
. egen egfr_cat_all = cut(egfr), at(0, 15, 30, 45, 60, 5000)
{txt}(19,652 missing values generated)

{com}. recode egfr_cat_all 0 = 5 15 = 4 30 = 3 45 = 2 60 = 0, generate(ckd_egfr)
{txt}(59178 differences between {bf:egfr_cat_all} and {bf:ckd_egfr})

{com}. 
. gen egfr_cat = .
{txt}(78,830 missing values generated)

{com}. recode egfr_cat . = 3 if egfr < 30
{txt}(13889 changes made to {bf:egfr_cat})

{com}. recode egfr_cat . = 2 if egfr < 60
{txt}(21054 changes made to {bf:egfr_cat})

{com}. recode egfr_cat . = 1 if egfr < .
{txt}(24235 changes made to {bf:egfr_cat})

{com}. replace egfr_cat = .u if egfr >= .
{txt}(19,652 real changes made, 19,652 to missing)

{com}. 
. label define egfr_cat   1 ">=60"                ///
>                                                 2 "30-59"               ///
>                                                 3 "<30"                 ///
>                                                 .u "Missing"
{txt}
{com}.                                         
. label values egfr_cat egfr_cat
{txt}
{com}. lab var egfr_cat "eGFR"
{txt}
{com}. 
. *If missing eGFR, assume normal
. gen egfr_cat_nomiss = egfr_cat
{txt}(19,652 missing values generated)

{com}. replace egfr_cat_nomiss = 1 if egfr_cat == .u
{txt}(19,652 real changes made)

{com}. 
. label define egfr_cat_nomiss    1 ">=60/missing"        ///
>                                                                 2 "30-59"                       ///
>                                                                 3 "<30" 
{txt}
{com}. label values egfr_cat_nomiss egfr_cat_nomiss
{txt}
{com}. lab var egfr_cat_nomiss "eGFR"
{txt}
{com}. 
. gen egfr_date = creatinine_date
{txt}(19,652 missing values generated)

{com}. format egfr_date %td
{txt}
{com}. 
. *Add in end stage renal failure and create a single CKD variable 
. *Missing assumed to not have CKD 
. gen ckd = 0
{txt}
{com}. replace ckd = 1 if ckd_egfr != . & ckd_egfr >= 1
{txt}(34,943 real changes made)

{com}. replace ckd = 1 if esrf == 1
{txt}(8,881 real changes made)

{com}. 
. label define ckd 0 "No CKD" 1 "CKD"
{txt}
{com}. label values ckd ckd
{txt}
{com}. label var ckd "Chronic kidney disease"
{txt}
{com}. 
. *Create date (most recent measure prior to index)
. gen temp1_ckd_date = creatinine_date if ckd_egfr >=1
{txt}(43,887 missing values generated)

{com}. gen temp2_ckd_date = esrf_date if esrf == 1
{txt}(62,982 missing values generated)

{com}. gen ckd_date = max(temp1_ckd_date,temp2_ckd_date) 
{txt}(35,006 missing values generated)

{com}. format ckd_date %td 
{txt}
{com}. 
. drop temp1_ckd_date temp2_ckd_date SCr_adj min max ckd_egfr egfr_cat_all
{txt}
{com}. 
. ***HbA1c
. *Set zero or negative to missing
. replace hba1c_percentage   = . if hba1c_percentage <= 0
{txt}(4,455 real changes made, 4,455 to missing)

{com}. replace hba1c_mmol_per_mol = . if hba1c_mmol_per_mol <= 0
{txt}(5,666 real changes made, 5,666 to missing)

{com}. 
. *Change implausible values to missing
. replace hba1c_percentage   = . if !inrange(hba1c_percentage, 1, 20)
{txt}(1,248 real changes made, 1,248 to missing)

{com}. replace hba1c_mmol_per_mol = . if !inrange(hba1c_mmol_per_mol, 10, 200)
{txt}(3,273 real changes made, 3,273 to missing)

{com}. 
. *Set most recent values of >24 months prior to EIA diagnosis date to missing
. replace hba1c_percentage   = . if (eia_code_date - hba1c_percentage_date) > 24*30 & hba1c_percentage_date != .
{txt}(70,702 real changes made, 70,702 to missing)

{com}. replace hba1c_mmol_per_mol = . if (eia_code_date - hba1c_mmol_per_mol_date) > 24*30 & hba1c_mmol_per_mol_date != .
{txt}(67,620 real changes made, 67,620 to missing)

{com}. 
. *Clean up dates
. replace hba1c_percentage_date = . if hba1c_percentage == .
{txt}(72,397 real changes made, 72,397 to missing)

{com}. replace hba1c_mmol_per_mol_date = . if hba1c_mmol_per_mol == .
{txt}(72,598 real changes made, 72,598 to missing)

{com}. 
. *Express  HbA1c as percentage
. *Express all values as perecentage 
. noi summ hba1c_percentage hba1c_mmol_per_mol 

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
hba1c_per~ge {c |}{res}      2,425    5.080616    1.890839   1.004418   11.67034
{txt}hba1c_mmol~l {c |}{res}      2,271    42.29938    17.61446   10.02266    107.442
{txt}
{com}. gen     hba1c_pct = hba1c_percentage 
{txt}(76,405 missing values generated)

{com}. replace hba1c_pct = (hba1c_mmol_per_mol/10.929)+2.15 if hba1c_mmol_per_mol<. 
{txt}(2,271 real changes made)

{com}. 
. *Valid % range between 0-20  
. replace hba1c_pct = . if !inrange(hba1c_pct, 1, 20) 
{txt}(0 real changes made)

{com}. replace hba1c_pct = round(hba1c_pct, 0.1)
{txt}(4,627 real changes made)

{com}. 
. *Categorise HbA1c and diabetes
. *Group hba1c pct
. gen     hba1ccat = 0 if hba1c_pct <  6.5
{txt}(75,642 missing values generated)

{com}. replace hba1ccat = 1 if hba1c_pct >= 6.5  & hba1c_pct < 7.5
{txt}(740 real changes made)

{com}. replace hba1ccat = 2 if hba1c_pct >= 7.5  & hba1c_pct < 8
{txt}(242 real changes made)

{com}. replace hba1ccat = 3 if hba1c_pct >= 8    & hba1c_pct < 9
{txt}(317 real changes made)

{com}. replace hba1ccat = 4 if hba1c_pct >= 9    & hba1c_pct !=.
{txt}(140 real changes made)

{com}. label define hba1ccat 0 "<6.5%" 1">=6.5-7.4" 2">=7.5-7.9" 3">=8-8.9" 4">=9"
{txt}
{com}. label values hba1ccat hba1ccat
{txt}
{com}. 
. *Express all values as mmol
. gen hba1c_mmol = hba1c_mmol_per_mol
{txt}(76,559 missing values generated)

{com}. replace hba1c_mmol = (hba1c_percentage*10.929)-23.5 if hba1c_percentage<. & hba1c_mmol==.
{txt}(2,356 real changes made)

{com}. 
. *Group hba1c mmol
. gen     hba1ccatmm = 0 if hba1c_mmol < 58
{txt}(74,897 missing values generated)

{com}. replace hba1ccatmm = 1 if hba1c_mmol >= 58 & hba1c_pct !=.
{txt}(694 real changes made)

{com}. replace hba1ccatmm =.u if hba1ccatmm==. 
{txt}(74,203 real changes made, 74,203 to missing)

{com}. label define hba1ccatmm 0 "HbA1c <58mmol/mol" 1 "HbA1c >=58mmol/mol" .u "Missing"
{txt}
{com}. label values hba1ccatmm hba1ccatmm
{txt}
{com}. lab var hba1ccatmm "HbA1c"
{txt}
{com}. 
. *Create diabetes, split by control/not (assumes missing = no diabetes)
. gen     diabcat = 1 if diabetes==0
{txt}(15,821 missing values generated)

{com}. replace diabcat = 2 if diabetes==1 & inlist(hba1ccat, 0, 1)
{txt}(777 real changes made)

{com}. replace diabcat = 3 if diabetes==1 & inlist(hba1ccat, 2, 3, 4)
{txt}(140 real changes made)

{com}. replace diabcat = 4 if diabetes==1 & !inlist(hba1ccat, 0, 1, 2, 3, 4)
{txt}(14,904 real changes made)

{com}. 
. label define diabcat    1 "No diabetes"                         ///
>                                                 2 "Controlled diabetes"         ///
>                                                 3 "Uncontrolled diabetes"       ///
>                                                 4 "Diabetes, no hba1c measure"
{txt}
{com}. label values diabcat diabcat
{txt}
{com}. 
. *Create cancer variable 'other cancer currently', includes carcinoma of the head and neck - need to confirm if this excludes NMSC
. gen cancer =0
{txt}
{com}. replace cancer =1 if lung_cancer ==1 | haem_cancer ==1 | other_cancer ==1
{txt}(38,343 real changes made)

{com}. lab var cancer "Cancer"
{txt}
{com}. 
. *Create other comorbid variables
. gen combined_cv_comorbid =1 if chronic_cardiac_disease ==1 | stroke==1
{txt}(50,485 missing values generated)

{com}. recode combined_cv_comorbid .=0
{txt}(50485 changes made to {bf:combined_cv_comorbid})

{com}. 
. *Delete unneeded variables
. drop hba1c_pct hba1c_percentage hba1c_mmol_per_mol
{txt}
{com}. 
. *Label variables
. lab var hypertension "Hypertension"
{txt}
{com}. lab var diabetes "Diabetes"
{txt}
{com}. lab var stroke "Stroke"
{txt}
{com}. lab var chronic_resp_disease "Chronic respiratory disease"
{txt}
{com}. lab var copd "COPD"
{txt}
{com}. lab var esrf "End-stage renal failure"
{txt}
{com}. lab var chronic_liver_disease "Chronic liver disease"
{txt}
{com}. lab var chronic_cardiac_disease "Chronic cardiac disease"
{txt}
{com}. 
. *Refine diagnostic window=============================================================*/
. 
. **All patients should have EIA code
. tab eia_code

   {txt}eia_code {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}        779        0.99        0.99
{txt}          1 {c |}{res}     78,051       99.01      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     78,830      100.00
{txt}
{com}. keep if eia_code==1
{txt}(779 observations deleted)

{com}. 
{txt}end of do-file

{com}. do "C:\Users\k1754142\AppData\Local\Temp\STD5fac_000000.tmp"
{txt}
{com}. tab has_6m_follow_up

{txt}has_6m_foll {c |}
      ow_up {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      3,888        4.98        4.98
{txt}          1 {c |}{res}     74,163       95.02      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     78,051      100.00
{txt}
{com}. tab has_12m_follow_up

{txt}has_12m_fol {c |}
     low_up {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      7,834       10.04       10.04
{txt}          1 {c |}{res}     70,217       89.96      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     78,051      100.00
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\k1754142\AppData\Local\Temp\STD5fac_000000.tmp"
{txt}
{com}. bys mo_year_diagn: has_6m_follow_up
{err}variable {bf}mo_year_diagn{sf} not found
{txt}{search r(111), local:r(111);}

end of do-file

{search r(111), local:r(111);}

{com}. do "C:\Users\k1754142\AppData\Local\Temp\STD5fac_000000.tmp"
{txt}
{com}. gen year_diag=year(eia_code_date)
{txt}
{com}. format year_diag %ty
{txt}
{com}. gen month_diag=month(eia_code_date)
{txt}
{com}. gen mo_year_diagn=ym(year_diag, month_diag)
{txt}
{com}. format mo_year_diagn %tm
{txt}
{com}. 
. **All patients should have at least 6 months of follow-up after EIA code (should be true from python code)
. tab has_6m_follow_up

{txt}has_6m_foll {c |}
      ow_up {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      3,888        4.98        4.98
{txt}          1 {c |}{res}     74,163       95.02      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     78,051      100.00
{txt}
{com}. tab has_12m_follow_up

{txt}has_12m_fol {c |}
     low_up {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      7,834       10.04       10.04
{txt}          1 {c |}{res}     70,217       89.96      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     78,051      100.00
{txt}
{com}. bys mo_year_diagn: has_6m_follow_up
{err}command {bf}has_6m_follow_up{sf} is unrecognized
{txt}{search r(199), local:r(199);}

end of do-file

{search r(199), local:r(199);}

{com}. do "C:\Users\k1754142\AppData\Local\Temp\STD5fac_000000.tmp"
{txt}
{com}. tab has_6m_follow_up

{txt}has_6m_foll {c |}
      ow_up {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      3,888        4.98        4.98
{txt}          1 {c |}{res}     74,163       95.02      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     78,051      100.00
{txt}
{com}. tab has_12m_follow_up

{txt}has_12m_fol {c |}
     low_up {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      7,834       10.04       10.04
{txt}          1 {c |}{res}     70,217       89.96      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     78,051      100.00
{txt}
{com}. bys mo_year_diagn: tab has_6m_follow_up

{txt}{hline}
-> mo_year_diagn = 2018m1

has_6m_foll {c |}
      ow_up {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}         32        4.62        4.62
{txt}          1 {c |}{res}        661       95.38      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        693      100.00

{txt}{hline}
-> mo_year_diagn = 2018m2

has_6m_foll {c |}
      ow_up {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}         72        4.90        4.90
{txt}          1 {c |}{res}      1,397       95.10      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,469      100.00

{txt}{hline}
-> mo_year_diagn = 2018m3

has_6m_foll {c |}
      ow_up {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}         77        4.92        4.92
{txt}          1 {c |}{res}      1,488       95.08      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,565      100.00

{txt}{hline}
-> mo_year_diagn = 2018m4

has_6m_foll {c |}
      ow_up {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}         69        4.58        4.58
{txt}          1 {c |}{res}      1,438       95.42      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,507      100.00

{txt}{hline}
-> mo_year_diagn = 2018m5

has_6m_foll {c |}
      ow_up {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}         83        5.10        5.10
{txt}          1 {c |}{res}      1,546       94.90      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,629      100.00

{txt}{hline}
-> mo_year_diagn = 2018m6

has_6m_foll {c |}
      ow_up {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}         66        4.39        4.39
{txt}          1 {c |}{res}      1,436       95.61      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,502      100.00

{txt}{hline}
-> mo_year_diagn = 2018m7

has_6m_foll {c |}
      ow_up {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}         77        4.75        4.75
{txt}          1 {c |}{res}      1,543       95.25      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,620      100.00

{txt}{hline}
-> mo_year_diagn = 2018m8

has_6m_foll {c |}
      ow_up {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}         72        4.58        4.58
{txt}          1 {c |}{res}      1,501       95.42      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,573      100.00

{txt}{hline}
-> mo_year_diagn = 2018m9

has_6m_foll {c |}
      ow_up {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}         75        5.02        5.02
{txt}          1 {c |}{res}      1,420       94.98      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,495      100.00

{txt}{hline}
-> mo_year_diagn = 2018m10

has_6m_foll {c |}
      ow_up {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}         70        4.83        4.83
{txt}          1 {c |}{res}      1,379       95.17      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,449      100.00

{txt}{hline}
-> mo_year_diagn = 2018m11

has_6m_foll {c |}
      ow_up {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}         69        4.56        4.56
{txt}          1 {c |}{res}      1,444       95.44      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,513      100.00

{txt}{hline}
-> mo_year_diagn = 2018m12

has_6m_foll {c |}
      ow_up {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}         74        4.87        4.87
{txt}          1 {c |}{res}      1,444       95.13      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,518      100.00

{txt}{hline}
-> mo_year_diagn = 2019m1

has_6m_foll {c |}
      ow_up {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}         73        4.62        4.62
{txt}          1 {c |}{res}      1,507       95.38      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,580      100.00

{txt}{hline}
-> mo_year_diagn = 2019m2

has_6m_foll {c |}
      ow_up {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}         66        4.59        4.59
{txt}          1 {c |}{res}      1,373       95.41      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,439      100.00

{txt}{hline}
-> mo_year_diagn = 2019m3

has_6m_foll {c |}
      ow_up {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}         74        4.87        4.87
{txt}          1 {c |}{res}      1,444       95.13      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,518      100.00

{txt}{hline}
-> mo_year_diagn = 2019m4

has_6m_foll {c |}
      ow_up {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}         76        4.97        4.97
{txt}          1 {c |}{res}      1,454       95.03      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,530      100.00

{txt}{hline}
-> mo_year_diagn = 2019m5

has_6m_foll {c |}
      ow_up {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}         83        5.32        5.32
{txt}          1 {c |}{res}      1,476       94.68      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,559      100.00

{txt}{hline}
-> mo_year_diagn = 2019m6

has_6m_foll {c |}
      ow_up {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}         79        5.02        5.02
{txt}          1 {c |}{res}      1,494       94.98      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,573      100.00

{txt}{hline}
-> mo_year_diagn = 2019m7

has_6m_foll {c |}
      ow_up {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}         81        5.24        5.24
{txt}          1 {c |}{res}      1,466       94.76      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,547      100.00

{txt}{hline}
-> mo_year_diagn = 2019m8

has_6m_foll {c |}
      ow_up {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}         80        5.21        5.21
{txt}          1 {c |}{res}      1,455       94.79      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,535      100.00

{txt}{hline}
-> mo_year_diagn = 2019m9

has_6m_foll {c |}
      ow_up {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}         79        5.07        5.07
{txt}          1 {c |}{res}      1,478       94.93      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,557      100.00

{txt}{hline}
-> mo_year_diagn = 2019m10

has_6m_foll {c |}
      ow_up {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}         86        5.36        5.36
{txt}          1 {c |}{res}      1,519       94.64      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,605      100.00

{txt}{hline}
-> mo_year_diagn = 2019m11

has_6m_foll {c |}
      ow_up {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}         76        5.12        5.12
{txt}          1 {c |}{res}      1,407       94.88      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,483      100.00

{txt}{hline}
-> mo_year_diagn = 2019m12

has_6m_foll {c |}
      ow_up {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}         82        5.24        5.24
{txt}          1 {c |}{res}      1,483       94.76      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,565      100.00

{txt}{hline}
-> mo_year_diagn = 2020m1

has_6m_foll {c |}
      ow_up {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}         83        5.40        5.40
{txt}          1 {c |}{res}      1,453       94.60      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,536      100.00

{txt}{hline}
-> mo_year_diagn = 2020m2

has_6m_foll {c |}
      ow_up {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}         79        5.51        5.51
{txt}          1 {c |}{res}      1,354       94.49      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,433      100.00

{txt}{hline}
-> mo_year_diagn = 2020m3

has_6m_foll {c |}
      ow_up {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}         83        5.32        5.32
{txt}          1 {c |}{res}      1,476       94.68      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,559      100.00

{txt}{hline}
-> mo_year_diagn = 2020m4

has_6m_foll {c |}
      ow_up {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}         77        5.01        5.01
{txt}          1 {c |}{res}      1,461       94.99      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,538      100.00

{txt}{hline}
-> mo_year_diagn = 2020m5

has_6m_foll {c |}
      ow_up {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}         72        4.57        4.57
{txt}          1 {c |}{res}      1,504       95.43      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,576      100.00

{txt}{hline}
-> mo_year_diagn = 2020m6

has_6m_foll {c |}
      ow_up {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}         74        4.82        4.82
{txt}          1 {c |}{res}      1,460       95.18      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,534      100.00

{txt}{hline}
-> mo_year_diagn = 2020m7

has_6m_foll {c |}
      ow_up {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}         59        3.73        3.73
{txt}          1 {c |}{res}      1,522       96.27      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,581      100.00

{txt}{hline}
-> mo_year_diagn = 2020m8

has_6m_foll {c |}
      ow_up {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}         77        5.13        5.13
{txt}          1 {c |}{res}      1,424       94.87      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,501      100.00

{txt}{hline}
-> mo_year_diagn = 2020m9

has_6m_foll {c |}
      ow_up {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}         74        5.01        5.01
{txt}          1 {c |}{res}      1,402       94.99      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,476      100.00

{txt}{hline}
-> mo_year_diagn = 2020m10

has_6m_foll {c |}
      ow_up {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}         73        4.80        4.80
{txt}          1 {c |}{res}      1,448       95.20      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,521      100.00

{txt}{hline}
-> mo_year_diagn = 2020m11

has_6m_foll {c |}
      ow_up {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}         74        5.25        5.25
{txt}          1 {c |}{res}      1,336       94.75      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,410      100.00

{txt}{hline}
-> mo_year_diagn = 2020m12

has_6m_foll {c |}
      ow_up {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}         82        5.38        5.38
{txt}          1 {c |}{res}      1,442       94.62      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,524      100.00

{txt}{hline}
-> mo_year_diagn = 2021m1

has_6m_foll {c |}
      ow_up {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}         71        4.38        4.38
{txt}          1 {c |}{res}      1,549       95.62      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,620      100.00

{txt}{hline}
-> mo_year_diagn = 2021m2

has_6m_foll {c |}
      ow_up {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}         54        3.85        3.85
{txt}          1 {c |}{res}      1,349       96.15      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,403      100.00

{txt}{hline}
-> mo_year_diagn = 2021m3

has_6m_foll {c |}
      ow_up {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}         83        5.06        5.06
{txt}          1 {c |}{res}      1,556       94.94      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,639      100.00

{txt}{hline}
-> mo_year_diagn = 2021m4

has_6m_foll {c |}
      ow_up {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}         95        6.24        6.24
{txt}          1 {c |}{res}      1,428       93.76      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,523      100.00

{txt}{hline}
-> mo_year_diagn = 2021m5

has_6m_foll {c |}
      ow_up {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}         73        4.69        4.69
{txt}          1 {c |}{res}      1,485       95.31      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,558      100.00

{txt}{hline}
-> mo_year_diagn = 2021m6

has_6m_foll {c |}
      ow_up {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}         86        5.65        5.65
{txt}          1 {c |}{res}      1,436       94.35      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,522      100.00

{txt}{hline}
-> mo_year_diagn = 2021m7

has_6m_foll {c |}
      ow_up {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}         87        5.55        5.55
{txt}          1 {c |}{res}      1,481       94.45      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,568      100.00

{txt}{hline}
-> mo_year_diagn = 2021m8

has_6m_foll {c |}
      ow_up {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}         82        5.24        5.24
{txt}          1 {c |}{res}      1,483       94.76      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,565      100.00

{txt}{hline}
-> mo_year_diagn = 2021m9

has_6m_foll {c |}
      ow_up {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}         63        4.33        4.33
{txt}          1 {c |}{res}      1,393       95.67      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,456      100.00

{txt}{hline}
-> mo_year_diagn = 2021m10

has_6m_foll {c |}
      ow_up {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}         72        4.65        4.65
{txt}          1 {c |}{res}      1,477       95.35      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,549      100.00

{txt}{hline}
-> mo_year_diagn = 2021m11

has_6m_foll {c |}
      ow_up {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}         79        5.06        5.06
{txt}          1 {c |}{res}      1,483       94.94      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,562      100.00

{txt}{hline}
-> mo_year_diagn = 2021m12

has_6m_foll {c |}
      ow_up {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}         95        6.10        6.10
{txt}          1 {c |}{res}      1,463       93.90      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,558      100.00

{txt}{hline}
-> mo_year_diagn = 2022m1

has_6m_foll {c |}
      ow_up {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}         78        5.22        5.22
{txt}          1 {c |}{res}      1,417       94.78      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,495      100.00

{txt}{hline}
-> mo_year_diagn = 2022m2

has_6m_foll {c |}
      ow_up {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}         68        4.99        4.99
{txt}          1 {c |}{res}      1,296       95.01      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,364      100.00

{txt}{hline}
-> mo_year_diagn = 2022m3

has_6m_foll {c |}
      ow_up {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}         81        5.33        5.33
{txt}          1 {c |}{res}      1,440       94.67      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,521      100.00

{txt}{hline}
-> mo_year_diagn = 2022m4

has_6m_foll {c |}
      ow_up {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}         43        4.60        4.60
{txt}          1 {c |}{res}        892       95.40      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        935      100.00

{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\k1754142\AppData\Local\Temp\STD5fac_000000.tmp"
{txt}
{com}. tab mo_year_diagn has_6m_follow_up

{txt}mo_year_di {c |}   has_6m_follow_up
       agn {c |}         0          1 {c |}     Total
{hline 11}{c +}{hline 22}{c +}{hline 10}
    2018m1 {c |}{res}        32        661 {txt}{c |}{res}       693 
{txt}    2018m2 {c |}{res}        72      1,397 {txt}{c |}{res}     1,469 
{txt}    2018m3 {c |}{res}        77      1,488 {txt}{c |}{res}     1,565 
{txt}    2018m4 {c |}{res}        69      1,438 {txt}{c |}{res}     1,507 
{txt}    2018m5 {c |}{res}        83      1,546 {txt}{c |}{res}     1,629 
{txt}    2018m6 {c |}{res}        66      1,436 {txt}{c |}{res}     1,502 
{txt}    2018m7 {c |}{res}        77      1,543 {txt}{c |}{res}     1,620 
{txt}    2018m8 {c |}{res}        72      1,501 {txt}{c |}{res}     1,573 
{txt}    2018m9 {c |}{res}        75      1,420 {txt}{c |}{res}     1,495 
{txt}   2018m10 {c |}{res}        70      1,379 {txt}{c |}{res}     1,449 
{txt}   2018m11 {c |}{res}        69      1,444 {txt}{c |}{res}     1,513 
{txt}   2018m12 {c |}{res}        74      1,444 {txt}{c |}{res}     1,518 
{txt}    2019m1 {c |}{res}        73      1,507 {txt}{c |}{res}     1,580 
{txt}    2019m2 {c |}{res}        66      1,373 {txt}{c |}{res}     1,439 
{txt}    2019m3 {c |}{res}        74      1,444 {txt}{c |}{res}     1,518 
{txt}    2019m4 {c |}{res}        76      1,454 {txt}{c |}{res}     1,530 
{txt}    2019m5 {c |}{res}        83      1,476 {txt}{c |}{res}     1,559 
{txt}    2019m6 {c |}{res}        79      1,494 {txt}{c |}{res}     1,573 
{txt}    2019m7 {c |}{res}        81      1,466 {txt}{c |}{res}     1,547 
{txt}    2019m8 {c |}{res}        80      1,455 {txt}{c |}{res}     1,535 
{txt}    2019m9 {c |}{res}        79      1,478 {txt}{c |}{res}     1,557 
{txt}   2019m10 {c |}{res}        86      1,519 {txt}{c |}{res}     1,605 
{txt}   2019m11 {c |}{res}        76      1,407 {txt}{c |}{res}     1,483 
{txt}   2019m12 {c |}{res}        82      1,483 {txt}{c |}{res}     1,565 
{txt}    2020m1 {c |}{res}        83      1,453 {txt}{c |}{res}     1,536 
{txt}    2020m2 {c |}{res}        79      1,354 {txt}{c |}{res}     1,433 
{txt}    2020m3 {c |}{res}        83      1,476 {txt}{c |}{res}     1,559 
{txt}    2020m4 {c |}{res}        77      1,461 {txt}{c |}{res}     1,538 
{txt}    2020m5 {c |}{res}        72      1,504 {txt}{c |}{res}     1,576 
{txt}    2020m6 {c |}{res}        74      1,460 {txt}{c |}{res}     1,534 
{txt}    2020m7 {c |}{res}        59      1,522 {txt}{c |}{res}     1,581 
{txt}    2020m8 {c |}{res}        77      1,424 {txt}{c |}{res}     1,501 
{txt}    2020m9 {c |}{res}        74      1,402 {txt}{c |}{res}     1,476 
{txt}   2020m10 {c |}{res}        73      1,448 {txt}{c |}{res}     1,521 
{txt}   2020m11 {c |}{res}        74      1,336 {txt}{c |}{res}     1,410 
{txt}   2020m12 {c |}{res}        82      1,442 {txt}{c |}{res}     1,524 
{txt}    2021m1 {c |}{res}        71      1,549 {txt}{c |}{res}     1,620 
{txt}    2021m2 {c |}{res}        54      1,349 {txt}{c |}{res}     1,403 
{txt}    2021m3 {c |}{res}        83      1,556 {txt}{c |}{res}     1,639 
{txt}    2021m4 {c |}{res}        95      1,428 {txt}{c |}{res}     1,523 
{txt}    2021m5 {c |}{res}        73      1,485 {txt}{c |}{res}     1,558 
{txt}    2021m6 {c |}{res}        86      1,436 {txt}{c |}{res}     1,522 
{txt}    2021m7 {c |}{res}        87      1,481 {txt}{c |}{res}     1,568 
{txt}    2021m8 {c |}{res}        82      1,483 {txt}{c |}{res}     1,565 
{txt}    2021m9 {c |}{res}        63      1,393 {txt}{c |}{res}     1,456 
{txt}   2021m10 {c |}{res}        72      1,477 {txt}{c |}{res}     1,549 
{txt}   2021m11 {c |}{res}        79      1,483 {txt}{c |}{res}     1,562 
{txt}   2021m12 {c |}{res}        95      1,463 {txt}{c |}{res}     1,558 
{txt}    2022m1 {c |}{res}        78      1,417 {txt}{c |}{res}     1,495 
{txt}    2022m2 {c |}{res}        68      1,296 {txt}{c |}{res}     1,364 
{txt}    2022m3 {c |}{res}        81      1,440 {txt}{c |}{res}     1,521 
{txt}    2022m4 {c |}{res}        43        892 {txt}{c |}{res}       935 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
     Total {c |}{res}     3,888     74,163 {txt}{c |}{res}    78,051 
{txt}
{com}. 
{txt}end of do-file

{com}. help tab

. do "C:\Users\k1754142\AppData\Local\Temp\STD5fac_000000.tmp"
{txt}
{com}. summ mo_year_diagn has_6m_follow_up

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
mo_year_di~n {c |}{res}     78,051    721.5183    14.72464        696        747
{txt}has_6m_fol~p {c |}{res}     78,051    .9501864     .217561          0          1
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\k1754142\AppData\Local\Temp\STD5fac_000000.tmp"
{txt}
{com}. tab mo_year_diagn has_6m_follow_up, statistic(percent)
{err}option {bf:statistic()} not allowed
{txt}{search r(198), local:r(198);}

end of do-file

{search r(198), local:r(198);}

{com}. exit, clear
