{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:/Users/k1754142/OneDrive/PhD Project/OpenSAFELY/Github Practice/logs/cleaning_dataset.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 5 Apr 2022, 15:38:21
{txt}
{com}. 
. di "$projectdir"
{res}C:/Users/k1754142/OneDrive/PhD Project/OpenSAFELY/Github Practice
{txt}
{com}. di "$logdir"
{res}C:/Users/k1754142/OneDrive/PhD Project/OpenSAFELY/Github Practice/logs
{txt}
{com}. 
. import delimited "$projectdir/output/input.csv", clear
{res}{txt}(encoding automatically selected: ISO-8859-1)
{res}{text}(65 vars, 100,000 obs)

{com}. 
. **Set Ado file path
. adopath + "$projectdir/analysis/extra_ados"
{txt}  [1]  (BASE)      "{res}C:\Program Files\Stata17\ado\base/{txt}"
  [2]  (SITE)      "{res}C:\Program Files\Stata17\ado\site/{txt}"
  [3]              "{res}.{txt}"
  [4]  (PERSONAL)  "{res}C:\Users\k1754142\ado\personal/{txt}"
  [5]  (PLUS)      "{res}C:\Users\k1754142\ado\plus/{txt}"
  [6]  (OLDPLACE)  "{res}c:\ado/{txt}"
  [7]              "{res}C:/Users/k1754142/OneDrive/PhD Project/OpenSAFELY/Github Practice/analysis/extra_ados{txt}"

{com}. 
. **Set index dates ===========================================================*/
. global year_preceding = "01/03/2018"
{txt}
{com}. global start_date = "01/03/2019"
{txt}
{com}. global end_date = "01/03/2022"
{txt}
{com}. 
. **Rename variables (some are too long for Stata to handle) =======================================*/
. rename chronic_respiratory_disease chronic_resp_disease
{res}{txt}
{com}. 
. **Convert date strings to dates ====================================================*/
. ***Some dates are given with month/year only, so adding day 15 to enable them to be processed as dates 
. 
. foreach var of varlist   hba1c_mmol_per_mol_date                        ///
>                                                  hba1c_percentage_date                          ///
>                                                  creatinine_date                                ///
>                                                  bmi_date_measured                          ///
>                                                  abatacept                                                      ///
>                                                  adalimumab                                                     ///     
>                                                  baricitinib                                            ///
>                                                  certolizumab                                           ///
>                                                  etanercept                                                     ///
>                                                  golimumab                                                      ///
>                                                  guselkumab                                                     ///     
>                                                  infliximab                                                     ///
>                                                  ixekizumab                                                     ///
>                                                  methotrexate_hcd                                       ///
>                                                  rituximab                                                      ///
>                                                  sarilumab                                                      ///
>                                                  secukinumab                                            ///     
>                                                  tocilizumab                                            ///
>                                                  tofacitinib                                            ///
>                                                  upadacitinib                                           ///
>                                                  ustekinumab                                            ///
>                                                  {c -(}
{txt}  2{com}.                                                         
.                 capture confirm string variable `var'
{txt}  3{com}.                 if _rc!=0 {c -(}
{txt}  4{com}.                         assert `var'==.
{txt}  5{com}.                         rename `var' `var'_date
{txt}  6{com}.                 {c )-}
{txt}  7{com}.         
.                 else {c -(}
{txt}  8{com}.                                 replace `var' = `var' + "-15"
{txt}  9{com}.                                 rename `var' `var'_dstr
{txt} 10{com}.                                 replace `var'_dstr = " " if `var'_dstr == "-15"
{txt} 11{com}.                                 gen `var'_date = date(`var'_dstr, "YMD") 
{txt} 12{com}.                                 order `var'_date, after(`var'_dstr)
{txt} 13{com}.                                 drop `var'_dstr
{txt} 14{com}.                 {c )-}
{txt} 15{com}.         
.         format `var'_date %td
{txt} 16{com}. {c )-}
{txt}variable {bf}{res}hba1c_mmol_per_mol_date{sf}{txt} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(5,000 real changes made)
(5,000 missing values generated)
variable {bf}{res}hba1c_percentage_date{sf}{txt} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(5,000 real changes made)
(5,000 missing values generated)
variable {bf}{res}creatinine_date{sf}{txt} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(5,000 real changes made)
(5,000 missing values generated)
variable {bf}{res}bmi_date_measured{sf}{txt} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(40,000 real changes made)
(40,000 missing values generated)
variable {bf}{res}abatacept{sf}{txt} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}{res}adalimumab{sf}{txt} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}{res}baricitinib{sf}{txt} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}{res}certolizumab{sf}{txt} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}{res}etanercept{sf}{txt} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}{res}golimumab{sf}{txt} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}{res}guselkumab{sf}{txt} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}{res}infliximab{sf}{txt} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}{res}ixekizumab{sf}{txt} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}{res}methotrexate_hcd{sf}{txt} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}{res}rituximab{sf}{txt} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}{res}sarilumab{sf}{txt} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}{res}secukinumab{sf}{txt} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}{res}tocilizumab{sf}{txt} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}{res}tofacitinib{sf}{txt} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}{res}upadacitinib{sf}{txt} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}{res}ustekinumab{sf}{txt} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)

{com}. 
. **Conversion for dates with day already included ====================================================*/
. 
. foreach var of varlist   died_date_ons                                          ///
>                                              eia_code_date                                              ///
>                                                  rheum_appt_date                                        ///
>                                              ra_code_date                                               ///
>                                                  psa_code_date                                          ///
>                                                  anksp_code_date                                        ///
>                                                  last_gp_prerheum_date                          ///
>                                                  last_gp_precode_date                           ///     
>                                                  last_gp_refrheum_date                          ///
>                                                  last_gp_refcode_date                           ///
>                                                  referral_rheum_prerheum                        ///
>                                                  referral_rheum_precode                         ///     
>                                                  chronic_cardiac_disease                        ///
>                                                  diabetes                                                       ///
>                                                  hypertension                                           ///     
>                                                  chronic_resp_disease                           ///
>                                                  copd                                                           ///
>                                                  chronic_liver_disease                          ///
>                                                  stroke                                                         ///
>                                                  lung_cancer                                            ///
>                                                  haem_cancer                                            ///
>                                                  other_cancer                                           ///
>                                                  esrf                                                           ///
>                                                  organ_transplant                                       ///
>                                                  hydroxychloroquine                                     ///
>                                                  leflunomide                                            ///
>                                                  methotrexate                                           ///
>                                                  methotrexate_inj                                       ///
>                                                  sulfasalazine                                          ///
>                                                  {c -(}
{txt}  2{com}.                                                                  
.                 capture confirm string variable `var'
{txt}  3{com}.                 if _rc!=0 {c -(}
{txt}  4{com}.                         assert `var'==.
{txt}  5{com}.                         rename `var' `var'_date
{txt}  6{com}.                 {c )-}
{txt}  7{com}.         
.                 else {c -(}
{txt}  8{com}.                                 rename `var' `var'_dstr
{txt}  9{com}.                                 gen `var'_date = date(`var'_dstr, "YMD") 
{txt} 10{com}.                                 order `var'_date, after(`var'_dstr)
{txt} 11{com}.                                 drop `var'_dstr
{txt} 12{com}.                                 gen `var'_date15 = `var'_date+15
{txt} 13{com}.                                 order `var'_date15, after(`var'_date)
{txt} 14{com}.                                 drop `var'_date
{txt} 15{com}.                                 rename `var'_date15 `var'_date
{txt} 16{com}.                 {c )-}
{txt} 17{com}.         
.         format `var'_date %td
{txt} 18{com}. {c )-}
{res}{txt}(90,000 missing values generated)
(90,000 missing values generated)
{res}{txt}(1,000 missing values generated)
(1,000 missing values generated)
{res}{txt}(9,999 missing values generated)
(9,999 missing values generated)
{res}{txt}(1,000 missing values generated)
(1,000 missing values generated)
{res}{txt}(1,000 missing values generated)
(1,000 missing values generated)
{res}{txt}(1,000 missing values generated)
(1,000 missing values generated)
{res}{txt}(9,999 missing values generated)
(9,999 missing values generated)
{res}{txt}(9,999 missing values generated)
(9,999 missing values generated)
{res}{txt}(9,999 missing values generated)
(9,999 missing values generated)
{res}{txt}(9,999 missing values generated)
(9,999 missing values generated)
{res}{txt}(9,999 missing values generated)
(9,999 missing values generated)
{res}{txt}(9,999 missing values generated)
(9,999 missing values generated)
{res}{txt}(80,000 missing values generated)
(80,000 missing values generated)
{res}{txt}(80,000 missing values generated)
(80,000 missing values generated)
{res}{txt}(80,000 missing values generated)
(80,000 missing values generated)
{res}{txt}(80,000 missing values generated)
(80,000 missing values generated)
{res}{txt}(80,000 missing values generated)
(80,000 missing values generated)
{res}{txt}(80,000 missing values generated)
(80,000 missing values generated)
{res}{txt}(80,000 missing values generated)
(80,000 missing values generated)
{res}{txt}(80,000 missing values generated)
(80,000 missing values generated)
{res}{txt}(80,000 missing values generated)
(80,000 missing values generated)
{res}{txt}(80,000 missing values generated)
(80,000 missing values generated)
{res}{txt}(80,000 missing values generated)
(80,000 missing values generated)
{res}{txt}(80,000 missing values generated)
(80,000 missing values generated)
{res}{txt}(90,000 missing values generated)
(90,000 missing values generated)
{res}{txt}(90,000 missing values generated)
(90,000 missing values generated)
{res}{txt}(90,000 missing values generated)
(90,000 missing values generated)
{res}{txt}(90,000 missing values generated)
(90,000 missing values generated)
{res}{txt}(90,000 missing values generated)
(90,000 missing values generated)
{res}{txt}
{com}.                                                  
. **Rename variables with extra 'date' added to the end of variable names===========================================================*/ 
. rename rheum_appt_date_date rheum_appt_date
{res}{txt}
{com}. rename eia_code_date_date eia_code_date
{res}{txt}
{com}. rename ra_code_date_date ra_code_date
{res}{txt}
{com}. rename psa_code_date_date psa_code_date
{res}{txt}
{com}. rename anksp_code_date_date anksp_code_date
{res}{txt}
{com}. rename died_date_ons_date died_ons_date
{res}{txt}
{com}. rename last_gp_prerheum_date_date last_gp_prerheum_date
{res}{txt}
{com}. rename last_gp_refrheum_date_date last_gp_refrheum_date
{res}{txt}
{com}. rename last_gp_refcode_date_date last_gp_refcode_date
{res}{txt}
{com}. rename last_gp_precode_date_date last_gp_precode_date
{res}{txt}
{com}. rename hba1c_mmol_per_mol_date_date hba1c_mmol_per_mol_date
{res}{txt}
{com}. rename hba1c_percentage_date_date hba1c_percentage_date
{res}{txt}
{com}. rename creatinine_date_date creatinine_date
{res}{txt}
{com}. rename creatinine creatinine_value 
{res}{txt}
{com}. rename bmi_date_measured_date bmi_date
{res}{txt}
{com}. rename bmi bmi_value
{res}{txt}
{com}. 
. **Create binary indicator variables for relevant conditions ====================================================*/
. 
. foreach var of varlist   eia_code_date                                          ///
>                                                  rheum_appt_date                                        ///
>                                              ra_code_date                                               ///
>                                                  psa_code_date                                          ///
>                                                  anksp_code_date                                        ///
>                                                  died_ons_date                                          ///
>                                                  last_gp_prerheum_date                          ///
>                                                  last_gp_precode_date                           ///     
>                                                  last_gp_refrheum_date                          ///
>                                                  last_gp_refcode_date                           ///
>                                                  referral_rheum_prerheum_date           ///
>                                                  referral_rheum_precode_date            ///     
>                                                  chronic_cardiac_disease_date           ///
>                                                  diabetes_date                                          ///
>                                                  hypertension_date                                      ///
>                                                  chronic_resp_disease_date                      ///
>                                                  copd_date                                                      ///
>                                                  chronic_liver_disease_date                     ///
>                                                  stroke_date                                            ///
>                                                  lung_cancer_date                                       ///
>                                                  haem_cancer_date                                       ///             
>                                                  other_cancer_date                                      ///
>                                                  esrf_date                                                      ///
>                                                  creatinine_date                                        ///
>                                                  organ_transplant_date                          ///
>                                                  hydroxychloroquine_date                        ///     
>                                                  leflunomide_date                                       ///
>                                                  methotrexate_date                                      ///
>                                                  methotrexate_inj_date                          ///             
>                                                  sulfasalazine_date                                     ///
>                                                  abatacept_date                                         ///
>                                                  adalimumab_date                                        ///
>                                                  baricitinib_date                                       ///
>                                                  certolizumab_date                                      ///
>                                                  etanercept_date                                        ///
>                                                  golimumab_date                                         ///
>                                                  guselkumab_date                                        ///
>                                                  infliximab_date                                        ///
>                                                  ixekizumab_date                                        ///
>                                                  methotrexate_hcd_date                          ///
>                                                  rituximab_date                                         ///             
>                                                  sarilumab_date                                         ///
>                                                  secukinumab_date                                       ///
>                                                  tocilizumab_date                                       ///             
>                                                  tofacitinib_date                                       ///
>                                                  upadacitinib_date                                      ///
>                                                  ustekinumab_date   {c -(}                           
{txt}  2{com}.         /*date ranges are applied in python, so presence of date indicates presence of 
>           disease in the correct time frame*/ 
.         local newvar =  substr("`var'", 1, length("`var'") - 5)
{txt}  3{com}.         gen `newvar' = (`var'!=. )
{txt}  4{com}.         order `newvar', after(`var')
{txt}  5{com}. {c )-}
{txt}
{com}. 
. **Create and label variables ===========================================================*/
. 
. **Demographics
. ***Sex
. gen male = 1 if sex == "M"
{txt}(51,158 missing values generated)

{com}. replace male = 0 if sex == "F"
{txt}(51,158 real changes made)

{com}. lab var male "Male"
{txt}
{com}. tab male, missing

       {txt}Male {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     51,158       51.16       51.16
{txt}          1 {c |}{res}     48,842       48.84      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}    100,000      100.00
{txt}
{com}. 
. ***Ethnicity
. replace ethnicity = .u if ethnicity == .
{txt}(25,000 real changes made, 25,000 to missing)

{com}. ****rearrange in order of prevalence
. recode ethnicity 2=6 /* mixed to 6 */
{txt}(14893 changes made to {bf:ethnicity})

{com}. recode ethnicity 3=2 /* south asian to 2 */
{txt}(7580 changes made to {bf:ethnicity})

{com}. recode ethnicity 4=3 /* black to 3 */
{txt}(7558 changes made to {bf:ethnicity})

{com}. recode ethnicity 6=4 /* mixed to 4 */
{txt}(14893 changes made to {bf:ethnicity})

{com}. recode ethnicity 5=4 /* other to 4 */
{txt}(7471 changes made to {bf:ethnicity})

{com}. 
. label define ethnicity  1 "White"                                       ///
>                                                 2 "Asian/Asian British"         ///
>                                                 3 "Black"                                       ///
>                                                 4 "Mixed/Other"                         ///
>                                                 .u "Missing"
{txt}
{com}. label values ethnicity ethnicity
{txt}
{com}. lab var ethnicity "Ethnicity"
{txt}
{com}. tab ethnicity, missing

          {txt}Ethnicity {c |}      Freq.     Percent        Cum.
{hline 20}{c +}{hline 35}
              White {c |}{res}     37,498       37.50       37.50
{txt}Asian/Asian British {c |}{res}      7,580        7.58       45.08
{txt}              Black {c |}{res}      7,558        7.56       52.64
{txt}        Mixed/Other {c |}{res}     22,364       22.36       75.00
{txt}            Missing {c |}{res}     25,000       25.00      100.00
{txt}{hline 20}{c +}{hline 35}
              Total {c |}{res}    100,000      100.00
{txt}
{com}. 
. ***STP 
. rename stp stp_old
{res}{txt}
{com}. bysort stp_old: gen stp = 1 if _n==1
{txt}(99,998 missing values generated)

{com}. replace stp = sum(stp) //
{txt}(99,999 real changes made)

{com}. drop stp_old
{txt}
{com}. 
. ***Regions
. encode region, gen(nuts_region)
{txt}
{com}. tab region, missing

                  {txt}region {c |}      Freq.     Percent        Cum.
{hline 25}{c +}{hline 35}
           East Midlands {c |}{res}      9,938        9.94        9.94
{txt}         East of England {c |}{res}     10,099       10.10       20.04
{txt}                  London {c |}{res}     20,109       20.11       40.15
{txt}              North East {c |}{res}     10,016       10.02       50.16
{txt}              North West {c |}{res}      9,882        9.88       60.04
{txt}              South East {c |}{res}     20,079       20.08       80.12
{txt}           West Midlands {c |}{res}      9,967        9.97       90.09
{txt}Yorkshire and the Humber {c |}{res}      9,910        9.91      100.00
{txt}{hline 25}{c +}{hline 35}
                   Total {c |}{res}    100,000      100.00
{txt}
{com}. 
. ***IMD
. *Group into 5 groups
. rename imd imd_o
{res}{txt}
{com}. egen imd = cut(imd_o), group(5) icodes 
{txt}
{com}. *Add one to create groups 1-5 
. replace imd = imd + 1
{txt}(100,000 real changes made)

{com}. *-1 is missing, should be excluded from population 
. replace imd = .u if imd_o == -1
{txt}(0 real changes made)

{com}. drop imd_o
{txt}
{com}. *Reverse the order (so high is more deprived)
. recode imd 5 = 1 4 = 2 3 = 3 2 = 4 1 = 5 .u = .u
{txt}(100000 changes made to {bf:imd})

{com}. label define imd 1 "1 least deprived" 2 "2" 3 "3" 4 "4" 5 "5 most deprived" .u "Missing"
{txt}
{com}. label values imd imd 
{txt}
{com}. lab var imd "Index of multiple deprivation"
{txt}
{com}. tab imd, missing

        {txt}Index of {c |}
        multiple {c |}
     deprivation {c |}      Freq.     Percent        Cum.
{hline 17}{c +}{hline 35}
1 least deprived {c |}{res}     69,995       70.00       70.00
{txt}               4 {c |}{res}     19,993       19.99       89.99
{txt} 5 most deprived {c |}{res}     10,012       10.01      100.00
{txt}{hline 17}{c +}{hline 35}
           Total {c |}{res}    100,000      100.00
{txt}
{com}. 
. ***Age variables
. *Nb. works if ages 18 and over
. *Create categorised age
. drop if age<18 & age !=.
{txt}(21,170 observations deleted)

{com}. drop if age>109 & age !=.
{txt}(0 observations deleted)

{com}. drop if age==.
{txt}(0 observations deleted)

{com}. lab var age "Age"
{txt}
{com}. 
. recode age 18/39.9999 = 1 /// 
>            40/49.9999 = 2 ///
>                    50/59.9999 = 3 ///
>                60/69.9999 = 4 ///
>                    70/79.9999 = 5 ///
>                    80/max = 6, gen(agegroup) 
{txt}(78830 differences between {bf:age} and {bf:agegroup})

{com}. 
. label define agegroup   1 "18-39" ///
>                                                 2 "40-49" ///
>                                                 3 "50-59" ///
>                                                 4 "60-69" ///
>                                                 5 "70-79" ///
>                                                 6 "80+"
{txt}
{com}.                                                 
. label values agegroup agegroup
{txt}
{com}. lab var agegroup "Age group"
{txt}
{com}. tab agegroup, missing

  {txt}Age group {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
      18-39 {c |}{res}     28,760       36.48       36.48
{txt}      40-49 {c |}{res}     12,855       16.31       52.79
{txt}      50-59 {c |}{res}     13,438       17.05       69.84
{txt}      60-69 {c |}{res}     10,813       13.72       83.55
{txt}      70-79 {c |}{res}      8,154       10.34       93.90
{txt}        80+ {c |}{res}      4,810        6.10      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     78,830      100.00
{txt}
{com}. 
. *Create binary age
. recode age min/69.999 = 0 ///
>            70/max = 1, gen(age70)
{txt}(78830 differences between {bf:age} and {bf:age70})

{com}. 
. *Create restricted cubic splines for age
. mkspline age = age, cubic nknots(4)
{txt}
{com}. 
. ***Body Mass Index
. *Recode strange values 
. replace bmi_value = . if bmi_value == 0 
{txt}(31,423 real changes made, 31,423 to missing)

{com}. replace bmi_value = . if !inrange(bmi_value, 10, 80)
{txt}(264 real changes made, 264 to missing)

{com}. 
. *Restrict to within 10 years of EIA diagnosis date and aged>16 
. gen bmi_time = (eia_code_date - bmi_date)/365.25
{txt}(31,884 missing values generated)

{com}. gen bmi_age = age - bmi_time
{txt}(31,884 missing values generated)

{com}. replace bmi_value = . if bmi_age < 16 
{txt}(33,409 real changes made, 33,409 to missing)

{com}. replace bmi_value = . if bmi_time > 10 & bmi_time != . 
{txt}(8,822 real changes made, 8,822 to missing)

{com}. 
. *Set to missing if no date, and vice versa 
. replace bmi_value = . if bmi_date == . 
{txt}(0 real changes made)

{com}. replace bmi_date = . if bmi_value == . 
{txt}(42,495 real changes made, 42,495 to missing)

{com}. replace bmi_time = . if bmi_value == . 
{txt}(42,492 real changes made, 42,492 to missing)

{com}. replace bmi_age = . if bmi_value == . 
{txt}(42,492 real changes made, 42,492 to missing)

{com}. 
. *Create BMI categories
. gen     bmicat = .
{txt}(78,830 missing values generated)

{com}. recode  bmicat . = 1 if bmi_value < 18.5
{txt}(211 changes made to {bf:bmicat})

{com}. recode  bmicat . = 2 if bmi_value < 25
{txt}(529 changes made to {bf:bmicat})

{com}. recode  bmicat . = 3 if bmi_value < 30
{txt}(733 changes made to {bf:bmicat})

{com}. recode  bmicat . = 4 if bmi_value < 35
{txt}(926 changes made to {bf:bmicat})

{com}. recode  bmicat . = 5 if bmi_value < 40
{txt}(942 changes made to {bf:bmicat})

{com}. recode  bmicat . = 6 if bmi_value < .
{txt}(1571 changes made to {bf:bmicat})

{com}. replace bmicat = .u if bmi_value >= .
{txt}(73,918 real changes made, 73,918 to missing)

{com}. 
. label define bmicat 1 "Underweight (<18.5)"     ///
>                                         2 "Normal (18.5-24.9)"          ///
>                                         3 "Overweight (25-29.9)"        ///
>                                         4 "Obese I (30-34.9)"           ///
>                                         5 "Obese II (35-39.9)"          ///
>                                         6 "Obese III (40+)"                     ///
>                                         .u "Missing"
{txt}
{com}.                                         
. label values bmicat bmicat
{txt}
{com}. lab var bmicat "BMI"
{txt}
{com}. tab bmicat, missing

                 {txt}BMI {c |}      Freq.     Percent        Cum.
{hline 21}{c +}{hline 35}
 Underweight (<18.5) {c |}{res}        211        0.27        0.27
{txt}  Normal (18.5-24.9) {c |}{res}        529        0.67        0.94
{txt}Overweight (25-29.9) {c |}{res}        733        0.93        1.87
{txt}   Obese I (30-34.9) {c |}{res}        926        1.17        3.04
{txt}  Obese II (35-39.9) {c |}{res}        942        1.19        4.24
{txt}     Obese III (40+) {c |}{res}      1,571        1.99        6.23
{txt}             Missing {c |}{res}     73,918       93.77      100.00
{txt}{hline 21}{c +}{hline 35}
               Total {c |}{res}     78,830      100.00
{txt}
{com}. 
. *Create less granular categorisation
. recode bmicat 1/3 .u = 1 4 = 2 5 = 3 6 = 4, gen(obese4cat)
{txt}(78619 differences between {bf:bmicat} and {bf:obese4cat})

{com}. 
. label define obese4cat  1 "No record of obesity"        ///
>                                                 2 "Obese I (30-34.9)"           ///
>                                                 3 "Obese II (35-39.9)"          ///
>                                                 4 "Obese III (40+)"             
{txt}
{com}. 
. label values obese4cat obese4cat
{txt}
{com}. order obese4cat, after(bmicat)
{txt}
{com}. 
. ***Smoking 
. label define smoke 1 "Never" 2 "Former" 3 "Current" .u "Missing"
{txt}
{com}. 
. gen     smoke = 1  if smoking_status == "N"
{txt}(70,950 missing values generated)

{com}. replace smoke = 2  if smoking_status == "E"
{txt}(3,842 real changes made)

{com}. replace smoke = 3  if smoking_status == "S"
{txt}(23,670 real changes made)

{com}. replace smoke = .u if smoking_status == "M"
{txt}(3,993 real changes made, 3,993 to missing)

{com}. replace smoke = .u if smoking_status == "" 
{txt}(39,445 real changes made, 39,445 to missing)

{com}. 
. label values smoke smoke
{txt}
{com}. lab var smoke "Smoking status"
{txt}
{com}. drop smoking_status
{txt}
{com}. tab smoke, missing

    {txt}Smoking {c |}
     status {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
      Never {c |}{res}      7,880       10.00       10.00
{txt}     Former {c |}{res}      3,842        4.87       14.87
{txt}    Current {c |}{res}     23,670       30.03       44.90
{txt}    Missing {c |}{res}     43,438       55.10      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     78,830      100.00
{txt}
{com}. 
. *Create non-missing 3-category variable for current smoking (assumes missing smoking is never smoking)
. recode smoke .u = 1, gen(smoke_nomiss)
{txt}(43438 differences between {bf:smoke} and {bf:smoke_nomiss})

{com}. order smoke_nomiss, after(smoke)
{txt}
{com}. label values smoke_nomiss smoke
{txt}
{com}. 
. **Clinical comorbidities
. ***eGFR
. *Set implausible creatinine values to missing (Note: zero changed to missing)
. replace creatinine_value = . if !inrange(creatinine_value, 20, 3000) 
{txt}(19,652 real changes made, 19,652 to missing)

{com}. 
. *Remove creatinine dates if no measurements, and vice versa 
. replace creatinine_value = . if creatinine_date == . 
{txt}(0 real changes made)

{com}. replace creatinine_date = . if creatinine_value == . 
{txt}(15,730 real changes made, 15,730 to missing)

{com}. replace creatinine = . if creatinine_value == .
{txt}(19,652 real changes made, 19,652 to missing)

{com}. recode creatinine .=0
{txt}(19652 changes made to {bf:creatinine})

{com}. tab creatinine, missing

 {txt}creatinine {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     19,652       24.93       24.93
{txt}          1 {c |}{res}     59,178       75.07      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     78,830      100.00
{txt}
{com}. tabstat creatinine_value, stat(n mean p50)

{txt}{ralign 12:Variable} {...}
{c |}         N      Mean       p50
{hline 13}{c +}{hline 30}
{ralign 12:creatinin~ue} {...}
{c |}{...}
 {res}    59178  136.8023  126.9014
{txt}{hline 13}{c BT}{hline 30}

{com}. 
. *Divide by 88.4 (to convert umol/l to mg/dl) 
. gen SCr_adj = creatinine_value/88.4
{txt}(19,652 missing values generated)

{com}. 
. gen min = .
{txt}(78,830 missing values generated)

{com}. replace min = SCr_adj/0.7 if male==0
{txt}(30,283 real changes made)

{com}. replace min = SCr_adj/0.9 if male==1
{txt}(28,895 real changes made)

{com}. replace min = min^-0.329  if male==0
{txt}(30,283 real changes made)

{com}. replace min = min^-0.411  if male==1
{txt}(28,895 real changes made)

{com}. replace min = 1 if min<1
{txt}(46,250 real changes made)

{com}. 
. gen max=.
{txt}(78,830 missing values generated)

{com}. replace max=SCr_adj/0.7 if male==0
{txt}(30,283 real changes made)

{com}. replace max=SCr_adj/0.9 if male==1
{txt}(28,895 real changes made)

{com}. replace max=max^-1.209
{txt}(59,178 real changes made)

{com}. replace max=1 if max>1
{txt}(32,580 real changes made)

{com}. 
. gen egfr=min*max*141
{txt}(19,652 missing values generated)

{com}. replace egfr=egfr*(0.993^age)
{txt}(59,178 real changes made)

{com}. replace egfr=egfr*1.018 if male==0
{txt}(30,283 real changes made)

{com}. label var egfr "egfr calculated using CKD-EPI formula with no ethnicity"
{txt}
{com}. 
. *Categorise into ckd stages
. egen egfr_cat_all = cut(egfr), at(0, 15, 30, 45, 60, 5000)
{txt}(19,652 missing values generated)

{com}. recode egfr_cat_all 0 = 5 15 = 4 30 = 3 45 = 2 60 = 0, generate(ckd_egfr)
{txt}(59178 differences between {bf:egfr_cat_all} and {bf:ckd_egfr})

{com}. 
. gen egfr_cat = .
{txt}(78,830 missing values generated)

{com}. recode egfr_cat . = 3 if egfr < 30
{txt}(13889 changes made to {bf:egfr_cat})

{com}. recode egfr_cat . = 2 if egfr < 60
{txt}(21054 changes made to {bf:egfr_cat})

{com}. recode egfr_cat . = 1 if egfr < .
{txt}(24235 changes made to {bf:egfr_cat})

{com}. replace egfr_cat = .u if egfr >= .
{txt}(19,652 real changes made, 19,652 to missing)

{com}. 
. label define egfr_cat   1 ">=60"                ///
>                                                 2 "30-59"               ///
>                                                 3 "<30"                 ///
>                                                 .u "Missing"
{txt}
{com}.                                         
. label values egfr_cat egfr_cat
{txt}
{com}. lab var egfr_cat "eGFR"
{txt}
{com}. tab egfr_cat, missing

       {txt}eGFR {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
       >=60 {c |}{res}     24,235       30.74       30.74
{txt}      30-59 {c |}{res}     21,054       26.71       57.45
{txt}        <30 {c |}{res}     13,889       17.62       75.07
{txt}    Missing {c |}{res}     19,652       24.93      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     78,830      100.00
{txt}
{com}. 
. *If missing eGFR, assume normal
. gen egfr_cat_nomiss = egfr_cat
{txt}(19,652 missing values generated)

{com}. replace egfr_cat_nomiss = 1 if egfr_cat == .u
{txt}(19,652 real changes made)

{com}. 
. label define egfr_cat_nomiss    1 ">=60/missing"        ///
>                                                                 2 "30-59"                       ///
>                                                                 3 "<30" 
{txt}
{com}. label values egfr_cat_nomiss egfr_cat_nomiss
{txt}
{com}. lab var egfr_cat_nomiss "eGFR"
{txt}
{com}. 
. gen egfr_date = creatinine_date
{txt}(19,652 missing values generated)

{com}. format egfr_date %td
{txt}
{com}. 
. *Add in end stage renal failure and create a single CKD variable 
. *Missing assumed to not have CKD 
. gen ckd = 0
{txt}
{com}. replace ckd = 1 if ckd_egfr != . & ckd_egfr >= 1
{txt}(34,943 real changes made)

{com}. replace ckd = 1 if esrf == 1
{txt}(8,881 real changes made)

{com}. 
. label define ckd 0 "No CKD" 1 "CKD"
{txt}
{com}. label values ckd ckd
{txt}
{com}. label var ckd "Chronic kidney disease"
{txt}
{com}. tab ckd, missing

    {txt}Chronic {c |}
     kidney {c |}
    disease {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
     No CKD {c |}{res}     35,006       44.41       44.41
{txt}        CKD {c |}{res}     43,824       55.59      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     78,830      100.00
{txt}
{com}. 
. *Create date (most recent measure prior to index)
. gen temp1_ckd_date = creatinine_date if ckd_egfr >=1
{txt}(43,887 missing values generated)

{com}. gen temp2_ckd_date = esrf_date if esrf == 1
{txt}(62,982 missing values generated)

{com}. gen ckd_date = max(temp1_ckd_date,temp2_ckd_date) 
{txt}(35,006 missing values generated)

{com}. format ckd_date %td 
{txt}
{com}. 
. drop temp1_ckd_date temp2_ckd_date SCr_adj min max ckd_egfr egfr_cat_all
{txt}
{com}. 
. ***HbA1c
. *Set zero or negative to missing
. replace hba1c_percentage   = . if hba1c_percentage <= 0
{txt}(4,455 real changes made, 4,455 to missing)

{com}. replace hba1c_mmol_per_mol = . if hba1c_mmol_per_mol <= 0
{txt}(5,666 real changes made, 5,666 to missing)

{com}. 
. *Change implausible values to missing
. replace hba1c_percentage   = . if !inrange(hba1c_percentage, 1, 20)
{txt}(1,248 real changes made, 1,248 to missing)

{com}. replace hba1c_mmol_per_mol = . if !inrange(hba1c_mmol_per_mol, 10, 200)
{txt}(3,273 real changes made, 3,273 to missing)

{com}. 
. *Set most recent values of >24 months prior to EIA diagnosis date to missing
. replace hba1c_percentage   = . if (eia_code_date - hba1c_percentage_date) > 24*30 & hba1c_percentage_date != .
{txt}(70,702 real changes made, 70,702 to missing)

{com}. replace hba1c_mmol_per_mol = . if (eia_code_date - hba1c_mmol_per_mol_date) > 24*30 & hba1c_mmol_per_mol_date != .
{txt}(67,620 real changes made, 67,620 to missing)

{com}. 
. *Clean up dates
. replace hba1c_percentage_date = . if hba1c_percentage == .
{txt}(72,397 real changes made, 72,397 to missing)

{com}. replace hba1c_mmol_per_mol_date = . if hba1c_mmol_per_mol == .
{txt}(72,598 real changes made, 72,598 to missing)

{com}. 
. *Express  HbA1c as percentage
. *Express all values as perecentage 
. noi summ hba1c_percentage hba1c_mmol_per_mol 

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
hba1c_per~ge {c |}{res}      2,425    5.080616    1.890839   1.004418   11.67034
{txt}hba1c_mmol~l {c |}{res}      2,271    42.29938    17.61446   10.02266    107.442
{txt}
{com}. gen     hba1c_pct = hba1c_percentage 
{txt}(76,405 missing values generated)

{com}. replace hba1c_pct = (hba1c_mmol_per_mol/10.929)+2.15 if hba1c_mmol_per_mol<. 
{txt}(2,271 real changes made)

{com}. 
. *Valid % range between 0-20  
. replace hba1c_pct = . if !inrange(hba1c_pct, 1, 20) 
{txt}(0 real changes made)

{com}. replace hba1c_pct = round(hba1c_pct, 0.1)
{txt}(4,627 real changes made)

{com}. 
. *Categorise HbA1c and diabetes
. *Group hba1c pct
. gen     hba1ccat = 0 if hba1c_pct <  6.5
{txt}(75,642 missing values generated)

{com}. replace hba1ccat = 1 if hba1c_pct >= 6.5  & hba1c_pct < 7.5
{txt}(740 real changes made)

{com}. replace hba1ccat = 2 if hba1c_pct >= 7.5  & hba1c_pct < 8
{txt}(242 real changes made)

{com}. replace hba1ccat = 3 if hba1c_pct >= 8    & hba1c_pct < 9
{txt}(317 real changes made)

{com}. replace hba1ccat = 4 if hba1c_pct >= 9    & hba1c_pct !=.
{txt}(140 real changes made)

{com}. label define hba1ccat 0 "<6.5%" 1">=6.5-7.4" 2">=7.5-7.9" 3">=8-8.9" 4">=9"
{txt}
{com}. label values hba1ccat hba1ccat
{txt}
{com}. tab hba1ccat, missing

   {txt}hba1ccat {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
      <6.5% {c |}{res}      3,188        4.04        4.04
{txt}  >=6.5-7.4 {c |}{res}        740        0.94        4.98
{txt}  >=7.5-7.9 {c |}{res}        242        0.31        5.29
{txt}    >=8-8.9 {c |}{res}        317        0.40        5.69
{txt}        >=9 {c |}{res}        140        0.18        5.87
{txt}          . {c |}{res}     74,203       94.13      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     78,830      100.00
{txt}
{com}. 
. *Express all values as mmol
. gen hba1c_mmol = hba1c_mmol_per_mol
{txt}(76,559 missing values generated)

{com}. replace hba1c_mmol = (hba1c_percentage*10.929)-23.5 if hba1c_percentage<. & hba1c_mmol==.
{txt}(2,356 real changes made)

{com}. 
. *Group hba1c mmol
. gen     hba1ccatmm = 0 if hba1c_mmol < 58
{txt}(74,897 missing values generated)

{com}. replace hba1ccatmm = 1 if hba1c_mmol >= 58 & hba1c_mmol !=.
{txt}(694 real changes made)

{com}. replace hba1ccatmm =.u if hba1ccatmm==. 
{txt}(74,203 real changes made, 74,203 to missing)

{com}. label define hba1ccatmm 0 "HbA1c <58mmol/mol" 1 "HbA1c >=58mmol/mol" .u "Missing"
{txt}
{com}. label values hba1ccatmm hba1ccatmm
{txt}
{com}. lab var hba1ccatmm "HbA1c"
{txt}
{com}. tab hba1ccatmm, missing

             {txt}HbA1c {c |}      Freq.     Percent        Cum.
{hline 19}{c +}{hline 35}
 HbA1c <58mmol/mol {c |}{res}      3,933        4.99        4.99
{txt}HbA1c >=58mmol/mol {c |}{res}        694        0.88        5.87
{txt}           Missing {c |}{res}     74,203       94.13      100.00
{txt}{hline 19}{c +}{hline 35}
             Total {c |}{res}     78,830      100.00
{txt}
{com}. 
. *Create diabetes, split by control/not (assumes missing = no diabetes)
. gen     diabcat = 1 if diabetes==0
{txt}(15,821 missing values generated)

{com}. replace diabcat = 2 if diabetes==1 & inlist(hba1ccat, 0, 1)
{txt}(777 real changes made)

{com}. replace diabcat = 3 if diabetes==1 & inlist(hba1ccat, 2, 3, 4)
{txt}(140 real changes made)

{com}. replace diabcat = 4 if diabetes==1 & !inlist(hba1ccat, 0, 1, 2, 3, 4)
{txt}(14,904 real changes made)

{com}. 
. label define diabcat    1 "No diabetes"                         ///
>                                                 2 "Controlled diabetes"         ///
>                                                 3 "Uncontrolled diabetes"       ///
>                                                 4 "Diabetes, no hba1c measure"
{txt}
{com}. label values diabcat diabcat
{txt}
{com}. 
. *Create cancer variable 'other cancer currently', includes carcinoma of the head and neck - need to confirm if this excludes NMSC
. gen cancer =0
{txt}
{com}. replace cancer =1 if lung_cancer ==1 | haem_cancer ==1 | other_cancer ==1
{txt}(38,343 real changes made)

{com}. lab var cancer "Cancer"
{txt}
{com}. tab cancer, missing

     {txt}Cancer {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     40,487       51.36       51.36
{txt}          1 {c |}{res}     38,343       48.64      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     78,830      100.00
{txt}
{com}. 
. *Create other comorbid variables
. gen combined_cv_comorbid =1 if chronic_cardiac_disease ==1 | stroke==1
{txt}(50,485 missing values generated)

{com}. recode combined_cv_comorbid .=0
{txt}(50485 changes made to {bf:combined_cv_comorbid})

{com}. 
. *Delete unneeded variables
. drop hba1c_pct hba1c_percentage hba1c_mmol_per_mol
{txt}
{com}. 
. *Label variables
. lab var hypertension "Hypertension"
{txt}
{com}. lab var diabetes "Diabetes"
{txt}
{com}. lab var stroke "Stroke"
{txt}
{com}. lab var chronic_resp_disease "Chronic respiratory disease"
{txt}
{com}. lab var copd "COPD"
{txt}
{com}. lab var esrf "End-stage renal failure"
{txt}
{com}. lab var chronic_liver_disease "Chronic liver disease"
{txt}
{com}. lab var chronic_cardiac_disease "Chronic cardiac disease"
{txt}
{com}. 
. *Refine diagnostic window=============================================================*/
. 
. **All patients should have EIA code
. tab eia_code, missing

   {txt}eia_code {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}        779        0.99        0.99
{txt}          1 {c |}{res}     78,051       99.01      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     78,830      100.00
{txt}
{com}. keep if eia_code==1
{txt}(779 observations deleted)

{com}. 
. **Keep patients with first EIA code in GP record if code was after 1st March 2019
. keep if eia_code_date>=date("$start_date", "DMY") & eia_code_date!=. 
{txt}(20,552 observations deleted)

{com}. tab eia_code

   {txt}eia_code {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}     57,499      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     57,499      100.00
{txt}
{com}. 
. **Month/Year of EIA code
. gen year_diag=year(eia_code_date)
{txt}
{com}. format year_diag %ty
{txt}
{com}. gen month_diag=month(eia_code_date)
{txt}
{com}. gen mo_year_diagn=ym(year_diag, month_diag)
{txt}
{com}. format mo_year_diagn %tm
{txt}
{com}. 
. *Include only most recent EIA sub-diagnosis=============================================*/
. 
. replace ra_code =0 if psa_code_date >= ra_code_date & psa_code_date !=.
{txt}(28,191 real changes made)

{com}. replace ra_code =0 if anksp_code_date >= ra_code_date & anksp_code_date !=.
{txt}(9,646 real changes made)

{com}. replace psa_code =0 if ra_code_date >= psa_code_date & ra_code_date !=.
{txt}(28,206 real changes made)

{com}. replace psa_code =0 if anksp_code_date >= psa_code_date & anksp_code_date !=.
{txt}(9,624 real changes made)

{com}. replace anksp_code =0 if psa_code_date >= anksp_code_date & psa_code_date !=.
{txt}(28,116 real changes made)

{com}. replace anksp_code =0 if ra_code_date >= anksp_code_date & ra_code_date !=.
{txt}(9,545 real changes made)

{com}. gen eia_diagnosis=1 if ra_code==1
{txt}(38,421 missing values generated)

{com}. replace eia_diagnosis=2 if psa_code==1
{txt}(19,101 real changes made)

{com}. replace eia_diagnosis=3 if anksp_code==1
{txt}(19,266 real changes made)

{com}. lab define eia_diagnosis 1 "RA" 2 "PsA" 3 "AxSpA", modify
{txt}
{com}. lab val eia_diagnosis eia_diagnosis
{txt}
{com}. tab eia_diagnosis, missing

{txt}eia_diagnos {c |}
         is {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
         RA {c |}{res}     19,078       33.18       33.18
{txt}        PsA {c |}{res}     19,101       33.22       66.40
{txt}      AxSpA {c |}{res}     19,266       33.51       99.91
{txt}          . {c |}{res}         54        0.09      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     57,499      100.00
{txt}
{com}. drop if eia_diagnosis==.
{txt}(54 observations deleted)

{com}. 
. *Define drugs and dates=====================================================*/
. 
. **csDMARDs (not including high cost MTX; wouldn't be shared care)
. gen csdmard=1 if hydroxychloroquine==1 | leflunomide==1 | methotrexate==1 | methotrexate_inj==1 | sulfasalazine==1
{txt}(33,768 missing values generated)

{com}. recode csdmard .=0 
{txt}(33768 changes made to {bf:csdmard})

{com}. tab csdmard, missing

    {txt}csdmard {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     33,768       58.78       58.78
{txt}          1 {c |}{res}     23,677       41.22      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     57,445      100.00
{txt}
{com}. bys eia_diagnosis: tab csdmard

{txt}{hline}
-> eia_diagnosis = RA

    csdmard {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     11,069       58.02       58.02
{txt}          1 {c |}{res}      8,009       41.98      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     19,078      100.00

{txt}{hline}
-> eia_diagnosis = PsA

    csdmard {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     11,264       58.97       58.97
{txt}          1 {c |}{res}      7,837       41.03      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     19,101      100.00

{txt}{hline}
-> eia_diagnosis = AxSpA

    csdmard {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     11,435       59.35       59.35
{txt}          1 {c |}{res}      7,831       40.65      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     19,266      100.00

{txt}
{com}. 
. **csDMARDs (including high cost MTX)
. gen csdmard_hcd=1 if hydroxychloroquine==1 | leflunomide==1 | methotrexate==1 | methotrexate_inj==1 | methotrexate_hcd==1 | sulfasalazine==1
{txt}(30,390 missing values generated)

{com}. recode csdmard_hcd .=0 
{txt}(30390 changes made to {bf:csdmard_hcd})

{com}. tab csdmard_hcd, missing

{txt}csdmard_hcd {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     30,390       52.90       52.90
{txt}          1 {c |}{res}     27,055       47.10      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     57,445      100.00
{txt}
{com}. bys eia_diagnosis: tab csdmard_hcd, missing

{txt}{hline}
-> eia_diagnosis = RA

csdmard_hcd {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      9,929       52.04       52.04
{txt}          1 {c |}{res}      9,149       47.96      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     19,078      100.00

{txt}{hline}
-> eia_diagnosis = PsA

csdmard_hcd {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     10,128       53.02       53.02
{txt}          1 {c |}{res}      8,973       46.98      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     19,101      100.00

{txt}{hline}
-> eia_diagnosis = AxSpA

csdmard_hcd {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     10,333       53.63       53.63
{txt}          1 {c |}{res}      8,933       46.37      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     19,266      100.00

{txt}
{com}. 
. **Date of first csDMARD script (not including high cost MTX prescriptions)
. gen csdmard_date=min(hydroxychloroquine_date, leflunomide_date, methotrexate_date, methotrexate_inj_date, sulfasalazine_date)
{txt}(33,768 missing values generated)

{com}. format %td csdmard_date
{txt}
{com}. 
. **Date of first csDMARD script (including high cost MTX prescriptions)
. gen csdmard_hcd_date=min(hydroxychloroquine_date, leflunomide_date, methotrexate_date, methotrexate_inj_date, methotrexate_hcd_date, sulfasalazine_date)
{txt}(30,390 missing values generated)

{com}. format %td csdmard_hcd_date
{txt}
{com}. 
. **Biologic use
. gen biologic=1 if abatacept==1 | adalimumab==1 | baricitinib==1 | certolizumab==1 | etanercept==1 | golimumab==1 | guselkumab==1 | infliximab==1 | ixekizumab==1 | rituximab==1 | sarilumab==1 | secukinumab==1 | tocilizumab==1 | tofacitinib==1 | upadacitinib==1 | ustekinumab==1 
{txt}(10,595 missing values generated)

{com}. recode biologic .=0
{txt}(10595 changes made to {bf:biologic})

{com}. tab biologic, missing

   {txt}biologic {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     10,595       18.44       18.44
{txt}          1 {c |}{res}     46,850       81.56      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     57,445      100.00
{txt}
{com}. bys eia_diagnosis: tab biologic, missing 

{txt}{hline}
-> eia_diagnosis = RA

   biologic {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      3,524       18.47       18.47
{txt}          1 {c |}{res}     15,554       81.53      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     19,078      100.00

{txt}{hline}
-> eia_diagnosis = PsA

   biologic {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      3,534       18.50       18.50
{txt}          1 {c |}{res}     15,567       81.50      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     19,101      100.00

{txt}{hline}
-> eia_diagnosis = AxSpA

   biologic {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      3,537       18.36       18.36
{txt}          1 {c |}{res}     15,729       81.64      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     19,266      100.00

{txt}
{com}. 
. **Date of first biologic script
. gen biologic_date=min(abatacept_date, adalimumab_date, baricitinib_date, certolizumab_date, etanercept_date, golimumab_date, guselkumab_date, infliximab_date, ixekizumab_date, rituximab_date, sarilumab_date, secukinumab_date, tocilizumab_date, tofacitinib_date, upadacitinib_date, ustekinumab_date)
{txt}(10,595 missing values generated)

{com}. format %td biologic_date
{txt}
{com}. 
. **Exclude if first csdmard or biologic was before first rheum appt
. ***Nb. could introduce leeway e.g. 30 days?
. tab csdmard if rheum_appt_date!=. & csdmard_date!=. & csdmard_date<rheum_appt_date

    {txt}csdmard {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}      8,550      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      8,550      100.00
{txt}
{com}. drop if rheum_appt_date!=. & csdmard_date!=. & csdmard_date<rheum_appt_date
{txt}(8,550 observations deleted)

{com}. tab biologic if rheum_appt_date!=. & biologic_date!=. & biologic_date<rheum_appt_date 

   {txt}biologic {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}     14,799      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,799      100.00
{txt}
{com}. drop if rheum_appt_date!=. & biologic_date!=. & biologic_date<rheum_appt_date 
{txt}(14,799 observations deleted)

{com}. 
. *Number of EIA diagnoses in 1-year time windows=========================================*/
. 
. gen diagnosis_year=1 if eia_code_date>=td(01mar2019) & eia_code_date<td(01mar2020)
{txt}(23,179 missing values generated)

{com}. replace diagnosis_year=2 if eia_code_date>=td(01mar2020) & eia_code_date<td(01mar2021)
{txt}(10,897 real changes made)

{com}. replace diagnosis_year=3 if eia_code_date>=td(01mar2021) & eia_code_date<td(01mar2022)
{txt}(10,830 real changes made)

{com}. lab define diagnosis_year 1 "March 2019-March 2020" 2 "March 2020-March 2021" 3 "March 2021-March 2022", modify
{txt}
{com}. lab val diagnosis_year diagnosis_year
{txt}
{com}. lab var diagnosis_year "Year of diagnosis"
{txt}
{com}. tab diagnosis_year, missing

    {txt}Year of diagnosis {c |}      Freq.     Percent        Cum.
{hline 22}{c +}{hline 35}
March 2019-March 2020 {c |}{res}     10,917       32.02       32.02
{txt}March 2020-March 2021 {c |}{res}     10,897       31.96       63.98
{txt}March 2021-March 2022 {c |}{res}     10,830       31.76       95.74
{txt}                    . {c |}{res}      1,452        4.26      100.00
{txt}{hline 22}{c +}{hline 35}
                Total {c |}{res}     34,096      100.00
{txt}
{com}. bys eia_diagnosis: tab diagnosis_year, missing

{txt}{hline}
-> eia_diagnosis = RA

    Year of diagnosis {c |}      Freq.     Percent        Cum.
{hline 22}{c +}{hline 35}
March 2019-March 2020 {c |}{res}      3,628       32.06       32.06
{txt}March 2020-March 2021 {c |}{res}      3,536       31.25       63.31
{txt}March 2021-March 2022 {c |}{res}      3,667       32.41       95.72
{txt}                    . {c |}{res}        484        4.28      100.00
{txt}{hline 22}{c +}{hline 35}
                Total {c |}{res}     11,315      100.00

{txt}{hline}
-> eia_diagnosis = PsA

    Year of diagnosis {c |}      Freq.     Percent        Cum.
{hline 22}{c +}{hline 35}
March 2019-March 2020 {c |}{res}      3,612       32.00       32.00
{txt}March 2020-March 2021 {c |}{res}      3,582       31.73       63.73
{txt}March 2021-March 2022 {c |}{res}      3,580       31.72       95.45
{txt}                    . {c |}{res}        514        4.55      100.00
{txt}{hline 22}{c +}{hline 35}
                Total {c |}{res}     11,288      100.00

{txt}{hline}
-> eia_diagnosis = AxSpA

    Year of diagnosis {c |}      Freq.     Percent        Cum.
{hline 22}{c +}{hline 35}
March 2019-March 2020 {c |}{res}      3,677       31.99       31.99
{txt}March 2020-March 2021 {c |}{res}      3,779       32.88       64.87
{txt}March 2021-March 2022 {c |}{res}      3,583       31.18       96.05
{txt}                    . {c |}{res}        454        3.95      100.00
{txt}{hline 22}{c +}{hline 35}
                Total {c |}{res}     11,493      100.00

{txt}
{com}. 
. **Proportion of patients with at least 6 or 12 months of GP follow-up after EIA code
. tab has_6m_follow_up

{txt}has_6m_foll {c |}
      ow_up {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      1,731        5.08        5.08
{txt}          1 {c |}{res}     32,365       94.92      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     34,096      100.00
{txt}
{com}. tab has_12m_follow_up

{txt}has_12m_fol {c |}
     low_up {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      3,405        9.99        9.99
{txt}          1 {c |}{res}     30,691       90.01      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     34,096      100.00
{txt}
{com}. tab mo_year_diagn has_6m_follow_up

{txt}mo_year_di {c |}   has_6m_follow_up
       agn {c |}         0          1 {c |}     Total
{hline 11}{c +}{hline 22}{c +}{hline 10}
    2019m3 {c |}{res}        42        837 {txt}{c |}{res}       879 
{txt}    2019m4 {c |}{res}        42        884 {txt}{c |}{res}       926 
{txt}    2019m5 {c |}{res}        42        889 {txt}{c |}{res}       931 
{txt}    2019m6 {c |}{res}        51        862 {txt}{c |}{res}       913 
{txt}    2019m7 {c |}{res}        59        877 {txt}{c |}{res}       936 
{txt}    2019m8 {c |}{res}        43        867 {txt}{c |}{res}       910 
{txt}    2019m9 {c |}{res}        42        854 {txt}{c |}{res}       896 
{txt}   2019m10 {c |}{res}        49        897 {txt}{c |}{res}       946 
{txt}   2019m11 {c |}{res}        40        814 {txt}{c |}{res}       854 
{txt}   2019m12 {c |}{res}        56        890 {txt}{c |}{res}       946 
{txt}    2020m1 {c |}{res}        45        894 {txt}{c |}{res}       939 
{txt}    2020m2 {c |}{res}        47        794 {txt}{c |}{res}       841 
{txt}    2020m3 {c |}{res}        49        888 {txt}{c |}{res}       937 
{txt}    2020m4 {c |}{res}        43        910 {txt}{c |}{res}       953 
{txt}    2020m5 {c |}{res}        42        915 {txt}{c |}{res}       957 
{txt}    2020m6 {c |}{res}        39        890 {txt}{c |}{res}       929 
{txt}    2020m7 {c |}{res}        41        913 {txt}{c |}{res}       954 
{txt}    2020m8 {c |}{res}        43        842 {txt}{c |}{res}       885 
{txt}    2020m9 {c |}{res}        44        808 {txt}{c |}{res}       852 
{txt}   2020m10 {c |}{res}        39        855 {txt}{c |}{res}       894 
{txt}   2020m11 {c |}{res}        50        788 {txt}{c |}{res}       838 
{txt}   2020m12 {c |}{res}        49        841 {txt}{c |}{res}       890 
{txt}    2021m1 {c |}{res}        44        930 {txt}{c |}{res}       974 
{txt}    2021m2 {c |}{res}        33        801 {txt}{c |}{res}       834 
{txt}    2021m3 {c |}{res}        43        882 {txt}{c |}{res}       925 
{txt}    2021m4 {c |}{res}        56        857 {txt}{c |}{res}       913 
{txt}    2021m5 {c |}{res}        48        871 {txt}{c |}{res}       919 
{txt}    2021m6 {c |}{res}        51        850 {txt}{c |}{res}       901 
{txt}    2021m7 {c |}{res}        50        862 {txt}{c |}{res}       912 
{txt}    2021m8 {c |}{res}        45        856 {txt}{c |}{res}       901 
{txt}    2021m9 {c |}{res}        38        841 {txt}{c |}{res}       879 
{txt}   2021m10 {c |}{res}        49        897 {txt}{c |}{res}       946 
{txt}   2021m11 {c |}{res}        47        857 {txt}{c |}{res}       904 
{txt}   2021m12 {c |}{res}        60        872 {txt}{c |}{res}       932 
{txt}    2022m1 {c |}{res}        46        847 {txt}{c |}{res}       893 
{txt}    2022m2 {c |}{res}        43        762 {txt}{c |}{res}       805 
{txt}    2022m3 {c |}{res}        54        853 {txt}{c |}{res}       907 
{txt}    2022m4 {c |}{res}        27        518 {txt}{c |}{res}       545 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
     Total {c |}{res}     1,731     32,365 {txt}{c |}{res}    34,096 
{txt}
{com}. tab mo_year_diagn has_12m_follow_up

{txt}mo_year_di {c |}   has_12m_follow_up
       agn {c |}         0          1 {c |}     Total
{hline 11}{c +}{hline 22}{c +}{hline 10}
    2019m3 {c |}{res}        81        798 {txt}{c |}{res}       879 
{txt}    2019m4 {c |}{res}        86        840 {txt}{c |}{res}       926 
{txt}    2019m5 {c |}{res}        99        832 {txt}{c |}{res}       931 
{txt}    2019m6 {c |}{res}        98        815 {txt}{c |}{res}       913 
{txt}    2019m7 {c |}{res}       103        833 {txt}{c |}{res}       936 
{txt}    2019m8 {c |}{res}        83        827 {txt}{c |}{res}       910 
{txt}    2019m9 {c |}{res}        79        817 {txt}{c |}{res}       896 
{txt}   2019m10 {c |}{res}        94        852 {txt}{c |}{res}       946 
{txt}   2019m11 {c |}{res}        95        759 {txt}{c |}{res}       854 
{txt}   2019m12 {c |}{res}       100        846 {txt}{c |}{res}       946 
{txt}    2020m1 {c |}{res}        79        860 {txt}{c |}{res}       939 
{txt}    2020m2 {c |}{res}        86        755 {txt}{c |}{res}       841 
{txt}    2020m3 {c |}{res}        98        839 {txt}{c |}{res}       937 
{txt}    2020m4 {c |}{res}        89        864 {txt}{c |}{res}       953 
{txt}    2020m5 {c |}{res}        89        868 {txt}{c |}{res}       957 
{txt}    2020m6 {c |}{res}       118        811 {txt}{c |}{res}       929 
{txt}    2020m7 {c |}{res}        83        871 {txt}{c |}{res}       954 
{txt}    2020m8 {c |}{res}        94        791 {txt}{c |}{res}       885 
{txt}    2020m9 {c |}{res}       103        749 {txt}{c |}{res}       852 
{txt}   2020m10 {c |}{res}        95        799 {txt}{c |}{res}       894 
{txt}   2020m11 {c |}{res}        67        771 {txt}{c |}{res}       838 
{txt}   2020m12 {c |}{res}        89        801 {txt}{c |}{res}       890 
{txt}    2021m1 {c |}{res}        87        887 {txt}{c |}{res}       974 
{txt}    2021m2 {c |}{res}        85        749 {txt}{c |}{res}       834 
{txt}    2021m3 {c |}{res}        93        832 {txt}{c |}{res}       925 
{txt}    2021m4 {c |}{res}        93        820 {txt}{c |}{res}       913 
{txt}    2021m5 {c |}{res}       111        808 {txt}{c |}{res}       919 
{txt}    2021m6 {c |}{res}        85        816 {txt}{c |}{res}       901 
{txt}    2021m7 {c |}{res}        84        828 {txt}{c |}{res}       912 
{txt}    2021m8 {c |}{res}        91        810 {txt}{c |}{res}       901 
{txt}    2021m9 {c |}{res}        93        786 {txt}{c |}{res}       879 
{txt}   2021m10 {c |}{res}        84        862 {txt}{c |}{res}       946 
{txt}   2021m11 {c |}{res}        73        831 {txt}{c |}{res}       904 
{txt}   2021m12 {c |}{res}        94        838 {txt}{c |}{res}       932 
{txt}    2022m1 {c |}{res}       110        783 {txt}{c |}{res}       893 
{txt}    2022m2 {c |}{res}        82        723 {txt}{c |}{res}       805 
{txt}    2022m3 {c |}{res}        81        826 {txt}{c |}{res}       907 
{txt}    2022m4 {c |}{res}        51        494 {txt}{c |}{res}       545 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
     Total {c |}{res}     3,405     30,691 {txt}{c |}{res}    34,096 
{txt}
{com}. tab diagnosis_year if has_6m_follow_up==1, missing

    {txt}Year of diagnosis {c |}      Freq.     Percent        Cum.
{hline 22}{c +}{hline 35}
March 2019-March 2020 {c |}{res}     10,359       32.01       32.01
{txt}March 2020-March 2021 {c |}{res}     10,381       32.07       64.08
{txt}March 2021-March 2022 {c |}{res}     10,254       31.68       95.76
{txt}                    . {c |}{res}      1,371        4.24      100.00
{txt}{hline 22}{c +}{hline 35}
                Total {c |}{res}     32,365      100.00
{txt}
{com}. bys eia_diagnosis: tab diagnosis_year if has_6m_follow_up==1, missing

{txt}{hline}
-> eia_diagnosis = RA

    Year of diagnosis {c |}      Freq.     Percent        Cum.
{hline 22}{c +}{hline 35}
March 2019-March 2020 {c |}{res}      3,415       31.90       31.90
{txt}March 2020-March 2021 {c |}{res}      3,356       31.35       63.26
{txt}March 2021-March 2022 {c |}{res}      3,468       32.40       95.66
{txt}                    . {c |}{res}        465        4.34      100.00
{txt}{hline 22}{c +}{hline 35}
                Total {c |}{res}     10,704      100.00

{txt}{hline}
-> eia_diagnosis = PsA

    Year of diagnosis {c |}      Freq.     Percent        Cum.
{hline 22}{c +}{hline 35}
March 2019-March 2020 {c |}{res}      3,442       32.04       32.04
{txt}March 2020-March 2021 {c |}{res}      3,414       31.78       63.82
{txt}March 2021-March 2022 {c |}{res}      3,403       31.68       95.50
{txt}                    . {c |}{res}        483        4.50      100.00
{txt}{hline 22}{c +}{hline 35}
                Total {c |}{res}     10,742      100.00

{txt}{hline}
-> eia_diagnosis = AxSpA

    Year of diagnosis {c |}      Freq.     Percent        Cum.
{hline 22}{c +}{hline 35}
March 2019-March 2020 {c |}{res}      3,502       32.07       32.07
{txt}March 2020-March 2021 {c |}{res}      3,611       33.07       65.14
{txt}March 2021-March 2022 {c |}{res}      3,383       30.98       96.13
{txt}                    . {c |}{res}        423        3.87      100.00
{txt}{hline 22}{c +}{hline 35}
                Total {c |}{res}     10,919      100.00

{txt}
{com}. tab diagnosis_year if has_12m_follow_up==1, missing

    {txt}Year of diagnosis {c |}      Freq.     Percent        Cum.
{hline 22}{c +}{hline 35}
March 2019-March 2020 {c |}{res}      9,834       32.04       32.04
{txt}March 2020-March 2021 {c |}{res}      9,800       31.93       63.97
{txt}March 2021-March 2022 {c |}{res}      9,737       31.73       95.70
{txt}                    . {c |}{res}      1,320        4.30      100.00
{txt}{hline 22}{c +}{hline 35}
                Total {c |}{res}     30,691      100.00
{txt}
{com}. bys eia_diagnosis: tab diagnosis_year if has_12m_follow_up==1, missing

{txt}{hline}
-> eia_diagnosis = RA

    Year of diagnosis {c |}      Freq.     Percent        Cum.
{hline 22}{c +}{hline 35}
March 2019-March 2020 {c |}{res}      3,310       32.31       32.31
{txt}March 2020-March 2021 {c |}{res}      3,168       30.92       63.23
{txt}March 2021-March 2022 {c |}{res}      3,324       32.45       95.68
{txt}                    . {c |}{res}        443        4.32      100.00
{txt}{hline 22}{c +}{hline 35}
                Total {c |}{res}     10,245      100.00

{txt}{hline}
-> eia_diagnosis = PsA

    Year of diagnosis {c |}      Freq.     Percent        Cum.
{hline 22}{c +}{hline 35}
March 2019-March 2020 {c |}{res}      3,237       31.92       31.92
{txt}March 2020-March 2021 {c |}{res}      3,227       31.82       63.75
{txt}March 2021-March 2022 {c |}{res}      3,214       31.70       95.44
{txt}                    . {c |}{res}        462        4.56      100.00
{txt}{hline 22}{c +}{hline 35}
                Total {c |}{res}     10,140      100.00

{txt}{hline}
-> eia_diagnosis = AxSpA

    Year of diagnosis {c |}      Freq.     Percent        Cum.
{hline 22}{c +}{hline 35}
March 2019-March 2020 {c |}{res}      3,287       31.89       31.89
{txt}March 2020-March 2021 {c |}{res}      3,405       33.04       64.93
{txt}March 2021-March 2022 {c |}{res}      3,199       31.04       95.97
{txt}                    . {c |}{res}        415        4.03      100.00
{txt}{hline 22}{c +}{hline 35}
                Total {c |}{res}     10,306      100.00

{txt}
{com}. 
. *Define appointments and referrals======================================*/
. **Nb. not excluding those without 6m+ follow-up
. 
. **Rheumatology appt 
. tab rheum_appt  //proportion with first rheum outpatient date in the year before EIA code appears in GP record (could change to two years)

 {txt}rheum_appt {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      5,806       17.03       17.03
{txt}          1 {c |}{res}     28,290       82.97      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     34,096      100.00
{txt}
{com}. tab rheum_appt if rheum_appt_date<eia_code_date & rheum_appt_date!=. //confirm proportion who had rheum appt (i.e. not missing) and appt before EIA code (should be accounted for by Python code)

 {txt}rheum_appt {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}     22,953      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     22,953      100.00
{txt}
{com}. 
. **Rheumatology referrals
. tab referral_rheum_prerheum //last rheum referral in the year before rheumatology outpatient (requires rheum appt to have been present, and rheum appt to be before EIA code)

{txt}referral_rh {c |}
eum_prerheu {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      3,397        9.96        9.96
{txt}          1 {c |}{res}     30,699       90.04      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     34,096      100.00
{txt}
{com}. tab referral_rheum_prerheum if rheum_appt!=0  //last rheum referral in the year before rheumatology outpatient if rheum appt date present

{txt}referral_rh {c |}
eum_prerheu {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      2,833       10.01       10.01
{txt}          1 {c |}{res}     25,457       89.99      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     28,290      100.00
{txt}
{com}. tab referral_rheum_prerheum if rheum_appt!=0 & referral_rheum_prerheum_date<rheum_appt_date  //last rheum referral in the year before rheumatology outpatient, assuming ref date before rheum appt date (should be accounted for by Python code)

{txt}referral_rh {c |}
eum_prerheu {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}      8,247      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      8,247      100.00
{txt}
{com}. tab referral_rheum_precode //last rheum referral in the year before EIA code (could use if rheum appt missing)

{txt}referral_rh {c |}
eum_precode {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      3,435       10.07       10.07
{txt}          1 {c |}{res}     30,661       89.93      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     34,096      100.00
{txt}
{com}. gen referral_rheum_comb_date = referral_rheum_prerheum_date if referral_rheum_prerheum_date!=.
{txt}(3,397 missing values generated)

{com}. replace referral_rheum_comb_date = referral_rheum_precode_date if referral_rheum_prerheum_date==. & referral_rheum_precode_date!=.
{txt}(3,055 real changes made)

{com}. format %td referral_rheum_comb_date
{txt}
{com}. codebook referral_rheum_comb_date

{txt}{hline}
{res}referral_rheum_comb_date{right:(unlabeled)}
{txt}{hline}

{col 19}Type: Numeric daily date ({res}float{txt})

{col 18}Range: [{res}21260{txt},{res}22754{txt}]{col 55}Units: {res}1
{col 8}{txt}Or equivalently: [{res}17mar2018{txt},{res}19apr2022{txt}]{col 55}Units: {res}days
{col 10}{txt}Unique values: {res}1,495{col 51}{txt}Missing .: {res}342{txt}/{res}34,096

{txt}{col 19}Mean: {res}{ralign 7:22010}{txt} = {res}05apr2020{txt}(+ 1 hour)
{col 14}Std. dev.: {res}{ralign 7:430.516}
{txt}{col 12}Percentiles: {col 25}{ralign 9:10%}{ralign 11:25%}{ralign 11:50%}{ralign 11:75%}{ralign 11:90%}
{res}{col 25}{ralign 9:21412}{ralign 11:   21640}{ralign 11: 22008.5}{ralign 11:   22383}{ralign 11:   22605}
{col 25}{ralign 9:16aug2018}{ralign 11:01apr2019}{ralign 11:03apr2020}{ralign 11:13apr2021}{ralign 11:21nov2021}
{txt}
{com}. 
. **GP appointments
. tab last_gp_refrheum //proportion with last GP appointment in year before rheum referral (pre-rheum appt); requires there to have been a rheum referral, before a rheum appt, before an EIA code

{txt}last_gp_ref {c |}
      rheum {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      3,365        9.87        9.87
{txt}          1 {c |}{res}     30,731       90.13      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     34,096      100.00
{txt}
{com}. gen all_appts=1 if last_gp_refrheum==1 & referral_rheum_prerheum==1 & rheum_appt==1 & eia_code==1 & last_gp_refrheum_date<referral_rheum_prerheum_date & referral_rheum_prerheum_date<rheum_appt_date & rheum_appt_date<eia_code_date 
{txt}(33,182 missing values generated)

{com}. recode all_appts .=0
{txt}(33182 changes made to {bf:all_appts})

{com}. tab all_appts, missing //KEY - proportion who had a last gp appt, then rheum ref, then rheum appt, then EIA code 

  {txt}all_appts {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     33,182       97.32       97.32
{txt}          1 {c |}{res}        914        2.68      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     34,096      100.00
{txt}
{com}. tab last_gp_refcode //last GP appointment before rheum ref (i.e. pre-eia code ref); requires there to have been a rheum referral before an EIA code (i.e. rheum appt could have been missing)

{txt}last_gp_ref {c |}
       code {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      3,362        9.86        9.86
{txt}          1 {c |}{res}     30,734       90.14      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     34,096      100.00
{txt}
{com}. tab last_gp_prerheum //last GP appointment before rheum appt; requires there to have been a rheum appt before and EIA code

{txt}last_gp_pre {c |}
      rheum {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      3,300        9.68        9.68
{txt}          1 {c |}{res}     30,796       90.32      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     34,096      100.00
{txt}
{com}. tab last_gp_precode //last GP appointment before EIA code

{txt}last_gp_pre {c |}
       code {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      3,441       10.09       10.09
{txt}          1 {c |}{res}     30,655       89.91      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     34,096      100.00
{txt}
{com}. 
. **For sensitivity analyses for those without rheum_appt, replace diagnosis date as EIA code date if rheum appt pre-code is missing or after
. gen eia_diagnosis_date_nomiss=rheum_appt_date if rheum_appt_date!=.
{txt}(5,806 missing values generated)

{com}. format %td eia_diagnosis_date_nomiss
{txt}
{com}. replace eia_diagnosis_date_nomiss=eia_code_date if (rheum_appt_date==. | rheum_appt_date>eia_code_date) & eia_code_date!=.
{txt}(11,126 real changes made)

{com}. gen eia_diagnosis_nomiss=1 if eia_diagnosis_date_nomiss!=.
{txt}
{com}. recode eia_diagnosis_nomiss .=0
{txt}(0 changes made to {bf:eia_diagnosis_nomiss})

{com}. tab eia_diagnosis_nomiss

{txt}eia_diagnos {c |}
  is_nomiss {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}     34,096      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     34,096      100.00
{txt}
{com}. 
. *Time to referral, appointment and EIA code=============================================*/
. 
. **Time from last GP to rheum ref before rheum appt (i.e. if appts are present and in correct time order) //Note - referral could (in theory) be coded just before GP appt
. gen time_gp_rheum_ref_appt = (referral_rheum_prerheum_date - last_gp_refrheum_date) if referral_rheum_prerheum_date!=. & last_gp_refrheum_date!=. & rheum_appt_date!=. & referral_rheum_prerheum_date>last_gp_refrheum_date & referral_rheum_prerheum_date<rheum_appt_date & rheum_appt_date<eia_code_date
{txt}(33,182 missing values generated)

{com}. tabstat time_gp_rheum_ref_appt, stats (n mean p50 p25 p75) //all patients (should be same number as all_appts)

{txt}{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_rh~t} {...}
{c |}{...}
 {res}      914   238.733       179        73       330
{txt}{hline 13}{c BT}{hline 50}

{com}. bys eia_diagnosis: tabstat time_gp_rheum_ref_appt, stats (n mean p50 p25 p75) //by eia diagnosis

{txt}{hline}
-> eia_diagnosis = RA

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_rh~t} {...}
{c |}{...}
 {res}      326  233.7025       180        76       323
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = PsA

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_rh~t} {...}
{c |}{...}
 {res}      303  249.3003       194        83       348
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = AxSpA

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_rh~t} {...}
{c |}{...}
 {res}      285  233.2526       165        61       330
{txt}{hline 13}{c BT}{hline 50}

{com}. bys diagnosis_year: tabstat time_gp_rheum_ref_appt, stats (n mean p50 p25 p75) //by diagnosis year

{txt}{hline}
-> diagnosis_year = March 2019-March 2020

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_rh~t} {...}
{c |}{...}
 {res}       92  130.5652       101        40     200.5
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> diagnosis_year = March 2020-March 2021

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_rh~t} {...}
{c |}{...}
 {res}      252  201.1627       157      69.5     289.5
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> diagnosis_year = March 2021-March 2022

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_rh~t} {...}
{c |}{...}
 {res}      482   272.639       207        92       404
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> diagnosis_year = .

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_rh~t} {...}
{c |}{...}
 {res}       88  273.6932       157      50.5       395
{txt}{hline 13}{c BT}{hline 50}

{com}. bys nuts_region: tabstat time_gp_rheum_ref_appt, stats (n mean p50 p25 p75) //by region

{txt}{hline}
-> nuts_region = East Midlands

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_rh~t} {...}
{c |}{...}
 {res}       86  207.4186     161.5        69       298
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = East of England

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_rh~t} {...}
{c |}{...}
 {res}       90  218.5778       147        77       345
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = London

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_rh~t} {...}
{c |}{...}
 {res}      190  239.9684       189        92       324
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = North East

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_rh~t} {...}
{c |}{...}
 {res}       88       249       178        52     400.5
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = North West

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_rh~t} {...}
{c |}{...}
 {res}       91  250.0769       220        59       389
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = South East

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_rh~t} {...}
{c |}{...}
 {res}      179  245.6313       194        76       358
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = West Midlands

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_rh~t} {...}
{c |}{...}
 {res}       87   235.977       169        91       307
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = Yorkshire and the Humber

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_rh~t} {...}
{c |}{...}
 {res}      103  251.7573       161        63       322
{txt}{hline 13}{c BT}{hline 50}

{com}. 
. gen gp_ref_cat=1 if time_gp_rheum_ref_appt<=3 & time_gp_rheum_ref_appt!=. 
{txt}(34,085 missing values generated)

{com}. replace gp_ref_cat=2 if time_gp_rheum_ref_appt<=7 & time_gp_rheum_ref_appt!=. & gp_ref_cat==.
{txt}(12 real changes made)

{com}. replace gp_ref_cat=3 if time_gp_rheum_ref_appt>7 & time_gp_rheum_ref_appt!=. & gp_ref_cat==.
{txt}(891 real changes made)

{com}. lab define gp_ref_cat 1 "Referred within 3 days" 2 "Referred within 7 days" 3 "Referral delay >7 days", modify
{txt}
{com}. lab val gp_ref_cat gp_ref_cat
{txt}
{com}. lab var gp_ref_cat "Time to GP referral"
{txt}
{com}. tab gp_ref_cat, missing

   {txt}Time to GP referral {c |}      Freq.     Percent        Cum.
{hline 23}{c +}{hline 35}
Referred within 3 days {c |}{res}         11        0.03        0.03
{txt}Referred within 7 days {c |}{res}         12        0.04        0.07
{txt}Referral delay >7 days {c |}{res}        891        2.61        2.68
{txt}                     . {c |}{res}     33,182       97.32      100.00
{txt}{hline 23}{c +}{hline 35}
                 Total {c |}{res}     34,096      100.00
{txt}
{com}. tab gp_ref_cat

   {txt}Time to GP referral {c |}      Freq.     Percent        Cum.
{hline 23}{c +}{hline 35}
Referred within 3 days {c |}{res}         11        1.20        1.20
{txt}Referred within 7 days {c |}{res}         12        1.31        2.52
{txt}Referral delay >7 days {c |}{res}        891       97.48      100.00
{txt}{hline 23}{c +}{hline 35}
                 Total {c |}{res}        914      100.00
{txt}
{com}. bys eia_diagnosis: tab gp_ref_cat, missing

{txt}{hline}
-> eia_diagnosis = RA

   Time to GP referral {c |}      Freq.     Percent        Cum.
{hline 23}{c +}{hline 35}
Referred within 3 days {c |}{res}          3        0.03        0.03
{txt}Referred within 7 days {c |}{res}          5        0.04        0.07
{txt}Referral delay >7 days {c |}{res}        318        2.81        2.88
{txt}                     . {c |}{res}     10,989       97.12      100.00
{txt}{hline 23}{c +}{hline 35}
                 Total {c |}{res}     11,315      100.00

{txt}{hline}
-> eia_diagnosis = PsA

   Time to GP referral {c |}      Freq.     Percent        Cum.
{hline 23}{c +}{hline 35}
Referred within 3 days {c |}{res}          3        0.03        0.03
{txt}Referred within 7 days {c |}{res}          3        0.03        0.05
{txt}Referral delay >7 days {c |}{res}        297        2.63        2.68
{txt}                     . {c |}{res}     10,985       97.32      100.00
{txt}{hline 23}{c +}{hline 35}
                 Total {c |}{res}     11,288      100.00

{txt}{hline}
-> eia_diagnosis = AxSpA

   Time to GP referral {c |}      Freq.     Percent        Cum.
{hline 23}{c +}{hline 35}
Referred within 3 days {c |}{res}          5        0.04        0.04
{txt}Referred within 7 days {c |}{res}          4        0.03        0.08
{txt}Referral delay >7 days {c |}{res}        276        2.40        2.48
{txt}                     . {c |}{res}     11,208       97.52      100.00
{txt}{hline 23}{c +}{hline 35}
                 Total {c |}{res}     11,493      100.00

{txt}
{com}. bys eia_diagnosis: tab gp_ref_cat

{txt}{hline}
-> eia_diagnosis = RA

   Time to GP referral {c |}      Freq.     Percent        Cum.
{hline 23}{c +}{hline 35}
Referred within 3 days {c |}{res}          3        0.92        0.92
{txt}Referred within 7 days {c |}{res}          5        1.53        2.45
{txt}Referral delay >7 days {c |}{res}        318       97.55      100.00
{txt}{hline 23}{c +}{hline 35}
                 Total {c |}{res}        326      100.00

{txt}{hline}
-> eia_diagnosis = PsA

   Time to GP referral {c |}      Freq.     Percent        Cum.
{hline 23}{c +}{hline 35}
Referred within 3 days {c |}{res}          3        0.99        0.99
{txt}Referred within 7 days {c |}{res}          3        0.99        1.98
{txt}Referral delay >7 days {c |}{res}        297       98.02      100.00
{txt}{hline 23}{c +}{hline 35}
                 Total {c |}{res}        303      100.00

{txt}{hline}
-> eia_diagnosis = AxSpA

   Time to GP referral {c |}      Freq.     Percent        Cum.
{hline 23}{c +}{hline 35}
Referred within 3 days {c |}{res}          5        1.75        1.75
{txt}Referred within 7 days {c |}{res}          4        1.40        3.16
{txt}Referral delay >7 days {c |}{res}        276       96.84      100.00
{txt}{hline 23}{c +}{hline 35}
                 Total {c |}{res}        285      100.00

{txt}
{com}. bys diagnosis_year: tab gp_ref_cat, missing

{txt}{hline}
-> diagnosis_year = March 2019-March 2020

   Time to GP referral {c |}      Freq.     Percent        Cum.
{hline 23}{c +}{hline 35}
Referred within 3 days {c |}{res}          3        0.03        0.03
{txt}Referred within 7 days {c |}{res}          2        0.02        0.05
{txt}Referral delay >7 days {c |}{res}         87        0.80        0.84
{txt}                     . {c |}{res}     10,825       99.16      100.00
{txt}{hline 23}{c +}{hline 35}
                 Total {c |}{res}     10,917      100.00

{txt}{hline}
-> diagnosis_year = March 2020-March 2021

   Time to GP referral {c |}      Freq.     Percent        Cum.
{hline 23}{c +}{hline 35}
Referred within 3 days {c |}{res}          4        0.04        0.04
{txt}Referred within 7 days {c |}{res}          2        0.02        0.06
{txt}Referral delay >7 days {c |}{res}        246        2.26        2.31
{txt}                     . {c |}{res}     10,645       97.69      100.00
{txt}{hline 23}{c +}{hline 35}
                 Total {c |}{res}     10,897      100.00

{txt}{hline}
-> diagnosis_year = March 2021-March 2022

   Time to GP referral {c |}      Freq.     Percent        Cum.
{hline 23}{c +}{hline 35}
Referred within 3 days {c |}{res}          4        0.04        0.04
{txt}Referred within 7 days {c |}{res}          7        0.06        0.10
{txt}Referral delay >7 days {c |}{res}        471        4.35        4.45
{txt}                     . {c |}{res}     10,348       95.55      100.00
{txt}{hline 23}{c +}{hline 35}
                 Total {c |}{res}     10,830      100.00

{txt}{hline}
-> diagnosis_year = .

   Time to GP referral {c |}      Freq.     Percent        Cum.
{hline 23}{c +}{hline 35}
Referred within 7 days {c |}{res}          1        0.07        0.07
{txt}Referral delay >7 days {c |}{res}         87        5.99        6.06
{txt}                     . {c |}{res}      1,364       93.94      100.00
{txt}{hline 23}{c +}{hline 35}
                 Total {c |}{res}      1,452      100.00

{txt}
{com}. bys diagnosis_year: tab gp_ref_cat

{txt}{hline}
-> diagnosis_year = March 2019-March 2020

   Time to GP referral {c |}      Freq.     Percent        Cum.
{hline 23}{c +}{hline 35}
Referred within 3 days {c |}{res}          3        3.26        3.26
{txt}Referred within 7 days {c |}{res}          2        2.17        5.43
{txt}Referral delay >7 days {c |}{res}         87       94.57      100.00
{txt}{hline 23}{c +}{hline 35}
                 Total {c |}{res}         92      100.00

{txt}{hline}
-> diagnosis_year = March 2020-March 2021

   Time to GP referral {c |}      Freq.     Percent        Cum.
{hline 23}{c +}{hline 35}
Referred within 3 days {c |}{res}          4        1.59        1.59
{txt}Referred within 7 days {c |}{res}          2        0.79        2.38
{txt}Referral delay >7 days {c |}{res}        246       97.62      100.00
{txt}{hline 23}{c +}{hline 35}
                 Total {c |}{res}        252      100.00

{txt}{hline}
-> diagnosis_year = March 2021-March 2022

   Time to GP referral {c |}      Freq.     Percent        Cum.
{hline 23}{c +}{hline 35}
Referred within 3 days {c |}{res}          4        0.83        0.83
{txt}Referred within 7 days {c |}{res}          7        1.45        2.28
{txt}Referral delay >7 days {c |}{res}        471       97.72      100.00
{txt}{hline 23}{c +}{hline 35}
                 Total {c |}{res}        482      100.00

{txt}{hline}
-> diagnosis_year = .

   Time to GP referral {c |}      Freq.     Percent        Cum.
{hline 23}{c +}{hline 35}
Referred within 7 days {c |}{res}          1        1.14        1.14
{txt}Referral delay >7 days {c |}{res}         87       98.86      100.00
{txt}{hline 23}{c +}{hline 35}
                 Total {c |}{res}         88      100.00

{txt}
{com}. bys nuts_region: tab gp_ref_cat, missing

{txt}{hline}
-> nuts_region = East Midlands

   Time to GP referral {c |}      Freq.     Percent        Cum.
{hline 23}{c +}{hline 35}
Referred within 3 days {c |}{res}          1        0.03        0.03
{txt}Referred within 7 days {c |}{res}          2        0.06        0.09
{txt}Referral delay >7 days {c |}{res}         83        2.51        2.60
{txt}                     . {c |}{res}      3,218       97.40      100.00
{txt}{hline 23}{c +}{hline 35}
                 Total {c |}{res}      3,304      100.00

{txt}{hline}
-> nuts_region = East of England

   Time to GP referral {c |}      Freq.     Percent        Cum.
{hline 23}{c +}{hline 35}
Referred within 3 days {c |}{res}          1        0.03        0.03
{txt}Referred within 7 days {c |}{res}          2        0.06        0.09
{txt}Referral delay >7 days {c |}{res}         87        2.57        2.66
{txt}                     . {c |}{res}      3,298       97.34      100.00
{txt}{hline 23}{c +}{hline 35}
                 Total {c |}{res}      3,388      100.00

{txt}{hline}
-> nuts_region = London

   Time to GP referral {c |}      Freq.     Percent        Cum.
{hline 23}{c +}{hline 35}
Referred within 3 days {c |}{res}          2        0.03        0.03
{txt}Referred within 7 days {c |}{res}          3        0.04        0.07
{txt}Referral delay >7 days {c |}{res}        185        2.68        2.76
{txt}                     . {c |}{res}      6,706       97.24      100.00
{txt}{hline 23}{c +}{hline 35}
                 Total {c |}{res}      6,896      100.00

{txt}{hline}
-> nuts_region = North East

   Time to GP referral {c |}      Freq.     Percent        Cum.
{hline 23}{c +}{hline 35}
Referred within 3 days {c |}{res}          4        0.11        0.11
{txt}Referred within 7 days {c |}{res}          1        0.03        0.14
{txt}Referral delay >7 days {c |}{res}         83        2.37        2.52
{txt}                     . {c |}{res}      3,408       97.48      100.00
{txt}{hline 23}{c +}{hline 35}
                 Total {c |}{res}      3,496      100.00

{txt}{hline}
-> nuts_region = North West

   Time to GP referral {c |}      Freq.     Percent        Cum.
{hline 23}{c +}{hline 35}
Referred within 3 days {c |}{res}          1        0.03        0.03
{txt}Referred within 7 days {c |}{res}          2        0.06        0.09
{txt}Referral delay >7 days {c |}{res}         88        2.59        2.68
{txt}                     . {c |}{res}      3,310       97.32      100.00
{txt}{hline 23}{c +}{hline 35}
                 Total {c |}{res}      3,401      100.00

{txt}{hline}
-> nuts_region = South East

   Time to GP referral {c |}      Freq.     Percent        Cum.
{hline 23}{c +}{hline 35}
Referred within 3 days {c |}{res}          1        0.01        0.01
{txt}Referred within 7 days {c |}{res}          1        0.01        0.03
{txt}Referral delay >7 days {c |}{res}        177        2.59        2.62
{txt}                     . {c |}{res}      6,644       97.38      100.00
{txt}{hline 23}{c +}{hline 35}
                 Total {c |}{res}      6,823      100.00

{txt}{hline}
-> nuts_region = West Midlands

   Time to GP referral {c |}      Freq.     Percent        Cum.
{hline 23}{c +}{hline 35}
Referred within 7 days {c |}{res}          1        0.03        0.03
{txt}Referral delay >7 days {c |}{res}         86        2.54        2.57
{txt}                     . {c |}{res}      3,303       97.43      100.00
{txt}{hline 23}{c +}{hline 35}
                 Total {c |}{res}      3,390      100.00

{txt}{hline}
-> nuts_region = Yorkshire and the Humber

   Time to GP referral {c |}      Freq.     Percent        Cum.
{hline 23}{c +}{hline 35}
Referred within 3 days {c |}{res}          1        0.03        0.03
{txt}Referral delay >7 days {c |}{res}        102        3.00        3.03
{txt}                     . {c |}{res}      3,295       96.97      100.00
{txt}{hline 23}{c +}{hline 35}
                 Total {c |}{res}      3,398      100.00

{txt}
{com}. bys nuts_region: tab gp_ref_cat

{txt}{hline}
-> nuts_region = East Midlands

   Time to GP referral {c |}      Freq.     Percent        Cum.
{hline 23}{c +}{hline 35}
Referred within 3 days {c |}{res}          1        1.16        1.16
{txt}Referred within 7 days {c |}{res}          2        2.33        3.49
{txt}Referral delay >7 days {c |}{res}         83       96.51      100.00
{txt}{hline 23}{c +}{hline 35}
                 Total {c |}{res}         86      100.00

{txt}{hline}
-> nuts_region = East of England

   Time to GP referral {c |}      Freq.     Percent        Cum.
{hline 23}{c +}{hline 35}
Referred within 3 days {c |}{res}          1        1.11        1.11
{txt}Referred within 7 days {c |}{res}          2        2.22        3.33
{txt}Referral delay >7 days {c |}{res}         87       96.67      100.00
{txt}{hline 23}{c +}{hline 35}
                 Total {c |}{res}         90      100.00

{txt}{hline}
-> nuts_region = London

   Time to GP referral {c |}      Freq.     Percent        Cum.
{hline 23}{c +}{hline 35}
Referred within 3 days {c |}{res}          2        1.05        1.05
{txt}Referred within 7 days {c |}{res}          3        1.58        2.63
{txt}Referral delay >7 days {c |}{res}        185       97.37      100.00
{txt}{hline 23}{c +}{hline 35}
                 Total {c |}{res}        190      100.00

{txt}{hline}
-> nuts_region = North East

   Time to GP referral {c |}      Freq.     Percent        Cum.
{hline 23}{c +}{hline 35}
Referred within 3 days {c |}{res}          4        4.55        4.55
{txt}Referred within 7 days {c |}{res}          1        1.14        5.68
{txt}Referral delay >7 days {c |}{res}         83       94.32      100.00
{txt}{hline 23}{c +}{hline 35}
                 Total {c |}{res}         88      100.00

{txt}{hline}
-> nuts_region = North West

   Time to GP referral {c |}      Freq.     Percent        Cum.
{hline 23}{c +}{hline 35}
Referred within 3 days {c |}{res}          1        1.10        1.10
{txt}Referred within 7 days {c |}{res}          2        2.20        3.30
{txt}Referral delay >7 days {c |}{res}         88       96.70      100.00
{txt}{hline 23}{c +}{hline 35}
                 Total {c |}{res}         91      100.00

{txt}{hline}
-> nuts_region = South East

   Time to GP referral {c |}      Freq.     Percent        Cum.
{hline 23}{c +}{hline 35}
Referred within 3 days {c |}{res}          1        0.56        0.56
{txt}Referred within 7 days {c |}{res}          1        0.56        1.12
{txt}Referral delay >7 days {c |}{res}        177       98.88      100.00
{txt}{hline 23}{c +}{hline 35}
                 Total {c |}{res}        179      100.00

{txt}{hline}
-> nuts_region = West Midlands

   Time to GP referral {c |}      Freq.     Percent        Cum.
{hline 23}{c +}{hline 35}
Referred within 7 days {c |}{res}          1        1.15        1.15
{txt}Referral delay >7 days {c |}{res}         86       98.85      100.00
{txt}{hline 23}{c +}{hline 35}
                 Total {c |}{res}         87      100.00

{txt}{hline}
-> nuts_region = Yorkshire and the Humber

   Time to GP referral {c |}      Freq.     Percent        Cum.
{hline 23}{c +}{hline 35}
Referred within 3 days {c |}{res}          1        0.97        0.97
{txt}Referral delay >7 days {c |}{res}        102       99.03      100.00
{txt}{hline 23}{c +}{hline 35}
                 Total {c |}{res}        103      100.00

{txt}
{com}. 
. gen gp_ref_3d=1 if time_gp_rheum_ref_appt<=3 & time_gp_rheum_ref_appt!=. 
{txt}(34,085 missing values generated)

{com}. replace gp_ref_3d=0 if time_gp_rheum_ref_appt>3 & time_gp_rheum_ref_appt!=.
{txt}(903 real changes made)

{com}. lab define gp_ref_3d 1 "Referred within 3 days" 0 "Referral delay >3 days", modify
{txt}
{com}. lab val gp_ref_3d gp_ref_3d
{txt}
{com}. lab var gp_ref_3d "Time to GP referral"
{txt}
{com}. tab gp_ref_3d, missing

   {txt}Time to GP referral {c |}      Freq.     Percent        Cum.
{hline 23}{c +}{hline 35}
Referral delay >3 days {c |}{res}        903        2.65        2.65
{txt}Referred within 3 days {c |}{res}         11        0.03        2.68
{txt}                     . {c |}{res}     33,182       97.32      100.00
{txt}{hline 23}{c +}{hline 35}
                 Total {c |}{res}     34,096      100.00
{txt}
{com}. tab gp_ref_3d

   {txt}Time to GP referral {c |}      Freq.     Percent        Cum.
{hline 23}{c +}{hline 35}
Referral delay >3 days {c |}{res}        903       98.80       98.80
{txt}Referred within 3 days {c |}{res}         11        1.20      100.00
{txt}{hline 23}{c +}{hline 35}
                 Total {c |}{res}        914      100.00
{txt}
{com}. bys eia_diagnosis: tab gp_ref_3d, missing

{txt}{hline}
-> eia_diagnosis = RA

   Time to GP referral {c |}      Freq.     Percent        Cum.
{hline 23}{c +}{hline 35}
Referral delay >3 days {c |}{res}        323        2.85        2.85
{txt}Referred within 3 days {c |}{res}          3        0.03        2.88
{txt}                     . {c |}{res}     10,989       97.12      100.00
{txt}{hline 23}{c +}{hline 35}
                 Total {c |}{res}     11,315      100.00

{txt}{hline}
-> eia_diagnosis = PsA

   Time to GP referral {c |}      Freq.     Percent        Cum.
{hline 23}{c +}{hline 35}
Referral delay >3 days {c |}{res}        300        2.66        2.66
{txt}Referred within 3 days {c |}{res}          3        0.03        2.68
{txt}                     . {c |}{res}     10,985       97.32      100.00
{txt}{hline 23}{c +}{hline 35}
                 Total {c |}{res}     11,288      100.00

{txt}{hline}
-> eia_diagnosis = AxSpA

   Time to GP referral {c |}      Freq.     Percent        Cum.
{hline 23}{c +}{hline 35}
Referral delay >3 days {c |}{res}        280        2.44        2.44
{txt}Referred within 3 days {c |}{res}          5        0.04        2.48
{txt}                     . {c |}{res}     11,208       97.52      100.00
{txt}{hline 23}{c +}{hline 35}
                 Total {c |}{res}     11,493      100.00

{txt}
{com}. bys eia_diagnosis: tab gp_ref_3d

{txt}{hline}
-> eia_diagnosis = RA

   Time to GP referral {c |}      Freq.     Percent        Cum.
{hline 23}{c +}{hline 35}
Referral delay >3 days {c |}{res}        323       99.08       99.08
{txt}Referred within 3 days {c |}{res}          3        0.92      100.00
{txt}{hline 23}{c +}{hline 35}
                 Total {c |}{res}        326      100.00

{txt}{hline}
-> eia_diagnosis = PsA

   Time to GP referral {c |}      Freq.     Percent        Cum.
{hline 23}{c +}{hline 35}
Referral delay >3 days {c |}{res}        300       99.01       99.01
{txt}Referred within 3 days {c |}{res}          3        0.99      100.00
{txt}{hline 23}{c +}{hline 35}
                 Total {c |}{res}        303      100.00

{txt}{hline}
-> eia_diagnosis = AxSpA

   Time to GP referral {c |}      Freq.     Percent        Cum.
{hline 23}{c +}{hline 35}
Referral delay >3 days {c |}{res}        280       98.25       98.25
{txt}Referred within 3 days {c |}{res}          5        1.75      100.00
{txt}{hline 23}{c +}{hline 35}
                 Total {c |}{res}        285      100.00

{txt}
{com}. bys diagnosis_year: tab gp_ref_3d, missing

{txt}{hline}
-> diagnosis_year = March 2019-March 2020

   Time to GP referral {c |}      Freq.     Percent        Cum.
{hline 23}{c +}{hline 35}
Referral delay >3 days {c |}{res}         89        0.82        0.82
{txt}Referred within 3 days {c |}{res}          3        0.03        0.84
{txt}                     . {c |}{res}     10,825       99.16      100.00
{txt}{hline 23}{c +}{hline 35}
                 Total {c |}{res}     10,917      100.00

{txt}{hline}
-> diagnosis_year = March 2020-March 2021

   Time to GP referral {c |}      Freq.     Percent        Cum.
{hline 23}{c +}{hline 35}
Referral delay >3 days {c |}{res}        248        2.28        2.28
{txt}Referred within 3 days {c |}{res}          4        0.04        2.31
{txt}                     . {c |}{res}     10,645       97.69      100.00
{txt}{hline 23}{c +}{hline 35}
                 Total {c |}{res}     10,897      100.00

{txt}{hline}
-> diagnosis_year = March 2021-March 2022

   Time to GP referral {c |}      Freq.     Percent        Cum.
{hline 23}{c +}{hline 35}
Referral delay >3 days {c |}{res}        478        4.41        4.41
{txt}Referred within 3 days {c |}{res}          4        0.04        4.45
{txt}                     . {c |}{res}     10,348       95.55      100.00
{txt}{hline 23}{c +}{hline 35}
                 Total {c |}{res}     10,830      100.00

{txt}{hline}
-> diagnosis_year = .

   Time to GP referral {c |}      Freq.     Percent        Cum.
{hline 23}{c +}{hline 35}
Referral delay >3 days {c |}{res}         88        6.06        6.06
{txt}                     . {c |}{res}      1,364       93.94      100.00
{txt}{hline 23}{c +}{hline 35}
                 Total {c |}{res}      1,452      100.00

{txt}
{com}. bys diagnosis_year: tab gp_ref_3d

{txt}{hline}
-> diagnosis_year = March 2019-March 2020

   Time to GP referral {c |}      Freq.     Percent        Cum.
{hline 23}{c +}{hline 35}
Referral delay >3 days {c |}{res}         89       96.74       96.74
{txt}Referred within 3 days {c |}{res}          3        3.26      100.00
{txt}{hline 23}{c +}{hline 35}
                 Total {c |}{res}         92      100.00

{txt}{hline}
-> diagnosis_year = March 2020-March 2021

   Time to GP referral {c |}      Freq.     Percent        Cum.
{hline 23}{c +}{hline 35}
Referral delay >3 days {c |}{res}        248       98.41       98.41
{txt}Referred within 3 days {c |}{res}          4        1.59      100.00
{txt}{hline 23}{c +}{hline 35}
                 Total {c |}{res}        252      100.00

{txt}{hline}
-> diagnosis_year = March 2021-March 2022

   Time to GP referral {c |}      Freq.     Percent        Cum.
{hline 23}{c +}{hline 35}
Referral delay >3 days {c |}{res}        478       99.17       99.17
{txt}Referred within 3 days {c |}{res}          4        0.83      100.00
{txt}{hline 23}{c +}{hline 35}
                 Total {c |}{res}        482      100.00

{txt}{hline}
-> diagnosis_year = .

   Time to GP referral {c |}      Freq.     Percent        Cum.
{hline 23}{c +}{hline 35}
Referral delay >3 days {c |}{res}         88      100.00      100.00
{txt}{hline 23}{c +}{hline 35}
                 Total {c |}{res}         88      100.00

{txt}
{com}. bys nuts_region: tab gp_ref_3d, missing

{txt}{hline}
-> nuts_region = East Midlands

   Time to GP referral {c |}      Freq.     Percent        Cum.
{hline 23}{c +}{hline 35}
Referral delay >3 days {c |}{res}         85        2.57        2.57
{txt}Referred within 3 days {c |}{res}          1        0.03        2.60
{txt}                     . {c |}{res}      3,218       97.40      100.00
{txt}{hline 23}{c +}{hline 35}
                 Total {c |}{res}      3,304      100.00

{txt}{hline}
-> nuts_region = East of England

   Time to GP referral {c |}      Freq.     Percent        Cum.
{hline 23}{c +}{hline 35}
Referral delay >3 days {c |}{res}         89        2.63        2.63
{txt}Referred within 3 days {c |}{res}          1        0.03        2.66
{txt}                     . {c |}{res}      3,298       97.34      100.00
{txt}{hline 23}{c +}{hline 35}
                 Total {c |}{res}      3,388      100.00

{txt}{hline}
-> nuts_region = London

   Time to GP referral {c |}      Freq.     Percent        Cum.
{hline 23}{c +}{hline 35}
Referral delay >3 days {c |}{res}        188        2.73        2.73
{txt}Referred within 3 days {c |}{res}          2        0.03        2.76
{txt}                     . {c |}{res}      6,706       97.24      100.00
{txt}{hline 23}{c +}{hline 35}
                 Total {c |}{res}      6,896      100.00

{txt}{hline}
-> nuts_region = North East

   Time to GP referral {c |}      Freq.     Percent        Cum.
{hline 23}{c +}{hline 35}
Referral delay >3 days {c |}{res}         84        2.40        2.40
{txt}Referred within 3 days {c |}{res}          4        0.11        2.52
{txt}                     . {c |}{res}      3,408       97.48      100.00
{txt}{hline 23}{c +}{hline 35}
                 Total {c |}{res}      3,496      100.00

{txt}{hline}
-> nuts_region = North West

   Time to GP referral {c |}      Freq.     Percent        Cum.
{hline 23}{c +}{hline 35}
Referral delay >3 days {c |}{res}         90        2.65        2.65
{txt}Referred within 3 days {c |}{res}          1        0.03        2.68
{txt}                     . {c |}{res}      3,310       97.32      100.00
{txt}{hline 23}{c +}{hline 35}
                 Total {c |}{res}      3,401      100.00

{txt}{hline}
-> nuts_region = South East

   Time to GP referral {c |}      Freq.     Percent        Cum.
{hline 23}{c +}{hline 35}
Referral delay >3 days {c |}{res}        178        2.61        2.61
{txt}Referred within 3 days {c |}{res}          1        0.01        2.62
{txt}                     . {c |}{res}      6,644       97.38      100.00
{txt}{hline 23}{c +}{hline 35}
                 Total {c |}{res}      6,823      100.00

{txt}{hline}
-> nuts_region = West Midlands

   Time to GP referral {c |}      Freq.     Percent        Cum.
{hline 23}{c +}{hline 35}
Referral delay >3 days {c |}{res}         87        2.57        2.57
{txt}                     . {c |}{res}      3,303       97.43      100.00
{txt}{hline 23}{c +}{hline 35}
                 Total {c |}{res}      3,390      100.00

{txt}{hline}
-> nuts_region = Yorkshire and the Humber

   Time to GP referral {c |}      Freq.     Percent        Cum.
{hline 23}{c +}{hline 35}
Referral delay >3 days {c |}{res}        102        3.00        3.00
{txt}Referred within 3 days {c |}{res}          1        0.03        3.03
{txt}                     . {c |}{res}      3,295       96.97      100.00
{txt}{hline 23}{c +}{hline 35}
                 Total {c |}{res}      3,398      100.00

{txt}
{com}. bys nuts_region: tab gp_ref_3d

{txt}{hline}
-> nuts_region = East Midlands

   Time to GP referral {c |}      Freq.     Percent        Cum.
{hline 23}{c +}{hline 35}
Referral delay >3 days {c |}{res}         85       98.84       98.84
{txt}Referred within 3 days {c |}{res}          1        1.16      100.00
{txt}{hline 23}{c +}{hline 35}
                 Total {c |}{res}         86      100.00

{txt}{hline}
-> nuts_region = East of England

   Time to GP referral {c |}      Freq.     Percent        Cum.
{hline 23}{c +}{hline 35}
Referral delay >3 days {c |}{res}         89       98.89       98.89
{txt}Referred within 3 days {c |}{res}          1        1.11      100.00
{txt}{hline 23}{c +}{hline 35}
                 Total {c |}{res}         90      100.00

{txt}{hline}
-> nuts_region = London

   Time to GP referral {c |}      Freq.     Percent        Cum.
{hline 23}{c +}{hline 35}
Referral delay >3 days {c |}{res}        188       98.95       98.95
{txt}Referred within 3 days {c |}{res}          2        1.05      100.00
{txt}{hline 23}{c +}{hline 35}
                 Total {c |}{res}        190      100.00

{txt}{hline}
-> nuts_region = North East

   Time to GP referral {c |}      Freq.     Percent        Cum.
{hline 23}{c +}{hline 35}
Referral delay >3 days {c |}{res}         84       95.45       95.45
{txt}Referred within 3 days {c |}{res}          4        4.55      100.00
{txt}{hline 23}{c +}{hline 35}
                 Total {c |}{res}         88      100.00

{txt}{hline}
-> nuts_region = North West

   Time to GP referral {c |}      Freq.     Percent        Cum.
{hline 23}{c +}{hline 35}
Referral delay >3 days {c |}{res}         90       98.90       98.90
{txt}Referred within 3 days {c |}{res}          1        1.10      100.00
{txt}{hline 23}{c +}{hline 35}
                 Total {c |}{res}         91      100.00

{txt}{hline}
-> nuts_region = South East

   Time to GP referral {c |}      Freq.     Percent        Cum.
{hline 23}{c +}{hline 35}
Referral delay >3 days {c |}{res}        178       99.44       99.44
{txt}Referred within 3 days {c |}{res}          1        0.56      100.00
{txt}{hline 23}{c +}{hline 35}
                 Total {c |}{res}        179      100.00

{txt}{hline}
-> nuts_region = West Midlands

   Time to GP referral {c |}      Freq.     Percent        Cum.
{hline 23}{c +}{hline 35}
Referral delay >3 days {c |}{res}         87      100.00      100.00
{txt}{hline 23}{c +}{hline 35}
                 Total {c |}{res}         87      100.00

{txt}{hline}
-> nuts_region = Yorkshire and the Humber

   Time to GP referral {c |}      Freq.     Percent        Cum.
{hline 23}{c +}{hline 35}
Referral delay >3 days {c |}{res}        102       99.03       99.03
{txt}Referred within 3 days {c |}{res}          1        0.97      100.00
{txt}{hline 23}{c +}{hline 35}
                 Total {c |}{res}        103      100.00

{txt}
{com}. 
. **Time from last GP to rheum ref before eia code (sensitivity analysis; includes those with no rheum appt)
. gen time_gp_rheum_ref_code = (referral_rheum_precode_date - last_gp_refcode_date) if referral_rheum_precode_date!=. & last_gp_refcode_date!=. & referral_rheum_precode_date>last_gp_refcode_date & referral_rheum_precode_date<eia_code_date
{txt}(28,181 missing values generated)

{com}. tabstat time_gp_rheum_ref_code, stats (n mean p50 p25 p75)

{txt}{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_rh~e} {...}
{c |}{...}
 {res}     5915  381.1755       318       138       565
{txt}{hline 13}{c BT}{hline 50}

{com}. bys eia_diagnosis: tabstat time_gp_rheum_ref_code, stats (n mean p50 p25 p75)

{txt}{hline}
-> eia_diagnosis = RA

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_rh~e} {...}
{c |}{...}
 {res}     1946  390.8828     322.5       144       578
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = PsA

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_rh~e} {...}
{c |}{...}
 {res}     1961  385.6446       319       139       582
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = AxSpA

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_rh~e} {...}
{c |}{...}
 {res}     2008  367.4034       313       134       538
{txt}{hline 13}{c BT}{hline 50}

{com}. 
. **Time from last GP to rheum ref (combined - sensitivity analysis; includes those with no rheum appt)
. gen time_gp_rheum_ref_comb = time_gp_rheum_ref_appt 
{txt}(33,182 missing values generated)

{com}. replace time_gp_rheum_ref_comb = time_gp_rheum_ref_code if time_gp_rheum_ref_appt==. & time_gp_rheum_ref_code!=.
{txt}(5,702 real changes made)

{com}. tabstat time_gp_rheum_ref_comb, stats (n mean p50 p25 p75)

{txt}{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_rh~b} {...}
{c |}{...}
 {res}     6616  360.5283       293       123       534
{txt}{hline 13}{c BT}{hline 50}

{com}. bys eia_diagnosis: tabstat time_gp_rheum_ref_comb, stats (n mean p50 p25 p75)

{txt}{hline}
-> eia_diagnosis = RA

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_rh~b} {...}
{c |}{...}
 {res}     2193  364.5408       292       125       536
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = PsA

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_rh~b} {...}
{c |}{...}
 {res}     2193  366.9617       298       127       549
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = AxSpA

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_rh~b} {...}
{c |}{...}
 {res}     2230  350.2556       291       117       520
{txt}{hline 13}{c BT}{hline 50}

{com}. 
. **Time from last GP pre-rheum appt to first rheum appt (key sensitivity analysis; includes those with no rheum ref)
. gen time_gp_rheum_appt = (rheum_appt_date - last_gp_prerheum_date) if rheum_appt_date!=. & last_gp_prerheum_date!=. & rheum_appt_date>last_gp_prerheum_date & rheum_appt_date<eia_code_date
{txt}(28,847 missing values generated)

{com}. tabstat time_gp_rheum_appt, stats (n mean p50 p25 p75)

{txt}{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_~m_appt} {...}
{c |}{...}
 {res}     5249  284.5087       225       103       405
{txt}{hline 13}{c BT}{hline 50}

{com}. bys eia_diagnosis: tabstat time_gp_rheum_appt, stats (n mean p50 p25 p75)

{txt}{hline}
-> eia_diagnosis = RA

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_~m_appt} {...}
{c |}{...}
 {res}     1711  285.7785       227       108       397
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = PsA

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_~m_appt} {...}
{c |}{...}
 {res}     1716  286.6521       224        99     419.5
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = AxSpA

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_~m_appt} {...}
{c |}{...}
 {res}     1822  281.2975       225       102       400
{txt}{hline 13}{c BT}{hline 50}

{com}. bys diagnosis_year: tabstat time_gp_rheum_appt, stats (n mean p50 p25 p75) //by diagnosis year

{txt}{hline}
-> diagnosis_year = March 2019-March 2020

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_~m_appt} {...}
{c |}{...}
 {res}      887  179.1962       159        70       262
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> diagnosis_year = March 2020-March 2021

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_~m_appt} {...}
{c |}{...}
 {res}     1690  254.9651     204.5        99       375
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> diagnosis_year = March 2021-March 2022

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_~m_appt} {...}
{c |}{...}
 {res}     2327  330.7817       267       123       488
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> diagnosis_year = .

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_~m_appt} {...}
{c |}{...}
 {res}      345  387.8812       296       147       600
{txt}{hline 13}{c BT}{hline 50}

{com}. bys nuts_region: tabstat time_gp_rheum_appt, stats (n mean p50 p25 p75) //by region

{txt}{hline}
-> nuts_region = East Midlands

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_~m_appt} {...}
{c |}{...}
 {res}      511  275.4403       207        94       401
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = East of England

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_~m_appt} {...}
{c |}{...}
 {res}      527  284.6281       221       101       407
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = London

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_~m_appt} {...}
{c |}{...}
 {res}     1021  279.5514       221       105       392
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = North East

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_~m_appt} {...}
{c |}{...}
 {res}      551  278.8258       227        98       383
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = North West

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_~m_appt} {...}
{c |}{...}
 {res}      522  280.9943       229       103       399
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = South East

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_~m_appt} {...}
{c |}{...}
 {res}     1082  291.4251       230       110       421
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = West Midlands

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_~m_appt} {...}
{c |}{...}
 {res}      503  296.1093       233       106       438
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = Yorkshire and the Humber

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_~m_appt} {...}
{c |}{...}
 {res}      532  286.9135       228        97       405
{txt}{hline 13}{c BT}{hline 50}

{com}. 
. **Time from last GP pre-code to EIA code (sensitivity analysis; includes those with no rheum ref and/or no rheum appt)
. gen time_gp_eia_code = (eia_code_date - last_gp_precode_date) if eia_code_date!=. & last_gp_precode_date!=. & eia_code_date>last_gp_precode_date
{txt}(15,245 missing values generated)

{com}. tabstat time_gp_eia_code, stats (n mean p50 p25 p75)

{txt}{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_ei~e} {...}
{c |}{...}
 {res}    18851  520.6574       469       229       771
{txt}{hline 13}{c BT}{hline 50}

{com}. bys eia_diagnosis: tabstat time_gp_eia_code, stats (n mean p50 p25 p75)

{txt}{hline}
-> eia_diagnosis = RA

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_ei~e} {...}
{c |}{...}
 {res}     6286  522.2553     470.5       233       772
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = PsA

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_ei~e} {...}
{c |}{...}
 {res}     6133   524.767       475       231       778
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = AxSpA

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_ei~e} {...}
{c |}{...}
 {res}     6432  515.1772       463       222       766
{txt}{hline 13}{c BT}{hline 50}

{com}. 
. **Time from last GP to EIA diagnosis (combined - sensitivity analysis; includes those with no rheum appt)
. gen time_gp_eia_diag = time_gp_rheum_appt
{txt}(28,847 missing values generated)

{com}. replace time_gp_eia_diag = time_gp_eia_code if time_gp_rheum_appt==. & time_gp_eia_code!=.
{txt}(15,505 real changes made)

{com}. tabstat time_gp_eia_diag, stats (n mean p50 p25 p75)

{txt}{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_ei~g} {...}
{c |}{...}
 {res}    20754  453.2141       382       174       675
{txt}{hline 13}{c BT}{hline 50}

{com}. bys eia_diagnosis: tabstat time_gp_eia_diag, stats (n mean p50 p25 p75)

{txt}{hline}
-> eia_diagnosis = RA

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_ei~g} {...}
{c |}{...}
 {res}     6929  457.5142       385       179       680
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = PsA

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_ei~g} {...}
{c |}{...}
 {res}     6766  457.1169       387       171       680
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = AxSpA

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_ei~g} {...}
{c |}{...}
 {res}     7059  445.2523       374       172       665
{txt}{hline 13}{c BT}{hline 50}

{com}. 
. **Time from rheum ref to rheum appt (i.e. if appts are present and in correct time order)
. gen time_ref_rheum_appt = (rheum_appt_date - referral_rheum_prerheum_date) if rheum_appt_date!=. & referral_rheum_prerheum_date!=. & referral_rheum_prerheum_date<rheum_appt_date & rheum_appt_date<eia_code_date
{txt}(28,912 missing values generated)

{com}. tabstat time_ref_rheum_appt, stats (n mean p50 p25 p75)

{txt}{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_ref_r~t} {...}
{c |}{...}
 {res}     5184  289.5492       229       105       421
{txt}{hline 13}{c BT}{hline 50}

{com}. bys eia_diagnosis: tabstat time_ref_rheum_appt, stats (n mean p50 p25 p75)

{txt}{hline}
-> eia_diagnosis = RA

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_ref_r~t} {...}
{c |}{...}
 {res}     1735  288.6006       229       103       427
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = PsA

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_ref_r~t} {...}
{c |}{...}
 {res}     1705  288.7238       227       102       415
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = AxSpA

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_ref_r~t} {...}
{c |}{...}
 {res}     1744  291.2999       230       108     419.5
{txt}{hline 13}{c BT}{hline 50}

{com}. bys diagnosis_year: tabstat time_ref_rheum_appt, stats (n mean p50 p25 p75) //all patients by diagnosis year

{txt}{hline}
-> diagnosis_year = March 2019-March 2020

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_ref_r~t} {...}
{c |}{...}
 {res}      865  180.0936       153        71       259
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> diagnosis_year = March 2020-March 2021

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_ref_r~t} {...}
{c |}{...}
 {res}     1660  265.1331       220       103     390.5
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> diagnosis_year = March 2021-March 2022

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_ref_r~t} {...}
{c |}{...}
 {res}     2305  332.9262       274       122       489
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> diagnosis_year = .

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_ref_r~t} {...}
{c |}{...}
 {res}      354  389.0565     349.5       159       553
{txt}{hline 13}{c BT}{hline 50}

{com}. bys nuts_region: tabstat time_ref_rheum_appt, stats (n mean p50 p25 p75) //by region

{txt}{hline}
-> nuts_region = East Midlands

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_ref_r~t} {...}
{c |}{...}
 {res}      486  285.9239       229       101       412
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = East of England

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_ref_r~t} {...}
{c |}{...}
 {res}      543  279.3591       218        99       385
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = London

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_ref_r~t} {...}
{c |}{...}
 {res}     1052  294.3403     236.5       109     429.5
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = North East

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_ref_r~t} {...}
{c |}{...}
 {res}      526  298.6198     243.5       103       444
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = North West

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_ref_r~t} {...}
{c |}{...}
 {res}      521  299.7889       232       102       438
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = South East

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_ref_r~t} {...}
{c |}{...}
 {res}     1037  284.9016       222       105       416
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = West Midlands

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_ref_r~t} {...}
{c |}{...}
 {res}      491  288.9491       221       103       411
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = Yorkshire and the Humber

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_ref_r~t} {...}
{c |}{...}
 {res}      528  284.3655       223     109.5       435
{txt}{hline 13}{c BT}{hline 50}

{com}. 
. gen ref_appt_cat=1 if time_ref_rheum_appt<=21 & time_ref_rheum_appt!=. 
{txt}(33,798 missing values generated)

{com}. replace ref_appt_cat=2 if time_ref_rheum_appt<=42 & time_ref_rheum_appt!=. & ref_appt_cat==.
{txt}(242 real changes made)

{com}. replace ref_appt_cat=3 if time_ref_rheum_appt>42 & time_ref_rheum_appt!=. & ref_appt_cat==.
{txt}(4,644 real changes made)

{com}. lab define ref_appt_cat 1 "Seen within 3 weeks" 2 "Seen within 6 weeks" 3 "Assessment delay >6 weeks", modify
{txt}
{com}. lab val ref_appt_cat ref_appt_cat
{txt}
{com}. lab var ref_appt_cat "Time to rheumatology assessment"
{txt}
{com}. tab ref_appt_cat, missing

     {txt}Time to rheumatology {c |}
               assessment {c |}      Freq.     Percent        Cum.
{hline 26}{c +}{hline 35}
      Seen within 3 weeks {c |}{res}        298        0.87        0.87
{txt}      Seen within 6 weeks {c |}{res}        242        0.71        1.58
{txt}Assessment delay >6 weeks {c |}{res}      4,644       13.62       15.20
{txt}                        . {c |}{res}     28,912       84.80      100.00
{txt}{hline 26}{c +}{hline 35}
                    Total {c |}{res}     34,096      100.00
{txt}
{com}. tab ref_appt_cat

     {txt}Time to rheumatology {c |}
               assessment {c |}      Freq.     Percent        Cum.
{hline 26}{c +}{hline 35}
      Seen within 3 weeks {c |}{res}        298        5.75        5.75
{txt}      Seen within 6 weeks {c |}{res}        242        4.67       10.42
{txt}Assessment delay >6 weeks {c |}{res}      4,644       89.58      100.00
{txt}{hline 26}{c +}{hline 35}
                    Total {c |}{res}      5,184      100.00
{txt}
{com}. bys eia_diagnosis: tab ref_appt_cat, missing

{txt}{hline}
-> eia_diagnosis = RA

     Time to rheumatology {c |}
               assessment {c |}      Freq.     Percent        Cum.
{hline 26}{c +}{hline 35}
      Seen within 3 weeks {c |}{res}         93        0.82        0.82
{txt}      Seen within 6 weeks {c |}{res}         82        0.72        1.55
{txt}Assessment delay >6 weeks {c |}{res}      1,560       13.79       15.33
{txt}                        . {c |}{res}      9,580       84.67      100.00
{txt}{hline 26}{c +}{hline 35}
                    Total {c |}{res}     11,315      100.00

{txt}{hline}
-> eia_diagnosis = PsA

     Time to rheumatology {c |}
               assessment {c |}      Freq.     Percent        Cum.
{hline 26}{c +}{hline 35}
      Seen within 3 weeks {c |}{res}         97        0.86        0.86
{txt}      Seen within 6 weeks {c |}{res}         83        0.74        1.59
{txt}Assessment delay >6 weeks {c |}{res}      1,525       13.51       15.10
{txt}                        . {c |}{res}      9,583       84.90      100.00
{txt}{hline 26}{c +}{hline 35}
                    Total {c |}{res}     11,288      100.00

{txt}{hline}
-> eia_diagnosis = AxSpA

     Time to rheumatology {c |}
               assessment {c |}      Freq.     Percent        Cum.
{hline 26}{c +}{hline 35}
      Seen within 3 weeks {c |}{res}        108        0.94        0.94
{txt}      Seen within 6 weeks {c |}{res}         77        0.67        1.61
{txt}Assessment delay >6 weeks {c |}{res}      1,559       13.56       15.17
{txt}                        . {c |}{res}      9,749       84.83      100.00
{txt}{hline 26}{c +}{hline 35}
                    Total {c |}{res}     11,493      100.00

{txt}
{com}. bys eia_diagnosis: tab ref_appt_cat

{txt}{hline}
-> eia_diagnosis = RA

     Time to rheumatology {c |}
               assessment {c |}      Freq.     Percent        Cum.
{hline 26}{c +}{hline 35}
      Seen within 3 weeks {c |}{res}         93        5.36        5.36
{txt}      Seen within 6 weeks {c |}{res}         82        4.73       10.09
{txt}Assessment delay >6 weeks {c |}{res}      1,560       89.91      100.00
{txt}{hline 26}{c +}{hline 35}
                    Total {c |}{res}      1,735      100.00

{txt}{hline}
-> eia_diagnosis = PsA

     Time to rheumatology {c |}
               assessment {c |}      Freq.     Percent        Cum.
{hline 26}{c +}{hline 35}
      Seen within 3 weeks {c |}{res}         97        5.69        5.69
{txt}      Seen within 6 weeks {c |}{res}         83        4.87       10.56
{txt}Assessment delay >6 weeks {c |}{res}      1,525       89.44      100.00
{txt}{hline 26}{c +}{hline 35}
                    Total {c |}{res}      1,705      100.00

{txt}{hline}
-> eia_diagnosis = AxSpA

     Time to rheumatology {c |}
               assessment {c |}      Freq.     Percent        Cum.
{hline 26}{c +}{hline 35}
      Seen within 3 weeks {c |}{res}        108        6.19        6.19
{txt}      Seen within 6 weeks {c |}{res}         77        4.42       10.61
{txt}Assessment delay >6 weeks {c |}{res}      1,559       89.39      100.00
{txt}{hline 26}{c +}{hline 35}
                    Total {c |}{res}      1,744      100.00

{txt}
{com}. bys diagnosis_year: tab ref_appt_cat, missing

{txt}{hline}
-> diagnosis_year = March 2019-March 2020

     Time to rheumatology {c |}
               assessment {c |}      Freq.     Percent        Cum.
{hline 26}{c +}{hline 35}
      Seen within 3 weeks {c |}{res}         69        0.63        0.63
{txt}      Seen within 6 weeks {c |}{res}         59        0.54        1.17
{txt}Assessment delay >6 weeks {c |}{res}        737        6.75        7.92
{txt}                        . {c |}{res}     10,052       92.08      100.00
{txt}{hline 26}{c +}{hline 35}
                    Total {c |}{res}     10,917      100.00

{txt}{hline}
-> diagnosis_year = March 2020-March 2021

     Time to rheumatology {c |}
               assessment {c |}      Freq.     Percent        Cum.
{hline 26}{c +}{hline 35}
      Seen within 3 weeks {c |}{res}         91        0.84        0.84
{txt}      Seen within 6 weeks {c |}{res}         79        0.72        1.56
{txt}Assessment delay >6 weeks {c |}{res}      1,490       13.67       15.23
{txt}                        . {c |}{res}      9,237       84.77      100.00
{txt}{hline 26}{c +}{hline 35}
                    Total {c |}{res}     10,897      100.00

{txt}{hline}
-> diagnosis_year = March 2021-March 2022

     Time to rheumatology {c |}
               assessment {c |}      Freq.     Percent        Cum.
{hline 26}{c +}{hline 35}
      Seen within 3 weeks {c |}{res}        126        1.16        1.16
{txt}      Seen within 6 weeks {c |}{res}         91        0.84        2.00
{txt}Assessment delay >6 weeks {c |}{res}      2,088       19.28       21.28
{txt}                        . {c |}{res}      8,525       78.72      100.00
{txt}{hline 26}{c +}{hline 35}
                    Total {c |}{res}     10,830      100.00

{txt}{hline}
-> diagnosis_year = .

     Time to rheumatology {c |}
               assessment {c |}      Freq.     Percent        Cum.
{hline 26}{c +}{hline 35}
      Seen within 3 weeks {c |}{res}         12        0.83        0.83
{txt}      Seen within 6 weeks {c |}{res}         13        0.90        1.72
{txt}Assessment delay >6 weeks {c |}{res}        329       22.66       24.38
{txt}                        . {c |}{res}      1,098       75.62      100.00
{txt}{hline 26}{c +}{hline 35}
                    Total {c |}{res}      1,452      100.00

{txt}
{com}. bys diagnosis_year: tab ref_appt_cat

{txt}{hline}
-> diagnosis_year = March 2019-March 2020

     Time to rheumatology {c |}
               assessment {c |}      Freq.     Percent        Cum.
{hline 26}{c +}{hline 35}
      Seen within 3 weeks {c |}{res}         69        7.98        7.98
{txt}      Seen within 6 weeks {c |}{res}         59        6.82       14.80
{txt}Assessment delay >6 weeks {c |}{res}        737       85.20      100.00
{txt}{hline 26}{c +}{hline 35}
                    Total {c |}{res}        865      100.00

{txt}{hline}
-> diagnosis_year = March 2020-March 2021

     Time to rheumatology {c |}
               assessment {c |}      Freq.     Percent        Cum.
{hline 26}{c +}{hline 35}
      Seen within 3 weeks {c |}{res}         91        5.48        5.48
{txt}      Seen within 6 weeks {c |}{res}         79        4.76       10.24
{txt}Assessment delay >6 weeks {c |}{res}      1,490       89.76      100.00
{txt}{hline 26}{c +}{hline 35}
                    Total {c |}{res}      1,660      100.00

{txt}{hline}
-> diagnosis_year = March 2021-March 2022

     Time to rheumatology {c |}
               assessment {c |}      Freq.     Percent        Cum.
{hline 26}{c +}{hline 35}
      Seen within 3 weeks {c |}{res}        126        5.47        5.47
{txt}      Seen within 6 weeks {c |}{res}         91        3.95        9.41
{txt}Assessment delay >6 weeks {c |}{res}      2,088       90.59      100.00
{txt}{hline 26}{c +}{hline 35}
                    Total {c |}{res}      2,305      100.00

{txt}{hline}
-> diagnosis_year = .

     Time to rheumatology {c |}
               assessment {c |}      Freq.     Percent        Cum.
{hline 26}{c +}{hline 35}
      Seen within 3 weeks {c |}{res}         12        3.39        3.39
{txt}      Seen within 6 weeks {c |}{res}         13        3.67        7.06
{txt}Assessment delay >6 weeks {c |}{res}        329       92.94      100.00
{txt}{hline 26}{c +}{hline 35}
                    Total {c |}{res}        354      100.00

{txt}
{com}. bys nuts_region: tab ref_appt_cat, missing

{txt}{hline}
-> nuts_region = East Midlands

     Time to rheumatology {c |}
               assessment {c |}      Freq.     Percent        Cum.
{hline 26}{c +}{hline 35}
      Seen within 3 weeks {c |}{res}         27        0.82        0.82
{txt}      Seen within 6 weeks {c |}{res}         27        0.82        1.63
{txt}Assessment delay >6 weeks {c |}{res}        432       13.08       14.71
{txt}                        . {c |}{res}      2,818       85.29      100.00
{txt}{hline 26}{c +}{hline 35}
                    Total {c |}{res}      3,304      100.00

{txt}{hline}
-> nuts_region = East of England

     Time to rheumatology {c |}
               assessment {c |}      Freq.     Percent        Cum.
{hline 26}{c +}{hline 35}
      Seen within 3 weeks {c |}{res}         32        0.94        0.94
{txt}      Seen within 6 weeks {c |}{res}         21        0.62        1.56
{txt}Assessment delay >6 weeks {c |}{res}        490       14.46       16.03
{txt}                        . {c |}{res}      2,845       83.97      100.00
{txt}{hline 26}{c +}{hline 35}
                    Total {c |}{res}      3,388      100.00

{txt}{hline}
-> nuts_region = London

     Time to rheumatology {c |}
               assessment {c |}      Freq.     Percent        Cum.
{hline 26}{c +}{hline 35}
      Seen within 3 weeks {c |}{res}         57        0.83        0.83
{txt}      Seen within 6 weeks {c |}{res}         47        0.68        1.51
{txt}Assessment delay >6 weeks {c |}{res}        948       13.75       15.26
{txt}                        . {c |}{res}      5,844       84.74      100.00
{txt}{hline 26}{c +}{hline 35}
                    Total {c |}{res}      6,896      100.00

{txt}{hline}
-> nuts_region = North East

     Time to rheumatology {c |}
               assessment {c |}      Freq.     Percent        Cum.
{hline 26}{c +}{hline 35}
      Seen within 3 weeks {c |}{res}         38        1.09        1.09
{txt}      Seen within 6 weeks {c |}{res}         26        0.74        1.83
{txt}Assessment delay >6 weeks {c |}{res}        462       13.22       15.05
{txt}                        . {c |}{res}      2,970       84.95      100.00
{txt}{hline 26}{c +}{hline 35}
                    Total {c |}{res}      3,496      100.00

{txt}{hline}
-> nuts_region = North West

     Time to rheumatology {c |}
               assessment {c |}      Freq.     Percent        Cum.
{hline 26}{c +}{hline 35}
      Seen within 3 weeks {c |}{res}         26        0.76        0.76
{txt}      Seen within 6 weeks {c |}{res}         25        0.74        1.50
{txt}Assessment delay >6 weeks {c |}{res}        470       13.82       15.32
{txt}                        . {c |}{res}      2,880       84.68      100.00
{txt}{hline 26}{c +}{hline 35}
                    Total {c |}{res}      3,401      100.00

{txt}{hline}
-> nuts_region = South East

     Time to rheumatology {c |}
               assessment {c |}      Freq.     Percent        Cum.
{hline 26}{c +}{hline 35}
      Seen within 3 weeks {c |}{res}         54        0.79        0.79
{txt}      Seen within 6 weeks {c |}{res}         45        0.66        1.45
{txt}Assessment delay >6 weeks {c |}{res}        938       13.75       15.20
{txt}                        . {c |}{res}      5,786       84.80      100.00
{txt}{hline 26}{c +}{hline 35}
                    Total {c |}{res}      6,823      100.00

{txt}{hline}
-> nuts_region = West Midlands

     Time to rheumatology {c |}
               assessment {c |}      Freq.     Percent        Cum.
{hline 26}{c +}{hline 35}
      Seen within 3 weeks {c |}{res}         25        0.74        0.74
{txt}      Seen within 6 weeks {c |}{res}         22        0.65        1.39
{txt}Assessment delay >6 weeks {c |}{res}        444       13.10       14.48
{txt}                        . {c |}{res}      2,899       85.52      100.00
{txt}{hline 26}{c +}{hline 35}
                    Total {c |}{res}      3,390      100.00

{txt}{hline}
-> nuts_region = Yorkshire and the Humber

     Time to rheumatology {c |}
               assessment {c |}      Freq.     Percent        Cum.
{hline 26}{c +}{hline 35}
      Seen within 3 weeks {c |}{res}         39        1.15        1.15
{txt}      Seen within 6 weeks {c |}{res}         29        0.85        2.00
{txt}Assessment delay >6 weeks {c |}{res}        460       13.54       15.54
{txt}                        . {c |}{res}      2,870       84.46      100.00
{txt}{hline 26}{c +}{hline 35}
                    Total {c |}{res}      3,398      100.00

{txt}
{com}. bys nuts_region: tab ref_appt_cat

{txt}{hline}
-> nuts_region = East Midlands

     Time to rheumatology {c |}
               assessment {c |}      Freq.     Percent        Cum.
{hline 26}{c +}{hline 35}
      Seen within 3 weeks {c |}{res}         27        5.56        5.56
{txt}      Seen within 6 weeks {c |}{res}         27        5.56       11.11
{txt}Assessment delay >6 weeks {c |}{res}        432       88.89      100.00
{txt}{hline 26}{c +}{hline 35}
                    Total {c |}{res}        486      100.00

{txt}{hline}
-> nuts_region = East of England

     Time to rheumatology {c |}
               assessment {c |}      Freq.     Percent        Cum.
{hline 26}{c +}{hline 35}
      Seen within 3 weeks {c |}{res}         32        5.89        5.89
{txt}      Seen within 6 weeks {c |}{res}         21        3.87        9.76
{txt}Assessment delay >6 weeks {c |}{res}        490       90.24      100.00
{txt}{hline 26}{c +}{hline 35}
                    Total {c |}{res}        543      100.00

{txt}{hline}
-> nuts_region = London

     Time to rheumatology {c |}
               assessment {c |}      Freq.     Percent        Cum.
{hline 26}{c +}{hline 35}
      Seen within 3 weeks {c |}{res}         57        5.42        5.42
{txt}      Seen within 6 weeks {c |}{res}         47        4.47        9.89
{txt}Assessment delay >6 weeks {c |}{res}        948       90.11      100.00
{txt}{hline 26}{c +}{hline 35}
                    Total {c |}{res}      1,052      100.00

{txt}{hline}
-> nuts_region = North East

     Time to rheumatology {c |}
               assessment {c |}      Freq.     Percent        Cum.
{hline 26}{c +}{hline 35}
      Seen within 3 weeks {c |}{res}         38        7.22        7.22
{txt}      Seen within 6 weeks {c |}{res}         26        4.94       12.17
{txt}Assessment delay >6 weeks {c |}{res}        462       87.83      100.00
{txt}{hline 26}{c +}{hline 35}
                    Total {c |}{res}        526      100.00

{txt}{hline}
-> nuts_region = North West

     Time to rheumatology {c |}
               assessment {c |}      Freq.     Percent        Cum.
{hline 26}{c +}{hline 35}
      Seen within 3 weeks {c |}{res}         26        4.99        4.99
{txt}      Seen within 6 weeks {c |}{res}         25        4.80        9.79
{txt}Assessment delay >6 weeks {c |}{res}        470       90.21      100.00
{txt}{hline 26}{c +}{hline 35}
                    Total {c |}{res}        521      100.00

{txt}{hline}
-> nuts_region = South East

     Time to rheumatology {c |}
               assessment {c |}      Freq.     Percent        Cum.
{hline 26}{c +}{hline 35}
      Seen within 3 weeks {c |}{res}         54        5.21        5.21
{txt}      Seen within 6 weeks {c |}{res}         45        4.34        9.55
{txt}Assessment delay >6 weeks {c |}{res}        938       90.45      100.00
{txt}{hline 26}{c +}{hline 35}
                    Total {c |}{res}      1,037      100.00

{txt}{hline}
-> nuts_region = West Midlands

     Time to rheumatology {c |}
               assessment {c |}      Freq.     Percent        Cum.
{hline 26}{c +}{hline 35}
      Seen within 3 weeks {c |}{res}         25        5.09        5.09
{txt}      Seen within 6 weeks {c |}{res}         22        4.48        9.57
{txt}Assessment delay >6 weeks {c |}{res}        444       90.43      100.00
{txt}{hline 26}{c +}{hline 35}
                    Total {c |}{res}        491      100.00

{txt}{hline}
-> nuts_region = Yorkshire and the Humber

     Time to rheumatology {c |}
               assessment {c |}      Freq.     Percent        Cum.
{hline 26}{c +}{hline 35}
      Seen within 3 weeks {c |}{res}         39        7.39        7.39
{txt}      Seen within 6 weeks {c |}{res}         29        5.49       12.88
{txt}Assessment delay >6 weeks {c |}{res}        460       87.12      100.00
{txt}{hline 26}{c +}{hline 35}
                    Total {c |}{res}        528      100.00

{txt}
{com}. 
. gen ref_appt_3w=1 if time_ref_rheum_appt<=21 & time_ref_rheum_appt!=. 
{txt}(33,798 missing values generated)

{com}. replace ref_appt_3w=0 if time_ref_rheum_appt>21 & time_ref_rheum_appt!=.
{txt}(4,886 real changes made)

{com}. lab define ref_appt_3w 1 "Seen within 3 weeks" 0 "Assessment delay >3 weeks", modify
{txt}
{com}. lab val ref_appt_3w ref_appt_3w
{txt}
{com}. lab var ref_appt_3w "Time to rheumatology assessment"
{txt}
{com}. tab ref_appt_3w, missing

     {txt}Time to rheumatology {c |}
               assessment {c |}      Freq.     Percent        Cum.
{hline 26}{c +}{hline 35}
Assessment delay >3 weeks {c |}{res}      4,886       14.33       14.33
{txt}      Seen within 3 weeks {c |}{res}        298        0.87       15.20
{txt}                        . {c |}{res}     28,912       84.80      100.00
{txt}{hline 26}{c +}{hline 35}
                    Total {c |}{res}     34,096      100.00
{txt}
{com}. tab ref_appt_3w

     {txt}Time to rheumatology {c |}
               assessment {c |}      Freq.     Percent        Cum.
{hline 26}{c +}{hline 35}
Assessment delay >3 weeks {c |}{res}      4,886       94.25       94.25
{txt}      Seen within 3 weeks {c |}{res}        298        5.75      100.00
{txt}{hline 26}{c +}{hline 35}
                    Total {c |}{res}      5,184      100.00
{txt}
{com}. bys eia_diagnosis: tab ref_appt_3w, missing

{txt}{hline}
-> eia_diagnosis = RA

     Time to rheumatology {c |}
               assessment {c |}      Freq.     Percent        Cum.
{hline 26}{c +}{hline 35}
Assessment delay >3 weeks {c |}{res}      1,642       14.51       14.51
{txt}      Seen within 3 weeks {c |}{res}         93        0.82       15.33
{txt}                        . {c |}{res}      9,580       84.67      100.00
{txt}{hline 26}{c +}{hline 35}
                    Total {c |}{res}     11,315      100.00

{txt}{hline}
-> eia_diagnosis = PsA

     Time to rheumatology {c |}
               assessment {c |}      Freq.     Percent        Cum.
{hline 26}{c +}{hline 35}
Assessment delay >3 weeks {c |}{res}      1,608       14.25       14.25
{txt}      Seen within 3 weeks {c |}{res}         97        0.86       15.10
{txt}                        . {c |}{res}      9,583       84.90      100.00
{txt}{hline 26}{c +}{hline 35}
                    Total {c |}{res}     11,288      100.00

{txt}{hline}
-> eia_diagnosis = AxSpA

     Time to rheumatology {c |}
               assessment {c |}      Freq.     Percent        Cum.
{hline 26}{c +}{hline 35}
Assessment delay >3 weeks {c |}{res}      1,636       14.23       14.23
{txt}      Seen within 3 weeks {c |}{res}        108        0.94       15.17
{txt}                        . {c |}{res}      9,749       84.83      100.00
{txt}{hline 26}{c +}{hline 35}
                    Total {c |}{res}     11,493      100.00

{txt}
{com}. bys eia_diagnosis: tab ref_appt_3w

{txt}{hline}
-> eia_diagnosis = RA

     Time to rheumatology {c |}
               assessment {c |}      Freq.     Percent        Cum.
{hline 26}{c +}{hline 35}
Assessment delay >3 weeks {c |}{res}      1,642       94.64       94.64
{txt}      Seen within 3 weeks {c |}{res}         93        5.36      100.00
{txt}{hline 26}{c +}{hline 35}
                    Total {c |}{res}      1,735      100.00

{txt}{hline}
-> eia_diagnosis = PsA

     Time to rheumatology {c |}
               assessment {c |}      Freq.     Percent        Cum.
{hline 26}{c +}{hline 35}
Assessment delay >3 weeks {c |}{res}      1,608       94.31       94.31
{txt}      Seen within 3 weeks {c |}{res}         97        5.69      100.00
{txt}{hline 26}{c +}{hline 35}
                    Total {c |}{res}      1,705      100.00

{txt}{hline}
-> eia_diagnosis = AxSpA

     Time to rheumatology {c |}
               assessment {c |}      Freq.     Percent        Cum.
{hline 26}{c +}{hline 35}
Assessment delay >3 weeks {c |}{res}      1,636       93.81       93.81
{txt}      Seen within 3 weeks {c |}{res}        108        6.19      100.00
{txt}{hline 26}{c +}{hline 35}
                    Total {c |}{res}      1,744      100.00

{txt}
{com}. bys diagnosis_year: tab ref_appt_3w, missing

{txt}{hline}
-> diagnosis_year = March 2019-March 2020

     Time to rheumatology {c |}
               assessment {c |}      Freq.     Percent        Cum.
{hline 26}{c +}{hline 35}
Assessment delay >3 weeks {c |}{res}        796        7.29        7.29
{txt}      Seen within 3 weeks {c |}{res}         69        0.63        7.92
{txt}                        . {c |}{res}     10,052       92.08      100.00
{txt}{hline 26}{c +}{hline 35}
                    Total {c |}{res}     10,917      100.00

{txt}{hline}
-> diagnosis_year = March 2020-March 2021

     Time to rheumatology {c |}
               assessment {c |}      Freq.     Percent        Cum.
{hline 26}{c +}{hline 35}
Assessment delay >3 weeks {c |}{res}      1,569       14.40       14.40
{txt}      Seen within 3 weeks {c |}{res}         91        0.84       15.23
{txt}                        . {c |}{res}      9,237       84.77      100.00
{txt}{hline 26}{c +}{hline 35}
                    Total {c |}{res}     10,897      100.00

{txt}{hline}
-> diagnosis_year = March 2021-March 2022

     Time to rheumatology {c |}
               assessment {c |}      Freq.     Percent        Cum.
{hline 26}{c +}{hline 35}
Assessment delay >3 weeks {c |}{res}      2,179       20.12       20.12
{txt}      Seen within 3 weeks {c |}{res}        126        1.16       21.28
{txt}                        . {c |}{res}      8,525       78.72      100.00
{txt}{hline 26}{c +}{hline 35}
                    Total {c |}{res}     10,830      100.00

{txt}{hline}
-> diagnosis_year = .

     Time to rheumatology {c |}
               assessment {c |}      Freq.     Percent        Cum.
{hline 26}{c +}{hline 35}
Assessment delay >3 weeks {c |}{res}        342       23.55       23.55
{txt}      Seen within 3 weeks {c |}{res}         12        0.83       24.38
{txt}                        . {c |}{res}      1,098       75.62      100.00
{txt}{hline 26}{c +}{hline 35}
                    Total {c |}{res}      1,452      100.00

{txt}
{com}. bys diagnosis_year: tab ref_appt_3w

{txt}{hline}
-> diagnosis_year = March 2019-March 2020

     Time to rheumatology {c |}
               assessment {c |}      Freq.     Percent        Cum.
{hline 26}{c +}{hline 35}
Assessment delay >3 weeks {c |}{res}        796       92.02       92.02
{txt}      Seen within 3 weeks {c |}{res}         69        7.98      100.00
{txt}{hline 26}{c +}{hline 35}
                    Total {c |}{res}        865      100.00

{txt}{hline}
-> diagnosis_year = March 2020-March 2021

     Time to rheumatology {c |}
               assessment {c |}      Freq.     Percent        Cum.
{hline 26}{c +}{hline 35}
Assessment delay >3 weeks {c |}{res}      1,569       94.52       94.52
{txt}      Seen within 3 weeks {c |}{res}         91        5.48      100.00
{txt}{hline 26}{c +}{hline 35}
                    Total {c |}{res}      1,660      100.00

{txt}{hline}
-> diagnosis_year = March 2021-March 2022

     Time to rheumatology {c |}
               assessment {c |}      Freq.     Percent        Cum.
{hline 26}{c +}{hline 35}
Assessment delay >3 weeks {c |}{res}      2,179       94.53       94.53
{txt}      Seen within 3 weeks {c |}{res}        126        5.47      100.00
{txt}{hline 26}{c +}{hline 35}
                    Total {c |}{res}      2,305      100.00

{txt}{hline}
-> diagnosis_year = .

     Time to rheumatology {c |}
               assessment {c |}      Freq.     Percent        Cum.
{hline 26}{c +}{hline 35}
Assessment delay >3 weeks {c |}{res}        342       96.61       96.61
{txt}      Seen within 3 weeks {c |}{res}         12        3.39      100.00
{txt}{hline 26}{c +}{hline 35}
                    Total {c |}{res}        354      100.00

{txt}
{com}. bys nuts_region: tab ref_appt_3w, missing

{txt}{hline}
-> nuts_region = East Midlands

     Time to rheumatology {c |}
               assessment {c |}      Freq.     Percent        Cum.
{hline 26}{c +}{hline 35}
Assessment delay >3 weeks {c |}{res}        459       13.89       13.89
{txt}      Seen within 3 weeks {c |}{res}         27        0.82       14.71
{txt}                        . {c |}{res}      2,818       85.29      100.00
{txt}{hline 26}{c +}{hline 35}
                    Total {c |}{res}      3,304      100.00

{txt}{hline}
-> nuts_region = East of England

     Time to rheumatology {c |}
               assessment {c |}      Freq.     Percent        Cum.
{hline 26}{c +}{hline 35}
Assessment delay >3 weeks {c |}{res}        511       15.08       15.08
{txt}      Seen within 3 weeks {c |}{res}         32        0.94       16.03
{txt}                        . {c |}{res}      2,845       83.97      100.00
{txt}{hline 26}{c +}{hline 35}
                    Total {c |}{res}      3,388      100.00

{txt}{hline}
-> nuts_region = London

     Time to rheumatology {c |}
               assessment {c |}      Freq.     Percent        Cum.
{hline 26}{c +}{hline 35}
Assessment delay >3 weeks {c |}{res}        995       14.43       14.43
{txt}      Seen within 3 weeks {c |}{res}         57        0.83       15.26
{txt}                        . {c |}{res}      5,844       84.74      100.00
{txt}{hline 26}{c +}{hline 35}
                    Total {c |}{res}      6,896      100.00

{txt}{hline}
-> nuts_region = North East

     Time to rheumatology {c |}
               assessment {c |}      Freq.     Percent        Cum.
{hline 26}{c +}{hline 35}
Assessment delay >3 weeks {c |}{res}        488       13.96       13.96
{txt}      Seen within 3 weeks {c |}{res}         38        1.09       15.05
{txt}                        . {c |}{res}      2,970       84.95      100.00
{txt}{hline 26}{c +}{hline 35}
                    Total {c |}{res}      3,496      100.00

{txt}{hline}
-> nuts_region = North West

     Time to rheumatology {c |}
               assessment {c |}      Freq.     Percent        Cum.
{hline 26}{c +}{hline 35}
Assessment delay >3 weeks {c |}{res}        495       14.55       14.55
{txt}      Seen within 3 weeks {c |}{res}         26        0.76       15.32
{txt}                        . {c |}{res}      2,880       84.68      100.00
{txt}{hline 26}{c +}{hline 35}
                    Total {c |}{res}      3,401      100.00

{txt}{hline}
-> nuts_region = South East

     Time to rheumatology {c |}
               assessment {c |}      Freq.     Percent        Cum.
{hline 26}{c +}{hline 35}
Assessment delay >3 weeks {c |}{res}        983       14.41       14.41
{txt}      Seen within 3 weeks {c |}{res}         54        0.79       15.20
{txt}                        . {c |}{res}      5,786       84.80      100.00
{txt}{hline 26}{c +}{hline 35}
                    Total {c |}{res}      6,823      100.00

{txt}{hline}
-> nuts_region = West Midlands

     Time to rheumatology {c |}
               assessment {c |}      Freq.     Percent        Cum.
{hline 26}{c +}{hline 35}
Assessment delay >3 weeks {c |}{res}        466       13.75       13.75
{txt}      Seen within 3 weeks {c |}{res}         25        0.74       14.48
{txt}                        . {c |}{res}      2,899       85.52      100.00
{txt}{hline 26}{c +}{hline 35}
                    Total {c |}{res}      3,390      100.00

{txt}{hline}
-> nuts_region = Yorkshire and the Humber

     Time to rheumatology {c |}
               assessment {c |}      Freq.     Percent        Cum.
{hline 26}{c +}{hline 35}
Assessment delay >3 weeks {c |}{res}        489       14.39       14.39
{txt}      Seen within 3 weeks {c |}{res}         39        1.15       15.54
{txt}                        . {c |}{res}      2,870       84.46      100.00
{txt}{hline 26}{c +}{hline 35}
                    Total {c |}{res}      3,398      100.00

{txt}
{com}. bys nuts_region: tab ref_appt_3w

{txt}{hline}
-> nuts_region = East Midlands

     Time to rheumatology {c |}
               assessment {c |}      Freq.     Percent        Cum.
{hline 26}{c +}{hline 35}
Assessment delay >3 weeks {c |}{res}        459       94.44       94.44
{txt}      Seen within 3 weeks {c |}{res}         27        5.56      100.00
{txt}{hline 26}{c +}{hline 35}
                    Total {c |}{res}        486      100.00

{txt}{hline}
-> nuts_region = East of England

     Time to rheumatology {c |}
               assessment {c |}      Freq.     Percent        Cum.
{hline 26}{c +}{hline 35}
Assessment delay >3 weeks {c |}{res}        511       94.11       94.11
{txt}      Seen within 3 weeks {c |}{res}         32        5.89      100.00
{txt}{hline 26}{c +}{hline 35}
                    Total {c |}{res}        543      100.00

{txt}{hline}
-> nuts_region = London

     Time to rheumatology {c |}
               assessment {c |}      Freq.     Percent        Cum.
{hline 26}{c +}{hline 35}
Assessment delay >3 weeks {c |}{res}        995       94.58       94.58
{txt}      Seen within 3 weeks {c |}{res}         57        5.42      100.00
{txt}{hline 26}{c +}{hline 35}
                    Total {c |}{res}      1,052      100.00

{txt}{hline}
-> nuts_region = North East

     Time to rheumatology {c |}
               assessment {c |}      Freq.     Percent        Cum.
{hline 26}{c +}{hline 35}
Assessment delay >3 weeks {c |}{res}        488       92.78       92.78
{txt}      Seen within 3 weeks {c |}{res}         38        7.22      100.00
{txt}{hline 26}{c +}{hline 35}
                    Total {c |}{res}        526      100.00

{txt}{hline}
-> nuts_region = North West

     Time to rheumatology {c |}
               assessment {c |}      Freq.     Percent        Cum.
{hline 26}{c +}{hline 35}
Assessment delay >3 weeks {c |}{res}        495       95.01       95.01
{txt}      Seen within 3 weeks {c |}{res}         26        4.99      100.00
{txt}{hline 26}{c +}{hline 35}
                    Total {c |}{res}        521      100.00

{txt}{hline}
-> nuts_region = South East

     Time to rheumatology {c |}
               assessment {c |}      Freq.     Percent        Cum.
{hline 26}{c +}{hline 35}
Assessment delay >3 weeks {c |}{res}        983       94.79       94.79
{txt}      Seen within 3 weeks {c |}{res}         54        5.21      100.00
{txt}{hline 26}{c +}{hline 35}
                    Total {c |}{res}      1,037      100.00

{txt}{hline}
-> nuts_region = West Midlands

     Time to rheumatology {c |}
               assessment {c |}      Freq.     Percent        Cum.
{hline 26}{c +}{hline 35}
Assessment delay >3 weeks {c |}{res}        466       94.91       94.91
{txt}      Seen within 3 weeks {c |}{res}         25        5.09      100.00
{txt}{hline 26}{c +}{hline 35}
                    Total {c |}{res}        491      100.00

{txt}{hline}
-> nuts_region = Yorkshire and the Humber

     Time to rheumatology {c |}
               assessment {c |}      Freq.     Percent        Cum.
{hline 26}{c +}{hline 35}
Assessment delay >3 weeks {c |}{res}        489       92.61       92.61
{txt}      Seen within 3 weeks {c |}{res}         39        7.39      100.00
{txt}{hline 26}{c +}{hline 35}
                    Total {c |}{res}        528      100.00

{txt}
{com}. 
. **Time from rheum ref or last GP to rheum appt (combined - sensitivity analysis; includes those with no rheum ref)
. gen time_refgp_rheum_appt = time_ref_rheum_appt
{txt}(28,912 missing values generated)

{com}. replace time_refgp_rheum_appt = time_gp_rheum_appt if time_ref_rheum_appt==. & time_gp_rheum_appt!=.
{txt}(3,418 real changes made)

{com}. bys eia_diagnosis: tabstat time_refgp_rheum_appt, stats (n mean p50 p25 p75)

{txt}{hline}
-> eia_diagnosis = RA

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_refgp~t} {...}
{c |}{...}
 {res}     2840  268.4623       209        97       386
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = PsA

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_refgp~t} {...}
{c |}{...}
 {res}     2840  271.3423       212        92       392
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = AxSpA

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_refgp~t} {...}
{c |}{...}
 {res}     2922   270.873       214        99       386
{txt}{hline 13}{c BT}{hline 50}

{com}. bys diagnosis_year: tabstat time_refgp_rheum_appt, stats (n mean p50 p25 p75) //all patients by diagnosis year

{txt}{hline}
-> diagnosis_year = March 2019-March 2020

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_refgp~t} {...}
{c |}{...}
 {res}     1544  174.3756       150      67.5       252
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> diagnosis_year = March 2020-March 2021

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_refgp~t} {...}
{c |}{...}
 {res}     2822  250.1155       203        96       365
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> diagnosis_year = March 2021-March 2022

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_refgp~t} {...}
{c |}{...}
 {res}     3689  312.3792       248       112       461
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> diagnosis_year = .

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_refgp~t} {...}
{c |}{...}
 {res}      547  360.3419       300       137       520
{txt}{hline 13}{c BT}{hline 50}

{com}. bys nuts_region: tabstat time_refgp_rheum_appt, stats (n mean p50 p25 p75) //by region

{txt}{hline}
-> nuts_region = East Midlands

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_refgp~t} {...}
{c |}{...}
 {res}      839  262.6377       201        93       381
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = East of England

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_refgp~t} {...}
{c |}{...}
 {res}      888  264.2804       209        94     366.5
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = London

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_refgp~t} {...}
{c |}{...}
 {res}     1698  271.8098     219.5        99       392
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = North East

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_refgp~t} {...}
{c |}{...}
 {res}      902  275.0344       218        89       391
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = North West

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_refgp~t} {...}
{c |}{...}
 {res}      858  277.4592       214        99       394
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = South East

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_refgp~t} {...}
{c |}{...}
 {res}     1739  269.9718       211        98       395
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = West Midlands

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_refgp~t} {...}
{c |}{...}
 {res}      811  272.6128       208        97       392
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = Yorkshire and the Humber

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_refgp~t} {...}
{c |}{...}
 {res}      867  266.7336       213        92       393
{txt}{hline 13}{c BT}{hline 50}

{com}. 
. **Time from rheum ref to EIA code (sensitivity analysis; includes those with no rheum appt)
. gen time_ref_rheum_eia = (eia_code_date - referral_rheum_precode_date) if eia_code_date!=. & referral_rheum_precode_date!=. & referral_rheum_precode_date<eia_code_date  
{txt}(15,270 missing values generated)

{com}. tabstat time_ref_rheum_eia, stats (n mean p50 p25 p75)

{txt}{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_ref_r~a} {...}
{c |}{...}
 {res}    18826  520.2818       467       231       763
{txt}{hline 13}{c BT}{hline 50}

{com}. bys eia_diagnosis: tabstat time_ref_rheum_eia, stats (n mean p50 p25 p75)

{txt}{hline}
-> eia_diagnosis = RA

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_ref_r~a} {...}
{c |}{...}
 {res}     6214  522.3973     467.5       230       777
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = PsA

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_ref_r~a} {...}
{c |}{...}
 {res}     6271  522.2491       475       235       758
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = AxSpA

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_ref_r~a} {...}
{c |}{...}
 {res}     6341  516.2632       462       228       757
{txt}{hline 13}{c BT}{hline 50}

{com}. 
. **Time from rheum ref to EIA diagnosis (combined - sensitivity analysis; includes those with no rheum appt)
. gen time_ref_rheum_eia_comb = time_ref_rheum_appt
{txt}(28,912 missing values generated)

{com}. replace time_ref_rheum_eia_comb = time_ref_rheum_eia if time_ref_rheum_appt==. & time_ref_rheum_eia!=.
{txt}(15,590 real changes made)

{com}. tabstat time_ref_rheum_eia_comb, stats (n mean p50 p25 p75)

{txt}{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_ref_r~b} {...}
{c |}{...}
 {res}    20774   454.985       387       178       671
{txt}{hline 13}{c BT}{hline 50}

{com}. bys eia_diagnosis: tabstat time_ref_rheum_eia_comb, stats (n mean p50 p25 p75)

{txt}{hline}
-> eia_diagnosis = RA

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_ref_r~b} {...}
{c |}{...}
 {res}     6878  455.6438     384.5       175       675
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = PsA

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_ref_r~b} {...}
{c |}{...}
 {res}     6900  456.6677       391       181       669
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = AxSpA

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_ref_r~b} {...}
{c |}{...}
 {res}     6996  452.6777       384     176.5       667
{txt}{hline 13}{c BT}{hline 50}

{com}. 
. **Time from rheum appt to EIA code (i.e. if appts are present and in correct time order)
. gen time_rheum_eia_code = (eia_code_date - rheum_appt_date) if eia_code_date!=. & rheum_appt_date!=. & rheum_appt_date<eia_code_date 
{txt}(11,143 missing values generated)

{com}. tabstat time_rheum_eia_code, stats (n mean p50 p25 p75) 

{txt}{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_rheum~e} {...}
{c |}{...}
 {res}    22953  602.8121       572       316       868
{txt}{hline 13}{c BT}{hline 50}

{com}. bys eia_diagnosis: tabstat time_rheum_eia_code, stats (n mean p50 p25 p75) 

{txt}{hline}
-> eia_diagnosis = RA

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_rheum~e} {...}
{c |}{...}
 {res}     7609  607.9434       575       318       878
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = PsA

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_rheum~e} {...}
{c |}{...}
 {res}     7598  605.9462       577       316       871
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = AxSpA

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_rheum~e} {...}
{c |}{...}
 {res}     7746  594.6975       562       312       850
{txt}{hline 13}{c BT}{hline 50}

{com}. 
. *Time to first csDMARD prescriptions - all of the below are shared care prescriptions, aside from those with MTX_high cost drug data included======================================================================*/
. 
. *All patients below must have at least six months of GP registration after EIA code
. 
. **Time to first csDMARD script for RA patients, whereby first rheum appt is classed as diagnosis date (if rheum appt present and before csDMARD date; not including high cost MTX prescriptions)
. gen time_to_csdmard=(csdmard_date-rheum_appt_date) if csdmard==1 & rheum_appt_date!=. & csdmard_date>rheum_appt_date 
{txt}(24,238 missing values generated)

{com}. tabstat time_to_csdmard if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75)

{txt}{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_cs~d} {...}
{c |}{...}
 {res}     3128  571.9639       533       290       833
{txt}{hline 13}{c BT}{hline 50}

{com}. bys diagnosis_year: tabstat time_to_csdmard if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by diagnosis year

{txt}{hline}
-> diagnosis_year = March 2019-March 2020

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_cs~d} {...}
{c |}{...}
 {res}      967   565.577       531       285       816
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> diagnosis_year = March 2020-March 2021

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_cs~d} {...}
{c |}{...}
 {res}      990  576.8646     540.5       295       838
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> diagnosis_year = March 2021-March 2022

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_cs~d} {...}
{c |}{...}
 {res}     1040  572.8202       530       291     829.5
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> diagnosis_year = .

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_cs~d} {...}
{c |}{...}
 {res}      131  575.2748       518       270       861
{txt}{hline 13}{c BT}{hline 50}

{com}. bys nuts_region: tabstat time_to_csdmard if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by region

{txt}{hline}
-> nuts_region = East Midlands

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_cs~d} {...}
{c |}{...}
 {res}      303  570.2541       551       249       844
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = East of England

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_cs~d} {...}
{c |}{...}
 {res}      281  581.1103       548       299       831
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = London

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_cs~d} {...}
{c |}{...}
 {res}      661  571.8215       526       304       835
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = North East

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_cs~d} {...}
{c |}{...}
 {res}      339  574.4867       539       282       865
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = North West

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_cs~d} {...}
{c |}{...}
 {res}      321  558.0405       536       286       779
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = South East

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_cs~d} {...}
{c |}{...}
 {res}      630  573.2651     527.5       293       837
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = West Midlands

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_cs~d} {...}
{c |}{...}
 {res}      298  553.9765       491       251       785
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = Yorkshire and the Humber

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_cs~d} {...}
{c |}{...}
 {res}      295  592.9695       593       320       866
{txt}{hline 13}{c BT}{hline 50}

{com}. 
. **Time to first csDMARD script for RA patients (including high cost MTX prescriptions)
. gen time_to_csdmard_hcd=(csdmard_hcd_date-rheum_appt_date) if csdmard_hcd==1 & rheum_appt_date!=. & csdmard_hcd_date>rheum_appt_date 
{txt}(22,937 missing values generated)

{com}. tabstat time_to_csdmard_hcd if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) 

{txt}{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_c~cd} {...}
{c |}{...}
 {res}     3565  560.2536       520       284       808
{txt}{hline 13}{c BT}{hline 50}

{com}. 
. **Time to first csDMARD script for PsA patients (not including high cost MTX prescriptions)
. tabstat time_to_csdmard if psa_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75)

{txt}{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_c~rd} {...}
{c |}{...}
 {res}     3087  583.1765       546       286       845
{txt}{hline 13}{c BT}{hline 50}

{com}. bys diagnosis_year: tabstat time_to_csdmard if psa_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by diagnosis year

{txt}{hline}
-> diagnosis_year = March 2019-March 2020

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_c~rd} {...}
{c |}{...}
 {res}     1010  560.3505       503       273       793
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> diagnosis_year = March 2020-March 2021

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_c~rd} {...}
{c |}{...}
 {res}      962  587.6694       566       276       866
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> diagnosis_year = March 2021-March 2022

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_c~rd} {...}
{c |}{...}
 {res}      971  601.7425       557       323       877
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> diagnosis_year = .

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_c~rd} {...}
{c |}{...}
 {res}      144  588.0694       570       275     872.5
{txt}{hline 13}{c BT}{hline 50}

{com}. bys nuts_region: tabstat time_to_csdmard if psa_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by region

{txt}{hline}
-> nuts_region = East Midlands

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_c~rd} {...}
{c |}{...}
 {res}      313  596.6645       581       296       843
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = East of England

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_c~rd} {...}
{c |}{...}
 {res}      301  570.0299       522       276       842
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = London

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_c~rd} {...}
{c |}{...}
 {res}      622  570.6045     546.5       283       841
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = North East

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_c~rd} {...}
{c |}{...}
 {res}      315  571.4889       537       252       830
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = North West

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_c~rd} {...}
{c |}{...}
 {res}      301  579.6512       538       328       822
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = South East

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_c~rd} {...}
{c |}{...}
 {res}      652  587.4448       548     274.5       854
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = West Midlands

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_c~rd} {...}
{c |}{...}
 {res}      295  602.8271       558       308       890
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = Yorkshire and the Humber

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_c~rd} {...}
{c |}{...}
 {res}      288  596.0868     544.5     318.5     871.5
{txt}{hline 13}{c BT}{hline 50}

{com}. 
. **Time to first csDMARD script for PsA patients (including high cost MTX prescriptions)
. tabstat time_to_csdmard_hcd if psa_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) 

{txt}{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_c~cd} {...}
{c |}{...}
 {res}     3495  571.4183       530       277       835
{txt}{hline 13}{c BT}{hline 50}

{com}. 
. **csDMARD time categories for RA patients (not including high cost MTX prescriptions) - consider restricting to patients with only 12m follow-up
. gen csdmard_6w=1 if time_to_csdmard<=42 & time_to_csdmard!=. 
{txt}(33,793 missing values generated)

{com}. recode csdmard_6w .=0
{txt}(33793 changes made to {bf:csdmard_6w})

{com}. tab csdmard_6w if ra_code==1 & has_6m_follow_up==1

 {txt}csdmard_6w {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     10,612       99.14       99.14
{txt}          1 {c |}{res}         92        0.86      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     10,704      100.00
{txt}
{com}. gen csdmard_3m=1 if time_to_csdmard<=90 & time_to_csdmard!=. 
{txt}(33,399 missing values generated)

{com}. recode csdmard_3m .=0
{txt}(33399 changes made to {bf:csdmard_3m})

{com}. tab csdmard_3m if ra_code==1 & has_6m_follow_up==1

 {txt}csdmard_3m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     10,482       97.93       97.93
{txt}          1 {c |}{res}        222        2.07      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     10,704      100.00
{txt}
{com}. gen csdmard_6m=1 if time_to_csdmard<=180 & time_to_csdmard!=. 
{txt}(32,629 missing values generated)

{com}. recode csdmard_6m .=0
{txt}(32629 changes made to {bf:csdmard_6m})

{com}. tab csdmard_6m if ra_code==1 & has_6m_follow_up==1

 {txt}csdmard_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     10,235       95.62       95.62
{txt}          1 {c |}{res}        469        4.38      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     10,704      100.00
{txt}
{com}. gen csdmard_12m=1 if time_to_csdmard<=365 & time_to_csdmard!=. 
{txt}(30,843 missing values generated)

{com}. recode csdmard_12m .=0
{txt}(30843 changes made to {bf:csdmard_12m})

{com}. tab csdmard_12m if ra_code==1 & has_12m_follow_up==1 //for patients with at least 12m registration

{txt}csdmard_12m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      9,256       90.35       90.35
{txt}          1 {c |}{res}        989        9.65      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     10,245      100.00
{txt}
{com}. lab define csdmard_6m 0 "No" 1 "Yes", modify
{txt}
{com}. lab val csdmard_6m csdmard_6m
{txt}
{com}. lab var csdmard_6m "csDMARD within 6 months"
{txt}
{com}. lab define csdmard_12m 0 "No" 1 "Yes", modify
{txt}
{com}. lab val csdmard_12m csdmard_12m
{txt}
{com}. lab var csdmard_12m "csDMARD within 12 months"
{txt}
{com}. 
. **csDMARD time categories for RA patients (including high cost MTX prescriptions)
. gen csdmard_hcd_6w=1 if time_to_csdmard_hcd<=42 & time_to_csdmard_hcd!=.
{txt}(33,737 missing values generated)

{com}. recode csdmard_hcd_6w .=0
{txt}(33737 changes made to {bf:csdmard_hcd_6w})

{com}. tab csdmard_hcd_6w if ra_code==1 & has_6m_follow_up==1

{txt}csdmard_hcd {c |}
        _6w {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     10,601       99.04       99.04
{txt}          1 {c |}{res}        103        0.96      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     10,704      100.00
{txt}
{com}. gen csdmard_hcd_3m=1 if time_to_csdmard_hcd<=90 & time_to_csdmard_hcd!=.
{txt}(33,281 missing values generated)

{com}. recode csdmard_hcd_3m .=0
{txt}(33281 changes made to {bf:csdmard_hcd_3m})

{com}. tab csdmard_hcd_3m if ra_code==1 & has_6m_follow_up==1

{txt}csdmard_hcd {c |}
        _3m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     10,455       97.67       97.67
{txt}          1 {c |}{res}        249        2.33      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     10,704      100.00
{txt}
{com}. gen csdmard_hcd_6m=1 if time_to_csdmard_hcd<=180 & time_to_csdmard_hcd!=.
{txt}(32,391 missing values generated)

{com}. recode csdmard_hcd_6m .=0
{txt}(32391 changes made to {bf:csdmard_hcd_6m})

{com}. tab csdmard_hcd_6m if ra_code==1 & has_6m_follow_up==1

{txt}csdmard_hcd {c |}
        _6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     10,173       95.04       95.04
{txt}          1 {c |}{res}        531        4.96      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     10,704      100.00
{txt}
{com}. gen csdmard_hcd_12m=1 if time_to_csdmard_hcd<=365 & time_to_csdmard_hcd!=.
{txt}(30,290 missing values generated)

{com}. recode csdmard_hcd_12m .=0
{txt}(30290 changes made to {bf:csdmard_hcd_12m})

{com}. tab csdmard_hcd_12m if ra_code==1 & has_12m_follow_up==1 //for patients with at least 12m registration

{txt}csdmard_hcd {c |}
       _12m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      9,084       88.67       88.67
{txt}          1 {c |}{res}      1,161       11.33      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     10,245      100.00
{txt}
{com}. 
. **csDMARD time categories for PsA patients (not including high cost MTX prescriptions)
. tab csdmard_6w if psa_code==1 & has_6m_follow_up==1

 {txt}csdmard_6w {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     10,646       99.11       99.11
{txt}          1 {c |}{res}         96        0.89      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     10,742      100.00
{txt}
{com}. tab csdmard_3m if psa_code==1 & has_6m_follow_up==1

 {txt}csdmard_3m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     10,532       98.05       98.05
{txt}          1 {c |}{res}        210        1.95      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     10,742      100.00
{txt}
{com}. tab csdmard_6m if psa_code==1 & has_6m_follow_up==1

    {txt}csDMARD {c |}
   within 6 {c |}
     months {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
         No {c |}{res}     10,297       95.86       95.86
{txt}        Yes {c |}{res}        445        4.14      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     10,742      100.00
{txt}
{com}. tab csdmard_12m if psa_code==1 & has_12m_follow_up==1

    {txt}csDMARD {c |}
  within 12 {c |}
     months {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
         No {c |}{res}      9,208       90.81       90.81
{txt}        Yes {c |}{res}        932        9.19      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     10,140      100.00
{txt}
{com}. 
. **csDMARD time categories for PsA patients (including high cost MTX prescriptions)
. tab csdmard_hcd_6w if psa_code==1 & has_6m_follow_up==1

{txt}csdmard_hcd {c |}
        _6w {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     10,619       98.85       98.85
{txt}          1 {c |}{res}        123        1.15      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     10,742      100.00
{txt}
{com}. tab csdmard_hcd_3m if psa_code==1 & has_6m_follow_up==1

{txt}csdmard_hcd {c |}
        _3m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     10,490       97.65       97.65
{txt}          1 {c |}{res}        252        2.35      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     10,742      100.00
{txt}
{com}. tab csdmard_hcd_6m if psa_code==1 & has_6m_follow_up==1

{txt}csdmard_hcd {c |}
        _6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     10,218       95.12       95.12
{txt}          1 {c |}{res}        524        4.88      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     10,742      100.00
{txt}
{com}. tab csdmard_hcd_12m if psa_code==1 & has_12m_follow_up==1

{txt}csdmard_hcd {c |}
       _12m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      9,048       89.23       89.23
{txt}          1 {c |}{res}      1,092       10.77      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     10,140      100.00
{txt}
{com}. 
. **What was first shared care csDMARD (not including high cost MTX prescriptions)
. gen first_csD=""
{txt}(34,096 missing values generated)

{com}. foreach var of varlist hydroxychloroquine_date leflunomide_date methotrexate_date methotrexate_inj_date sulfasalazine_date {c -(}
{txt}  2{com}.         replace first_csD="`var'" if csdmard_date==`var' & csdmard_date!=.
{txt}  3{com}.         {c )-}
{txt}variable {bf}{res}first_csD{sf}{txt} was {bf}{res}str1{sf}{txt} now {bf}{res}str23{sf}
{txt}(2,458 real changes made)
(2,454 real changes made)
(2,487 real changes made)
(2,392 real changes made)
(2,447 real changes made)

{com}. gen first_csDMARD = substr(first_csD, 1, length(first_csD) - 5) if first_csD!=""
{txt}(21,860 missing values generated)

{com}. drop first_csD
{txt}
{com}. tab first_csDMARD if ra_code==1 & has_6m_follow_up==1 //for RA patients

     {txt}first_csDMARD {c |}      Freq.     Percent        Cum.
{hline 19}{c +}{hline 35}
hydroxychloroquine {c |}{res}        786       20.11       20.11
{txt}       leflunomide {c |}{res}        786       20.11       40.23
{txt}      methotrexate {c |}{res}        827       21.16       61.39
{txt}  methotrexate_inj {c |}{res}        749       19.17       80.55
{txt}     sulfasalazine {c |}{res}        760       19.45      100.00
{txt}{hline 19}{c +}{hline 35}
             Total {c |}{res}      3,908      100.00
{txt}
{com}. tab first_csDMARD if psa_code==1 & has_6m_follow_up==1 //for PsA patients

     {txt}first_csDMARD {c |}      Freq.     Percent        Cum.
{hline 19}{c +}{hline 35}
hydroxychloroquine {c |}{res}        749       19.57       19.57
{txt}       leflunomide {c |}{res}        747       19.51       39.08
{txt}      methotrexate {c |}{res}        788       20.59       59.67
{txt}  methotrexate_inj {c |}{res}        732       19.12       78.79
{txt}     sulfasalazine {c |}{res}        812       21.21      100.00
{txt}{hline 19}{c +}{hline 35}
             Total {c |}{res}      3,828      100.00
{txt}
{com}. 
. **What was first csDMARD (including high cost MTX prescriptions)
. gen first_csD_hcd=""
{txt}(34,096 missing values generated)

{com}. foreach var of varlist hydroxychloroquine_date leflunomide_date methotrexate_date methotrexate_inj_date methotrexate_hcd_date sulfasalazine_date {c -(}
{txt}  2{com}.         replace first_csD_hcd="`var'" if csdmard_hcd_date==`var' & csdmard_hcd_date!=.
{txt}  3{com}.         {c )-}
{txt}variable {bf}{res}first_csD_hcd{sf}{txt} was {bf}{res}str1{sf}{txt} now {bf}{res}str23{sf}
{txt}(2,321 real changes made)
(2,314 real changes made)
(2,356 real changes made)
(2,273 real changes made)
(2,822 real changes made)
(2,318 real changes made)

{com}. gen first_csDMARD_hcd = substr(first_csD_hcd, 1, length(first_csD_hcd) - 5) if first_csD_hcd!=""
{txt}(19,693 missing values generated)

{com}. drop first_csD_hcd
{txt}
{com}. tab first_csDMARD_hcd if ra_code==1 & has_6m_follow_up==1 //for RA patients

 {txt}first_csDMARD_hcd {c |}      Freq.     Percent        Cum.
{hline 19}{c +}{hline 35}
hydroxychloroquine {c |}{res}        744       16.16       16.16
{txt}       leflunomide {c |}{res}        748       16.25       32.41
{txt}      methotrexate {c |}{res}        782       16.99       49.39
{txt}  methotrexate_hcd {c |}{res}        905       19.66       69.05
{txt}  methotrexate_inj {c |}{res}        709       15.40       84.45
{txt}     sulfasalazine {c |}{res}        716       15.55      100.00
{txt}{hline 19}{c +}{hline 35}
             Total {c |}{res}      4,604      100.00
{txt}
{com}. tab first_csDMARD_hcd if psa_code==1 & has_6m_follow_up==1 //for PsA patients

 {txt}first_csDMARD_hcd {c |}      Freq.     Percent        Cum.
{hline 19}{c +}{hline 35}
hydroxychloroquine {c |}{res}        705       15.53       15.53
{txt}       leflunomide {c |}{res}        702       15.46       30.99
{txt}      methotrexate {c |}{res}        741       16.32       47.31
{txt}  methotrexate_hcd {c |}{res}        932       20.53       67.84
{txt}  methotrexate_inj {c |}{res}        696       15.33       83.17
{txt}     sulfasalazine {c |}{res}        764       16.83      100.00
{txt}{hline 19}{c +}{hline 35}
             Total {c |}{res}      4,540      100.00
{txt}
{com}.  
. **Methotrexate use (not including high cost MTX prescriptions)
. gen mtx=1 if methotrexate==1 | methotrexate_inj==1
{txt}(28,543 missing values generated)

{com}. recode mtx .=0 
{txt}(28543 changes made to {bf:mtx})

{com}. tab mtx if ra_code==1 & has_6m_follow_up==1 //for RA patients; Nb. this is just a check; need time-to-MTX instead (below)

        {txt}mtx {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      8,893       83.08       83.08
{txt}          1 {c |}{res}      1,811       16.92      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     10,704      100.00
{txt}
{com}. tab mtx if psa_code==1 & has_6m_follow_up==1 //for PsA patients

        {txt}mtx {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      9,036       84.12       84.12
{txt}          1 {c |}{res}      1,706       15.88      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     10,742      100.00
{txt}
{com}. 
. **Methotrexate use (including high cost MTX prescriptions)
. gen mtx_hcd=1 if methotrexate==1 | methotrexate_inj==1 | methotrexate_hcd==1
{txt}(25,701 missing values generated)

{com}. recode mtx_hcd .=0 
{txt}(25701 changes made to {bf:mtx_hcd})

{com}. tab mtx_hcd if ra_code==1 & has_6m_follow_up==1 //for RA patients

    {txt}mtx_hcd {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      7,995       74.69       74.69
{txt}          1 {c |}{res}      2,709       25.31      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     10,704      100.00
{txt}
{com}. tab mtx_hcd if psa_code==1 & has_6m_follow_up==1 //for PsA patients

    {txt}mtx_hcd {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      8,096       75.37       75.37
{txt}          1 {c |}{res}      2,646       24.63      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     10,742      100.00
{txt}
{com}. 
. **Date of first methotrexate script (not including high cost MTX prescriptions)
. gen mtx_date=min(methotrexate_date, methotrexate_inj_date)
{txt}(28,543 missing values generated)

{com}. format %td mtx_date
{txt}
{com}. 
. **Date of first methotrexate script (including high cost MTX prescriptions)
. gen mtx_hcd_date=min(methotrexate_date, methotrexate_inj_date, methotrexate_hcd_date)
{txt}(25,701 missing values generated)

{com}. format %td mtx_hcd_date
{txt}
{com}. 
. **Time to first methotrexate script for RA patients (not including high cost MTX prescriptions)
. gen time_to_mtx=(mtx_date-rheum_appt_date) if mtx==1 & rheum_appt_date!=. & mtx_date>rheum_appt_date 
{txt}(29,638 missing values generated)

{com}. tabstat time_to_mtx if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75)

{txt}{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_mtx} {...}
{c |}{...}
 {res}     1438  600.7851       568       311       874
{txt}{hline 13}{c BT}{hline 50}

{com}. bys diagnosis_year: tabstat time_to_mtx if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by diagnosis year

{txt}{hline}
-> diagnosis_year = March 2019-March 2020

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_mtx} {...}
{c |}{...}
 {res}      425  588.6565       563       261       876
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> diagnosis_year = March 2020-March 2021

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_mtx} {...}
{c |}{...}
 {res}      470  600.3957       574       332       864
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> diagnosis_year = March 2021-March 2022

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_mtx} {...}
{c |}{...}
 {res}      478  604.5607     555.5       324       867
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> diagnosis_year = .

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_mtx} {...}
{c |}{...}
 {res}       65  655.1385       620       344       929
{txt}{hline 13}{c BT}{hline 50}

{com}. bys nuts_region: tabstat time_to_mtx if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by region

{txt}{hline}
-> nuts_region = East Midlands

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_mtx} {...}
{c |}{...}
 {res}      160  600.5812     596.5     276.5     896.5
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = East of England

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_mtx} {...}
{c |}{...}
 {res}      127  633.7165       607       332       946
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = London

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_mtx} {...}
{c |}{...}
 {res}      309  592.2492       556       309       869
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = North East

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_mtx} {...}
{c |}{...}
 {res}      145  605.9034       546       300       886
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = North West

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_mtx} {...}
{c |}{...}
 {res}      144  592.9792       561       300       842
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = South East

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_mtx} {...}
{c |}{...}
 {res}      289  599.4913       572       330       851
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = West Midlands

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_mtx} {...}
{c |}{...}
 {res}      128  553.3672     522.5       245       778
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = Yorkshire and the Humber

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_mtx} {...}
{c |}{...}
 {res}      136  639.8529       628     357.5     908.5
{txt}{hline 13}{c BT}{hline 50}

{com}. 
. **Time to first methotrexate script for RA patients (including high cost MTX prescriptions)
. gen time_to_mtx_hcd=(mtx_hcd_date-rheum_appt_date) if mtx_hcd==1 & rheum_appt_date!=. & mtx_hcd_date>rheum_appt_date 
{txt}(27,777 missing values generated)

{com}. tabstat time_to_mtx_hcd if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75)

{txt}{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_mt~d} {...}
{c |}{...}
 {res}     2042  585.0485       543       305       843
{txt}{hline 13}{c BT}{hline 50}

{com}. 
. **Time to first methotrexate script for PsA patients (not including high cost MTX prescriptions)
. tabstat time_to_mtx if psa_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75)

{txt}{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_mtx} {...}
{c |}{...}
 {res}     1380  607.6804       579     325.5       877
{txt}{hline 13}{c BT}{hline 50}

{com}. bys diagnosis_year: tabstat time_to_mtx if psa_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by diagnosis year

{txt}{hline}
-> diagnosis_year = March 2019-March 2020

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_mtx} {...}
{c |}{...}
 {res}      441  582.4649       526       297       841
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> diagnosis_year = March 2020-March 2021

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_mtx} {...}
{c |}{...}
 {res}      441  614.8526       605       327       883
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> diagnosis_year = March 2021-March 2022

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_mtx} {...}
{c |}{...}
 {res}      430  614.7419       579       340       885
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> diagnosis_year = .

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_mtx} {...}
{c |}{...}
 {res}       68  680.0441       687     383.5       959
{txt}{hline 13}{c BT}{hline 50}

{com}. bys nuts_region: tabstat time_to_mtx if psa_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by region

{txt}{hline}
-> nuts_region = East Midlands

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_mtx} {...}
{c |}{...}
 {res}      124  565.6935       526     296.5       791
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = East of England

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_mtx} {...}
{c |}{...}
 {res}      129  584.3876       549       304       884
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = London

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_mtx} {...}
{c |}{...}
 {res}      280     588.4     590.5       315       838
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = North East

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_mtx} {...}
{c |}{...}
 {res}      156  588.3397     548.5       255     882.5
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = North West

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_mtx} {...}
{c |}{...}
 {res}      146  662.7877     661.5       418       887
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = South East

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_mtx} {...}
{c |}{...}
 {res}      282   615.695       572       319       886
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = West Midlands

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_mtx} {...}
{c |}{...}
 {res}      140  615.1071       561     358.5     897.5
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = Yorkshire and the Humber

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_mtx} {...}
{c |}{...}
 {res}      123  650.6179       641       360       907
{txt}{hline 13}{c BT}{hline 50}

{com}. 
. **Time to first methotrexate script for PsA patients (including high cost MTX prescriptions)
. tabstat time_to_mtx_hcd if psa_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75)

{txt}{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_mt~d} {...}
{c |}{...}
 {res}     1972  592.9295     559.5     316.5       857
{txt}{hline 13}{c BT}{hline 50}

{com}. 
. **Methotrexate time categories for RA patients (not including high-cost MTX) //Nb. this is time period from rheum appt (i.e. diagnosis) to shared care, not from referral to first script 
. gen mtx_6w=1 if time_to_mtx<=42 & time_to_mtx!=.
{txt}(33,970 missing values generated)

{com}. recode mtx_6w .=0
{txt}(33970 changes made to {bf:mtx_6w})

{com}. tab mtx_6w if ra_code==1 & has_6m_follow_up==1

     {txt}mtx_6w {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     10,669       99.67       99.67
{txt}          1 {c |}{res}         35        0.33      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     10,704      100.00
{txt}
{com}. gen mtx_3m=1 if time_to_mtx<=90 & time_to_mtx!=.
{txt}(33,824 missing values generated)

{com}. recode mtx_3m .=0
{txt}(33824 changes made to {bf:mtx_3m})

{com}. tab mtx_3m if ra_code==1 & has_6m_follow_up==1

     {txt}mtx_3m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     10,620       99.22       99.22
{txt}          1 {c |}{res}         84        0.78      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     10,704      100.00
{txt}
{com}. gen mtx_6m=1 if time_to_mtx<=180 & time_to_mtx!=.
{txt}(33,489 missing values generated)

{com}. recode mtx_6m .=0
{txt}(33489 changes made to {bf:mtx_6m})

{com}. tab mtx_6m if ra_code==1 & has_6m_follow_up==1

     {txt}mtx_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     10,510       98.19       98.19
{txt}          1 {c |}{res}        194        1.81      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     10,704      100.00
{txt}
{com}. gen mtx_12m=1 if time_to_mtx<=365 & time_to_mtx!=. 
{txt}(32,729 missing values generated)

{com}. recode mtx_12m .=0 
{txt}(32729 changes made to {bf:mtx_12m})

{com}. tab mtx_12m if ra_code==1 & has_12m_follow_up==1 //with a least 12m registration

    {txt}mtx_12m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      9,818       95.83       95.83
{txt}          1 {c |}{res}        427        4.17      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     10,245      100.00
{txt}
{com}. lab define mtx_6m 0 "No" 1 "Yes", modify
{txt}
{com}. lab val mtx_6m mtx_6m
{txt}
{com}. lab var mtx_6m "Methotrexate within 6 months"
{txt}
{com}. lab define mtx_12m 0 "No" 1 "Yes", modify
{txt}
{com}. lab val mtx_12m mtx_12m
{txt}
{com}. lab var mtx_12m "Methotrexate within 12 months"
{txt}
{com}. 
. **Methotrexate time categories for RA patients (including high-cost MTX)
. gen mtx_hcd_6w=1 if time_to_mtx_hcd<=42 & time_to_mtx_hcd!=.
{txt}(33,907 missing values generated)

{com}. recode mtx_hcd_6w .=0
{txt}(33907 changes made to {bf:mtx_hcd_6w})

{com}. tab mtx_hcd_6w if ra_code==1 & has_6m_follow_up==1

 {txt}mtx_hcd_6w {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     10,656       99.55       99.55
{txt}          1 {c |}{res}         48        0.45      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     10,704      100.00
{txt}
{com}. gen mtx_hcd_3m=1 if time_to_mtx_hcd<=90 & time_to_mtx_hcd!=.
{txt}(33,689 missing values generated)

{com}. recode mtx_hcd_3m .=0
{txt}(33689 changes made to {bf:mtx_hcd_3m})

{com}. tab mtx_hcd_3m if ra_code==1 & has_6m_follow_up==1

 {txt}mtx_hcd_3m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     10,589       98.93       98.93
{txt}          1 {c |}{res}        115        1.07      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     10,704      100.00
{txt}
{com}. gen mtx_hcd_6m=1 if time_to_mtx_hcd<=180 & time_to_mtx_hcd!=.
{txt}(33,215 missing values generated)

{com}. recode mtx_hcd_6m .=0
{txt}(33215 changes made to {bf:mtx_hcd_6m})

{com}. tab mtx_hcd_6m if ra_code==1 & has_6m_follow_up==1

 {txt}mtx_hcd_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     10,438       97.51       97.51
{txt}          1 {c |}{res}        266        2.49      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     10,704      100.00
{txt}
{com}. gen mtx_hcd_12m=1 if time_to_mtx_hcd<=365 & time_to_mtx_hcd!=.
{txt}(32,078 missing values generated)

{com}. recode mtx_hcd_12m .=0
{txt}(32078 changes made to {bf:mtx_hcd_12m})

{com}. tab mtx_hcd_12m if ra_code==1 & has_12m_follow_up==1 //with a least 12m registration

{txt}mtx_hcd_12m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      9,621       93.91       93.91
{txt}          1 {c |}{res}        624        6.09      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     10,245      100.00
{txt}
{com}. 
. **Methotrexate time categories for PsA patients (not including high-cost MTX)
. tab mtx_6w if psa_code==1 & has_6m_follow_up==1

     {txt}mtx_6w {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     10,705       99.66       99.66
{txt}          1 {c |}{res}         37        0.34      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     10,742      100.00
{txt}
{com}. tab mtx_3m if psa_code==1 & has_6m_follow_up==1

     {txt}mtx_3m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     10,669       99.32       99.32
{txt}          1 {c |}{res}         73        0.68      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     10,742      100.00
{txt}
{com}. tab mtx_6m if psa_code==1 & has_6m_follow_up==1

{txt}Methotrexat {c |}
 e within 6 {c |}
     months {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
         No {c |}{res}     10,563       98.33       98.33
{txt}        Yes {c |}{res}        179        1.67      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     10,742      100.00
{txt}
{com}. tab mtx_12m if psa_code==1 & has_12m_follow_up==1 //with a least 12m registration

{txt}Methotrexat {c |}
e within 12 {c |}
     months {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
         No {c |}{res}      9,745       96.10       96.10
{txt}        Yes {c |}{res}        395        3.90      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     10,140      100.00
{txt}
{com}. 
. **Methotrexate time categories for PsA patients (including high-cost MTX)
. tab mtx_hcd_6w if psa_code==1 & has_6m_follow_up==1

 {txt}mtx_hcd_6w {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     10,676       99.39       99.39
{txt}          1 {c |}{res}         66        0.61      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     10,742      100.00
{txt}
{com}. tab mtx_hcd_3m if psa_code==1 & has_6m_follow_up==1

 {txt}mtx_hcd_3m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     10,619       98.85       98.85
{txt}          1 {c |}{res}        123        1.15      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     10,742      100.00
{txt}
{com}. tab mtx_hcd_6m if psa_code==1 & has_6m_follow_up==1

 {txt}mtx_hcd_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     10,471       97.48       97.48
{txt}          1 {c |}{res}        271        2.52      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     10,742      100.00
{txt}
{com}. tab mtx_hcd_12m if psa_code==1 & has_12m_follow_up==1 //with a least 12m registration

{txt}mtx_hcd_12m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      9,559       94.27       94.27
{txt}          1 {c |}{res}        581        5.73      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     10,140      100.00
{txt}
{com}. 
. **Sulfasalazine use
. gen time_to_ssz=(sulfasalazine_date-rheum_appt_date) if sulfasalazine==1 & rheum_appt_date!=. & sulfasalazine_date>rheum_appt_date 
{txt}(31,729 missing values generated)

{com}. tabstat time_to_ssz if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75)

{txt}{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_ssz} {...}
{c |}{...}
 {res}      751  619.8202       589       320       880
{txt}{hline 13}{c BT}{hline 50}

{com}. bys diagnosis_year: tabstat time_to_ssz if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by diagnosis year for RA

{txt}{hline}
-> diagnosis_year = March 2019-March 2020

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_ssz} {...}
{c |}{...}
 {res}      238  629.3235     589.5       318       866
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> diagnosis_year = March 2020-March 2021

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_ssz} {...}
{c |}{...}
 {res}      244  636.3566       598       323     926.5
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> diagnosis_year = March 2021-March 2022

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_ssz} {...}
{c |}{...}
 {res}      236  606.1271       582       311       880
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> diagnosis_year = .

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_ssz} {...}
{c |}{...}
 {res}       33  526.9394       506       274       660
{txt}{hline 13}{c BT}{hline 50}

{com}. bys diagnosis_year: tabstat time_to_ssz if psa_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by diagnosis year for PsA

{txt}{hline}
-> diagnosis_year = March 2019-March 2020

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_ssz} {...}
{c |}{...}
 {res}      258  554.1395     515.5       275       768
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> diagnosis_year = March 2020-March 2021

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_ssz} {...}
{c |}{...}
 {res}      237  650.5443       671       308       931
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> diagnosis_year = March 2021-March 2022

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_ssz} {...}
{c |}{...}
 {res}      241  641.7593       604       375       934
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> diagnosis_year = .

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_ssz} {...}
{c |}{...}
 {res}       33  673.2424       673       342       904
{txt}{hline 13}{c BT}{hline 50}

{com}. bys nuts_region: tabstat time_to_ssz if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by region for RA

{txt}{hline}
-> nuts_region = East Midlands

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_ssz} {...}
{c |}{...}
 {res}       78  553.6282     518.5       269       818
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = East of England

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_ssz} {...}
{c |}{...}
 {res}       69  645.1739       658       410       832
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = London

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_ssz} {...}
{c |}{...}
 {res}      153  617.7647       612       304       872
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = North East

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_ssz} {...}
{c |}{...}
 {res}       93  641.8602       613       356       951
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = North West

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_ssz} {...}
{c |}{...}
 {res}       72  641.6528     603.5       317     912.5
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = South East

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_ssz} {...}
{c |}{...}
 {res}      153  615.8235       582       306       902
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = West Midlands

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_ssz} {...}
{c |}{...}
 {res}       71  630.6901       611       318       903
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = Yorkshire and the Humber

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_ssz} {...}
{c |}{...}
 {res}       62  618.9516       595       393       812
{txt}{hline 13}{c BT}{hline 50}

{com}. bys nuts_region: tabstat time_to_ssz if psa_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by region for PsA

{txt}{hline}
-> nuts_region = East Midlands

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_ssz} {...}
{c |}{...}
 {res}       81  614.9259       629       349       861
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = East of England

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_ssz} {...}
{c |}{...}
 {res}       84  573.0119     510.5     278.5       842
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = London

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_ssz} {...}
{c |}{...}
 {res}      164  621.7622       610     312.5       904
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = North East

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_ssz} {...}
{c |}{...}
 {res}       80  649.8125     641.5       380       907
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = North West

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_ssz} {...}
{c |}{...}
 {res}       75    561.72       524       200       811
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = South East

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_ssz} {...}
{c |}{...}
 {res}      160  611.7813       567     274.5       895
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = West Midlands

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_ssz} {...}
{c |}{...}
 {res}       64  727.3906     692.5       409      1062
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = Yorkshire and the Humber

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_ssz} {...}
{c |}{...}
 {res}       61  583.0328       532       302       827
{txt}{hline 13}{c BT}{hline 50}

{com}. 
. **Sulfasalazine time categories for RA patients //Nb. this is time period from rheum appt (i.e. diagnosis) to shared care, not from referral to first script 
. gen ssz_6w=1 if time_to_ssz<=42 & time_to_ssz!=.
{txt}(34,041 missing values generated)

{com}. recode ssz_6w .=0
{txt}(34041 changes made to {bf:ssz_6w})

{com}. tab ssz_6w if ra_code==1 & has_6m_follow_up==1

     {txt}ssz_6w {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     10,689       99.86       99.86
{txt}          1 {c |}{res}         15        0.14      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     10,704      100.00
{txt}
{com}. gen ssz_3m=1 if time_to_ssz<=90 & time_to_ssz!=.
{txt}(33,959 missing values generated)

{com}. recode ssz_3m .=0
{txt}(33959 changes made to {bf:ssz_3m})

{com}. tab ssz_3m if ra_code==1 & has_6m_follow_up==1

     {txt}ssz_3m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     10,667       99.65       99.65
{txt}          1 {c |}{res}         37        0.35      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     10,704      100.00
{txt}
{com}. gen ssz_6m=1 if time_to_ssz<=180 & time_to_ssz!=.
{txt}(33,803 missing values generated)

{com}. recode ssz_6m .=0
{txt}(33803 changes made to {bf:ssz_6m})

{com}. tab ssz_6m if ra_code==1 & has_6m_follow_up==1

     {txt}ssz_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     10,614       99.16       99.16
{txt}          1 {c |}{res}         90        0.84      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     10,704      100.00
{txt}
{com}. gen ssz_12m=1 if time_to_ssz<=365 & time_to_ssz!=. 
{txt}(33,406 missing values generated)

{com}. recode ssz_12m .=0 
{txt}(33406 changes made to {bf:ssz_12m})

{com}. tab ssz_12m if ra_code==1 & has_12m_follow_up==1 //with a least 12m registration

    {txt}ssz_12m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     10,049       98.09       98.09
{txt}          1 {c |}{res}        196        1.91      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     10,245      100.00
{txt}
{com}. lab define ssz_6m 0 "No" 1 "Yes", modify
{txt}
{com}. lab val ssz_6m ssz_6m
{txt}
{com}. lab var ssz_6m "Sulfasalazine within 6 months"
{txt}
{com}. lab define ssz_12m 0 "No" 1 "Yes", modify
{txt}
{com}. lab val ssz_12m ssz_12m
{txt}
{com}. lab var ssz_12m "Sulfasalazine within 12 months"
{txt}
{com}. 
. **Sulfasalazine time categories for PsA patients
. tab ssz_6w if psa_code==1 & has_6m_follow_up==1

     {txt}ssz_6w {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     10,720       99.80       99.80
{txt}          1 {c |}{res}         22        0.20      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     10,742      100.00
{txt}
{com}. tab ssz_3m if psa_code==1 & has_6m_follow_up==1

     {txt}ssz_3m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     10,687       99.49       99.49
{txt}          1 {c |}{res}         55        0.51      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     10,742      100.00
{txt}
{com}. tab ssz_6m if psa_code==1 & has_6m_follow_up==1

{txt}Sulfasalazi {c |}
ne within 6 {c |}
     months {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
         No {c |}{res}     10,648       99.12       99.12
{txt}        Yes {c |}{res}         94        0.88      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     10,742      100.00
{txt}
{com}. tab ssz_12m if psa_code==1 & has_12m_follow_up==1 //with a least 12m registration

{txt}Sulfasalazi {c |}
  ne within {c |}
  12 months {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
         No {c |}{res}      9,946       98.09       98.09
{txt}        Yes {c |}{res}        194        1.91      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     10,140      100.00
{txt}
{com}. 
. **Hydroxychloroquine use
. gen time_to_hcq=(hydroxychloroquine_date-rheum_appt_date) if hydroxychloroquine==1 & rheum_appt_date!=. & hydroxychloroquine_date>rheum_appt_date 
{txt}(31,694 missing values generated)

{com}. tabstat time_to_hcq if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75)

{txt}{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_hcq} {...}
{c |}{...}
 {res}      763   590.616       555       316       855
{txt}{hline 13}{c BT}{hline 50}

{com}. bys diagnosis_year: tabstat time_to_hcq if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by diagnosis year for RA

{txt}{hline}
-> diagnosis_year = March 2019-March 2020

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_hcq} {...}
{c |}{...}
 {res}      258  587.8256     536.5       322       846
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> diagnosis_year = March 2020-March 2021

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_hcq} {...}
{c |}{...}
 {res}      218  583.4541     557.5       294       813
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> diagnosis_year = March 2021-March 2022

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_hcq} {...}
{c |}{...}
 {res}      258  592.2132       573       317       878
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> diagnosis_year = .

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_hcq} {...}
{c |}{...}
 {res}       29   655.069       606       276      1014
{txt}{hline 13}{c BT}{hline 50}

{com}. bys diagnosis_year: tabstat time_to_hcq if psa_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by diagnosis year for PsA

{txt}{hline}
-> diagnosis_year = March 2019-March 2020

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_hcq} {...}
{c |}{...}
 {res}      246  598.3902     576.5       305       865
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> diagnosis_year = March 2020-March 2021

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_hcq} {...}
{c |}{...}
 {res}      227   624.304       612       281       969
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> diagnosis_year = March 2021-March 2022

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_hcq} {...}
{c |}{...}
 {res}      220  600.0727     572.5       323     854.5
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> diagnosis_year = .

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_hcq} {...}
{c |}{...}
 {res}       38  569.7105       601       230       843
{txt}{hline 13}{c BT}{hline 50}

{com}. bys nuts_region: tabstat time_to_hcq if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by region for RA

{txt}{hline}
-> nuts_region = East Midlands

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_hcq} {...}
{c |}{...}
 {res}       64  605.6719     582.5       282       916
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = East of England

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_hcq} {...}
{c |}{...}
 {res}       74  515.9324       483       225       801
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = London

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_hcq} {...}
{c |}{...}
 {res}      158  643.2848     650.5       382       907
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = North East

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_hcq} {...}
{c |}{...}
 {res}       73  556.5068       559       276       802
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = North West

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_hcq} {...}
{c |}{...}
 {res}       88  572.3523     540.5     286.5     767.5
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = South East

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_hcq} {...}
{c |}{...}
 {res}      150  608.2867       586       335       867
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = West Midlands

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_hcq} {...}
{c |}{...}
 {res}       81   596.284       509       345       878
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = Yorkshire and the Humber

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_hcq} {...}
{c |}{...}
 {res}       75  553.6667       530       205       801
{txt}{hline 13}{c BT}{hline 50}

{com}. bys nuts_region: tabstat time_to_hcq if psa_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by region for PsA

{txt}{hline}
-> nuts_region = East Midlands

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_hcq} {...}
{c |}{...}
 {res}       87  686.1034       655       378       976
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = East of England

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_hcq} {...}
{c |}{...}
 {res}       59  619.3729       585       336       900
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = London

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_hcq} {...}
{c |}{...}
 {res}      150    608.14       597       311       928
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = North East

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_hcq} {...}
{c |}{...}
 {res}       70     688.4       708       418       986
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = North West

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_hcq} {...}
{c |}{...}
 {res}       76  545.8421     514.5     281.5       799
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = South East

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_hcq} {...}
{c |}{...}
 {res}      141  566.2128       565       227       843
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = West Midlands

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_hcq} {...}
{c |}{...}
 {res}       67  617.1194       588       276       976
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = Yorkshire and the Humber

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_hcq} {...}
{c |}{...}
 {res}       81  546.6173       509       265       807
{txt}{hline 13}{c BT}{hline 50}

{com}. 
. **Hydroxychloroquine time categories for RA patients //Nb. this is time period from rheum appt (i.e. diagnosis) to shared care, not from referral to first script 
. gen hcq_6w=1 if time_to_hcq<=42 & time_to_hcq!=.
{txt}(34,025 missing values generated)

{com}. recode hcq_6w .=0
{txt}(34025 changes made to {bf:hcq_6w})

{com}. tab hcq_6w if ra_code==1 & has_6m_follow_up==1

     {txt}hcq_6w {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     10,680       99.78       99.78
{txt}          1 {c |}{res}         24        0.22      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     10,704      100.00
{txt}
{com}. gen hcq_3m=1 if time_to_hcq<=90 & time_to_hcq!=.
{txt}(33,938 missing values generated)

{com}. recode hcq_3m .=0
{txt}(33938 changes made to {bf:hcq_3m})

{com}. tab hcq_3m if ra_code==1 & has_6m_follow_up==1

     {txt}hcq_3m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     10,647       99.47       99.47
{txt}          1 {c |}{res}         57        0.53      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     10,704      100.00
{txt}
{com}. gen hcq_6m=1 if time_to_hcq<=180 & time_to_hcq!=.
{txt}(33,771 missing values generated)

{com}. recode hcq_6m .=0
{txt}(33771 changes made to {bf:hcq_6m})

{com}. tab hcq_6m if ra_code==1 & has_6m_follow_up==1

     {txt}hcq_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     10,594       98.97       98.97
{txt}          1 {c |}{res}        110        1.03      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     10,704      100.00
{txt}
{com}. gen hcq_12m=1 if time_to_hcq<=365 & time_to_hcq!=. 
{txt}(33,378 missing values generated)

{com}. recode hcq_12m .=0 
{txt}(33378 changes made to {bf:hcq_12m})

{com}. tab hcq_12m if ra_code==1 & has_12m_follow_up==1 //with a least 12m registration

    {txt}hcq_12m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     10,018       97.78       97.78
{txt}          1 {c |}{res}        227        2.22      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     10,245      100.00
{txt}
{com}. lab define hcq_6m 0 "No" 1 "Yes", modify
{txt}
{com}. lab val hcq_6m hcq_6m
{txt}
{com}. lab var hcq_6m "Hydroxychloroquine within 6 months"
{txt}
{com}. lab define hcq_12m 0 "No" 1 "Yes", modify
{txt}
{com}. lab val hcq_12m hcq_12m
{txt}
{com}. lab var hcq_12m "Hydroxychloroquine within 12 months"
{txt}
{com}. 
. **Hydroxychloroquine time categories for PsA patients
. tab hcq_6w if psa_code==1 & has_6m_follow_up==1

     {txt}hcq_6w {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     10,719       99.79       99.79
{txt}          1 {c |}{res}         23        0.21      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     10,742      100.00
{txt}
{com}. tab hcq_3m if psa_code==1 & has_6m_follow_up==1

     {txt}hcq_3m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     10,692       99.53       99.53
{txt}          1 {c |}{res}         50        0.47      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     10,742      100.00
{txt}
{com}. tab hcq_6m if psa_code==1 & has_6m_follow_up==1

{txt}Hydroxychlo {c |}
    roquine {c |}
   within 6 {c |}
     months {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
         No {c |}{res}     10,638       99.03       99.03
{txt}        Yes {c |}{res}        104        0.97      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     10,742      100.00
{txt}
{com}. tab hcq_12m if psa_code==1 & has_12m_follow_up==1 //with a least 12m registration

{txt}Hydroxychlo {c |}
    roquine {c |}
  within 12 {c |}
     months {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
         No {c |}{res}      9,929       97.92       97.92
{txt}        Yes {c |}{res}        211        2.08      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     10,140      100.00
{txt}
{com}. 
. **Leflunomide use
. gen time_to_lef=(leflunomide_date-rheum_appt_date) if leflunomide==1 & rheum_appt_date!=. & leflunomide_date>rheum_appt_date 
{txt}(31,753 missing values generated)

{com}. tabstat time_to_lef if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75)

{txt}{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_lef} {...}
{c |}{...}
 {res}      741  625.3077       616       346       896
{txt}{hline 13}{c BT}{hline 50}

{com}. bys diagnosis_year: tabstat time_to_lef if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by diagnosis year for RA

{txt}{hline}
-> diagnosis_year = March 2019-March 2020

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_lef} {...}
{c |}{...}
 {res}      232  624.6897       586     354.5     890.5
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> diagnosis_year = March 2020-March 2021

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_lef} {...}
{c |}{...}
 {res}      227  645.0837       630       360       918
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> diagnosis_year = March 2021-March 2022

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_lef} {...}
{c |}{...}
 {res}      253  614.3715       635       340       861
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> diagnosis_year = .

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_lef} {...}
{c |}{...}
 {res}       29  570.8621       526       289       860
{txt}{hline 13}{c BT}{hline 50}

{com}. bys diagnosis_year: tabstat time_to_lef if psa_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by diagnosis year for PsA

{txt}{hline}
-> diagnosis_year = March 2019-March 2020

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_lef} {...}
{c |}{...}
 {res}      233  636.6524       580       355       884
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> diagnosis_year = March 2020-March 2021

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_lef} {...}
{c |}{...}
 {res}      211  592.9526       577       296       842
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> diagnosis_year = March 2021-March 2022

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_lef} {...}
{c |}{...}
 {res}      236  633.0254       564       360     922.5
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> diagnosis_year = .

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_lef} {...}
{c |}{...}
 {res}       32  519.4375     466.5     267.5       698
{txt}{hline 13}{c BT}{hline 50}

{com}. bys nuts_region: tabstat time_to_lef if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by region for RA

{txt}{hline}
-> nuts_region = East Midlands

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_lef} {...}
{c |}{...}
 {res}       70  743.5571       712       554      1015
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = East of England

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_lef} {...}
{c |}{...}
 {res}       68  627.4118     634.5     330.5       867
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = London

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_lef} {...}
{c |}{...}
 {res}      162  586.2778       519       338       883
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = North East

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_lef} {...}
{c |}{...}
 {res}       76  622.9342       618       348     875.5
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = North West

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_lef} {...}
{c |}{...}
 {res}       70  636.0286       604       354       914
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = South East

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_lef} {...}
{c |}{...}
 {res}      150    607.98       607       349       855
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = West Midlands

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_lef} {...}
{c |}{...}
 {res}       78  591.4744       530       301       822
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = Yorkshire and the Humber

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_lef} {...}
{c |}{...}
 {res}       67  663.6716       668       345       940
{txt}{hline 13}{c BT}{hline 50}

{com}. bys nuts_region: tabstat time_to_lef if psa_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by region for PsA

{txt}{hline}
-> nuts_region = East Midlands

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_lef} {...}
{c |}{...}
 {res}       73  634.7123       633       384       883
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = East of England

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_lef} {...}
{c |}{...}
 {res}       70     589.5     535.5       287       832
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = London

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_lef} {...}
{c |}{...}
 {res}      134   592.403     515.5       317       859
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = North East

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_lef} {...}
{c |}{...}
 {res}       58  518.6897     484.5       203       746
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = North West

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_lef} {...}
{c |}{...}
 {res}       56  608.7321       519     358.5       913
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = South East

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_lef} {...}
{c |}{...}
 {res}      166  649.0181     642.5       363       906
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = West Midlands

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_lef} {...}
{c |}{...}
 {res}       74  581.5676       569       286       791
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = Yorkshire and the Humber

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_lef} {...}
{c |}{...}
 {res}       81  710.3951       632       418       991
{txt}{hline 13}{c BT}{hline 50}

{com}. 
. **Leflunomide time categories for RA patients //Nb. this is time period from rheum appt (i.e. diagnosis) to shared care, not from referral to first script 
. gen lef_6w=1 if time_to_lef<=42 & time_to_lef!=.
{txt}(34,042 missing values generated)

{com}. recode lef_6w .=0
{txt}(34042 changes made to {bf:lef_6w})

{com}. tab lef_6w if ra_code==1 & has_6m_follow_up==1

     {txt}lef_6w {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     10,686       99.83       99.83
{txt}          1 {c |}{res}         18        0.17      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     10,704      100.00
{txt}
{com}. gen lef_3m=1 if time_to_lef<=90 & time_to_lef!=.
{txt}(33,957 missing values generated)

{com}. recode lef_3m .=0
{txt}(33957 changes made to {bf:lef_3m})

{com}. tab lef_3m if ra_code==1 & has_6m_follow_up==1

     {txt}lef_3m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     10,659       99.58       99.58
{txt}          1 {c |}{res}         45        0.42      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     10,704      100.00
{txt}
{com}. gen lef_6m=1 if time_to_lef<=180 & time_to_lef!=.
{txt}(33,809 missing values generated)

{com}. recode lef_6m .=0
{txt}(33809 changes made to {bf:lef_6m})

{com}. tab lef_6m if ra_code==1 & has_6m_follow_up==1

     {txt}lef_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     10,616       99.18       99.18
{txt}          1 {c |}{res}         88        0.82      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     10,704      100.00
{txt}
{com}. gen lef_12m=1 if time_to_lef<=365 & time_to_lef!=. 
{txt}(33,430 missing values generated)

{com}. recode lef_12m .=0 
{txt}(33430 changes made to {bf:lef_12m})

{com}. tab lef_12m if ra_code==1 & has_12m_follow_up==1 //with a least 12m registration

    {txt}lef_12m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     10,047       98.07       98.07
{txt}          1 {c |}{res}        198        1.93      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     10,245      100.00
{txt}
{com}. lab define lef_6m 0 "No" 1 "Yes", modify
{txt}
{com}. lab val lef_6m lef_6m
{txt}
{com}. lab var lef_6m "Leflunomide within 6 months"
{txt}
{com}. lab define lef_12m 0 "No" 1 "Yes", modify
{txt}
{com}. lab val lef_12m lef_12m
{txt}
{com}. lab var lef_12m "Leflunomide within 12 months"
{txt}
{com}. 
. **Leflunomide time categories for PsA patients
. tab lef_6w if psa_code==1 & has_6m_follow_up==1

     {txt}lef_6w {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     10,726       99.85       99.85
{txt}          1 {c |}{res}         16        0.15      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     10,742      100.00
{txt}
{com}. tab lef_3m if psa_code==1 & has_6m_follow_up==1

     {txt}lef_3m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     10,706       99.66       99.66
{txt}          1 {c |}{res}         36        0.34      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     10,742      100.00
{txt}
{com}. tab lef_6m if psa_code==1 & has_6m_follow_up==1

{txt}Leflunomide {c |}
   within 6 {c |}
     months {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
         No {c |}{res}     10,658       99.22       99.22
{txt}        Yes {c |}{res}         84        0.78      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     10,742      100.00
{txt}
{com}. tab lef_12m if psa_code==1 & has_12m_follow_up==1 //with a least 12m registration

{txt}Leflunomide {c |}
  within 12 {c |}
     months {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
         No {c |}{res}      9,959       98.21       98.21
{txt}        Yes {c |}{res}        181        1.79      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     10,140      100.00
{txt}
{com}. 
. **Time to first biologic script, whereby first rheum appt is classed as diagnosis date (assumes rheum appt present); high_cost drug data available to Nov 2020======================================================================*/
. 
. *Below analyses are only for patients with at least 12 months of follow-up available after EIA code
. gen time_to_biologic=(biologic_date-rheum_appt_date) if biologic==1 & rheum_appt_date!=. & biologic_date>rheum_appt_date 
{txt}(13,703 missing values generated)

{com}. tabstat time_to_biologic if has_12m_follow_up==1, stats (n mean p50 p25 p75) //for all EIA patients

{txt}{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_bi~c} {...}
{c |}{...}
 {res}    18355  460.7393       402       207       663
{txt}{hline 13}{c BT}{hline 50}

{com}. bys eia_diagnosis: tabstat time_to_biologic if has_12m_follow_up==1, stats (n mean p50 p25 p75) 

{txt}{hline}
-> eia_diagnosis = RA

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_bi~c} {...}
{c |}{...}
 {res}     6108  467.9005       401       210       679
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = PsA

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_bi~c} {...}
{c |}{...}
 {res}     6047   457.805       401       209       657
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = AxSpA

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_bi~c} {...}
{c |}{...}
 {res}     6200  456.5461       403       200     655.5
{txt}{hline 13}{c BT}{hline 50}

{com}. bys diagnosis_year: tabstat time_to_biologic if ra_code==1 & has_12m_follow_up==1, stats (n mean p50 p25 p75) //by diagnosis year

{txt}{hline}
-> diagnosis_year = March 2019-March 2020

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_bi~c} {...}
{c |}{...}
 {res}     1963  464.9959       401       210       679
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> diagnosis_year = March 2020-March 2021

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_bi~c} {...}
{c |}{...}
 {res}     1925  470.6436       412       209       686
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> diagnosis_year = March 2021-March 2022

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_bi~c} {...}
{c |}{...}
 {res}     1972  466.3129       390       210       674
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> diagnosis_year = .

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_bi~c} {...}
{c |}{...}
 {res}      248  482.2218       420     242.5     652.5
{txt}{hline 13}{c BT}{hline 50}

{com}. bys nuts_region: tabstat time_to_biologic if ra_code==1 & has_12m_follow_up==1, stats (n mean p50 p25 p75) //by region

{txt}{hline}
-> nuts_region = East Midlands

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_bi~c} {...}
{c |}{...}
 {res}      612  469.0833     420.5       215       667
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = East of England

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_bi~c} {...}
{c |}{...}
 {res}      603  454.5854       380       193       663
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = London

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_bi~c} {...}
{c |}{...}
 {res}     1276  464.1622       388     203.5       671
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = North East

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_bi~c} {...}
{c |}{...}
 {res}      613  466.9902       401       213       678
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = North West

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_bi~c} {...}
{c |}{...}
 {res}      573  489.2565       408       207       730
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = South East

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_bi~c} {...}
{c |}{...}
 {res}     1227  469.2339       408       220       687
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = West Midlands

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_bi~c} {...}
{c |}{...}
 {res}      588  471.2245       419     223.5     685.5
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> nuts_region = Yorkshire and the Humber

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_bi~c} {...}
{c |}{...}
 {res}      616  462.7143       395     202.5     656.5
{txt}{hline 13}{c BT}{hline 50}

{com}. 
. **What was first biologic
. gen first_bio=""
{txt}(34,096 missing values generated)

{com}. foreach var of varlist abatacept_date adalimumab_date baricitinib_date certolizumab_date etanercept_date golimumab_date guselkumab_date infliximab_date ixekizumab_date rituximab_date sarilumab_date secukinumab_date tocilizumab_date tofacitinib_date upadacitinib_date ustekinumab_date {c -(}
{txt}  2{com}.         replace first_bio="`var'" if biologic_date==`var' & biologic_date!=.
{txt}  3{com}.         {c )-}
{txt}variable {bf}{res}first_bio{sf}{txt} was {bf}{res}str1{sf}{txt} now {bf}{res}str14{sf}
{txt}(1,567 real changes made)
variable {bf}{res}first_bio{sf}{txt} was {bf}{res}str14{sf}{txt} now {bf}{res}str15{sf}
{txt}(1,615 real changes made)
variable {bf}{res}first_bio{sf}{txt} was {bf}{res}str15{sf}{txt} now {bf}{res}str16{sf}
{txt}(1,622 real changes made)
variable {bf}{res}first_bio{sf}{txt} was {bf}{res}str16{sf}{txt} now {bf}{res}str17{sf}
{txt}(1,573 real changes made)
(1,583 real changes made)
(1,651 real changes made)
(1,633 real changes made)
(1,637 real changes made)
(1,593 real changes made)
(1,597 real changes made)
(1,648 real changes made)
(1,613 real changes made)
(1,576 real changes made)
(1,541 real changes made)
(1,567 real changes made)
(1,674 real changes made)

{com}. gen first_biologic = substr(first_bio, 1, length(first_bio) - 5)        
{txt}(8,969 missing values generated)

{com}. drop first_bio
{txt}
{com}. tab first_biologic if has_12m_follow_up==1 //for all EIA patients

{txt}first_biolog {c |}
          ic {c |}      Freq.     Percent        Cum.
{hline 13}{c +}{hline 35}
   abatacept {c |}{res}      1,347        5.95        5.95
{txt}  adalimumab {c |}{res}      1,386        6.13       12.08
{txt} baricitinib {c |}{res}      1,428        6.31       18.39
{txt}certolizumab {c |}{res}      1,375        6.08       24.47
{txt}  etanercept {c |}{res}      1,370        6.05       30.52
{txt}   golimumab {c |}{res}      1,457        6.44       36.96
{txt}  guselkumab {c |}{res}      1,416        6.26       43.22
{txt}  infliximab {c |}{res}      1,417        6.26       49.48
{txt}  ixekizumab {c |}{res}      1,409        6.23       55.71
{txt}   rituximab {c |}{res}      1,429        6.32       62.02
{txt}   sarilumab {c |}{res}      1,488        6.58       68.60
{txt} secukinumab {c |}{res}      1,414        6.25       74.85
{txt} tocilizumab {c |}{res}      1,384        6.12       80.97
{txt} tofacitinib {c |}{res}      1,374        6.07       87.04
{txt}upadacitinib {c |}{res}      1,417        6.26       93.30
{txt} ustekinumab {c |}{res}      1,516        6.70      100.00
{txt}{hline 13}{c +}{hline 35}
       Total {c |}{res}     22,627      100.00
{txt}
{com}. bys eia_diagnosis: tab first_biologic if has_12m_follow_up==1

{txt}{hline}
-> eia_diagnosis = RA

first_biolog {c |}
          ic {c |}      Freq.     Percent        Cum.
{hline 13}{c +}{hline 35}
   abatacept {c |}{res}        461        6.09        6.09
{txt}  adalimumab {c |}{res}        475        6.27       12.36
{txt} baricitinib {c |}{res}        483        6.38       18.75
{txt}certolizumab {c |}{res}        460        6.08       24.82
{txt}  etanercept {c |}{res}        441        5.83       30.65
{txt}   golimumab {c |}{res}        508        6.71       37.36
{txt}  guselkumab {c |}{res}        492        6.50       43.86
{txt}  infliximab {c |}{res}        448        5.92       49.78
{txt}  ixekizumab {c |}{res}        474        6.26       56.04
{txt}   rituximab {c |}{res}        487        6.43       62.47
{txt}   sarilumab {c |}{res}        490        6.47       68.94
{txt} secukinumab {c |}{res}        479        6.33       75.27
{txt} tocilizumab {c |}{res}        490        6.47       81.74
{txt} tofacitinib {c |}{res}        475        6.27       88.02
{txt}upadacitinib {c |}{res}        452        5.97       93.99
{txt} ustekinumab {c |}{res}        455        6.01      100.00
{txt}{hline 13}{c +}{hline 35}
       Total {c |}{res}      7,570      100.00

{txt}{hline}
-> eia_diagnosis = PsA

first_biolog {c |}
          ic {c |}      Freq.     Percent        Cum.
{hline 13}{c +}{hline 35}
   abatacept {c |}{res}        423        5.66        5.66
{txt}  adalimumab {c |}{res}        450        6.02       11.68
{txt} baricitinib {c |}{res}        455        6.09       17.77
{txt}certolizumab {c |}{res}        437        5.85       23.61
{txt}  etanercept {c |}{res}        482        6.45       30.06
{txt}   golimumab {c |}{res}        489        6.54       36.60
{txt}  guselkumab {c |}{res}        444        5.94       42.54
{txt}  infliximab {c |}{res}        469        6.27       48.82
{txt}  ixekizumab {c |}{res}        463        6.19       55.01
{txt}   rituximab {c |}{res}        460        6.15       61.16
{txt}   sarilumab {c |}{res}        474        6.34       67.51
{txt} secukinumab {c |}{res}        481        6.43       73.94
{txt} tocilizumab {c |}{res}        468        6.26       80.20
{txt} tofacitinib {c |}{res}        467        6.25       86.45
{txt}upadacitinib {c |}{res}        475        6.35       92.80
{txt} ustekinumab {c |}{res}        538        7.20      100.00
{txt}{hline 13}{c +}{hline 35}
       Total {c |}{res}      7,475      100.00

{txt}{hline}
-> eia_diagnosis = AxSpA

first_biolog {c |}
          ic {c |}      Freq.     Percent        Cum.
{hline 13}{c +}{hline 35}
   abatacept {c |}{res}        463        6.11        6.11
{txt}  adalimumab {c |}{res}        461        6.08       12.19
{txt} baricitinib {c |}{res}        490        6.46       18.65
{txt}certolizumab {c |}{res}        478        6.30       24.95
{txt}  etanercept {c |}{res}        447        5.90       30.85
{txt}   golimumab {c |}{res}        460        6.07       36.92
{txt}  guselkumab {c |}{res}        480        6.33       43.25
{txt}  infliximab {c |}{res}        500        6.59       49.84
{txt}  ixekizumab {c |}{res}        472        6.23       56.07
{txt}   rituximab {c |}{res}        482        6.36       62.42
{txt}   sarilumab {c |}{res}        524        6.91       69.34
{txt} secukinumab {c |}{res}        454        5.99       75.32
{txt} tocilizumab {c |}{res}        426        5.62       80.94
{txt} tofacitinib {c |}{res}        432        5.70       86.64
{txt}upadacitinib {c |}{res}        490        6.46       93.10
{txt} ustekinumab {c |}{res}        523        6.90      100.00
{txt}{hline 13}{c +}{hline 35}
       Total {c |}{res}      7,582      100.00

{txt}
{com}. 
. **Biologic time categories (for all patients)
. gen biologic_6m=1 if time_to_biologic<=180 & time_to_biologic!=.
{txt}(29,685 missing values generated)

{com}. recode biologic_6m .=0
{txt}(29685 changes made to {bf:biologic_6m})

{com}. tab biologic_6m if has_6m_follow_up==1 //for all EIA patients with at least 6m follow-up

{txt}biologic_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     28,181       87.07       87.07
{txt}          1 {c |}{res}      4,184       12.93      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     32,365      100.00
{txt}
{com}. bys eia_diagnosis: tab biologic_6m if has_6m_follow_up==1

{txt}{hline}
-> eia_diagnosis = RA

biologic_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      9,344       87.29       87.29
{txt}          1 {c |}{res}      1,360       12.71      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     10,704      100.00

{txt}{hline}
-> eia_diagnosis = PsA

biologic_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      9,367       87.20       87.20
{txt}          1 {c |}{res}      1,375       12.80      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     10,742      100.00

{txt}{hline}
-> eia_diagnosis = AxSpA

biologic_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      9,470       86.73       86.73
{txt}          1 {c |}{res}      1,449       13.27      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     10,919      100.00

{txt}
{com}. gen biologic_12m=1 if time_to_biologic<=365 & time_to_biologic!=.
{txt}(24,849 missing values generated)

{com}. recode biologic_12m .=0
{txt}(24849 changes made to {bf:biologic_12m})

{com}. tab biologic_12m if has_12m_follow_up==1 //for all EIA patients

{txt}biologic_12 {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     22,368       72.88       72.88
{txt}          1 {c |}{res}      8,323       27.12      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     30,691      100.00
{txt}
{com}. bys eia_diagnosis: tab biologic_12m if has_12m_follow_up==1

{txt}{hline}
-> eia_diagnosis = RA

biologic_12 {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      7,478       72.99       72.99
{txt}          1 {c |}{res}      2,767       27.01      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     10,245      100.00

{txt}{hline}
-> eia_diagnosis = PsA

biologic_12 {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      7,392       72.90       72.90
{txt}          1 {c |}{res}      2,748       27.10      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     10,140      100.00

{txt}{hline}
-> eia_diagnosis = AxSpA

biologic_12 {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      7,498       72.75       72.75
{txt}          1 {c |}{res}      2,808       27.25      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     10,306      100.00

{txt}
{com}. lab define biologic_6m 0 "No" 1 "Yes", modify
{txt}
{com}. lab val biologic_6m biologic_6m
{txt}
{com}. lab var biologic_6m "bDMARD/tsDMARD within 6 months"
{txt}
{com}. lab define biologic_12m 0 "No" 1 "Yes", modify
{txt}
{com}. lab val biologic_12m biologic_12m
{txt}
{com}. lab var biologic_12m "bDMARD/tsDMARD within 12 months"
{txt}
{com}. 
. **Biologic time categories (by year)
. bys diagnosis_year: tab biologic_6m if has_6m_follow_up==1 //for all EIA patients with at least 6m follow-up

{txt}{hline}
-> diagnosis_year = March 2019-March 2020

bDMARD/tsDM {c |}
 ARD within {c |}
   6 months {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
         No {c |}{res}      9,018       87.05       87.05
{txt}        Yes {c |}{res}      1,341       12.95      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     10,359      100.00

{txt}{hline}
-> diagnosis_year = March 2020-March 2021

bDMARD/tsDM {c |}
 ARD within {c |}
   6 months {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
         No {c |}{res}      9,022       86.91       86.91
{txt}        Yes {c |}{res}      1,359       13.09      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     10,381      100.00

{txt}{hline}
-> diagnosis_year = March 2021-March 2022

bDMARD/tsDM {c |}
 ARD within {c |}
   6 months {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
         No {c |}{res}      8,947       87.25       87.25
{txt}        Yes {c |}{res}      1,307       12.75      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     10,254      100.00

{txt}{hline}
-> diagnosis_year = .

bDMARD/tsDM {c |}
 ARD within {c |}
   6 months {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
         No {c |}{res}      1,194       87.09       87.09
{txt}        Yes {c |}{res}        177       12.91      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,371      100.00

{txt}
{com}. bys diagnosis_year eia_diagnosis: tab biologic_6m if has_6m_follow_up==1 //for each diagnosis with at least 6m follow-up

{txt}{hline}
-> diagnosis_year = March 2019-March 2020, eia_diagnosis = RA

bDMARD/tsDM {c |}
 ARD within {c |}
   6 months {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
         No {c |}{res}      2,975       87.12       87.12
{txt}        Yes {c |}{res}        440       12.88      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,415      100.00

{txt}{hline}
-> diagnosis_year = March 2019-March 2020, eia_diagnosis = PsA

bDMARD/tsDM {c |}
 ARD within {c |}
   6 months {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
         No {c |}{res}      3,026       87.91       87.91
{txt}        Yes {c |}{res}        416       12.09      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,442      100.00

{txt}{hline}
-> diagnosis_year = March 2019-March 2020, eia_diagnosis = AxSpA

bDMARD/tsDM {c |}
 ARD within {c |}
   6 months {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
         No {c |}{res}      3,017       86.15       86.15
{txt}        Yes {c |}{res}        485       13.85      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,502      100.00

{txt}{hline}
-> diagnosis_year = March 2020-March 2021, eia_diagnosis = RA

bDMARD/tsDM {c |}
 ARD within {c |}
   6 months {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
         No {c |}{res}      2,919       86.98       86.98
{txt}        Yes {c |}{res}        437       13.02      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,356      100.00

{txt}{hline}
-> diagnosis_year = March 2020-March 2021, eia_diagnosis = PsA

bDMARD/tsDM {c |}
 ARD within {c |}
   6 months {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
         No {c |}{res}      2,984       87.40       87.40
{txt}        Yes {c |}{res}        430       12.60      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,414      100.00

{txt}{hline}
-> diagnosis_year = March 2020-March 2021, eia_diagnosis = AxSpA

bDMARD/tsDM {c |}
 ARD within {c |}
   6 months {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
         No {c |}{res}      3,119       86.37       86.37
{txt}        Yes {c |}{res}        492       13.63      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,611      100.00

{txt}{hline}
-> diagnosis_year = March 2021-March 2022, eia_diagnosis = RA

bDMARD/tsDM {c |}
 ARD within {c |}
   6 months {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
         No {c |}{res}      3,038       87.60       87.60
{txt}        Yes {c |}{res}        430       12.40      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,468      100.00

{txt}{hline}
-> diagnosis_year = March 2021-March 2022, eia_diagnosis = PsA

bDMARD/tsDM {c |}
 ARD within {c |}
   6 months {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
         No {c |}{res}      2,935       86.25       86.25
{txt}        Yes {c |}{res}        468       13.75      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,403      100.00

{txt}{hline}
-> diagnosis_year = March 2021-March 2022, eia_diagnosis = AxSpA

bDMARD/tsDM {c |}
 ARD within {c |}
   6 months {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
         No {c |}{res}      2,974       87.91       87.91
{txt}        Yes {c |}{res}        409       12.09      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,383      100.00

{txt}{hline}
-> diagnosis_year = ., eia_diagnosis = RA

bDMARD/tsDM {c |}
 ARD within {c |}
   6 months {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
         No {c |}{res}        412       88.60       88.60
{txt}        Yes {c |}{res}         53       11.40      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        465      100.00

{txt}{hline}
-> diagnosis_year = ., eia_diagnosis = PsA

bDMARD/tsDM {c |}
 ARD within {c |}
   6 months {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
         No {c |}{res}        422       87.37       87.37
{txt}        Yes {c |}{res}         61       12.63      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        483      100.00

{txt}{hline}
-> diagnosis_year = ., eia_diagnosis = AxSpA

bDMARD/tsDM {c |}
 ARD within {c |}
   6 months {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
         No {c |}{res}        360       85.11       85.11
{txt}        Yes {c |}{res}         63       14.89      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        423      100.00

{txt}
{com}. bys diagnosis_year: tab biologic_12m if has_12m_follow_up==1 //for all EIA patients

{txt}{hline}
-> diagnosis_year = March 2019-March 2020

bDMARD/tsDM {c |}
 ARD within {c |}
  12 months {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
         No {c |}{res}      7,153       72.74       72.74
{txt}        Yes {c |}{res}      2,681       27.26      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      9,834      100.00

{txt}{hline}
-> diagnosis_year = March 2020-March 2021

bDMARD/tsDM {c |}
 ARD within {c |}
  12 months {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
         No {c |}{res}      7,135       72.81       72.81
{txt}        Yes {c |}{res}      2,665       27.19      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      9,800      100.00

{txt}{hline}
-> diagnosis_year = March 2021-March 2022

bDMARD/tsDM {c |}
 ARD within {c |}
  12 months {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
         No {c |}{res}      7,101       72.93       72.93
{txt}        Yes {c |}{res}      2,636       27.07      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      9,737      100.00

{txt}{hline}
-> diagnosis_year = .

bDMARD/tsDM {c |}
 ARD within {c |}
  12 months {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
         No {c |}{res}        979       74.17       74.17
{txt}        Yes {c |}{res}        341       25.83      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,320      100.00

{txt}
{com}. bys diagnosis_year eia_diagnosis: tab biologic_12m if has_12m_follow_up==1 //for each diagnosis

{txt}{hline}
-> diagnosis_year = March 2019-March 2020, eia_diagnosis = RA

bDMARD/tsDM {c |}
 ARD within {c |}
  12 months {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
         No {c |}{res}      2,430       73.41       73.41
{txt}        Yes {c |}{res}        880       26.59      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,310      100.00

{txt}{hline}
-> diagnosis_year = March 2019-March 2020, eia_diagnosis = PsA

bDMARD/tsDM {c |}
 ARD within {c |}
  12 months {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
         No {c |}{res}      2,377       73.43       73.43
{txt}        Yes {c |}{res}        860       26.57      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,237      100.00

{txt}{hline}
-> diagnosis_year = March 2019-March 2020, eia_diagnosis = AxSpA

bDMARD/tsDM {c |}
 ARD within {c |}
  12 months {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
         No {c |}{res}      2,346       71.37       71.37
{txt}        Yes {c |}{res}        941       28.63      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,287      100.00

{txt}{hline}
-> diagnosis_year = March 2020-March 2021, eia_diagnosis = RA

bDMARD/tsDM {c |}
 ARD within {c |}
  12 months {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
         No {c |}{res}      2,317       73.14       73.14
{txt}        Yes {c |}{res}        851       26.86      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,168      100.00

{txt}{hline}
-> diagnosis_year = March 2020-March 2021, eia_diagnosis = PsA

bDMARD/tsDM {c |}
 ARD within {c |}
  12 months {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
         No {c |}{res}      2,360       73.13       73.13
{txt}        Yes {c |}{res}        867       26.87      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,227      100.00

{txt}{hline}
-> diagnosis_year = March 2020-March 2021, eia_diagnosis = AxSpA

bDMARD/tsDM {c |}
 ARD within {c |}
  12 months {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
         No {c |}{res}      2,458       72.19       72.19
{txt}        Yes {c |}{res}        947       27.81      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,405      100.00

{txt}{hline}
-> diagnosis_year = March 2021-March 2022, eia_diagnosis = RA

bDMARD/tsDM {c |}
 ARD within {c |}
  12 months {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
         No {c |}{res}      2,397       72.11       72.11
{txt}        Yes {c |}{res}        927       27.89      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,324      100.00

{txt}{hline}
-> diagnosis_year = March 2021-March 2022, eia_diagnosis = PsA

bDMARD/tsDM {c |}
 ARD within {c |}
  12 months {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
         No {c |}{res}      2,308       71.81       71.81
{txt}        Yes {c |}{res}        906       28.19      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,214      100.00

{txt}{hline}
-> diagnosis_year = March 2021-March 2022, eia_diagnosis = AxSpA

bDMARD/tsDM {c |}
 ARD within {c |}
  12 months {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
         No {c |}{res}      2,396       74.90       74.90
{txt}        Yes {c |}{res}        803       25.10      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,199      100.00

{txt}{hline}
-> diagnosis_year = ., eia_diagnosis = RA

bDMARD/tsDM {c |}
 ARD within {c |}
  12 months {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
         No {c |}{res}        334       75.40       75.40
{txt}        Yes {c |}{res}        109       24.60      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        443      100.00

{txt}{hline}
-> diagnosis_year = ., eia_diagnosis = PsA

bDMARD/tsDM {c |}
 ARD within {c |}
  12 months {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
         No {c |}{res}        347       75.11       75.11
{txt}        Yes {c |}{res}        115       24.89      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        462      100.00

{txt}{hline}
-> diagnosis_year = ., eia_diagnosis = AxSpA

bDMARD/tsDM {c |}
 ARD within {c |}
  12 months {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
         No {c |}{res}        298       71.81       71.81
{txt}        Yes {c |}{res}        117       28.19      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        415      100.00

{txt}
{com}. 
. save "$projectdir/output/data/file_eia_all", replace
{txt}{p 0 4 2}
file {bf}
C:/Users/k1754142/OneDrive/PhD Project/OpenSAFELY/Github Practice/output/data/file_eia_all.dta{rm}
saved
{p_end}

{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}C:/Users/k1754142/OneDrive/PhD Project/OpenSAFELY/Github Practice/logs/cleaning_dataset.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 5 Apr 2022, 15:38:30
{txt}{.-}
{smcl}
{txt}{sf}{ul off}