{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/logs/cleaning_dataset.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 1 Apr 2022, 16:30:32
{txt}
{com}. 
. **Set Ado file path
. adopath + "$projectdir/analysis/extra_ados"
{txt}  [1]  (BASE)      "{res}C:\Program Files\Stata17\ado\base/{txt}"
  [2]  (SITE)      "{res}C:\Program Files\Stata17\ado\site/{txt}"
  [3]              "{res}.{txt}"
  [4]  (PERSONAL)  "{res}C:\Users\k1754142\ado\personal/{txt}"
  [5]  (PLUS)      "{res}C:\Users\k1754142\ado\plus/{txt}"
  [6]  (OLDPLACE)  "{res}c:\ado/{txt}"
  [7]              "{res}C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/analysis/extra_ados{txt}"

{com}. 
. **Set index dates ===========================================================*/
. global year_preceding = "01/03/2018"
{txt}
{com}. global start_date = "01/03/2019"
{txt}
{com}. global end_date = "01/03/2022"
{txt}
{com}. 
. **Rename variables (some are too long for Stata to handle) =======================================*/
. rename chronic_respiratory_disease chronic_resp_disease
{res}{txt}
{com}. 
. **Convert date strings to dates ====================================================*/
. ***Some dates are given with month/year only, so adding day 15 to enable them to be processed as dates 
. 
. foreach var of varlist   hba1c_mmol_per_mol_date                        ///
>                                                  hba1c_percentage_date                          ///
>                                                  creatinine_date                                ///
>                                                  bmi_date_measured                          ///
>                                                  abatacept                                                      ///
>                                                  adalimumab                                                     ///     
>                                                  baricitinib                                            ///
>                                                  certolizumab                                           ///
>                                                  etanercept                                                     ///
>                                                  golimumab                                                      ///
>                                                  guselkumab                                                     ///     
>                                                  infliximab                                                     ///
>                                                  ixekizumab                                                     ///
>                                                  methotrexate_hcd                                       ///
>                                                  rituximab                                                      ///
>                                                  sarilumab                                                      ///
>                                                  secukinumab                                            ///     
>                                                  tocilizumab                                            ///
>                                                  tofacitinib                                            ///
>                                                  upadacitinib                                           ///
>                                                  ustekinumab                                            ///
>                                                  {c -(}
{txt}  2{com}.                                                         
.                 capture confirm string variable `var'
{txt}  3{com}.                 if _rc!=0 {c -(}
{txt}  4{com}.                         assert `var'==.
{txt}  5{com}.                         rename `var' `var'_date
{txt}  6{com}.                 {c )-}
{txt}  7{com}.         
.                 else {c -(}
{txt}  8{com}.                                 replace `var' = `var' + "-15"
{txt}  9{com}.                                 rename `var' `var'_dstr
{txt} 10{com}.                                 replace `var'_dstr = " " if `var'_dstr == "-15"
{txt} 11{com}.                                 gen `var'_date = date(`var'_dstr, "YMD") 
{txt} 12{com}.                                 order `var'_date, after(`var'_dstr)
{txt} 13{com}.                                 drop `var'_dstr
{txt} 14{com}.                 {c )-}
{txt} 15{com}.         
.         format `var'_date %td
{txt} 16{com}. {c )-}
{txt}variable {bf}{res}hba1c_mmol_per_mol_date{sf}{txt} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(5,000 real changes made)
(5,000 missing values generated)
variable {bf}{res}hba1c_percentage_date{sf}{txt} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(5,000 real changes made)
(5,000 missing values generated)
variable {bf}{res}creatinine_date{sf}{txt} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(5,000 real changes made)
(5,000 missing values generated)
variable {bf}{res}bmi_date_measured{sf}{txt} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(40,000 real changes made)
(40,000 missing values generated)
variable {bf}{res}abatacept{sf}{txt} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}{res}adalimumab{sf}{txt} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}{res}baricitinib{sf}{txt} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}{res}certolizumab{sf}{txt} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}{res}etanercept{sf}{txt} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}{res}golimumab{sf}{txt} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}{res}guselkumab{sf}{txt} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}{res}infliximab{sf}{txt} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}{res}ixekizumab{sf}{txt} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}{res}methotrexate_hcd{sf}{txt} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}{res}rituximab{sf}{txt} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}{res}sarilumab{sf}{txt} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}{res}secukinumab{sf}{txt} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}{res}tocilizumab{sf}{txt} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}{res}tofacitinib{sf}{txt} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}{res}upadacitinib{sf}{txt} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}{res}ustekinumab{sf}{txt} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)

{com}. 
. **Conversion for dates with day already included ====================================================*/
. 
. foreach var of varlist   died_date_ons                                          ///
>                                              eia_code_date                                              ///
>                                                  rheum_appt_date                                        ///
>                                              ra_code_date                                               ///
>                                                  psa_code_date                                          ///
>                                                  anksp_code_date                                        ///
>                                                  last_gp_prerheum_date                          ///
>                                                  last_gp_precode_date                           ///     
>                                                  last_gp_refrheum_date                          ///
>                                                  last_gp_refcode_date                           ///
>                                                  referral_rheum_prerheum                        ///
>                                                  referral_rheum_precode                         ///     
>                                                  chronic_cardiac_disease                        ///
>                                                  diabetes                                                       ///
>                                                  hypertension                                           ///     
>                                                  chronic_resp_disease                           ///
>                                                  copd                                                           ///
>                                                  chronic_liver_disease                          ///
>                                                  stroke                                                         ///
>                                                  lung_cancer                                            ///
>                                                  haem_cancer                                            ///
>                                                  other_cancer                                           ///
>                                                  esrf                                                           ///
>                                                  organ_transplant                                       ///
>                                                  hydroxychloroquine                                     ///
>                                                  leflunomide                                            ///
>                                                  methotrexate                                           ///
>                                                  methotrexate_inj                                       ///
>                                                  sulfasalazine                                          ///
>                                                  {c -(}
{txt}  2{com}.                                                                  
.                 capture confirm string variable `var'
{txt}  3{com}.                 if _rc!=0 {c -(}
{txt}  4{com}.                         assert `var'==.
{txt}  5{com}.                         rename `var' `var'_date
{txt}  6{com}.                 {c )-}
{txt}  7{com}.         
.                 else {c -(}
{txt}  8{com}.                                 rename `var' `var'_dstr
{txt}  9{com}.                                 gen `var'_date = date(`var'_dstr, "YMD") 
{txt} 10{com}.                                 order `var'_date, after(`var'_dstr)
{txt} 11{com}.                                 drop `var'_dstr
{txt} 12{com}.                                 gen `var'_date15 = `var'_date+15
{txt} 13{com}.                                 order `var'_date15, after(`var'_date)
{txt} 14{com}.                                 drop `var'_date
{txt} 15{com}.                                 rename `var'_date15 `var'_date
{txt} 16{com}.                 {c )-}
{txt} 17{com}.         
.         format `var'_date %td
{txt} 18{com}. {c )-}
{res}{txt}(90,000 missing values generated)
(90,000 missing values generated)
{res}{txt}(1,000 missing values generated)
(1,000 missing values generated)
{res}{txt}(9,999 missing values generated)
(9,999 missing values generated)
{res}{txt}(1,000 missing values generated)
(1,000 missing values generated)
{res}{txt}(1,000 missing values generated)
(1,000 missing values generated)
{res}{txt}(1,000 missing values generated)
(1,000 missing values generated)
{res}{txt}(9,999 missing values generated)
(9,999 missing values generated)
{res}{txt}(9,999 missing values generated)
(9,999 missing values generated)
{res}{txt}(9,999 missing values generated)
(9,999 missing values generated)
{res}{txt}(9,999 missing values generated)
(9,999 missing values generated)
{res}{txt}(9,999 missing values generated)
(9,999 missing values generated)
{res}{txt}(9,999 missing values generated)
(9,999 missing values generated)
{res}{txt}(80,000 missing values generated)
(80,000 missing values generated)
{res}{txt}(80,000 missing values generated)
(80,000 missing values generated)
{res}{txt}(80,000 missing values generated)
(80,000 missing values generated)
{res}{txt}(80,000 missing values generated)
(80,000 missing values generated)
{res}{txt}(80,000 missing values generated)
(80,000 missing values generated)
{res}{txt}(80,000 missing values generated)
(80,000 missing values generated)
{res}{txt}(80,000 missing values generated)
(80,000 missing values generated)
{res}{txt}(80,000 missing values generated)
(80,000 missing values generated)
{res}{txt}(80,000 missing values generated)
(80,000 missing values generated)
{res}{txt}(80,000 missing values generated)
(80,000 missing values generated)
{res}{txt}(80,000 missing values generated)
(80,000 missing values generated)
{res}{txt}(80,000 missing values generated)
(80,000 missing values generated)
{res}{txt}(90,000 missing values generated)
(90,000 missing values generated)
{res}{txt}(90,000 missing values generated)
(90,000 missing values generated)
{res}{txt}(90,000 missing values generated)
(90,000 missing values generated)
{res}{txt}(90,000 missing values generated)
(90,000 missing values generated)
{res}{txt}(90,000 missing values generated)
(90,000 missing values generated)
{res}{txt}
{com}.                                                  
. **Rename variables with extra 'date' added to the end of variable names===========================================================*/ 
. rename rheum_appt_date_date rheum_appt_date
{res}{txt}
{com}. rename eia_code_date_date eia_code_date
{res}{txt}
{com}. rename ra_code_date_date ra_code_date
{res}{txt}
{com}. rename psa_code_date_date psa_code_date
{res}{txt}
{com}. rename anksp_code_date_date anksp_code_date
{res}{txt}
{com}. rename died_date_ons_date died_ons_date
{res}{txt}
{com}. rename last_gp_prerheum_date_date last_gp_prerheum_date
{res}{txt}
{com}. rename last_gp_refrheum_date_date last_gp_refrheum_date
{res}{txt}
{com}. rename last_gp_refcode_date_date last_gp_refcode_date
{res}{txt}
{com}. rename last_gp_precode_date_date last_gp_precode_date
{res}{txt}
{com}. rename hba1c_mmol_per_mol_date_date hba1c_mmol_per_mol_date
{res}{txt}
{com}. rename hba1c_percentage_date_date hba1c_percentage_date
{res}{txt}
{com}. rename creatinine_date_date creatinine_date
{res}{txt}
{com}. rename creatinine creatinine_value 
{res}{txt}
{com}. rename bmi_date_measured_date bmi_date
{res}{txt}
{com}. rename bmi bmi_value
{res}{txt}
{com}. 
. **Create binary indicator variables for relevant conditions ====================================================*/
. 
. foreach var of varlist   eia_code_date                                          ///
>                                                  rheum_appt_date                                        ///
>                                              ra_code_date                                               ///
>                                                  psa_code_date                                          ///
>                                                  anksp_code_date                                        ///
>                                                  died_ons_date                                          ///
>                                                  last_gp_prerheum_date                          ///
>                                                  last_gp_precode_date                           ///     
>                                                  last_gp_refrheum_date                          ///
>                                                  last_gp_refcode_date                           ///
>                                                  referral_rheum_prerheum_date           ///
>                                                  referral_rheum_precode_date            ///     
>                                                  chronic_cardiac_disease_date           ///
>                                                  diabetes_date                                          ///
>                                                  hypertension_date                                      ///
>                                                  chronic_resp_disease_date                      ///
>                                                  copd_date                                                      ///
>                                                  chronic_liver_disease_date                     ///
>                                                  stroke_date                                            ///
>                                                  lung_cancer_date                                       ///
>                                                  haem_cancer_date                                       ///             
>                                                  other_cancer_date                                      ///
>                                                  esrf_date                                                      ///
>                                                  creatinine_date                                        ///
>                                                  organ_transplant_date                          ///
>                                                  hydroxychloroquine_date                        ///     
>                                                  leflunomide_date                                       ///
>                                                  methotrexate_date                                      ///
>                                                  methotrexate_inj_date                          ///             
>                                                  sulfasalazine_date                                     ///
>                                                  abatacept_date                                         ///
>                                                  adalimumab_date                                        ///
>                                                  baricitinib_date                                       ///
>                                                  certolizumab_date                                      ///
>                                                  etanercept_date                                        ///
>                                                  golimumab_date                                         ///
>                                                  guselkumab_date                                        ///
>                                                  infliximab_date                                        ///
>                                                  ixekizumab_date                                        ///
>                                                  methotrexate_hcd_date                          ///
>                                                  rituximab_date                                         ///             
>                                                  sarilumab_date                                         ///
>                                                  secukinumab_date                                       ///
>                                                  tocilizumab_date                                       ///             
>                                                  tofacitinib_date                                       ///
>                                                  upadacitinib_date                                      ///
>                                                  ustekinumab_date   {c -(}                           
{txt}  2{com}.         /*date ranges are applied in python, so presence of date indicates presence of 
>           disease in the correct time frame*/ 
.         local newvar =  substr("`var'", 1, length("`var'") - 5)
{txt}  3{com}.         gen `newvar' = (`var'!=. )
{txt}  4{com}.         order `newvar', after(`var')
{txt}  5{com}. {c )-}
{txt}
{com}. 
. *Refine diagnostic window=============================================================*/
. 
. **All patients should have EIA code
. tab eia_code

   {txt}eia_code {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      1,000        1.00        1.00
{txt}          1 {c |}{res}     99,000       99.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}    100,000      100.00
{txt}
{com}. keep if eia_code==1
{txt}(1,000 observations deleted)

{com}. 
. **Keep patients with first EIA code in GP record if code was after 1st March 2019
. keep if eia_code_date>=date("$start_date", "DMY") & eia_code_date!=. 
{txt}(26,199 observations deleted)

{com}. tab eia_code

   {txt}eia_code {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}     72,801      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     72,801      100.00
{txt}
{com}. 
. **Month/Year of diagnosis
. gen year_diag=year(eia_code_date)
{txt}
{com}. format year_diag %ty
{txt}
{com}. gen month_diag=month(eia_code_date)
{txt}
{com}. gen mo_year_diagn=ym(year_diag, month_diag)
{txt}
{com}. format mo_year_diagn %tm
{txt}
{com}. 
. *Include only most recent EIA sub-diagnosis
. replace ra_code =0 if psa_code_date >= ra_code_date & psa_code_date !=.
{txt}(35,653 real changes made)

{com}. replace ra_code =0 if anksp_code_date >= ra_code_date & anksp_code_date !=.
{txt}(12,157 real changes made)

{com}. replace psa_code =0 if ra_code_date >= psa_code_date & ra_code_date !=.
{txt}(35,752 real changes made)

{com}. replace psa_code =0 if anksp_code_date >= psa_code_date & anksp_code_date !=.
{txt}(12,159 real changes made)

{com}. replace anksp_code =0 if psa_code_date >= anksp_code_date & psa_code_date !=.
{txt}(35,646 real changes made)

{com}. replace anksp_code =0 if ra_code_date >= anksp_code_date & ra_code_date !=.
{txt}(12,153 real changes made)

{com}. gen eia_diagnosis=1 if ra_code==1
{txt}(48,529 missing values generated)

{com}. replace eia_diagnosis=2 if psa_code==1
{txt}(24,167 real changes made)

{com}. replace eia_diagnosis=3 if anksp_code==1
{txt}(24,298 real changes made)

{com}. lab define eia_diagnosis 1 "RA" 2 "PsA" 3 "AxSpA", modify
{txt}
{com}. lab val eia_diagnosis eia_diagnosis
{txt}
{com}. tab eia_diagnosis

{txt}eia_diagnos {c |}
         is {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
         RA {c |}{res}     24,272       33.37       33.37
{txt}        PsA {c |}{res}     24,167       33.23       66.59
{txt}      AxSpA {c |}{res}     24,298       33.41      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     72,737      100.00
{txt}
{com}. drop if eia_diagnosis==.
{txt}(64 observations deleted)

{com}. 
. *Define appointments and referrals======================================*/
. 
. **Rheumatology appt 
. tab rheum_appt  //proportion with first rheum outpatient date in the year before EIA code appears in GP record 

 {txt}rheum_appt {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      7,241        9.96        9.96
{txt}          1 {c |}{res}     65,496       90.04      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     72,737      100.00
{txt}
{com}. tab rheum_appt if rheum_appt_date<eia_code_date & rheum_appt_date!=. //confirm proportion who had rheum appt (i.e. not missing) and appt before EIA code 

 {txt}rheum_appt {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}     40,387      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     40,387      100.00
{txt}
{com}. 
. **Rheumatology referrals
. tab referral_rheum_prerheum //last rheum referral in the year before rheumatology outpatient (requires rheum appt to have been present)

{txt}referral_rh {c |}
eum_prerheu {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      7,294       10.03       10.03
{txt}          1 {c |}{res}     65,443       89.97      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     72,737      100.00
{txt}
{com}. tab referral_rheum_prerheum if rheum_appt!=0  //last rheum referral in the year before rheumatology outpatient if rheum appt date present

{txt}referral_rh {c |}
eum_prerheu {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      6,608       10.09       10.09
{txt}          1 {c |}{res}     58,888       89.91      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     65,496      100.00
{txt}
{com}. tab referral_rheum_prerheum if rheum_appt!=0 & referral_rheum_prerheum_date<rheum_appt_date  //last rheum referral in the year before rheumatology outpatient, assuming ref date before rheum appt date

{txt}referral_rh {c |}
eum_prerheu {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}     29,348      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     29,348      100.00
{txt}
{com}. tab referral_rheum_precode //last rheum referral in the year before EIA code (could use if rheum appt missing)

{txt}referral_rh {c |}
eum_precode {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      7,258        9.98        9.98
{txt}          1 {c |}{res}     65,479       90.02      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     72,737      100.00
{txt}
{com}. gen referral_rheum_comb_date = referral_rheum_prerheum_date if referral_rheum_prerheum_date!=.
{txt}(7,294 missing values generated)

{com}. replace referral_rheum_comb_date = referral_rheum_precode_date if referral_rheum_prerheum_date==. & referral_rheum_precode_date!=.
{txt}(6,573 real changes made)

{com}. format %td referral_rheum_comb_date
{txt}
{com}. 
. **GP appointments
. tab last_gp_refrheum //proportion with last GP appointment in year before rheum referral (pre-rheum appt)

{txt}last_gp_ref {c |}
      rheum {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      7,386       10.15       10.15
{txt}          1 {c |}{res}     65,351       89.85      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     72,737      100.00
{txt}
{com}. gen all_appts=1 if last_gp_refrheum==1 & referral_rheum_prerheum==1 & rheum_appt==1 & eia_code==1 & last_gp_refrheum_date<referral_rheum_prerheum_date & referral_rheum_prerheum_date<rheum_appt_date & rheum_appt_date<eia_code_date 
{txt}(69,934 missing values generated)

{com}. recode all_appts .=0
{txt}(69934 changes made to {bf:all_appts})

{com}. tab all_appts //KEY - proportion who had a last gp appt, then rheum ref, then rheum appt, then EIA code 

  {txt}all_appts {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     69,934       96.15       96.15
{txt}          1 {c |}{res}      2,803        3.85      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     72,737      100.00
{txt}
{com}. tab last_gp_refcode     if referral_rheum_precode!=0 //last GP appointment before rheum ref if present (pre-eia code ref)

{txt}last_gp_ref {c |}
       code {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      6,584       10.06       10.06
{txt}          1 {c |}{res}     58,895       89.94      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     65,479      100.00
{txt}
{com}. tab last_gp_prerheum if rheum_appt!=0 //last GP appointment before rheum appt (if present)

{txt}last_gp_pre {c |}
      rheum {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      6,522        9.96        9.96
{txt}          1 {c |}{res}     58,974       90.04      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     65,496      100.00
{txt}
{com}. tab last_gp_precode //last GP appointment before EIA code

{txt}last_gp_pre {c |}
       code {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      7,278       10.01       10.01
{txt}          1 {c |}{res}     65,459       89.99      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     72,737      100.00
{txt}
{com}. 
. **For sensitivity analyses for those without rheum_appt, replace diagnosis date as EIA code date if rheum appt pre-code is missing or after
. gen eia_diagnosis_date_nomiss=rheum_appt_date if rheum_appt_date!=.
{txt}(7,241 missing values generated)

{com}. format %td eia_diagnosis_date_nomiss
{txt}
{com}. replace eia_diagnosis_date_nomiss=eia_code_date if (rheum_appt_date==. | rheum_appt_date>eia_code_date) & eia_code_date!=.
{txt}(32,299 real changes made)

{com}. gen eia_diagnosis_nomiss=1 if eia_diagnosis_date_nomiss!=.
{txt}
{com}. recode eia_diagnosis_nomiss .=0
{txt}(0 changes made to {bf:eia_diagnosis_nomiss})

{com}. tab eia_diagnosis_nomiss

{txt}eia_diagnos {c |}
  is_nomiss {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}     72,737      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     72,737      100.00
{txt}
{com}. 
. *Define drugs and dates=====================================================*/
. 
. **csDMARDs (not including high cost MTX; wouldn't be shared care)
. gen csdmard=1 if hydroxychloroquine==1 | leflunomide==1 | methotrexate==1 | methotrexate_inj==1 | sulfasalazine==1
{txt}(42,872 missing values generated)

{com}. recode csdmard .=0 
{txt}(42872 changes made to {bf:csdmard})

{com}. tab csdmard 

    {txt}csdmard {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     42,872       58.94       58.94
{txt}          1 {c |}{res}     29,865       41.06      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     72,737      100.00
{txt}
{com}. bys eia_diagnosis: tab csdmard

{txt}{hline}
-> eia_diagnosis = RA

    csdmard {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     14,332       59.05       59.05
{txt}          1 {c |}{res}      9,940       40.95      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     24,272      100.00

{txt}{hline}
-> eia_diagnosis = PsA

    csdmard {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     14,173       58.65       58.65
{txt}          1 {c |}{res}      9,994       41.35      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     24,167      100.00

{txt}{hline}
-> eia_diagnosis = AxSpA

    csdmard {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     14,367       59.13       59.13
{txt}          1 {c |}{res}      9,931       40.87      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     24,298      100.00

{txt}
{com}. 
. **csDMARDs (including high cost MTX)
. gen csdmard_hcd=1 if hydroxychloroquine==1 | leflunomide==1 | methotrexate==1 | methotrexate_inj==1 | methotrexate_hcd==1 | sulfasalazine==1
{txt}(38,546 missing values generated)

{com}. recode csdmard_hcd .=0 
{txt}(38546 changes made to {bf:csdmard_hcd})

{com}. tab csdmard_hcd

{txt}csdmard_hcd {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     38,546       52.99       52.99
{txt}          1 {c |}{res}     34,191       47.01      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     72,737      100.00
{txt}
{com}. bys eia_diagnosis: tab csdmard_hcd 

{txt}{hline}
-> eia_diagnosis = RA

csdmard_hcd {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     12,872       53.03       53.03
{txt}          1 {c |}{res}     11,400       46.97      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     24,272      100.00

{txt}{hline}
-> eia_diagnosis = PsA

csdmard_hcd {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     12,733       52.69       52.69
{txt}          1 {c |}{res}     11,434       47.31      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     24,167      100.00

{txt}{hline}
-> eia_diagnosis = AxSpA

csdmard_hcd {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     12,941       53.26       53.26
{txt}          1 {c |}{res}     11,357       46.74      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     24,298      100.00

{txt}
{com}. 
. **Date of first csDMARD script (not including high cost MTX prescriptions)
. gen csdmard_date=min(hydroxychloroquine_date, leflunomide_date, methotrexate_date, methotrexate_inj_date, sulfasalazine_date)
{txt}(42,872 missing values generated)

{com}. format %td csdmard_date
{txt}
{com}. 
. **Date of first csDMARD script (including high cost MTX prescriptions)
. gen csdmard_hcd_date=min(hydroxychloroquine_date, leflunomide_date, methotrexate_date, methotrexate_inj_date, methotrexate_hcd_date, sulfasalazine_date)
{txt}(38,546 missing values generated)

{com}. format %td csdmard_hcd_date
{txt}
{com}. 
. **Biologic use
. gen biologic=1 if abatacept==1 | adalimumab==1 | baricitinib==1 | certolizumab==1 | etanercept==1 | golimumab==1 | guselkumab==1 | infliximab==1 | ixekizumab==1 | rituximab==1 | sarilumab==1 | secukinumab==1 | tocilizumab==1 | tofacitinib==1 | upadacitinib==1 | ustekinumab==1 
{txt}(13,417 missing values generated)

{com}. recode biologic .=0
{txt}(13417 changes made to {bf:biologic})

{com}. tab biologic 

   {txt}biologic {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     13,417       18.45       18.45
{txt}          1 {c |}{res}     59,320       81.55      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     72,737      100.00
{txt}
{com}. bys eia_diagnosis: tab biologic 

{txt}{hline}
-> eia_diagnosis = RA

   biologic {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      4,495       18.52       18.52
{txt}          1 {c |}{res}     19,777       81.48      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     24,272      100.00

{txt}{hline}
-> eia_diagnosis = PsA

   biologic {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      4,458       18.45       18.45
{txt}          1 {c |}{res}     19,709       81.55      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     24,167      100.00

{txt}{hline}
-> eia_diagnosis = AxSpA

   biologic {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      4,464       18.37       18.37
{txt}          1 {c |}{res}     19,834       81.63      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     24,298      100.00

{txt}
{com}. 
. **Date of first biologic script
. gen biologic_date=min(abatacept_date, adalimumab_date, baricitinib_date, certolizumab_date, etanercept_date, golimumab_date, guselkumab_date, infliximab_date, ixekizumab_date, rituximab_date, sarilumab_date, secukinumab_date, tocilizumab_date, tofacitinib_date, upadacitinib_date, ustekinumab_date)
{txt}(13,417 missing values generated)

{com}. format %td biologic_date
{txt}
{com}. 
. **Exclude if first csdmard or biologic was before first rheum appt
. ***Nb. could introduce leeway e.g. 30 days?
. tab csdmard if rheum_appt_date!=. & csdmard_date!=. & csdmard_date<rheum_appt_date

    {txt}csdmard {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}     10,791      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     10,791      100.00
{txt}
{com}. drop if rheum_appt_date!=. & csdmard_date!=. & csdmard_date<rheum_appt_date
{txt}(10,791 observations deleted)

{com}. tab biologic if rheum_appt_date!=. & biologic_date!=. & biologic_date<rheum_appt_date 

   {txt}biologic {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}     18,902      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     18,902      100.00
{txt}
{com}. drop if rheum_appt_date!=. & biologic_date!=. & biologic_date<rheum_appt_date 
{txt}(18,902 observations deleted)

{com}. 
. *Number of EIA diagnoses in 1-year time windows=========================================*/
. 
. gen diagnosis_year=1 if eia_code_date>=td(01mar2019) & eia_code_date<td(01mar2020)
{txt}(29,361 missing values generated)

{com}. replace diagnosis_year=2 if eia_code_date>=td(01mar2020) & eia_code_date<td(01mar2021)
{txt}(13,870 real changes made)

{com}. replace diagnosis_year=3 if eia_code_date>=td(01mar2021) & eia_code_date<td(01mar2022)
{txt}(13,717 real changes made)

{com}. lab define diagnosis_year 1 "March 2019-March 2020" 2 "March 2020-March 2021" 3 "March 2021-March 2022", modify
{txt}
{com}. lab val diagnosis_year diagnosis_year
{txt}
{com}. lab var diagnosis_year "Year of diagnosis"
{txt}
{com}. tab diagnosis_year

    {txt}Year of diagnosis {c |}      Freq.     Percent        Cum.
{hline 22}{c +}{hline 35}
March 2019-March 2020 {c |}{res}     13,683       33.15       33.15
{txt}March 2020-March 2021 {c |}{res}     13,870       33.61       66.76
{txt}March 2021-March 2022 {c |}{res}     13,717       33.24      100.00
{txt}{hline 22}{c +}{hline 35}
                Total {c |}{res}     41,270      100.00
{txt}
{com}. bys eia_diagnosis: tab diagnosis_year

{txt}{hline}
-> eia_diagnosis = RA

    Year of diagnosis {c |}      Freq.     Percent        Cum.
{hline 22}{c +}{hline 35}
March 2019-March 2020 {c |}{res}      4,603       33.28       33.28
{txt}March 2020-March 2021 {c |}{res}      4,644       33.57       66.85
{txt}March 2021-March 2022 {c |}{res}      4,585       33.15      100.00
{txt}{hline 22}{c +}{hline 35}
                Total {c |}{res}     13,832      100.00

{txt}{hline}
-> eia_diagnosis = PsA

    Year of diagnosis {c |}      Freq.     Percent        Cum.
{hline 22}{c +}{hline 35}
March 2019-March 2020 {c |}{res}      4,476       32.86       32.86
{txt}March 2020-March 2021 {c |}{res}      4,608       33.83       66.70
{txt}March 2021-March 2022 {c |}{res}      4,536       33.30      100.00
{txt}{hline 22}{c +}{hline 35}
                Total {c |}{res}     13,620      100.00

{txt}{hline}
-> eia_diagnosis = AxSpA

    Year of diagnosis {c |}      Freq.     Percent        Cum.
{hline 22}{c +}{hline 35}
March 2019-March 2020 {c |}{res}      4,604       33.32       33.32
{txt}March 2020-March 2021 {c |}{res}      4,618       33.42       66.74
{txt}March 2021-March 2022 {c |}{res}      4,596       33.26      100.00
{txt}{hline 22}{c +}{hline 35}
                Total {c |}{res}     13,818      100.00

{txt}
{com}. 
. *Time to referral, appointment and EIA code=============================================*/
. 
. **Time from last GP to rheum ref before rheum appt (i.e. if appts are present and in correct time order) //Note - referral could be coded before GP appt?
. gen time_gp_rheum_ref_appt = (referral_rheum_prerheum_date - last_gp_refrheum_date) if referral_rheum_prerheum_date!=. & last_gp_refrheum_date!=. & rheum_appt_date!=. & referral_rheum_prerheum_date>last_gp_refrheum_date & referral_rheum_prerheum_date<rheum_appt_date & rheum_appt_date<eia_code_date
{txt}(41,907 missing values generated)

{com}. tabstat time_gp_rheum_ref_appt, stats (n mean p50 p25 p75) //all patients

{txt}{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_rh~t} {...}
{c |}{...}
 {res}     1137  237.4785       179        81       347
{txt}{hline 13}{c BT}{hline 50}

{com}. bys eia_diagnosis: tabstat time_gp_rheum_ref_appt, stats (n mean p50 p25 p75)

{txt}{hline}
-> eia_diagnosis = RA

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_rh~t} {...}
{c |}{...}
 {res}      376  240.2553     176.5      69.5     347.5
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = PsA

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_rh~t} {...}
{c |}{...}
 {res}      386  235.5078     178.5        82       344
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = AxSpA

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_rh~t} {...}
{c |}{...}
 {res}      375  236.7227       180        86       353
{txt}{hline 13}{c BT}{hline 50}

{com}. 
. **Time from last GP to rheum ref before eia code (sensitivity analysis; includes those with no rheum appt)
. gen time_gp_rheum_ref_code = (referral_rheum_precode_date - last_gp_refcode_date) if referral_rheum_precode_date!=. & last_gp_refcode_date!=. & referral_rheum_precode_date>last_gp_refcode_date & referral_rheum_precode_date<eia_code_date
{txt}(35,671 missing values generated)

{com}. tabstat time_gp_rheum_ref_code, stats (n mean p50 p25 p75)

{txt}{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_rh~e} {...}
{c |}{...}
 {res}     7373  381.7057       322       144       564
{txt}{hline 13}{c BT}{hline 50}

{com}. bys eia_diagnosis: tabstat time_gp_rheum_ref_code, stats (n mean p50 p25 p75)

{txt}{hline}
-> eia_diagnosis = RA

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_rh~e} {...}
{c |}{...}
 {res}     2514   391.004       332       152       577
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = PsA

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_rh~e} {...}
{c |}{...}
 {res}     2451  383.5753       328       148       560
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = AxSpA

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_rh~e} {...}
{c |}{...}
 {res}     2408  370.0951     310.5       132     539.5
{txt}{hline 13}{c BT}{hline 50}

{com}. 
. **Time from last GP to rheum ref (combined - sensitivity analysis; includes those with no rheum appt)
. gen time_gp_rheum_ref_comb = time_gp_rheum_ref_appt 
{txt}(41,907 missing values generated)

{com}. replace time_gp_rheum_ref_comb = time_gp_rheum_ref_code if time_gp_rheum_ref_appt==. & time_gp_rheum_ref_code!=.
{txt}(7,103 real changes made)

{com}. tabstat time_gp_rheum_ref_comb, stats (n mean p50 p25 p75)

{txt}{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_rh~b} {...}
{c |}{...}
 {res}     8240  360.2211       297       130     528.5
{txt}{hline 13}{c BT}{hline 50}

{com}. bys eia_diagnosis: tabstat time_gp_rheum_ref_comb, stats (n mean p50 p25 p75)

{txt}{hline}
-> eia_diagnosis = RA

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_rh~b} {...}
{c |}{...}
 {res}     2807  368.4613       301       136       545
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = PsA

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_rh~b} {...}
{c |}{...}
 {res}     2740   361.542       302       135       526
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = AxSpA

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_rh~b} {...}
{c |}{...}
 {res}     2693  350.2882       287       120       510
{txt}{hline 13}{c BT}{hline 50}

{com}. 
. **Time from last GP pre-rheum appt to first rheum appt (sensitivity analysis; includes those with no rheum ref)
. gen time_gp_rheum_appt = (rheum_appt_date - last_gp_prerheum_date) if rheum_appt_date!=. & last_gp_prerheum_date!=. & rheum_appt_date>last_gp_prerheum_date & rheum_appt_date<eia_code_date
{txt}(36,187 missing values generated)

{com}. tabstat time_gp_rheum_appt, stats (n mean p50 p25 p75)

{txt}{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_~m_appt} {...}
{c |}{...}
 {res}     6857  292.3805       234       107       419
{txt}{hline 13}{c BT}{hline 50}

{com}. bys eia_diagnosis: tabstat time_gp_rheum_appt, stats (n mean p50 p25 p75)

{txt}{hline}
-> eia_diagnosis = RA

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_~m_appt} {...}
{c |}{...}
 {res}     2343  287.0854       230       108       409
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = PsA

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_~m_appt} {...}
{c |}{...}
 {res}     2221  302.4777       249       112       435
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = AxSpA

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_~m_appt} {...}
{c |}{...}
 {res}     2293  288.0109       226       102       407
{txt}{hline 13}{c BT}{hline 50}

{com}. 
. **Time from last GP pre-code to EIA code (sensitivity analysis; includes those with no rheum ref and/or no rheum appt)
. gen time_gp_eia_code = (eia_code_date - last_gp_precode_date) if eia_code_date!=. & last_gp_precode_date!=. & eia_code_date>last_gp_precode_date
{txt}(19,029 missing values generated)

{com}. tabstat time_gp_eia_code, stats (n mean p50 p25 p75)

{txt}{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_ei~e} {...}
{c |}{...}
 {res}    24015  523.9135       474       232       776
{txt}{hline 13}{c BT}{hline 50}

{com}. bys eia_diagnosis: tabstat time_gp_eia_code, stats (n mean p50 p25 p75)

{txt}{hline}
-> eia_diagnosis = RA

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_ei~e} {...}
{c |}{...}
 {res}     7981   527.856       480       235       779
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = PsA

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_ei~e} {...}
{c |}{...}
 {res}     7984  520.9415       469       229       774
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = AxSpA

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_ei~e} {...}
{c |}{...}
 {res}     8050  522.9524       474       232       775
{txt}{hline 13}{c BT}{hline 50}

{com}. 
. **Time from last GP to EIA diagnosis (combined - sensitivity analysis; includes those with no rheum appt)
. gen time_gp_eia_diag = time_gp_rheum_appt
{txt}(36,187 missing values generated)

{com}. replace time_gp_eia_diag = time_gp_eia_code if time_gp_rheum_appt==. & time_gp_eia_code!=.
{txt}(19,651 real changes made)

{com}. tabstat time_gp_eia_diag, stats (n mean p50 p25 p75)

{txt}{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_ei~g} {...}
{c |}{...}
 {res}    26508  454.9023       386       177       677
{txt}{hline 13}{c BT}{hline 50}

{com}. bys eia_diagnosis: tabstat time_gp_eia_diag, stats (n mean p50 p25 p75)

{txt}{hline}
-> eia_diagnosis = RA

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_ei~g} {...}
{c |}{...}
 {res}     8837  456.1464       385       177       680
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = PsA

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_ei~g} {...}
{c |}{...}
 {res}     8790  455.4611       387       179       676
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = AxSpA

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_ei~g} {...}
{c |}{...}
 {res}     8881  453.1111       385       176       672
{txt}{hline 13}{c BT}{hline 50}

{com}. 
. **Time from rheum ref to rheum appt (i.e. if appts are present and in correct time order)
. gen time_ref_rheum_appt = (rheum_appt_date - referral_rheum_prerheum_date) if rheum_appt_date!=. & referral_rheum_prerheum_date!=. & referral_rheum_prerheum_date<rheum_appt_date & rheum_appt_date<eia_code_date
{txt}(36,434 missing values generated)

{com}. tabstat time_ref_rheum_appt, stats (n mean p50 p25 p75)

{txt}{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_ref_r~t} {...}
{c |}{...}
 {res}     6610   287.488       230       102       409
{txt}{hline 13}{c BT}{hline 50}

{com}. bys eia_diagnosis: tabstat time_ref_rheum_appt, stats (n mean p50 p25 p75)

{txt}{hline}
-> eia_diagnosis = RA

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_ref_r~t} {...}
{c |}{...}
 {res}     2243  287.3923       227       102       410
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = PsA

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_ref_r~t} {...}
{c |}{...}
 {res}     2190   291.547     235.5       103       409
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = AxSpA

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_ref_r~t} {...}
{c |}{...}
 {res}     2177  283.5034       226       101       408
{txt}{hline 13}{c BT}{hline 50}

{com}. 
. **Time from rheum ref to EIA code (sensitivity analysis; includes those with no rheum appt)
. gen time_ref_rheum_eia = (eia_code_date - referral_rheum_precode_date) if eia_code_date!=. & referral_rheum_precode_date!=. & referral_rheum_precode_date<eia_code_date  
{txt}(19,201 missing values generated)

{com}. tabstat time_ref_rheum_eia, stats (n mean p50 p25 p75)

{txt}{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_ref_r~a} {...}
{c |}{...}
 {res}    23843  521.1205       468       234       765
{txt}{hline 13}{c BT}{hline 50}

{com}. bys eia_diagnosis: tabstat time_ref_rheum_eia, stats (n mean p50 p25 p75)

{txt}{hline}
-> eia_diagnosis = RA

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_ref_r~a} {...}
{c |}{...}
 {res}     7992  519.3574       461       227       774
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = PsA

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_ref_r~a} {...}
{c |}{...}
 {res}     7918  521.1128       473       240       755
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = AxSpA

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_ref_r~a} {...}
{c |}{...}
 {res}     7933  522.9043       470       236       769
{txt}{hline 13}{c BT}{hline 50}

{com}. 
. **Time from rheum ref to EIA diagnosis (combined - sensitivity analysis; includes those with no rheum appt)
. gen time_ref_rheum_eia_comb = time_ref_rheum_appt
{txt}(36,434 missing values generated)

{com}. replace time_ref_rheum_eia_comb = time_ref_rheum_eia if time_ref_rheum_appt==. & time_ref_rheum_eia!=.
{txt}(19,644 real changes made)

{com}. tabstat time_ref_rheum_eia_comb, stats (n mean p50 p25 p75)

{txt}{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_ref_r~b} {...}
{c |}{...}
 {res}    26254    454.64       385       179       671
{txt}{hline 13}{c BT}{hline 50}

{com}. bys eia_diagnosis: tabstat time_ref_rheum_eia_comb, stats (n mean p50 p25 p75)

{txt}{hline}
-> eia_diagnosis = RA

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_ref_r~b} {...}
{c |}{...}
 {res}     8834  453.3844       380       175       675
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = PsA

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_ref_r~b} {...}
{c |}{...}
 {res}     8687  455.0972       386       183       667
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = AxSpA

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_ref_r~b} {...}
{c |}{...}
 {res}     8733  455.4554       388       179       669
{txt}{hline 13}{c BT}{hline 50}

{com}. 
. **Time from rheum appt to EIA code (i.e. if appts are present and in correct time order)
. gen time_rheum_eia_code = (eia_code_date - rheum_appt_date) if eia_code_date!=. & rheum_appt_date!=. & rheum_appt_date<eia_code_date 
{txt}(13,987 missing values generated)

{com}. tabstat time_rheum_eia_code, stats (n mean p50 p25 p75) 

{txt}{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_rheum~e} {...}
{c |}{...}
 {res}    29057  602.1917       572       314       870
{txt}{hline 13}{c BT}{hline 50}

{com}. bys eia_diagnosis: tabstat time_rheum_eia_code, stats (n mean p50 p25 p75) 

{txt}{hline}
-> eia_diagnosis = RA

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_rheum~e} {...}
{c |}{...}
 {res}     9836  602.7728       576       307       872
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = PsA

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_rheum~e} {...}
{c |}{...}
 {res}     9558  606.2578     578.5       321       876
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = AxSpA

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_rheum~e} {...}
{c |}{...}
 {res}     9663  597.5784       561       313       860
{txt}{hline 13}{c BT}{hline 50}

{com}. 
. ***************************************************************************************************************************
. *Time to first prescription - all of the below are shared care prescriptions, aside from those with MTX_high cost drug data included
. 
. **Time to first csDMARD script for RA patients, whereby first rheum appt is classed as diagnosis date (assumes rheum appt present; not including high cost MTX prescriptions)
. gen time_to_csdmard=(csdmard_date-rheum_appt_date) if csdmard==1 & rheum_appt_date!=. & csdmard_date>rheum_appt_date 
{txt}(30,715 missing values generated)

{com}. tabstat time_to_csdmard if ra_code==1, stats (n mean p50 p25 p75)

{txt}{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_cs~d} {...}
{c |}{...}
 {res}     4100  567.7107       532       293       815
{txt}{hline 13}{c BT}{hline 50}

{com}. 
. **Time to first csDMARD script for RA patients (including high cost MTX prescriptions)
. gen time_to_csdmard_hcd=(csdmard_hcd_date-rheum_appt_date) if csdmard_hcd==1 & rheum_appt_date!=. & csdmard_hcd_date>rheum_appt_date 
{txt}(29,085 missing values generated)

{com}. tabstat time_to_csdmard_hcd if ra_code==1, stats (n mean p50 p25 p75) 

{txt}{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_c~cd} {...}
{c |}{...}
 {res}     4652  559.9693     519.5       285     803.5
{txt}{hline 13}{c BT}{hline 50}

{com}. 
. **Time to first csDMARD script for PsA patients (not including high cost MTX prescriptions)
. tabstat time_to_csdmard if psa_code==1, stats (n mean p50 p25 p75)

{txt}{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_c~rd} {...}
{c |}{...}
 {res}     4078    564.77       524       289       820
{txt}{hline 13}{c BT}{hline 50}

{com}. tab csdmard if rheum_appt_date!=. & csdmard_date<rheum_appt_date & psa_code==1 
{txt}no observations

{com}. 
. **Time to first csDMARD script for PsA patients (including high cost MTX prescriptions)
. tabstat time_to_csdmard_hcd if psa_code==1, stats (n mean p50 p25 p75) 

{txt}{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_c~cd} {...}
{c |}{...}
 {res}     4626  554.7315     513.5       277       808
{txt}{hline 13}{c BT}{hline 50}

{com}. tab csdmard_hcd if rheum_appt_date!=. & csdmard_hcd_date<rheum_appt_date & psa_code==1  

{txt}csdmard_hcd {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}        217      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        217      100.00
{txt}
{com}. 
. **csDMARD time categories for RA patients (not including high cost MTX prescriptions)
. gen csdmard_6w=1 if time_to_csdmard<=42 & time_to_csdmard!=. 
{txt}(42,678 missing values generated)

{com}. recode csdmard_6w .=0
{txt}(42678 changes made to {bf:csdmard_6w})

{com}. tab csdmard_6w if ra_code==1

 {txt}csdmard_6w {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     14,327       99.08       99.08
{txt}          1 {c |}{res}        133        0.92      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,460      100.00
{txt}
{com}. gen csdmard_3m=1 if time_to_csdmard<=90 & time_to_csdmard!=. 
{txt}(42,220 missing values generated)

{com}. recode csdmard_3m .=0
{txt}(42220 changes made to {bf:csdmard_3m})

{com}. tab csdmard_3m if ra_code==1

 {txt}csdmard_3m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     14,184       98.09       98.09
{txt}          1 {c |}{res}        276        1.91      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,460      100.00
{txt}
{com}. gen csdmard_6m=1 if time_to_csdmard<=180 & time_to_csdmard!=. 
{txt}(41,237 missing values generated)

{com}. recode csdmard_6m .=0
{txt}(41237 changes made to {bf:csdmard_6m})

{com}. tab csdmard_6m if ra_code==1

 {txt}csdmard_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     13,865       95.89       95.89
{txt}          1 {c |}{res}        595        4.11      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,460      100.00
{txt}
{com}. gen csdmard_12m=1 if time_to_csdmard<=365 & time_to_csdmard!=. 
{txt}(38,978 missing values generated)

{com}. recode csdmard_12m .=0
{txt}(38978 changes made to {bf:csdmard_12m})

{com}. tab csdmard_12m if ra_code==1

{txt}csdmard_12m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     13,147       90.92       90.92
{txt}          1 {c |}{res}      1,313        9.08      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,460      100.00
{txt}
{com}. 
. **csDMARD time categories for RA patients (including high cost MTX prescriptions)
. gen csdmard_hcd_6w=1 if time_to_csdmard_hcd<=42 & time_to_csdmard_hcd!=.
{txt}(42,617 missing values generated)

{com}. recode csdmard_hcd_6w .=0
{txt}(42617 changes made to {bf:csdmard_hcd_6w})

{com}. tab csdmard_hcd_6w if ra_code==1

{txt}csdmard_hcd {c |}
        _6w {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     14,307       98.94       98.94
{txt}          1 {c |}{res}        153        1.06      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,460      100.00
{txt}
{com}. gen csdmard_hcd_3m=1 if time_to_csdmard_hcd<=90 & time_to_csdmard_hcd!=.
{txt}(42,070 missing values generated)

{com}. recode csdmard_hcd_3m .=0
{txt}(42070 changes made to {bf:csdmard_hcd_3m})

{com}. tab csdmard_hcd_3m if ra_code==1

{txt}csdmard_hcd {c |}
        _3m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     14,134       97.75       97.75
{txt}          1 {c |}{res}        326        2.25      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,460      100.00
{txt}
{com}. gen csdmard_hcd_6m=1 if time_to_csdmard_hcd<=180 & time_to_csdmard_hcd!=.
{txt}(40,913 missing values generated)

{com}. recode csdmard_hcd_6m .=0
{txt}(40913 changes made to {bf:csdmard_hcd_6m})

{com}. tab csdmard_hcd_6m if ra_code==1

{txt}csdmard_hcd {c |}
        _6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     13,770       95.23       95.23
{txt}          1 {c |}{res}        690        4.77      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,460      100.00
{txt}
{com}. gen csdmard_hcd_12m=1 if time_to_csdmard_hcd<=365 & time_to_csdmard_hcd!=.
{txt}(38,276 missing values generated)

{com}. recode csdmard_hcd_12m .=0
{txt}(38276 changes made to {bf:csdmard_hcd_12m})

{com}. tab csdmard_hcd_12m if ra_code==1

{txt}csdmard_hcd {c |}
       _12m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     12,908       89.27       89.27
{txt}          1 {c |}{res}      1,552       10.73      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,460      100.00
{txt}
{com}. 
. **csDMARD time categories for PsA patients (not including high cost MTX prescriptions)
. tab csdmard_6w if psa_code==1

 {txt}csdmard_6w {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     14,093       99.18       99.18
{txt}          1 {c |}{res}        116        0.82      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,209      100.00
{txt}
{com}. tab csdmard_3m if psa_code==1

 {txt}csdmard_3m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     13,921       97.97       97.97
{txt}          1 {c |}{res}        288        2.03      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,209      100.00
{txt}
{com}. tab csdmard_6m if psa_code==1

 {txt}csdmard_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     13,610       95.78       95.78
{txt}          1 {c |}{res}        599        4.22      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,209      100.00
{txt}
{com}. tab csdmard_12m if psa_code==1

{txt}csdmard_12m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     12,843       90.39       90.39
{txt}          1 {c |}{res}      1,366        9.61      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,209      100.00
{txt}
{com}. 
. **csDMARD time categories for PsA patients (including high cost MTX prescriptions)
. tab csdmard_hcd_6w if psa_code==1

{txt}csdmard_hcd {c |}
        _6w {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     14,073       99.04       99.04
{txt}          1 {c |}{res}        136        0.96      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,209      100.00
{txt}
{com}. tab csdmard_hcd_3m if psa_code==1

{txt}csdmard_hcd {c |}
        _3m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     13,867       97.59       97.59
{txt}          1 {c |}{res}        342        2.41      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,209      100.00
{txt}
{com}. tab csdmard_hcd_6m if psa_code==1

{txt}csdmard_hcd {c |}
        _6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     13,489       94.93       94.93
{txt}          1 {c |}{res}        720        5.07      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,209      100.00
{txt}
{com}. tab csdmard_hcd_12m if psa_code==1

{txt}csdmard_hcd {c |}
       _12m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     12,611       88.75       88.75
{txt}          1 {c |}{res}      1,598       11.25      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,209      100.00
{txt}
{com}. 
. **What was first shared care csDMARD (not including high cost MTX prescriptions)
. gen first_csD=""
{txt}(43,044 missing values generated)

{com}. foreach var of varlist hydroxychloroquine_date leflunomide_date methotrexate_date methotrexate_inj_date sulfasalazine_date {c -(}
{txt}  2{com}.         replace first_csD="`var'" if csdmard_date==`var' & csdmard_date!=.
{txt}  3{com}.         {c )-}
{txt}variable {bf}{res}first_csD{sf}{txt} was {bf}{res}str1{sf}{txt} now {bf}{res}str23{sf}
{txt}(3,109 real changes made)
(3,130 real changes made)
(3,046 real changes made)
(3,015 real changes made)
(3,106 real changes made)

{com}. gen first_csDMARD = substr(first_csD, 1, length(first_csD) - 5) if first_csD!=""
{txt}(27,640 missing values generated)

{com}. drop first_csD
{txt}
{com}. tab first_csDMARD if ra_code==1 //for RA patients

     {txt}first_csDMARD {c |}      Freq.     Percent        Cum.
{hline 19}{c +}{hline 35}
hydroxychloroquine {c |}{res}      1,009       19.81       19.81
{txt}       leflunomide {c |}{res}      1,068       20.97       40.77
{txt}      methotrexate {c |}{res}      1,011       19.85       60.62
{txt}  methotrexate_inj {c |}{res}        968       19.00       79.62
{txt}     sulfasalazine {c |}{res}      1,038       20.38      100.00
{txt}{hline 19}{c +}{hline 35}
             Total {c |}{res}      5,094      100.00
{txt}
{com}. tab first_csDMARD if psa_code==1 //for PsA patients

     {txt}first_csDMARD {c |}      Freq.     Percent        Cum.
{hline 19}{c +}{hline 35}
hydroxychloroquine {c |}{res}      1,048       20.50       20.50
{txt}       leflunomide {c |}{res}      1,018       19.91       40.41
{txt}      methotrexate {c |}{res}      1,015       19.86       60.27
{txt}  methotrexate_inj {c |}{res}      1,027       20.09       80.36
{txt}     sulfasalazine {c |}{res}      1,004       19.64      100.00
{txt}{hline 19}{c +}{hline 35}
             Total {c |}{res}      5,112      100.00
{txt}
{com}. 
. 
. **What was first csDMARD (including high cost MTX prescriptions)
. gen first_csD_hcd=""
{txt}(43,044 missing values generated)

{com}. foreach var of varlist hydroxychloroquine_date leflunomide_date methotrexate_date methotrexate_inj_date methotrexate_hcd_date sulfasalazine_date {c -(}
{txt}  2{com}.         replace first_csD_hcd="`var'" if csdmard_hcd_date==`var' & csdmard_hcd_date!=.
{txt}  3{com}.         {c )-}
{txt}variable {bf}{res}first_csD_hcd{sf}{txt} was {bf}{res}str1{sf}{txt} now {bf}{res}str23{sf}
{txt}(2,950 real changes made)
(2,953 real changes made)
(2,892 real changes made)
(2,843 real changes made)
(3,551 real changes made)
(2,968 real changes made)

{com}. gen first_csDMARD_hcd = substr(first_csD_hcd, 1, length(first_csD_hcd) - 5) if first_csD_hcd!=""
{txt}(24,890 missing values generated)

{com}. drop first_csD_hcd
{txt}
{com}. tab first_csDMARD_hcd if ra_code==1 //for RA patients

 {txt}first_csDMARD_hcd {c |}      Freq.     Percent        Cum.
{hline 19}{c +}{hline 35}
hydroxychloroquine {c |}{res}        960       15.95       15.95
{txt}       leflunomide {c |}{res}      1,007       16.73       32.67
{txt}      methotrexate {c |}{res}        953       15.83       48.50
{txt}  methotrexate_hcd {c |}{res}      1,192       19.80       68.31
{txt}  methotrexate_inj {c |}{res}        921       15.30       83.60
{txt}     sulfasalazine {c |}{res}        987       16.40      100.00
{txt}{hline 19}{c +}{hline 35}
             Total {c |}{res}      6,020      100.00
{txt}
{com}. tab first_csDMARD_hcd if psa_code==1 //for PsA patients

 {txt}first_csDMARD_hcd {c |}      Freq.     Percent        Cum.
{hline 19}{c +}{hline 35}
hydroxychloroquine {c |}{res}        987       16.40       16.40
{txt}       leflunomide {c |}{res}        958       15.92       32.33
{txt}      methotrexate {c |}{res}        971       16.14       48.46
{txt}  methotrexate_hcd {c |}{res}      1,168       19.41       67.87
{txt}  methotrexate_inj {c |}{res}        972       16.15       84.03
{txt}     sulfasalazine {c |}{res}        961       15.97      100.00
{txt}{hline 19}{c +}{hline 35}
             Total {c |}{res}      6,017      100.00
{txt}
{com}.  
. **Methotrexate use (not including high cost MTX prescriptions)
. gen mtx=1 if methotrexate==1 | methotrexate_inj==1
{txt}(36,057 missing values generated)

{com}. recode mtx .=0 
{txt}(36057 changes made to {bf:mtx})

{com}. tab mtx if ra_code==1 //for RA patients

        {txt}mtx {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     12,180       84.23       84.23
{txt}          1 {c |}{res}      2,280       15.77      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,460      100.00
{txt}
{com}. tab mtx if psa_code==1 //for PsA patients

        {txt}mtx {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     11,867       83.52       83.52
{txt}          1 {c |}{res}      2,342       16.48      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,209      100.00
{txt}
{com}. 
. **Methotrexate use (including high cost MTX prescriptions)
. gen mtx_hcd=1 if methotrexate==1 | methotrexate_inj==1 | methotrexate_hcd==1
{txt}(32,486 missing values generated)

{com}. recode mtx_hcd .=0 
{txt}(32486 changes made to {bf:mtx_hcd})

{com}. tab mtx_hcd if ra_code==1 //for RA patients

    {txt}mtx_hcd {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     10,979       75.93       75.93
{txt}          1 {c |}{res}      3,481       24.07      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,460      100.00
{txt}
{com}. tab mtx_hcd if psa_code==1 //for PsA patients

    {txt}mtx_hcd {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     10,682       75.18       75.18
{txt}          1 {c |}{res}      3,527       24.82      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,209      100.00
{txt}
{com}. 
. **Date of first methotrexate script (not including high cost MTX prescriptions)
. gen mtx_date=min(methotrexate_date, methotrexate_inj_date)
{txt}(36,057 missing values generated)

{com}. format %td mtx_date
{txt}
{com}. 
. **Date of first methotrexate script (including high cost MTX prescriptions)
. gen mtx_hcd_date=min(methotrexate_date, methotrexate_inj_date, methotrexate_hcd_date)
{txt}(32,486 missing values generated)

{com}. format %td mtx_hcd_date
{txt}
{com}. 
. **Time to first methotrexate script for RA patients (not including high cost MTX prescriptions)
. gen time_to_mtx=(mtx_date-rheum_appt_date) if mtx==1 & rheum_appt_date!=. & mtx_date>rheum_appt_date 
{txt}(37,483 missing values generated)

{com}. tabstat time_to_mtx if ra_code==1, stats (n mean p50 p25 p75)

{txt}{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_mtx} {...}
{c |}{...}
 {res}     1832  591.2347     563.5       321     851.5
{txt}{hline 13}{c BT}{hline 50}

{com}. 
. **Time to first methotrexate script for RA patients (including high cost MTX prescriptions)
. gen time_to_mtx_hcd=(mtx_hcd_date-rheum_appt_date) if mtx_hcd==1 & rheum_appt_date!=. & mtx_hcd_date>rheum_appt_date 
{txt}(35,187 missing values generated)

{com}. tabstat time_to_mtx_hcd if ra_code==1, stats (n mean p50 p25 p75)

{txt}{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_mt~d} {...}
{c |}{...}
 {res}     2611  581.2827       549       312       839
{txt}{hline 13}{c BT}{hline 50}

{com}. 
. **Time to first methotrexate script for PsA patients (not including high cost MTX prescriptions)
. tabstat time_to_mtx if psa_code==1, stats (n mean p50 p25 p75)

{txt}{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_mtx} {...}
{c |}{...}
 {res}     1842  587.2117     548.5       304       868
{txt}{hline 13}{c BT}{hline 50}

{com}. tab mtx if rheum_appt_date!=. & mtx_date<rheum_appt_date & psa_code==1 //how many patients had precriptions pre-rheum appt
{txt}no observations

{com}. 
. **Time to first methotrexate script for PsA patients (including high cost MTX prescriptions)
. tabstat time_to_mtx_hcd if psa_code==1, stats (n mean p50 p25 p75)

{txt}{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_mt~d} {...}
{c |}{...}
 {res}     2618  574.7983     532.5       288       850
{txt}{hline 13}{c BT}{hline 50}

{com}. tab mtx_hcd if rheum_appt_date!=. & mtx_hcd_date<rheum_appt_date & psa_code==1 //how many patients had precriptions pre-rheum appt

    {txt}mtx_hcd {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}        217      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        217      100.00
{txt}
{com}. 
. **Methotrexate time categories for RA patients (not including high-cost MTX) //Nb. this is time period from rheum appt (i.e. diagnosis) to shared care, not from referral to first script 
. gen mtx_6w=1 if time_to_mtx<=42 & time_to_mtx!=.
{txt}(42,888 missing values generated)

{com}. recode mtx_6w .=0
{txt}(42888 changes made to {bf:mtx_6w})

{com}. tab mtx_6w if ra_code==1

     {txt}mtx_6w {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     14,406       99.63       99.63
{txt}          1 {c |}{res}         54        0.37      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,460      100.00
{txt}
{com}. gen mtx_3m=1 if time_to_mtx<=90 & time_to_mtx!=.
{txt}(42,695 missing values generated)

{com}. recode mtx_3m .=0
{txt}(42695 changes made to {bf:mtx_3m})

{com}. tab mtx_3m if ra_code==1

     {txt}mtx_3m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     14,350       99.24       99.24
{txt}          1 {c |}{res}        110        0.76      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,460      100.00
{txt}
{com}. gen mtx_6m=1 if time_to_mtx<=180 & time_to_mtx!=.
{txt}(42,301 missing values generated)

{com}. recode mtx_6m .=0
{txt}(42301 changes made to {bf:mtx_6m})

{com}. tab mtx_6m if ra_code==1

     {txt}mtx_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     14,226       98.38       98.38
{txt}          1 {c |}{res}        234        1.62      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,460      100.00
{txt}
{com}. gen mtx_12m=1 if time_to_mtx<=365 & time_to_mtx!=.
{txt}(41,336 missing values generated)

{com}. recode mtx_12m .=0
{txt}(41336 changes made to {bf:mtx_12m})

{com}. tab mtx_12m if ra_code==1

    {txt}mtx_12m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     13,919       96.26       96.26
{txt}          1 {c |}{res}        541        3.74      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,460      100.00
{txt}
{com}. 
. **Methotrexate time categories for RA patients (including high-cost MTX)
. gen mtx_hcd_6w=1 if time_to_mtx_hcd<=42 & time_to_mtx_hcd!=.
{txt}(42,820 missing values generated)

{com}. recode mtx_hcd_6w .=0
{txt}(42820 changes made to {bf:mtx_hcd_6w})

{com}. tab mtx_hcd_6w if ra_code==1

 {txt}mtx_hcd_6w {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     14,383       99.47       99.47
{txt}          1 {c |}{res}         77        0.53      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,460      100.00
{txt}
{com}. gen mtx_hcd_3m=1 if time_to_mtx_hcd<=90 & time_to_mtx_hcd!=.
{txt}(42,528 missing values generated)

{com}. recode mtx_hcd_3m .=0
{txt}(42528 changes made to {bf:mtx_hcd_3m})

{com}. tab mtx_hcd_3m if ra_code==1

 {txt}mtx_hcd_3m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     14,292       98.84       98.84
{txt}          1 {c |}{res}        168        1.16      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,460      100.00
{txt}
{com}. gen mtx_hcd_6m=1 if time_to_mtx_hcd<=180 & time_to_mtx_hcd!=.
{txt}(41,933 missing values generated)

{com}. recode mtx_hcd_6m .=0
{txt}(41933 changes made to {bf:mtx_hcd_6m})

{com}. tab mtx_hcd_6m if ra_code==1

 {txt}mtx_hcd_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     14,116       97.62       97.62
{txt}          1 {c |}{res}        344        2.38      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,460      100.00
{txt}
{com}. gen mtx_hcd_12m=1 if time_to_mtx_hcd<=365 & time_to_mtx_hcd!=.
{txt}(40,509 missing values generated)

{com}. recode mtx_hcd_12m .=0
{txt}(40509 changes made to {bf:mtx_hcd_12m})

{com}. tab mtx_hcd_12m if ra_code==1

{txt}mtx_hcd_12m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     13,642       94.34       94.34
{txt}          1 {c |}{res}        818        5.66      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,460      100.00
{txt}
{com}. 
. **Methotrexate time categories for PsA patients (not including high-cost MTX)
. tab mtx_6w if psa_code==1

     {txt}mtx_6w {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     14,158       99.64       99.64
{txt}          1 {c |}{res}         51        0.36      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,209      100.00
{txt}
{com}. tab mtx_3m if psa_code==1

     {txt}mtx_3m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     14,081       99.10       99.10
{txt}          1 {c |}{res}        128        0.90      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,209      100.00
{txt}
{com}. tab mtx_6m if psa_code==1

     {txt}mtx_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     13,956       98.22       98.22
{txt}          1 {c |}{res}        253        1.78      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,209      100.00
{txt}
{com}. tab mtx_12m if psa_code==1

    {txt}mtx_12m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     13,627       95.90       95.90
{txt}          1 {c |}{res}        582        4.10      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,209      100.00
{txt}
{com}. 
. **Methotrexate time categories for PsA patients (including high-cost MTX)
. tab mtx_hcd_6w if psa_code==1

 {txt}mtx_hcd_6w {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     14,137       99.49       99.49
{txt}          1 {c |}{res}         72        0.51      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,209      100.00
{txt}
{com}. tab mtx_hcd_3m if psa_code==1

 {txt}mtx_hcd_3m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     14,022       98.68       98.68
{txt}          1 {c |}{res}        187        1.32      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,209      100.00
{txt}
{com}. tab mtx_hcd_6m if psa_code==1

 {txt}mtx_hcd_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     13,821       97.27       97.27
{txt}          1 {c |}{res}        388        2.73      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,209      100.00
{txt}
{com}. tab mtx_hcd_12m if psa_code==1

{txt}mtx_hcd_12m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     13,349       93.95       93.95
{txt}          1 {c |}{res}        860        6.05      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,209      100.00
{txt}
{com}. 
. **Time to first biologic script, whereby first rheum appt is classed as diagnosis date (assumes rheum appt present)
. gen time_to_biologic=(biologic_date-rheum_appt_date) if biologic==1 & rheum_appt_date!=. & biologic_date>rheum_appt_date 
{txt}(17,366 missing values generated)

{com}. tabstat time_to_biologic, stats (n mean p50 p25 p75) //for all EIA patients

{txt}{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_bi~c} {...}
{c |}{...}
 {res}    25678  458.3088       402       202       663
{txt}{hline 13}{c BT}{hline 50}

{com}. bys eia_diagnosis: tabstat time_to_biologic, stats (n mean p50 p25 p75) 

{txt}{hline}
-> eia_diagnosis = RA

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_bi~c} {...}
{c |}{...}
 {res}     8640  459.9323       402       203       663
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = PsA

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_bi~c} {...}
{c |}{...}
 {res}     8447  458.7528       402       202       668
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = AxSpA

{ralign 12:Variable} {...}
{c |}         N      Mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_bi~c} {...}
{c |}{...}
 {res}     8591  456.2394       401       202       659
{txt}{hline 13}{c BT}{hline 50}

{com}. 
. **What was first biologic
. gen first_bio=""
{txt}(43,044 missing values generated)

{com}. foreach var of varlist abatacept_date adalimumab_date baricitinib_date certolizumab_date etanercept_date golimumab_date guselkumab_date infliximab_date ixekizumab_date rituximab_date sarilumab_date secukinumab_date tocilizumab_date tofacitinib_date upadacitinib_date ustekinumab_date {c -(}
{txt}  2{com}.         replace first_bio="`var'" if biologic_date==`var' & biologic_date!=.
{txt}  3{com}.         {c )-}
{txt}variable {bf}{res}first_bio{sf}{txt} was {bf}{res}str1{sf}{txt} now {bf}{res}str14{sf}
{txt}(2,027 real changes made)
variable {bf}{res}first_bio{sf}{txt} was {bf}{res}str14{sf}{txt} now {bf}{res}str15{sf}
{txt}(1,962 real changes made)
variable {bf}{res}first_bio{sf}{txt} was {bf}{res}str15{sf}{txt} now {bf}{res}str16{sf}
{txt}(2,097 real changes made)
variable {bf}{res}first_bio{sf}{txt} was {bf}{res}str16{sf}{txt} now {bf}{res}str17{sf}
{txt}(1,983 real changes made)
(2,035 real changes made)
(2,056 real changes made)
(2,075 real changes made)
(2,054 real changes made)
(2,010 real changes made)
(1,965 real changes made)
(1,991 real changes made)
(2,045 real changes made)
(1,986 real changes made)
(2,023 real changes made)
(2,063 real changes made)
(1,913 real changes made)

{com}. gen first_biologic = substr(first_bio, 1, length(first_bio) - 5)        
{txt}(11,445 missing values generated)

{com}. drop first_bio
{txt}
{com}. tab first_biologic //for all EIA patients

{txt}first_biolog {c |}
          ic {c |}      Freq.     Percent        Cum.
{hline 13}{c +}{hline 35}
   abatacept {c |}{res}      1,946        6.16        6.16
{txt}  adalimumab {c |}{res}      1,895        6.00       12.16
{txt} baricitinib {c |}{res}      2,026        6.41       18.57
{txt}certolizumab {c |}{res}      1,914        6.06       24.62
{txt}  etanercept {c |}{res}      1,962        6.21       30.83
{txt}   golimumab {c |}{res}      2,008        6.35       37.19
{txt}  guselkumab {c |}{res}      2,016        6.38       43.57
{txt}  infliximab {c |}{res}      2,006        6.35       49.92
{txt}  ixekizumab {c |}{res}      1,967        6.22       56.14
{txt}   rituximab {c |}{res}      1,930        6.11       62.25
{txt}   sarilumab {c |}{res}      1,953        6.18       68.43
{txt} secukinumab {c |}{res}      2,020        6.39       74.82
{txt} tocilizumab {c |}{res}      1,973        6.24       81.07
{txt} tofacitinib {c |}{res}      2,014        6.37       87.44
{txt}upadacitinib {c |}{res}      2,056        6.51       93.95
{txt} ustekinumab {c |}{res}      1,913        6.05      100.00
{txt}{hline 13}{c +}{hline 35}
       Total {c |}{res}     31,599      100.00
{txt}
{com}. bys eia_diagnosis: tab first_biologic 

{txt}{hline}
-> eia_diagnosis = RA

first_biolog {c |}
          ic {c |}      Freq.     Percent        Cum.
{hline 13}{c +}{hline 35}
   abatacept {c |}{res}        660        6.23        6.23
{txt}  adalimumab {c |}{res}        618        5.83       12.06
{txt} baricitinib {c |}{res}        660        6.23       18.28
{txt}certolizumab {c |}{res}        655        6.18       24.46
{txt}  etanercept {c |}{res}        628        5.92       30.39
{txt}   golimumab {c |}{res}        685        6.46       36.85
{txt}  guselkumab {c |}{res}        664        6.26       43.11
{txt}  infliximab {c |}{res}        693        6.54       49.65
{txt}  ixekizumab {c |}{res}        666        6.28       55.93
{txt}   rituximab {c |}{res}        624        5.89       61.82
{txt}   sarilumab {c |}{res}        647        6.10       67.92
{txt} secukinumab {c |}{res}        683        6.44       74.37
{txt} tocilizumab {c |}{res}        673        6.35       80.72
{txt} tofacitinib {c |}{res}        689        6.50       87.22
{txt}upadacitinib {c |}{res}        704        6.64       93.86
{txt} ustekinumab {c |}{res}        651        6.14      100.00
{txt}{hline 13}{c +}{hline 35}
       Total {c |}{res}     10,600      100.00

{txt}{hline}
-> eia_diagnosis = PsA

first_biolog {c |}
          ic {c |}      Freq.     Percent        Cum.
{hline 13}{c +}{hline 35}
   abatacept {c |}{res}        638        6.12        6.12
{txt}  adalimumab {c |}{res}        652        6.26       12.38
{txt} baricitinib {c |}{res}        686        6.58       18.96
{txt}certolizumab {c |}{res}        644        6.18       25.14
{txt}  etanercept {c |}{res}        680        6.52       31.66
{txt}   golimumab {c |}{res}        681        6.53       38.19
{txt}  guselkumab {c |}{res}        653        6.26       44.46
{txt}  infliximab {c |}{res}        667        6.40       50.86
{txt}  ixekizumab {c |}{res}        655        6.28       57.14
{txt}   rituximab {c |}{res}        658        6.31       63.46
{txt}   sarilumab {c |}{res}        632        6.06       69.52
{txt} secukinumab {c |}{res}        650        6.24       75.76
{txt} tocilizumab {c |}{res}        624        5.99       81.74
{txt} tofacitinib {c |}{res}        651        6.25       87.99
{txt}upadacitinib {c |}{res}        634        6.08       94.07
{txt} ustekinumab {c |}{res}        618        5.93      100.00
{txt}{hline 13}{c +}{hline 35}
       Total {c |}{res}     10,423      100.00

{txt}{hline}
-> eia_diagnosis = AxSpA

first_biolog {c |}
          ic {c |}      Freq.     Percent        Cum.
{hline 13}{c +}{hline 35}
   abatacept {c |}{res}        648        6.13        6.13
{txt}  adalimumab {c |}{res}        625        5.91       12.04
{txt} baricitinib {c |}{res}        680        6.43       18.47
{txt}certolizumab {c |}{res}        615        5.82       24.28
{txt}  etanercept {c |}{res}        654        6.18       30.47
{txt}   golimumab {c |}{res}        642        6.07       36.54
{txt}  guselkumab {c |}{res}        699        6.61       43.14
{txt}  infliximab {c |}{res}        646        6.11       49.25
{txt}  ixekizumab {c |}{res}        646        6.11       55.36
{txt}   rituximab {c |}{res}        648        6.13       61.49
{txt}   sarilumab {c |}{res}        674        6.37       67.86
{txt} secukinumab {c |}{res}        687        6.50       74.36
{txt} tocilizumab {c |}{res}        676        6.39       80.75
{txt} tofacitinib {c |}{res}        674        6.37       87.12
{txt}upadacitinib {c |}{res}        718        6.79       93.91
{txt} ustekinumab {c |}{res}        644        6.09      100.00
{txt}{hline 13}{c +}{hline 35}
       Total {c |}{res}     10,576      100.00

{txt}
{com}. 
. **Biologic time categories (for all patients)
. gen biologic_6m=1 if time_to_biologic<=180 & time_to_biologic!=.
{txt}(37,316 missing values generated)

{com}. recode biologic_6m .=0
{txt}(37316 changes made to {bf:biologic_6m})

{com}. tab biologic_6m //for all EIA patients

{txt}biologic_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     37,316       86.69       86.69
{txt}          1 {c |}{res}      5,728       13.31      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     43,044      100.00
{txt}
{com}. bys eia_diagnosis: tab biologic_6m 

{txt}{hline}
-> eia_diagnosis = RA

biologic_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     12,541       86.73       86.73
{txt}          1 {c |}{res}      1,919       13.27      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,460      100.00

{txt}{hline}
-> eia_diagnosis = PsA

biologic_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     12,330       86.78       86.78
{txt}          1 {c |}{res}      1,879       13.22      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,209      100.00

{txt}{hline}
-> eia_diagnosis = AxSpA

biologic_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     12,445       86.57       86.57
{txt}          1 {c |}{res}      1,930       13.43      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,375      100.00

{txt}
{com}. gen biologic_12m=1 if time_to_biologic<=365 & time_to_biologic!=.
{txt}(31,312 missing values generated)

{com}. recode biologic_12m .=0
{txt}(31312 changes made to {bf:biologic_12m})

{com}. tab biologic_12m //for all EIA patients

{txt}biologic_12 {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     31,312       72.74       72.74
{txt}          1 {c |}{res}     11,732       27.26      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     43,044      100.00
{txt}
{com}. bys eia_diagnosis: tab biologic_12m 

{txt}{hline}
-> eia_diagnosis = RA

biologic_12 {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     10,547       72.94       72.94
{txt}          1 {c |}{res}      3,913       27.06      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,460      100.00

{txt}{hline}
-> eia_diagnosis = PsA

biologic_12 {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     10,374       73.01       73.01
{txt}          1 {c |}{res}      3,835       26.99      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,209      100.00

{txt}{hline}
-> eia_diagnosis = AxSpA

biologic_12 {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     10,391       72.29       72.29
{txt}          1 {c |}{res}      3,984       27.71      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,375      100.00

{txt}
{com}. 
. **Biologic time categories (by year)
. bys diagnosis_year: tab biologic_6m //for all EIA patients

{txt}{hline}
-> diagnosis_year = March 2019-March 2020

biologic_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     11,877       86.80       86.80
{txt}          1 {c |}{res}      1,806       13.20      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     13,683      100.00

{txt}{hline}
-> diagnosis_year = March 2020-March 2021

biologic_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     11,976       86.34       86.34
{txt}          1 {c |}{res}      1,894       13.66      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     13,870      100.00

{txt}{hline}
-> diagnosis_year = March 2021-March 2022

biologic_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     11,913       86.85       86.85
{txt}          1 {c |}{res}      1,804       13.15      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     13,717      100.00

{txt}{hline}
-> diagnosis_year = .

biologic_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      1,550       87.37       87.37
{txt}          1 {c |}{res}        224       12.63      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,774      100.00

{txt}
{com}. bys diagnosis_year eia_diagnosis: tab biologic_6m //for each diagnosis

{txt}{hline}
-> diagnosis_year = March 2019-March 2020, eia_diagnosis = RA

biologic_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      3,975       86.36       86.36
{txt}          1 {c |}{res}        628       13.64      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      4,603      100.00

{txt}{hline}
-> diagnosis_year = March 2019-March 2020, eia_diagnosis = PsA

biologic_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      3,926       87.71       87.71
{txt}          1 {c |}{res}        550       12.29      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      4,476      100.00

{txt}{hline}
-> diagnosis_year = March 2019-March 2020, eia_diagnosis = AxSpA

biologic_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      3,976       86.36       86.36
{txt}          1 {c |}{res}        628       13.64      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      4,604      100.00

{txt}{hline}
-> diagnosis_year = March 2020-March 2021, eia_diagnosis = RA

biologic_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      3,991       85.94       85.94
{txt}          1 {c |}{res}        653       14.06      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      4,644      100.00

{txt}{hline}
-> diagnosis_year = March 2020-March 2021, eia_diagnosis = PsA

biologic_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      3,977       86.31       86.31
{txt}          1 {c |}{res}        631       13.69      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      4,608      100.00

{txt}{hline}
-> diagnosis_year = March 2020-March 2021, eia_diagnosis = AxSpA

biologic_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      4,008       86.79       86.79
{txt}          1 {c |}{res}        610       13.21      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      4,618      100.00

{txt}{hline}
-> diagnosis_year = March 2021-March 2022, eia_diagnosis = RA

biologic_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      4,013       87.52       87.52
{txt}          1 {c |}{res}        572       12.48      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      4,585      100.00

{txt}{hline}
-> diagnosis_year = March 2021-March 2022, eia_diagnosis = PsA

biologic_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      3,921       86.44       86.44
{txt}          1 {c |}{res}        615       13.56      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      4,536      100.00

{txt}{hline}
-> diagnosis_year = March 2021-March 2022, eia_diagnosis = AxSpA

biologic_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      3,979       86.58       86.58
{txt}          1 {c |}{res}        617       13.42      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      4,596      100.00

{txt}{hline}
-> diagnosis_year = ., eia_diagnosis = RA

biologic_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}        562       89.49       89.49
{txt}          1 {c |}{res}         66       10.51      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        628      100.00

{txt}{hline}
-> diagnosis_year = ., eia_diagnosis = PsA

biologic_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}        506       85.91       85.91
{txt}          1 {c |}{res}         83       14.09      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        589      100.00

{txt}{hline}
-> diagnosis_year = ., eia_diagnosis = AxSpA

biologic_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}        482       86.54       86.54
{txt}          1 {c |}{res}         75       13.46      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        557      100.00

{txt}
{com}. bys diagnosis_year: tab biologic_12m //for all EIA patients

{txt}{hline}
-> diagnosis_year = March 2019-March 2020

biologic_12 {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      9,996       73.05       73.05
{txt}          1 {c |}{res}      3,687       26.95      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     13,683      100.00

{txt}{hline}
-> diagnosis_year = March 2020-March 2021

biologic_12 {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     10,037       72.36       72.36
{txt}          1 {c |}{res}      3,833       27.64      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     13,870      100.00

{txt}{hline}
-> diagnosis_year = March 2021-March 2022

biologic_12 {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      9,954       72.57       72.57
{txt}          1 {c |}{res}      3,763       27.43      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     13,717      100.00

{txt}{hline}
-> diagnosis_year = .

biologic_12 {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      1,325       74.69       74.69
{txt}          1 {c |}{res}        449       25.31      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,774      100.00

{txt}
{com}. bys diagnosis_year eia_diagnosis: tab biologic_12m //for each diagnosis

{txt}{hline}
-> diagnosis_year = March 2019-March 2020, eia_diagnosis = RA

biologic_12 {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      3,357       72.93       72.93
{txt}          1 {c |}{res}      1,246       27.07      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      4,603      100.00

{txt}{hline}
-> diagnosis_year = March 2019-March 2020, eia_diagnosis = PsA

biologic_12 {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      3,322       74.22       74.22
{txt}          1 {c |}{res}      1,154       25.78      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      4,476      100.00

{txt}{hline}
-> diagnosis_year = March 2019-March 2020, eia_diagnosis = AxSpA

biologic_12 {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      3,317       72.05       72.05
{txt}          1 {c |}{res}      1,287       27.95      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      4,604      100.00

{txt}{hline}
-> diagnosis_year = March 2020-March 2021, eia_diagnosis = RA

biologic_12 {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      3,346       72.05       72.05
{txt}          1 {c |}{res}      1,298       27.95      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      4,644      100.00

{txt}{hline}
-> diagnosis_year = March 2020-March 2021, eia_diagnosis = PsA

biologic_12 {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      3,345       72.59       72.59
{txt}          1 {c |}{res}      1,263       27.41      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      4,608      100.00

{txt}{hline}
-> diagnosis_year = March 2020-March 2021, eia_diagnosis = AxSpA

biologic_12 {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      3,346       72.46       72.46
{txt}          1 {c |}{res}      1,272       27.54      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      4,618      100.00

{txt}{hline}
-> diagnosis_year = March 2021-March 2022, eia_diagnosis = RA

biologic_12 {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      3,362       73.33       73.33
{txt}          1 {c |}{res}      1,223       26.67      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      4,585      100.00

{txt}{hline}
-> diagnosis_year = March 2021-March 2022, eia_diagnosis = PsA

biologic_12 {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      3,271       72.11       72.11
{txt}          1 {c |}{res}      1,265       27.89      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      4,536      100.00

{txt}{hline}
-> diagnosis_year = March 2021-March 2022, eia_diagnosis = AxSpA

biologic_12 {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      3,321       72.26       72.26
{txt}          1 {c |}{res}      1,275       27.74      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      4,596      100.00

{txt}{hline}
-> diagnosis_year = ., eia_diagnosis = RA

biologic_12 {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}        482       76.75       76.75
{txt}          1 {c |}{res}        146       23.25      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        628      100.00

{txt}{hline}
-> diagnosis_year = ., eia_diagnosis = PsA

biologic_12 {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}        436       74.02       74.02
{txt}          1 {c |}{res}        153       25.98      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        589      100.00

{txt}{hline}
-> diagnosis_year = ., eia_diagnosis = AxSpA

biologic_12 {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}        407       73.07       73.07
{txt}          1 {c |}{res}        150       26.93      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        557      100.00

{txt}
{com}. 
. **Create and label variables ===========================================================*/
. 
. **Demographics
. ***Sex
. gen male = 1 if sex == "M"
{txt}(21,917 missing values generated)

{com}. replace male = 0 if sex == "F"
{txt}(21,917 real changes made)

{com}. lab var male "Male"
{txt}
{com}. 
. ***Ethnicity
. replace ethnicity = .u if ethnicity == .
{txt}(10,663 real changes made, 10,663 to missing)

{com}. ****rearrange in order of prevalence
. recode ethnicity 2=6 /* mixed to 6 */
{txt}(6458 changes made to {bf:ethnicity})

{com}. recode ethnicity 3=2 /* south asian to 2 */
{txt}(3182 changes made to {bf:ethnicity})

{com}. recode ethnicity 4=3 /* black to 3 */
{txt}(3144 changes made to {bf:ethnicity})

{com}. recode ethnicity 6=4 /* mixed to 4 */
{txt}(6458 changes made to {bf:ethnicity})

{com}. recode ethnicity 5=4 /* other to 4 */
{txt}(3312 changes made to {bf:ethnicity})

{com}. 
. label define ethnicity  1 "White"                                       ///
>                                                 2 "Asian/Asian British"         ///
>                                                 3 "Black"                                       ///
>                                                 4 "Mixed/Other"                         ///
>                                                 .u "Missing"
{txt}
{com}. label values ethnicity ethnicity
{txt}
{com}. lab var ethnicity "Ethnicity"
{txt}
{com}. 
. ***STP 
. rename stp stp_old
{res}{txt}
{com}. bysort stp_old: gen stp = 1 if _n==1
{txt}(43,042 missing values generated)

{com}. replace stp = sum(stp) //
{txt}(43,043 real changes made)

{com}. drop stp_old
{txt}
{com}. 
. ***IMD
. *Group into 5 groups
. rename imd imd_o
{res}{txt}
{com}. egen imd = cut(imd_o), group(5) icodes 
{txt}
{com}. *Add one to create groups 1-5 
. replace imd = imd + 1
{txt}(43,044 real changes made)

{com}. *-1 is missing, should be excluded from population 
. replace imd = .u if imd_o == -1
{txt}(0 real changes made)

{com}. drop imd_o
{txt}
{com}. *Reverse the order (so high is more deprived)
. recode imd 5 = 1 4 = 2 3 = 3 2 = 4 1 = 5 .u = .u
{txt}(43044 changes made to {bf:imd})

{com}. label define imd 1 "1 least deprived" 2 "2" 3 "3" 4 "4" 5 "5 most deprived" .u "Missing"
{txt}
{com}. label values imd imd 
{txt}
{com}. lab var imd "Index of multiple deprivation"
{txt}
{com}. 
. ***Age variables
. *Nb. works if ages 18 and over
. *Create categorised age
. drop if age<18 & age !=.
{txt}(9,138 observations deleted)

{com}. drop if age>109 & age !=.
{txt}(0 observations deleted)

{com}. drop if age==.
{txt}(0 observations deleted)

{com}. lab var age "Age"
{txt}
{com}. 
. recode age 18/39.9999 = 1 /// 
>            40/49.9999 = 2 ///
>                    50/59.9999 = 3 ///
>                60/69.9999 = 4 ///
>                    70/79.9999 = 5 ///
>                    80/max = 6, gen(agegroup) 
{txt}(33906 differences between {bf:age} and {bf:agegroup})

{com}. 
. label define agegroup   1 "18-39" ///
>                                                 2 "40-49" ///
>                                                 3 "50-59" ///
>                                                 4 "60-69" ///
>                                                 5 "70-79" ///
>                                                 6 "80+"
{txt}
{com}.                                                 
. label values agegroup agegroup
{txt}
{com}. lab var agegroup "Age group"
{txt}
{com}. 
. *Create binary age
. recode age min/69.999 = 0 ///
>            70/max = 1, gen(age70)
{txt}(33906 differences between {bf:age} and {bf:age70})

{com}. 
. *Create restricted cubic splines for age
. mkspline age = age, cubic nknots(4)
{txt}
{com}. 
. ***Body Mass Index
. *Recode strange values 
. replace bmi_value = . if bmi_value == 0 
{txt}(13,456 real changes made, 13,456 to missing)

{com}. replace bmi_value = . if !inrange(bmi_value, 10, 80)
{txt}(146 real changes made, 146 to missing)

{com}. 
. *Restrict to within 10 years of EIA diagnosis date and aged>16 
. gen bmi_time = (eia_code_date - bmi_date)/365.25
{txt}(13,456 missing values generated)

{com}. gen bmi_age = age - bmi_time
{txt}(13,456 missing values generated)

{com}. replace bmi_value = . if bmi_age < 16 
{txt}(14,578 real changes made, 14,578 to missing)

{com}. replace bmi_value = . if bmi_time > 10 & bmi_time != . 
{txt}(3,836 real changes made, 3,836 to missing)

{com}. 
. *Set to missing if no date, and vice versa 
. replace bmi_value = . if bmi_date == . 
{txt}(0 real changes made)

{com}. replace bmi_date = . if bmi_value == . 
{txt}(18,560 real changes made, 18,560 to missing)

{com}. replace bmi_time = . if bmi_value == . 
{txt}(18,560 real changes made, 18,560 to missing)

{com}. replace bmi_age = . if bmi_value == . 
{txt}(18,560 real changes made, 18,560 to missing)

{com}. 
. *Create BMI categories
. gen     bmicat = .
{txt}(33,906 missing values generated)

{com}. recode  bmicat . = 1 if bmi_value < 18.5
{txt}(91 changes made to {bf:bmicat})

{com}. recode  bmicat . = 2 if bmi_value < 25
{txt}(180 changes made to {bf:bmicat})

{com}. recode  bmicat . = 3 if bmi_value < 30
{txt}(274 changes made to {bf:bmicat})

{com}. recode  bmicat . = 4 if bmi_value < 35
{txt}(370 changes made to {bf:bmicat})

{com}. recode  bmicat . = 5 if bmi_value < 40
{txt}(398 changes made to {bf:bmicat})

{com}. recode  bmicat . = 6 if bmi_value < .
{txt}(577 changes made to {bf:bmicat})

{com}. replace bmicat = .u if bmi_value >= .
{txt}(32,016 real changes made, 32,016 to missing)

{com}. 
. label define bmicat 1 "Underweight (<18.5)"     ///
>                                         2 "Normal (18.5-24.9)"          ///
>                                         3 "Overweight (25-29.9)"        ///
>                                         4 "Obese I (30-34.9)"           ///
>                                         5 "Obese II (35-39.9)"          ///
>                                         6 "Obese III (40+)"                     ///
>                                         .u "Missing"
{txt}
{com}.                                         
. label values bmicat bmicat
{txt}
{com}. lab var bmicat "BMI"
{txt}
{com}. 
. *Create less granular categorisation
. recode bmicat 1/3 .u = 1 4 = 2 5 = 3 6 = 4, gen(obese4cat)
{txt}(33815 differences between {bf:bmicat} and {bf:obese4cat})

{com}. 
. label define obese4cat  1 "No record of obesity"        ///
>                                                 2 "Obese I (30-34.9)"           ///
>                                                 3 "Obese II (35-39.9)"          ///
>                                                 4 "Obese III (40+)"             
{txt}
{com}. 
. label values obese4cat obese4cat
{txt}
{com}. order obese4cat, after(bmicat)
{txt}
{com}. 
. ***Smoking 
. label define smoke 1 "Never" 2 "Former" 3 "Current" .u "Missing"
{txt}
{com}. 
. gen     smoke = 1  if smoking_status == "N"
{txt}(30,463 missing values generated)

{com}. replace smoke = 2  if smoking_status == "E"
{txt}(1,592 real changes made)

{com}. replace smoke = 3  if smoking_status == "S"
{txt}(10,180 real changes made)

{com}. replace smoke = .u if smoking_status == "M"
{txt}(1,673 real changes made, 1,673 to missing)

{com}. replace smoke = .u if smoking_status == "" 
{txt}(17,018 real changes made, 17,018 to missing)

{com}. 
. label values smoke smoke
{txt}
{com}. lab var smoke "Smoking status"
{txt}
{com}. drop smoking_status
{txt}
{com}. 
. *Create non-missing 3-category variable for current smoking (assumes missing smoking is never smoking)
. recode smoke .u = 1, gen(smoke_nomiss)
{txt}(18691 differences between {bf:smoke} and {bf:smoke_nomiss})

{com}. order smoke_nomiss, after(smoke)
{txt}
{com}. label values smoke_nomiss smoke
{txt}
{com}. 
. **Clinical comorbidities
. ***eGFR
. *Set implausible creatinine values to missing (Note: zero changed to missing)
. replace creatinine_value = . if !inrange(creatinine_value, 20, 3000) 
{txt}(8,479 real changes made, 8,479 to missing)

{com}. 
. *Remove creatinine dates if no measurements, and vice versa 
. replace creatinine_value = . if creatinine_date == . 
{txt}(0 real changes made)

{com}. replace creatinine_date = . if creatinine_value == . 
{txt}(6,816 real changes made, 6,816 to missing)

{com}. replace creatinine = . if creatinine_value == .
{txt}(8,479 real changes made, 8,479 to missing)

{com}. recode creatinine .=0
{txt}(8479 changes made to {bf:creatinine})

{com}. 
. *Divide by 88.4 (to convert umol/l to mg/dl) 
. gen SCr_adj = creatinine_value/88.4
{txt}(8,479 missing values generated)

{com}. 
. gen min = .
{txt}(33,906 missing values generated)

{com}. replace min = SCr_adj/0.7 if male==0
{txt}(12,881 real changes made)

{com}. replace min = SCr_adj/0.9 if male==1
{txt}(12,546 real changes made)

{com}. replace min = min^-0.329  if male==0
{txt}(12,881 real changes made)

{com}. replace min = min^-0.411  if male==1
{txt}(12,546 real changes made)

{com}. replace min = 1 if min<1
{txt}(19,852 real changes made)

{com}. 
. gen max=.
{txt}(33,906 missing values generated)

{com}. replace max=SCr_adj/0.7 if male==0
{txt}(12,881 real changes made)

{com}. replace max=SCr_adj/0.9 if male==1
{txt}(12,546 real changes made)

{com}. replace max=max^-1.209
{txt}(25,427 real changes made)

{com}. replace max=1 if max>1
{txt}(14,054 real changes made)

{com}. 
. gen egfr=min*max*141
{txt}(8,479 missing values generated)

{com}. replace egfr=egfr*(0.993^age)
{txt}(25,427 real changes made)

{com}. replace egfr=egfr*1.018 if male==0
{txt}(12,881 real changes made)

{com}. label var egfr "egfr calculated using CKD-EPI formula with no ethnicity"
{txt}
{com}. 
. *Categorise into ckd stages
. egen egfr_cat_all = cut(egfr), at(0, 15, 30, 45, 60, 5000)
{txt}(8,479 missing values generated)

{com}. recode egfr_cat_all 0 = 5 15 = 4 30 = 3 45 = 2 60 = 0, generate(ckd_egfr)
{txt}(25427 differences between {bf:egfr_cat_all} and {bf:ckd_egfr})

{com}. 
. gen egfr_cat = .
{txt}(33,906 missing values generated)

{com}. recode egfr_cat . = 3 if egfr < 30
{txt}(6087 changes made to {bf:egfr_cat})

{com}. recode egfr_cat . = 2 if egfr < 60
{txt}(8833 changes made to {bf:egfr_cat})

{com}. recode egfr_cat . = 1 if egfr < .
{txt}(10507 changes made to {bf:egfr_cat})

{com}. replace egfr_cat = .u if egfr >= .
{txt}(8,479 real changes made, 8,479 to missing)

{com}. 
. label define egfr_cat   1 ">=60"                ///
>                                                 2 "30-59"               ///
>                                                 3 "<30"                 ///
>                                                 .u "Missing"
{txt}
{com}.                                         
. label values egfr_cat egfr_cat
{txt}
{com}. lab var egfr_cat "eGFR"
{txt}
{com}. 
. *If missing eGFR, assume normal
. gen egfr_cat_nomiss = egfr_cat
{txt}(8,479 missing values generated)

{com}. replace egfr_cat_nomiss = 1 if egfr_cat == .u
{txt}(8,479 real changes made)

{com}. 
. label define egfr_cat_nomiss    1 ">=60/missing"        ///
>                                                                 2 "30-59"                       ///
>                                                                 3 "<30" 
{txt}
{com}. label values egfr_cat_nomiss egfr_cat_nomiss
{txt}
{com}. lab var egfr_cat_nomiss "eGFR"
{txt}
{com}. 
. gen egfr_date = creatinine_date
{txt}(8,479 missing values generated)

{com}. format egfr_date %td
{txt}
{com}. 
. *Add in end stage renal failure and create a single CKD variable 
. *Missing assumed to not have CKD 
. gen ckd = 0
{txt}
{com}. replace ckd = 1 if ckd_egfr != . & ckd_egfr >= 1
{txt}(14,920 real changes made)

{com}. replace ckd = 1 if esrf == 1
{txt}(3,851 real changes made)

{com}. 
. label define ckd 0 "No CKD" 1 "CKD"
{txt}
{com}. label values ckd ckd
{txt}
{com}. label var ckd "Chronic kidney disease"
{txt}
{com}. 
. *Create date (most recent measure prior to index)
. gen temp1_ckd_date = creatinine_date if ckd_egfr >=1
{txt}(18,986 missing values generated)

{com}. gen temp2_ckd_date = esrf_date if esrf == 1
{txt}(27,055 missing values generated)

{com}. gen ckd_date = max(temp1_ckd_date,temp2_ckd_date) 
{txt}(15,135 missing values generated)

{com}. format ckd_date %td 
{txt}
{com}. 
. drop temp1_ckd_date temp2_ckd_date SCr_adj min max ckd_egfr egfr_cat_all
{txt}
{com}. 
. ***HbA1c
. *Set zero or negative to missing
. replace hba1c_percentage   = . if hba1c_percentage <= 0
{txt}(1,849 real changes made, 1,849 to missing)

{com}. replace hba1c_mmol_per_mol = . if hba1c_mmol_per_mol <= 0
{txt}(2,557 real changes made, 2,557 to missing)

{com}. 
. *Change implausible values to missing
. replace hba1c_percentage   = . if !inrange(hba1c_percentage, 1, 20)
{txt}(538 real changes made, 538 to missing)

{com}. replace hba1c_mmol_per_mol = . if !inrange(hba1c_mmol_per_mol, 10, 200)
{txt}(1,473 real changes made, 1,473 to missing)

{com}. 
. *Set most recent values of >24 months prior to EIA diagnosis date to missing
. replace hba1c_percentage   = . if (eia_code_date - hba1c_percentage_date) > 24*30 & hba1c_percentage_date != .
{txt}(30,668 real changes made, 30,668 to missing)

{com}. replace hba1c_mmol_per_mol = . if (eia_code_date - hba1c_mmol_per_mol_date) > 24*30 & hba1c_mmol_per_mol_date != .
{txt}(29,014 real changes made, 29,014 to missing)

{com}. 
. *Clean up dates
. replace hba1c_percentage_date = . if hba1c_percentage == .
{txt}(31,424 real changes made, 31,424 to missing)

{com}. replace hba1c_mmol_per_mol_date = . if hba1c_mmol_per_mol == .
{txt}(31,241 real changes made, 31,241 to missing)

{com}. 
. *Express  HbA1c as percentage
. *Express all values as perecentage 
. noi summ hba1c_percentage hba1c_mmol_per_mol 

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
hba1c_per~ge {c |}{res}        851    5.083083     1.86481   1.001462   10.96054
{txt}hba1c_mmol~l {c |}{res}        862     41.6382    17.46777   10.43492   90.53609
{txt}
{com}. gen     hba1c_pct = hba1c_percentage 
{txt}(33,055 missing values generated)

{com}. replace hba1c_pct = (hba1c_mmol_per_mol/10.929)+2.15 if hba1c_mmol_per_mol<. 
{txt}(862 real changes made)

{com}. 
. *Valid % range between 0-20  
. replace hba1c_pct = . if !inrange(hba1c_pct, 1, 20) 
{txt}(0 real changes made)

{com}. replace hba1c_pct = round(hba1c_pct, 0.1)
{txt}(1,693 real changes made)

{com}. 
. *Categorise HbA1c and diabetes
. *Group hba1c pct
. gen     hba1ccat = 0 if hba1c_pct <  6.5
{txt}(32,731 missing values generated)

{com}. replace hba1ccat = 1 if hba1c_pct >= 6.5  & hba1c_pct < 7.5
{txt}(265 real changes made)

{com}. replace hba1ccat = 2 if hba1c_pct >= 7.5  & hba1c_pct < 8
{txt}(88 real changes made)

{com}. replace hba1ccat = 3 if hba1c_pct >= 8    & hba1c_pct < 9
{txt}(111 real changes made)

{com}. replace hba1ccat = 4 if hba1c_pct >= 9    & hba1c_pct !=.
{txt}(54 real changes made)

{com}. label define hba1ccat 0 "<6.5%" 1">=6.5-7.4" 2">=7.5-7.9" 3">=8-8.9" 4">=9"
{txt}
{com}. label values hba1ccat hba1ccat
{txt}
{com}. 
. *Express all values as mmol
. gen hba1c_mmol = hba1c_mmol_per_mol
{txt}(33,044 missing values generated)

{com}. replace hba1c_mmol = (hba1c_percentage*10.929)-23.5 if hba1c_percentage<. & hba1c_mmol==.
{txt}(831 real changes made)

{com}. 
. *Group hba1c mmol
. gen     hba1ccatmm = 0 if hba1c_mmol < 58
{txt}(32,466 missing values generated)

{com}. replace hba1ccatmm = 1 if hba1c_mmol >= 58 & hba1c_pct !=.
{txt}(253 real changes made)

{com}. replace hba1ccatmm =.u if hba1ccatmm==. 
{txt}(32,213 real changes made, 32,213 to missing)

{com}. label define hba1ccatmm 0 "HbA1c <58mmol/mol" 1 "HbA1c >=58mmol/mol" .u "Missing"
{txt}
{com}. label values hba1ccatmm hba1ccatmm
{txt}
{com}. lab var hba1ccatmm "HbA1c"
{txt}
{com}. 
. *Create diabetes, split by control/not (assumes missing = no diabetes)
. gen     diabcat = 1 if diabetes==0
{txt}(6,780 missing values generated)

{com}. replace diabcat = 2 if diabetes==1 & inlist(hba1ccat, 0, 1)
{txt}(304 real changes made)

{com}. replace diabcat = 3 if diabetes==1 & inlist(hba1ccat, 2, 3, 4)
{txt}(48 real changes made)

{com}. replace diabcat = 4 if diabetes==1 & !inlist(hba1ccat, 0, 1, 2, 3, 4)
{txt}(6,428 real changes made)

{com}. 
. label define diabcat    1 "No diabetes"                         ///
>                                                 2 "Controlled diabetes"         ///
>                                                 3 "Uncontrolled diabetes"       ///
>                                                 4 "Diabetes, no hba1c measure"
{txt}
{com}. label values diabcat diabcat
{txt}
{com}. 
. *Create cancer variable 'other cancer currently', includes carcinoma of the head and neck - need to confirm if this excludes NMSC
. gen cancer =0
{txt}
{com}. replace cancer =1 if lung_cancer ==1 | haem_cancer ==1 | other_cancer ==1
{txt}(16,566 real changes made)

{com}. lab var cancer "Cancer"
{txt}
{com}. 
. *Create other comorbid variables
. gen combined_cv_comorbid =1 if chronic_cardiac_disease ==1 | stroke==1
{txt}(21,650 missing values generated)

{com}. recode combined_cv_comorbid .=0
{txt}(21650 changes made to {bf:combined_cv_comorbid})

{com}. 
. *Delete unneeded variables
. drop hba1c_pct hba1c_percentage hba1c_mmol_per_mol
{txt}
{com}. 
. *Label variables
. lab var hypertension "Hypertension"
{txt}
{com}. lab var diabetes "Diabetes"
{txt}
{com}. lab var stroke "Stroke"
{txt}
{com}. lab var chronic_resp_disease "Chronic respiratory disease"
{txt}
{com}. lab var copd "COPD"
{txt}
{com}. lab var esrf "End-stage renal failure"
{txt}
{com}. lab var chronic_liver_disease "Chronic liver disease"
{txt}
{com}. lab var chronic_cardiac_disease "Chronic cardiac disease"
{txt}
{com}. 
. save "$projectdir/output/data/file_eia_all.dta", replace        
{txt}{p 0 4 2}
file {bf}
C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/data/file_eia_all.dta{rm}
saved
{p_end}

{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/logs/cleaning_dataset.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 1 Apr 2022, 16:30:37
{txt}{.-}
{smcl}
{txt}{sf}{ul off}