{smcl}
{txt}{sf}{ul off}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/workspace/logs/cleaning_dataset.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 4 Apr 2022, 08:43:24
{txt}
{com}. 
. di "$projectdir"
{res}/workspace
{txt}
{com}. di "$logdir"
{res}/workspace/logs
{txt}
{com}. 
. **Set Ado file path
. adopath + "$projectdir/analysis/extra_ados"
{txt}  [1]  (BASE)      "{res}/usr/local/stata/ado/base/{txt}"
  [2]  (SITE)      "{res}/usr/local/ado/{txt}"
  [3]              "{res}.{txt}"
  [4]  (PERSONAL)  "{res}~/ado/personal/{txt}"
  [5]  (PLUS)      "{res}~/ado/plus/{txt}"
  [6]  (OLDPLACE)  "{res}~/ado/{txt}"
  [7]              "{res}/workspace/analysis/extra_ados{txt}"

{com}. 
. **Set index dates ===========================================================*/
. global year_preceding = "01/03/2018"
{txt}
{com}. global start_date = "01/03/2019"
{txt}
{com}. global end_date = "01/03/2022"
{txt}
{com}. 
. **Rename variables (some are too long for Stata to handle) =======================================*/
. rename chronic_respiratory_disease chronic_resp_disease
{res}{txt}
{com}. 
. **Convert date strings to dates ====================================================*/
. ***Some dates are given with month/year only, so adding day 15 to enable them to be processed as dates 
. 
. foreach var of varlist   hba1c_mmol_per_mol_date                        ///
>                                                  hba1c_percentage_date                          ///
>                                                  creatinine_date                                ///
>                                                  bmi_date_measured                          ///
>                                                  abatacept                                                      ///
>                                                  adalimumab                                                     ///     
>                                                  baricitinib                                            ///
>                                                  certolizumab                                           ///
>                                                  etanercept                                                     ///
>                                                  golimumab                                                      ///
>                                                  guselkumab                                                     ///     
>                                                  infliximab                                                     ///
>                                                  ixekizumab                                                     ///
>                                                  methotrexate_hcd                                       ///
>                                                  rituximab                                                      ///
>                                                  sarilumab                                                      ///
>                                                  secukinumab                                            ///     
>                                                  tocilizumab                                            ///
>                                                  tofacitinib                                            ///
>                                                  upadacitinib                                           ///
>                                                  ustekinumab                                            ///
>                                                  {c -(}
{txt}  2{com}.                                                         
.                 capture confirm string variable `var'
{txt}  3{com}.                 if _rc!=0 {c -(}
{txt}  4{com}.                         assert `var'==.
{txt}  5{com}.                         rename `var' `var'_date
{txt}  6{com}.                 {c )-}
{txt}  7{com}.         
.                 else {c -(}
{txt}  8{com}.                                 replace `var' = `var' + "-15"
{txt}  9{com}.                                 rename `var' `var'_dstr
{txt} 10{com}.                                 replace `var'_dstr = " " if `var'_dstr == "-15"
{txt} 11{com}.                                 gen `var'_date = date(`var'_dstr, "YMD") 
{txt} 12{com}.                                 order `var'_date, after(`var'_dstr)
{txt} 13{com}.                                 drop `var'_dstr
{txt} 14{com}.                 {c )-}
{txt} 15{com}.         
.         format `var'_date %td
{txt} 16{com}. {c )-}
{txt}variable {bf}hba1c_mmol_per_mol_date{sf} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(5,000 real changes made)
(5,000 missing values generated)
variable {bf}hba1c_percentage_date{sf} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(5,000 real changes made)
(5,000 missing values generated)
variable {bf}creatinine_date{sf} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(5,000 real changes made)
(5,000 missing values generated)
variable {bf}bmi_date_measured{sf} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(40,000 real changes made)
(40,000 missing values generated)
variable {bf}abatacept{sf} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}adalimumab{sf} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}baricitinib{sf} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}certolizumab{sf} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}etanercept{sf} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}golimumab{sf} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}guselkumab{sf} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}infliximab{sf} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}ixekizumab{sf} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}methotrexate_hcd{sf} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}rituximab{sf} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}sarilumab{sf} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}secukinumab{sf} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}tocilizumab{sf} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}tofacitinib{sf} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}upadacitinib{sf} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)
variable {bf}ustekinumab{sf} was {bf}{res}str7{sf}{txt} now {bf}{res}str10{sf}
{txt}(100,000 real changes made)
{res}{txt}(90,000 real changes made)
(90,000 missing values generated)

{com}. 
. **Conversion for dates with day already included ====================================================*/
. 
. foreach var of varlist   died_date_ons                                          ///
>                                              eia_code_date                                              ///
>                                                  rheum_appt_date                                        ///
>                                              ra_code_date                                               ///
>                                                  psa_code_date                                          ///
>                                                  anksp_code_date                                        ///
>                                                  last_gp_prerheum_date                          ///
>                                                  last_gp_precode_date                           ///     
>                                                  last_gp_refrheum_date                          ///
>                                                  last_gp_refcode_date                           ///
>                                                  referral_rheum_prerheum                        ///
>                                                  referral_rheum_precode                         ///     
>                                                  chronic_cardiac_disease                        ///
>                                                  diabetes                                                       ///
>                                                  hypertension                                           ///     
>                                                  chronic_resp_disease                           ///
>                                                  copd                                                           ///
>                                                  chronic_liver_disease                          ///
>                                                  stroke                                                         ///
>                                                  lung_cancer                                            ///
>                                                  haem_cancer                                            ///
>                                                  other_cancer                                           ///
>                                                  esrf                                                           ///
>                                                  organ_transplant                                       ///
>                                                  hydroxychloroquine                                     ///
>                                                  leflunomide                                            ///
>                                                  methotrexate                                           ///
>                                                  methotrexate_inj                                       ///
>                                                  sulfasalazine                                          ///
>                                                  {c -(}
{txt}  2{com}.                                                                  
.                 capture confirm string variable `var'
{txt}  3{com}.                 if _rc!=0 {c -(}
{txt}  4{com}.                         assert `var'==.
{txt}  5{com}.                         rename `var' `var'_date
{txt}  6{com}.                 {c )-}
{txt}  7{com}.         
.                 else {c -(}
{txt}  8{com}.                                 rename `var' `var'_dstr
{txt}  9{com}.                                 gen `var'_date = date(`var'_dstr, "YMD") 
{txt} 10{com}.                                 order `var'_date, after(`var'_dstr)
{txt} 11{com}.                                 drop `var'_dstr
{txt} 12{com}.                                 gen `var'_date15 = `var'_date+15
{txt} 13{com}.                                 order `var'_date15, after(`var'_date)
{txt} 14{com}.                                 drop `var'_date
{txt} 15{com}.                                 rename `var'_date15 `var'_date
{txt} 16{com}.                 {c )-}
{txt} 17{com}.         
.         format `var'_date %td
{txt} 18{com}. {c )-}
{res}{txt}(90,000 missing values generated)
(90,000 missing values generated)
{res}{txt}(1,000 missing values generated)
(1,000 missing values generated)
{res}{txt}(9,999 missing values generated)
(9,999 missing values generated)
{res}{txt}(1,000 missing values generated)
(1,000 missing values generated)
{res}{txt}(1,000 missing values generated)
(1,000 missing values generated)
{res}{txt}(1,000 missing values generated)
(1,000 missing values generated)
{res}{txt}(9,999 missing values generated)
(9,999 missing values generated)
{res}{txt}(9,999 missing values generated)
(9,999 missing values generated)
{res}{txt}(9,999 missing values generated)
(9,999 missing values generated)
{res}{txt}(9,999 missing values generated)
(9,999 missing values generated)
{res}{txt}(9,999 missing values generated)
(9,999 missing values generated)
{res}{txt}(9,999 missing values generated)
(9,999 missing values generated)
{res}{txt}(80,000 missing values generated)
(80,000 missing values generated)
{res}{txt}(80,000 missing values generated)
(80,000 missing values generated)
{res}{txt}(80,000 missing values generated)
(80,000 missing values generated)
{res}{txt}(80,000 missing values generated)
(80,000 missing values generated)
{res}{txt}(80,000 missing values generated)
(80,000 missing values generated)
{res}{txt}(80,000 missing values generated)
(80,000 missing values generated)
{res}{txt}(80,000 missing values generated)
(80,000 missing values generated)
{res}{txt}(80,000 missing values generated)
(80,000 missing values generated)
{res}{txt}(80,000 missing values generated)
(80,000 missing values generated)
{res}{txt}(80,000 missing values generated)
(80,000 missing values generated)
{res}{txt}(80,000 missing values generated)
(80,000 missing values generated)
{res}{txt}(80,000 missing values generated)
(80,000 missing values generated)
{res}{txt}(90,000 missing values generated)
(90,000 missing values generated)
{res}{txt}(90,000 missing values generated)
(90,000 missing values generated)
{res}{txt}(90,000 missing values generated)
(90,000 missing values generated)
{res}{txt}(90,000 missing values generated)
(90,000 missing values generated)
{res}{txt}(90,000 missing values generated)
(90,000 missing values generated)
{res}{txt}
{com}.                                                  
. **Rename variables with extra 'date' added to the end of variable names===========================================================*/ 
. rename rheum_appt_date_date rheum_appt_date
{res}{txt}
{com}. rename eia_code_date_date eia_code_date
{res}{txt}
{com}. rename ra_code_date_date ra_code_date
{res}{txt}
{com}. rename psa_code_date_date psa_code_date
{res}{txt}
{com}. rename anksp_code_date_date anksp_code_date
{res}{txt}
{com}. rename died_date_ons_date died_ons_date
{res}{txt}
{com}. rename last_gp_prerheum_date_date last_gp_prerheum_date
{res}{txt}
{com}. rename last_gp_refrheum_date_date last_gp_refrheum_date
{res}{txt}
{com}. rename last_gp_refcode_date_date last_gp_refcode_date
{res}{txt}
{com}. rename last_gp_precode_date_date last_gp_precode_date
{res}{txt}
{com}. rename hba1c_mmol_per_mol_date_date hba1c_mmol_per_mol_date
{res}{txt}
{com}. rename hba1c_percentage_date_date hba1c_percentage_date
{res}{txt}
{com}. rename creatinine_date_date creatinine_date
{res}{txt}
{com}. rename creatinine creatinine_value 
{res}{txt}
{com}. rename bmi_date_measured_date bmi_date
{res}{txt}
{com}. rename bmi bmi_value
{res}{txt}
{com}. 
. **Create binary indicator variables for relevant conditions ====================================================*/
. 
. foreach var of varlist   eia_code_date                                          ///
>                                                  rheum_appt_date                                        ///
>                                              ra_code_date                                               ///
>                                                  psa_code_date                                          ///
>                                                  anksp_code_date                                        ///
>                                                  died_ons_date                                          ///
>                                                  last_gp_prerheum_date                          ///
>                                                  last_gp_precode_date                           ///     
>                                                  last_gp_refrheum_date                          ///
>                                                  last_gp_refcode_date                           ///
>                                                  referral_rheum_prerheum_date           ///
>                                                  referral_rheum_precode_date            ///     
>                                                  chronic_cardiac_disease_date           ///
>                                                  diabetes_date                                          ///
>                                                  hypertension_date                                      ///
>                                                  chronic_resp_disease_date                      ///
>                                                  copd_date                                                      ///
>                                                  chronic_liver_disease_date                     ///
>                                                  stroke_date                                            ///
>                                                  lung_cancer_date                                       ///
>                                                  haem_cancer_date                                       ///             
>                                                  other_cancer_date                                      ///
>                                                  esrf_date                                                      ///
>                                                  creatinine_date                                        ///
>                                                  organ_transplant_date                          ///
>                                                  hydroxychloroquine_date                        ///     
>                                                  leflunomide_date                                       ///
>                                                  methotrexate_date                                      ///
>                                                  methotrexate_inj_date                          ///             
>                                                  sulfasalazine_date                                     ///
>                                                  abatacept_date                                         ///
>                                                  adalimumab_date                                        ///
>                                                  baricitinib_date                                       ///
>                                                  certolizumab_date                                      ///
>                                                  etanercept_date                                        ///
>                                                  golimumab_date                                         ///
>                                                  guselkumab_date                                        ///
>                                                  infliximab_date                                        ///
>                                                  ixekizumab_date                                        ///
>                                                  methotrexate_hcd_date                          ///
>                                                  rituximab_date                                         ///             
>                                                  sarilumab_date                                         ///
>                                                  secukinumab_date                                       ///
>                                                  tocilizumab_date                                       ///             
>                                                  tofacitinib_date                                       ///
>                                                  upadacitinib_date                                      ///
>                                                  ustekinumab_date   {c -(}                           
{txt}  2{com}.         /*date ranges are applied in python, so presence of date indicates presence of 
>           disease in the correct time frame*/ 
.         local newvar =  substr("`var'", 1, length("`var'") - 5)
{txt}  3{com}.         gen `newvar' = (`var'!=. )
{txt}  4{com}.         order `newvar', after(`var')
{txt}  5{com}. {c )-}
{txt}
{com}. 
. *Refine diagnostic window=============================================================*/
. 
. **All patients should have EIA code
. tab eia_code

   {txt}eia_code {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      1,000        1.00        1.00
{txt}          1 {c |}{res}     99,000       99.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}    100,000      100.00
{txt}
{com}. keep if eia_code==1
{txt}(1,000 observations deleted)

{com}. 
. **Keep patients with first EIA code in GP record if code was after 1st March 2019
. keep if eia_code_date>=date("$start_date", "DMY") & eia_code_date!=. 
{txt}(26,088 observations deleted)

{com}. tab eia_code

   {txt}eia_code {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}     72,912      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     72,912      100.00
{txt}
{com}. 
. **Month/Year of diagnosis
. gen year_diag=year(eia_code_date)
{txt}
{com}. format year_diag %ty
{txt}
{com}. gen month_diag=month(eia_code_date)
{txt}
{com}. gen mo_year_diagn=ym(year_diag, month_diag)
{txt}
{com}. format mo_year_diagn %tm
{txt}
{com}. 
. *Include only most recent EIA sub-diagnosis
. replace ra_code =0 if psa_code_date >= ra_code_date & psa_code_date !=.
{txt}(35,882 real changes made)

{com}. replace ra_code =0 if anksp_code_date >= ra_code_date & anksp_code_date !=.
{txt}(12,059 real changes made)

{com}. replace psa_code =0 if ra_code_date >= psa_code_date & ra_code_date !=.
{txt}(35,618 real changes made)

{com}. replace psa_code =0 if anksp_code_date >= psa_code_date & anksp_code_date !=.
{txt}(12,137 real changes made)

{com}. replace anksp_code =0 if psa_code_date >= anksp_code_date & psa_code_date !=.
{txt}(35,925 real changes made)

{com}. replace anksp_code =0 if ra_code_date >= anksp_code_date & ra_code_date !=.
{txt}(12,072 real changes made)

{com}. gen eia_diagnosis=1 if ra_code==1
{txt}(48,648 missing values generated)

{com}. replace eia_diagnosis=2 if psa_code==1
{txt}(24,409 real changes made)

{com}. replace eia_diagnosis=3 if anksp_code==1
{txt}(24,179 real changes made)

{com}. lab define eia_diagnosis 1 "RA" 2 "PsA" 3 "AxSpA", modify
{txt}
{com}. lab val eia_diagnosis eia_diagnosis
{txt}
{com}. tab eia_diagnosis

{txt}eia_diagnos {c |}
         is {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
         RA {c |}{res}     24,264       33.31       33.31
{txt}        PsA {c |}{res}     24,409       33.50       66.81
{txt}      AxSpA {c |}{res}     24,179       33.19      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     72,852      100.00
{txt}
{com}. drop if eia_diagnosis==.
{txt}(60 observations deleted)

{com}. 
. *Define appointments and referrals======================================*/
. 
. **Rheumatology appt 
. tab rheum_appt  //proportion with first rheum outpatient date in the year before EIA code appears in GP record 

 {txt}rheum_appt {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      7,279        9.99        9.99
{txt}          1 {c |}{res}     65,573       90.01      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     72,852      100.00
{txt}
{com}. tab rheum_appt if rheum_appt_date<eia_code_date & rheum_appt_date!=. //confirm proportion who had rheum appt (i.e. not missing) and appt before EIA code 

 {txt}rheum_appt {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}     40,187      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     40,187      100.00
{txt}
{com}. 
. **Rheumatology referrals
. tab referral_rheum_prerheum //last rheum referral in the year before rheumatology outpatient (requires rheum appt to have been present)

{txt}referral_rh {c |}
eum_prerheu {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      7,279        9.99        9.99
{txt}          1 {c |}{res}     65,573       90.01      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     72,852      100.00
{txt}
{com}. tab referral_rheum_prerheum if rheum_appt!=0  //last rheum referral in the year before rheumatology outpatient if rheum appt date present

{txt}referral_rh {c |}
eum_prerheu {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      6,593       10.05       10.05
{txt}          1 {c |}{res}     58,980       89.95      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     65,573      100.00
{txt}
{com}. tab referral_rheum_prerheum if rheum_appt!=0 & referral_rheum_prerheum_date<rheum_appt_date  //last rheum referral in the year before rheumatology outpatient, assuming ref date before rheum appt date

{txt}referral_rh {c |}
eum_prerheu {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}     29,468      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     29,468      100.00
{txt}
{com}. tab referral_rheum_precode //last rheum referral in the year before EIA code (could use if rheum appt missing)

{txt}referral_rh {c |}
eum_precode {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      7,247        9.95        9.95
{txt}          1 {c |}{res}     65,605       90.05      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     72,852      100.00
{txt}
{com}. gen referral_rheum_comb_date = referral_rheum_prerheum_date if referral_rheum_prerheum_date!=.
{txt}(7,279 missing values generated)

{com}. replace referral_rheum_comb_date = referral_rheum_precode_date if referral_rheum_prerheum_date==. & referral_rheum_precode_date!=.
{txt}(6,600 real changes made)

{com}. format %td referral_rheum_comb_date
{txt}
{com}. 
. **GP appointments
. tab last_gp_refrheum //proportion with last GP appointment in year before rheum referral (pre-rheum appt)

{txt}last_gp_ref {c |}
      rheum {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      7,301       10.02       10.02
{txt}          1 {c |}{res}     65,551       89.98      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     72,852      100.00
{txt}
{com}. gen all_appts=1 if last_gp_refrheum==1 & referral_rheum_prerheum==1 & rheum_appt==1 & eia_code==1 & last_gp_refrheum_date<referral_rheum_prerheum_date & referral_rheum_prerheum_date<rheum_appt_date & rheum_appt_date<eia_code_date 
{txt}(70,035 missing values generated)

{com}. recode all_appts .=0
{txt}(all_appts: 70035 changes made)

{com}. tab all_appts //KEY - proportion who had a last gp appt, then rheum ref, then rheum appt, then EIA code 

  {txt}all_appts {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     70,035       96.13       96.13
{txt}          1 {c |}{res}      2,817        3.87      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     72,852      100.00
{txt}
{com}. tab last_gp_refcode     if referral_rheum_precode!=0 //last GP appointment before rheum ref if present (pre-eia code ref)

{txt}last_gp_ref {c |}
       code {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      6,604       10.07       10.07
{txt}          1 {c |}{res}     59,001       89.93      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     65,605      100.00
{txt}
{com}. tab last_gp_prerheum if rheum_appt!=0 //last GP appointment before rheum appt (if present)

{txt}last_gp_pre {c |}
      rheum {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      6,611       10.08       10.08
{txt}          1 {c |}{res}     58,962       89.92      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     65,573      100.00
{txt}
{com}. tab last_gp_precode //last GP appointment before EIA code

{txt}last_gp_pre {c |}
       code {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      7,339       10.07       10.07
{txt}          1 {c |}{res}     65,513       89.93      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     72,852      100.00
{txt}
{com}. 
. **For sensitivity analyses for those without rheum_appt, replace diagnosis date as EIA code date if rheum appt pre-code is missing or after
. gen eia_diagnosis_date_nomiss=rheum_appt_date if rheum_appt_date!=.
{txt}(7,279 missing values generated)

{com}. format %td eia_diagnosis_date_nomiss
{txt}
{com}. replace eia_diagnosis_date_nomiss=eia_code_date if (rheum_appt_date==. | rheum_appt_date>eia_code_date) & eia_code_date!=.
{txt}(32,617 real changes made)

{com}. gen eia_diagnosis_nomiss=1 if eia_diagnosis_date_nomiss!=.
{txt}
{com}. recode eia_diagnosis_nomiss .=0
{txt}(eia_diagnosis_nomiss: 0 changes made)

{com}. tab eia_diagnosis_nomiss

{txt}eia_diagnos {c |}
  is_nomiss {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}     72,852      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     72,852      100.00
{txt}
{com}. 
. *Define drugs and dates=====================================================*/
. 
. **csDMARDs (not including high cost MTX; wouldn't be shared care)
. gen csdmard=1 if hydroxychloroquine==1 | leflunomide==1 | methotrexate==1 | methotrexate_inj==1 | sulfasalazine==1
{txt}(43,146 missing values generated)

{com}. recode csdmard .=0 
{txt}(csdmard: 43146 changes made)

{com}. tab csdmard 

    {txt}csdmard {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     43,146       59.22       59.22
{txt}          1 {c |}{res}     29,706       40.78      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     72,852      100.00
{txt}
{com}. bys eia_diagnosis: tab csdmard

{txt}{hline}
-> eia_diagnosis = RA

    csdmard {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     14,398       59.34       59.34
{txt}          1 {c |}{res}      9,866       40.66      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     24,264      100.00

{txt}{hline}
-> eia_diagnosis = PsA

    csdmard {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     14,540       59.57       59.57
{txt}          1 {c |}{res}      9,869       40.43      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     24,409      100.00

{txt}{hline}
-> eia_diagnosis = AxSpA

    csdmard {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     14,208       58.76       58.76
{txt}          1 {c |}{res}      9,971       41.24      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     24,179      100.00

{txt}
{com}. 
. **csDMARDs (including high cost MTX)
. gen csdmard_hcd=1 if hydroxychloroquine==1 | leflunomide==1 | methotrexate==1 | methotrexate_inj==1 | methotrexate_hcd==1 | sulfasalazine==1
{txt}(38,828 missing values generated)

{com}. recode csdmard_hcd .=0 
{txt}(csdmard_hcd: 38828 changes made)

{com}. tab csdmard_hcd

{txt}csdmard_hcd {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     38,828       53.30       53.30
{txt}          1 {c |}{res}     34,024       46.70      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     72,852      100.00
{txt}
{com}. bys eia_diagnosis: tab csdmard_hcd 

{txt}{hline}
-> eia_diagnosis = RA

csdmard_hcd {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     12,964       53.43       53.43
{txt}          1 {c |}{res}     11,300       46.57      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     24,264      100.00

{txt}{hline}
-> eia_diagnosis = PsA

csdmard_hcd {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     13,049       53.46       53.46
{txt}          1 {c |}{res}     11,360       46.54      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     24,409      100.00

{txt}{hline}
-> eia_diagnosis = AxSpA

csdmard_hcd {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     12,815       53.00       53.00
{txt}          1 {c |}{res}     11,364       47.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     24,179      100.00

{txt}
{com}. 
. **Date of first csDMARD script (not including high cost MTX prescriptions)
. gen csdmard_date=min(hydroxychloroquine_date, leflunomide_date, methotrexate_date, methotrexate_inj_date, sulfasalazine_date)
{txt}(43,146 missing values generated)

{com}. format %td csdmard_date
{txt}
{com}. 
. **Date of first csDMARD script (including high cost MTX prescriptions)
. gen csdmard_hcd_date=min(hydroxychloroquine_date, leflunomide_date, methotrexate_date, methotrexate_inj_date, methotrexate_hcd_date, sulfasalazine_date)
{txt}(38,828 missing values generated)

{com}. format %td csdmard_hcd_date
{txt}
{com}. 
. **Biologic use
. gen biologic=1 if abatacept==1 | adalimumab==1 | baricitinib==1 | certolizumab==1 | etanercept==1 | golimumab==1 | guselkumab==1 | infliximab==1 | ixekizumab==1 | rituximab==1 | sarilumab==1 | secukinumab==1 | tocilizumab==1 | tofacitinib==1 | upadacitinib==1 | ustekinumab==1 
{txt}(13,533 missing values generated)

{com}. recode biologic .=0
{txt}(biologic: 13533 changes made)

{com}. tab biologic 

   {txt}biologic {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     13,533       18.58       18.58
{txt}          1 {c |}{res}     59,319       81.42      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     72,852      100.00
{txt}
{com}. bys eia_diagnosis: tab biologic 

{txt}{hline}
-> eia_diagnosis = RA

   biologic {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      4,523       18.64       18.64
{txt}          1 {c |}{res}     19,741       81.36      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     24,264      100.00

{txt}{hline}
-> eia_diagnosis = PsA

   biologic {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      4,549       18.64       18.64
{txt}          1 {c |}{res}     19,860       81.36      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     24,409      100.00

{txt}{hline}
-> eia_diagnosis = AxSpA

   biologic {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      4,461       18.45       18.45
{txt}          1 {c |}{res}     19,718       81.55      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     24,179      100.00

{txt}
{com}. 
. **Date of first biologic script
. gen biologic_date=min(abatacept_date, adalimumab_date, baricitinib_date, certolizumab_date, etanercept_date, golimumab_date, guselkumab_date, infliximab_date, ixekizumab_date, rituximab_date, sarilumab_date, secukinumab_date, tocilizumab_date, tofacitinib_date, upadacitinib_date, ustekinumab_date)
{txt}(13,533 missing values generated)

{com}. format %td biologic_date
{txt}
{com}. 
. **Exclude if first csdmard or biologic was before first rheum appt
. ***Nb. could introduce leeway e.g. 30 days?
. tab csdmard if rheum_appt_date!=. & csdmard_date!=. & csdmard_date<rheum_appt_date

    {txt}csdmard {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}     10,521      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     10,521      100.00
{txt}
{com}. drop if rheum_appt_date!=. & csdmard_date!=. & csdmard_date<rheum_appt_date
{txt}(10,521 observations deleted)

{com}. tab biologic if rheum_appt_date!=. & biologic_date!=. & biologic_date<rheum_appt_date 

   {txt}biologic {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}     19,071      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     19,071      100.00
{txt}
{com}. drop if rheum_appt_date!=. & biologic_date!=. & biologic_date<rheum_appt_date 
{txt}(19,071 observations deleted)

{com}. 
. *Number of EIA diagnoses in 1-year time windows=========================================*/
. 
. gen diagnosis_year=1 if eia_code_date>=td(01mar2019) & eia_code_date<td(01mar2020)
{txt}(29,320 missing values generated)

{com}. replace diagnosis_year=2 if eia_code_date>=td(01mar2020) & eia_code_date<td(01mar2021)
{txt}(13,706 real changes made)

{com}. replace diagnosis_year=3 if eia_code_date>=td(01mar2021) & eia_code_date<td(01mar2022)
{txt}(13,692 real changes made)

{com}. lab define diagnosis_year 1 "March 2019-March 2020" 2 "March 2020-March 2021" 3 "March 2021-March 2022", modify
{txt}
{com}. lab val diagnosis_year diagnosis_year
{txt}
{com}. lab var diagnosis_year "Year of diagnosis"
{txt}
{com}. tab diagnosis_year

    {txt}Year of diagnosis {c |}      Freq.     Percent        Cum.
{hline 22}{c +}{hline 35}
March 2019-March 2020 {c |}{res}     13,940       33.72       33.72
{txt}March 2020-March 2021 {c |}{res}     13,706       33.16       66.88
{txt}March 2021-March 2022 {c |}{res}     13,692       33.12      100.00
{txt}{hline 22}{c +}{hline 35}
                Total {c |}{res}     41,338      100.00
{txt}
{com}. bys eia_diagnosis: tab diagnosis_year

{txt}{hline}
-> eia_diagnosis = RA

    Year of diagnosis {c |}      Freq.     Percent        Cum.
{hline 22}{c +}{hline 35}
March 2019-March 2020 {c |}{res}      4,640       33.86       33.86
{txt}March 2020-March 2021 {c |}{res}      4,514       32.94       66.81
{txt}March 2021-March 2022 {c |}{res}      4,548       33.19      100.00
{txt}{hline 22}{c +}{hline 35}
                Total {c |}{res}     13,702      100.00

{txt}{hline}
-> eia_diagnosis = PsA

    Year of diagnosis {c |}      Freq.     Percent        Cum.
{hline 22}{c +}{hline 35}
March 2019-March 2020 {c |}{res}      4,712       34.08       34.08
{txt}March 2020-March 2021 {c |}{res}      4,549       32.90       66.97
{txt}March 2021-March 2022 {c |}{res}      4,567       33.03      100.00
{txt}{hline 22}{c +}{hline 35}
                Total {c |}{res}     13,828      100.00

{txt}{hline}
-> eia_diagnosis = AxSpA

    Year of diagnosis {c |}      Freq.     Percent        Cum.
{hline 22}{c +}{hline 35}
March 2019-March 2020 {c |}{res}      4,588       33.23       33.23
{txt}March 2020-March 2021 {c |}{res}      4,643       33.63       66.85
{txt}March 2021-March 2022 {c |}{res}      4,577       33.15      100.00
{txt}{hline 22}{c +}{hline 35}
                Total {c |}{res}     13,808      100.00

{txt}
{com}. 
. *Time to referral, appointment and EIA code=============================================*/
. 
. **Time from last GP to rheum ref before rheum appt (i.e. if appts are present and in correct time order) //Note - referral could be coded before GP appt?
. gen time_gp_rheum_ref_appt = (referral_rheum_prerheum_date - last_gp_refrheum_date) if referral_rheum_prerheum_date!=. & last_gp_refrheum_date!=. & rheum_appt_date!=. & referral_rheum_prerheum_date>last_gp_refrheum_date & referral_rheum_prerheum_date<rheum_appt_date & rheum_appt_date<eia_code_date
{txt}(42,078 missing values generated)

{com}. tabstat time_gp_rheum_ref_appt, stats (n mean p50 p25 p75) //all patients

{txt}{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_rh~t} {...}
{c |}{...}
 {res}     1182   255.791       203        81       377
{txt}{hline 13}{c BT}{hline 50}

{com}. bys eia_diagnosis: tabstat time_gp_rheum_ref_appt, stats (n mean p50 p25 p75)

{txt}{hline}
-> eia_diagnosis = RA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_rh~t} {...}
{c |}{...}
 {res}      369  255.3388       198        88       366
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = PsA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_rh~t} {...}
{c |}{...}
 {res}      417  265.4652       207        82       414
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = AxSpA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_rh~t} {...}
{c |}{...}
 {res}      396  246.0253     199.5      73.5       359
{txt}{hline 13}{c BT}{hline 50}

{com}. 
. **Time from last GP to rheum ref before eia code (sensitivity analysis; includes those with no rheum appt)
. gen time_gp_rheum_ref_code = (referral_rheum_precode_date - last_gp_refcode_date) if referral_rheum_precode_date!=. & last_gp_refcode_date!=. & referral_rheum_precode_date>last_gp_refcode_date & referral_rheum_precode_date<eia_code_date
{txt}(35,845 missing values generated)

{com}. tabstat time_gp_rheum_ref_code, stats (n mean p50 p25 p75)

{txt}{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_rh~e} {...}
{c |}{...}
 {res}     7415   378.115       314       142       557
{txt}{hline 13}{c BT}{hline 50}

{com}. bys eia_diagnosis: tabstat time_gp_rheum_ref_code, stats (n mean p50 p25 p75)

{txt}{hline}
-> eia_diagnosis = RA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_rh~e} {...}
{c |}{...}
 {res}     2431  377.8717       315       137       559
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = PsA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_rh~e} {...}
{c |}{...}
 {res}     2494  373.5914       313       145       548
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = AxSpA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_rh~e} {...}
{c |}{...}
 {res}     2490  382.8835     314.5       143       563
{txt}{hline 13}{c BT}{hline 50}

{com}. 
. **Time from last GP to rheum ref (combined - sensitivity analysis; includes those with no rheum appt)
. gen time_gp_rheum_ref_comb = time_gp_rheum_ref_appt 
{txt}(42,078 missing values generated)

{com}. replace time_gp_rheum_ref_comb = time_gp_rheum_ref_code if time_gp_rheum_ref_appt==. & time_gp_rheum_ref_code!=.
{txt}(7,136 real changes made)

{com}. tabstat time_gp_rheum_ref_comb, stats (n mean p50 p25 p75)

{txt}{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_rh~b} {...}
{c |}{...}
 {res}     8318  359.7728       295       130       528
{txt}{hline 13}{c BT}{hline 50}

{com}. bys eia_diagnosis: tabstat time_gp_rheum_ref_comb, stats (n mean p50 p25 p75)

{txt}{hline}
-> eia_diagnosis = RA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_rh~b} {...}
{c |}{...}
 {res}     2721  360.5693       295       129       525
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = PsA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_rh~b} {...}
{c |}{...}
 {res}     2818  356.6086     293.5       134       526
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = AxSpA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_rh~b} {...}
{c |}{...}
 {res}     2779  362.2015       296       127       533
{txt}{hline 13}{c BT}{hline 50}

{com}. 
. **Time from last GP pre-rheum appt to first rheum appt (sensitivity analysis; includes those with no rheum ref)
. gen time_gp_rheum_appt = (rheum_appt_date - last_gp_prerheum_date) if rheum_appt_date!=. & last_gp_prerheum_date!=. & rheum_appt_date>last_gp_prerheum_date & rheum_appt_date<eia_code_date
{txt}(36,572 missing values generated)

{com}. tabstat time_gp_rheum_appt, stats (n mean p50 p25 p75)

{txt}{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_~m_appt} {...}
{c |}{...}
 {res}     6688  292.7865       236     107.5       422
{txt}{hline 13}{c BT}{hline 50}

{com}. bys eia_diagnosis: tabstat time_gp_rheum_appt, stats (n mean p50 p25 p75)

{txt}{hline}
-> eia_diagnosis = RA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_~m_appt} {...}
{c |}{...}
 {res}     2182  294.0683       236       113       415
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = PsA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_~m_appt} {...}
{c |}{...}
 {res}     2280  298.6386       244       109       428
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = AxSpA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_~m_appt} {...}
{c |}{...}
 {res}     2226  285.5359     225.5       100       421
{txt}{hline 13}{c BT}{hline 50}

{com}. 
. **Time from last GP pre-code to EIA code (sensitivity analysis; includes those with no rheum ref and/or no rheum appt)
. gen time_gp_eia_code = (eia_code_date - last_gp_precode_date) if eia_code_date!=. & last_gp_precode_date!=. & eia_code_date>last_gp_precode_date
{txt}(19,422 missing values generated)

{com}. tabstat time_gp_eia_code, stats (n mean p50 p25 p75)

{txt}{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_ei~e} {...}
{c |}{...}
 {res}    23838   524.765       472       234       774
{txt}{hline 13}{c BT}{hline 50}

{com}. bys eia_diagnosis: tabstat time_gp_eia_code, stats (n mean p50 p25 p75)

{txt}{hline}
-> eia_diagnosis = RA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_ei~e} {...}
{c |}{...}
 {res}     7934   526.135       470       233       777
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = PsA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_ei~e} {...}
{c |}{...}
 {res}     7957   526.605       472       239       775
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = AxSpA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_ei~e} {...}
{c |}{...}
 {res}     7947  521.5549       475       230       769
{txt}{hline 13}{c BT}{hline 50}

{com}. 
. **Time from last GP to EIA diagnosis (combined - sensitivity analysis; includes those with no rheum appt)
. gen time_gp_eia_diag = time_gp_rheum_appt
{txt}(36,572 missing values generated)

{com}. replace time_gp_eia_diag = time_gp_eia_code if time_gp_rheum_appt==. & time_gp_eia_code!=.
{txt}(19,593 real changes made)

{com}. tabstat time_gp_eia_diag, stats (n mean p50 p25 p75)

{txt}{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_ei~g} {...}
{c |}{...}
 {res}    26281  456.6715       386       180       672
{txt}{hline 13}{c BT}{hline 50}

{com}. bys eia_diagnosis: tabstat time_gp_eia_diag, stats (n mean p50 p25 p75)

{txt}{hline}
-> eia_diagnosis = RA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_ei~g} {...}
{c |}{...}
 {res}     8730  457.9019       384       180       674
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = PsA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_ei~g} {...}
{c |}{...}
 {res}     8797   458.879       389       183       678
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = AxSpA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_gp_ei~g} {...}
{c |}{...}
 {res}     8754  453.2262       386       177       668
{txt}{hline 13}{c BT}{hline 50}

{com}. 
. **Time from rheum ref to rheum appt (i.e. if appts are present and in correct time order)
. gen time_ref_rheum_appt = (rheum_appt_date - referral_rheum_prerheum_date) if rheum_appt_date!=. & referral_rheum_prerheum_date!=. & referral_rheum_prerheum_date<rheum_appt_date & rheum_appt_date<eia_code_date
{txt}(36,521 missing values generated)

{com}. tabstat time_ref_rheum_appt, stats (n mean p50 p25 p75)

{txt}{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_ref_r~t} {...}
{c |}{...}
 {res}     6739  295.1938       234       108       427
{txt}{hline 13}{c BT}{hline 50}

{com}. bys eia_diagnosis: tabstat time_ref_rheum_appt, stats (n mean p50 p25 p75)

{txt}{hline}
-> eia_diagnosis = RA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_ref_r~t} {...}
{c |}{...}
 {res}     2231  293.2662       231       107       432
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = PsA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_ref_r~t} {...}
{c |}{...}
 {res}     2236  299.4012     238.5       105     433.5
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = AxSpA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_ref_r~t} {...}
{c |}{...}
 {res}     2272  292.9459       233       111     417.5
{txt}{hline 13}{c BT}{hline 50}

{com}. 
. **Time from rheum ref to EIA code (sensitivity analysis; includes those with no rheum appt)
. gen time_ref_rheum_eia = (eia_code_date - referral_rheum_precode_date) if eia_code_date!=. & referral_rheum_precode_date!=. & referral_rheum_precode_date<eia_code_date  
{txt}(19,376 missing values generated)

{com}. tabstat time_ref_rheum_eia, stats (n mean p50 p25 p75)

{txt}{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_ref_r~a} {...}
{c |}{...}
 {res}    23884  520.0709       466       232       768
{txt}{hline 13}{c BT}{hline 50}

{com}. bys eia_diagnosis: tabstat time_ref_rheum_eia, stats (n mean p50 p25 p75)

{txt}{hline}
-> eia_diagnosis = RA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_ref_r~a} {...}
{c |}{...}
 {res}     7881  523.2803       466       228       777
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = PsA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_ref_r~a} {...}
{c |}{...}
 {res}     8021  520.9428       465       232       768
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = AxSpA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_ref_r~a} {...}
{c |}{...}
 {res}     7982  516.0259       467       235       759
{txt}{hline 13}{c BT}{hline 50}

{com}. 
. **Time from rheum ref to EIA diagnosis (combined - sensitivity analysis; includes those with no rheum appt)
. gen time_ref_rheum_eia_comb = time_ref_rheum_appt
{txt}(36,521 missing values generated)

{com}. replace time_ref_rheum_eia_comb = time_ref_rheum_eia if time_ref_rheum_appt==. & time_ref_rheum_eia!=.
{txt}(19,667 real changes made)

{com}. tabstat time_ref_rheum_eia_comb, stats (n mean p50 p25 p75)

{txt}{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_ref_r~b} {...}
{c |}{...}
 {res}    26406  455.3944       387       180       671
{txt}{hline 13}{c BT}{hline 50}

{com}. bys eia_diagnosis: tabstat time_ref_rheum_eia_comb, stats (n mean p50 p25 p75)

{txt}{hline}
-> eia_diagnosis = RA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_ref_r~b} {...}
{c |}{...}
 {res}     8743  457.3183       389       179       671
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = PsA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_ref_r~b} {...}
{c |}{...}
 {res}     8830  456.2496       386       180       677
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = AxSpA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_ref_r~b} {...}
{c |}{...}
 {res}     8833  452.6351       386       181       666
{txt}{hline 13}{c BT}{hline 50}

{com}. 
. **Time from rheum appt to EIA code (i.e. if appts are present and in correct time order)
. gen time_rheum_eia_code = (eia_code_date - rheum_appt_date) if eia_code_date!=. & rheum_appt_date!=. & rheum_appt_date<eia_code_date 
{txt}(14,087 missing values generated)

{com}. tabstat time_rheum_eia_code, stats (n mean p50 p25 p75) 

{txt}{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_rheum~e} {...}
{c |}{...}
 {res}    29173  598.3456       568       310       864
{txt}{hline 13}{c BT}{hline 50}

{com}. bys eia_diagnosis: tabstat time_rheum_eia_code, stats (n mean p50 p25 p75) 

{txt}{hline}
-> eia_diagnosis = RA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_rheum~e} {...}
{c |}{...}
 {res}     9617  599.9121       571       313       862
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = PsA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_rheum~e} {...}
{c |}{...}
 {res}     9808  597.0034       565       309       865
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = AxSpA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_rheum~e} {...}
{c |}{...}
 {res}     9748  598.1506       568     306.5       867
{txt}{hline 13}{c BT}{hline 50}

{com}. 
. ***************************************************************************************************************************
. *Time to first prescription - all of the below are shared care prescriptions, aside from those with MTX_high cost drug data included
. 
. **Time to first csDMARD script for RA patients, whereby first rheum appt is classed as diagnosis date (assumes rheum appt present; not including high cost MTX prescriptions)
. gen time_to_csdmard=(csdmard_date-rheum_appt_date) if csdmard==1 & rheum_appt_date!=. & csdmard_date>rheum_appt_date 
{txt}(30,748 missing values generated)

{com}. tabstat time_to_csdmard if ra_code==1, stats (n mean p50 p25 p75)

{txt}{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_cs~d} {...}
{c |}{...}
 {res}     4159  566.9291       530       287       821
{txt}{hline 13}{c BT}{hline 50}

{com}. 
. **Time to first csDMARD script for RA patients (including high cost MTX prescriptions)
. gen time_to_csdmard_hcd=(csdmard_hcd_date-rheum_appt_date) if csdmard_hcd==1 & rheum_appt_date!=. & csdmard_hcd_date>rheum_appt_date 
{txt}(29,068 missing values generated)

{com}. tabstat time_to_csdmard_hcd if ra_code==1, stats (n mean p50 p25 p75) 

{txt}{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_c~cd} {...}
{c |}{...}
 {res}     4720  560.1943       520       283       815
{txt}{hline 13}{c BT}{hline 50}

{com}. 
. **Time to first csDMARD script for PsA patients (not including high cost MTX prescriptions)
. tabstat time_to_csdmard if psa_code==1, stats (n mean p50 p25 p75)

{txt}{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_c~rd} {...}
{c |}{...}
 {res}     4120  563.3638       527       283     813.5
{txt}{hline 13}{c BT}{hline 50}

{com}. tab csdmard if rheum_appt_date!=. & csdmard_date<rheum_appt_date & psa_code==1 
{txt}no observations

{com}. 
. **Time to first csDMARD script for PsA patients (including high cost MTX prescriptions)
. tabstat time_to_csdmard_hcd if psa_code==1, stats (n mean p50 p25 p75) 

{txt}{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_c~cd} {...}
{c |}{...}
 {res}     4690  554.1505       517       277       799
{txt}{hline 13}{c BT}{hline 50}

{com}. tab csdmard_hcd if rheum_appt_date!=. & csdmard_hcd_date<rheum_appt_date & psa_code==1  

{txt}csdmard_hcd {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}        252      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        252      100.00
{txt}
{com}. 
. **csDMARD time categories for RA patients (not including high cost MTX prescriptions)
. gen csdmard_6w=1 if time_to_csdmard<=42 & time_to_csdmard!=. 
{txt}(42,803 missing values generated)

{com}. recode csdmard_6w .=0
{txt}(csdmard_6w: 42803 changes made)

{com}. tab csdmard_6w if ra_code==1

 {txt}csdmard_6w {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     14,222       99.00       99.00
{txt}          1 {c |}{res}        144        1.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,366      100.00
{txt}
{com}. gen csdmard_3m=1 if time_to_csdmard<=90 & time_to_csdmard!=. 
{txt}(42,326 missing values generated)

{com}. recode csdmard_3m .=0
{txt}(csdmard_3m: 42326 changes made)

{com}. tab csdmard_3m if ra_code==1

 {txt}csdmard_3m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     14,046       97.77       97.77
{txt}          1 {c |}{res}        320        2.23      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,366      100.00
{txt}
{com}. gen csdmard_6m=1 if time_to_csdmard<=180 & time_to_csdmard!=. 
{txt}(41,350 missing values generated)

{com}. recode csdmard_6m .=0
{txt}(csdmard_6m: 41350 changes made)

{com}. tab csdmard_6m if ra_code==1

 {txt}csdmard_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     13,731       95.58       95.58
{txt}          1 {c |}{res}        635        4.42      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,366      100.00
{txt}
{com}. gen csdmard_12m=1 if time_to_csdmard<=365 & time_to_csdmard!=. 
{txt}(39,026 missing values generated)

{com}. recode csdmard_12m .=0
{txt}(csdmard_12m: 39026 changes made)

{com}. tab csdmard_12m if ra_code==1

{txt}csdmard_12m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     12,977       90.33       90.33
{txt}          1 {c |}{res}      1,389        9.67      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,366      100.00
{txt}
{com}. 
. **csDMARD time categories for RA patients (including high cost MTX prescriptions)
. gen csdmard_hcd_6w=1 if time_to_csdmard_hcd<=42 & time_to_csdmard_hcd!=.
{txt}(42,738 missing values generated)

{com}. recode csdmard_hcd_6w .=0
{txt}(csdmard_hcd_6w: 42738 changes made)

{com}. tab csdmard_hcd_6w if ra_code==1

{txt}csdmard_hcd {c |}
        _6w {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     14,203       98.87       98.87
{txt}          1 {c |}{res}        163        1.13      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,366      100.00
{txt}
{com}. gen csdmard_hcd_3m=1 if time_to_csdmard_hcd<=90 & time_to_csdmard_hcd!=.
{txt}(42,187 missing values generated)

{com}. recode csdmard_hcd_3m .=0
{txt}(csdmard_hcd_3m: 42187 changes made)

{com}. tab csdmard_hcd_3m if ra_code==1

{txt}csdmard_hcd {c |}
        _3m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     14,010       97.52       97.52
{txt}          1 {c |}{res}        356        2.48      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,366      100.00
{txt}
{com}. gen csdmard_hcd_6m=1 if time_to_csdmard_hcd<=180 & time_to_csdmard_hcd!=.
{txt}(41,050 missing values generated)

{com}. recode csdmard_hcd_6m .=0
{txt}(csdmard_hcd_6m: 41050 changes made)

{com}. tab csdmard_hcd_6m if ra_code==1

{txt}csdmard_hcd {c |}
        _6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     13,646       94.99       94.99
{txt}          1 {c |}{res}        720        5.01      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,366      100.00
{txt}
{com}. gen csdmard_hcd_12m=1 if time_to_csdmard_hcd<=365 & time_to_csdmard_hcd!=.
{txt}(38,339 missing values generated)

{com}. recode csdmard_hcd_12m .=0
{txt}(csdmard_hcd_12m: 38339 changes made)

{com}. tab csdmard_hcd_12m if ra_code==1

{txt}csdmard_hcd {c |}
       _12m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     12,748       88.74       88.74
{txt}          1 {c |}{res}      1,618       11.26      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,366      100.00
{txt}
{com}. 
. **csDMARD time categories for PsA patients (not including high cost MTX prescriptions)
. tab csdmard_6w if psa_code==1

 {txt}csdmard_6w {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     14,342       98.99       98.99
{txt}          1 {c |}{res}        146        1.01      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,488      100.00
{txt}
{com}. tab csdmard_3m if psa_code==1

 {txt}csdmard_3m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     14,182       97.89       97.89
{txt}          1 {c |}{res}        306        2.11      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,488      100.00
{txt}
{com}. tab csdmard_6m if psa_code==1

 {txt}csdmard_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     13,883       95.82       95.82
{txt}          1 {c |}{res}        605        4.18      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,488      100.00
{txt}
{com}. tab csdmard_12m if psa_code==1

{txt}csdmard_12m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     13,111       90.50       90.50
{txt}          1 {c |}{res}      1,377        9.50      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,488      100.00
{txt}
{com}. 
. **csDMARD time categories for PsA patients (including high cost MTX prescriptions)
. tab csdmard_hcd_6w if psa_code==1

{txt}csdmard_hcd {c |}
        _6w {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     14,314       98.80       98.80
{txt}          1 {c |}{res}        174        1.20      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,488      100.00
{txt}
{com}. tab csdmard_hcd_3m if psa_code==1

{txt}csdmard_hcd {c |}
        _3m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     14,131       97.54       97.54
{txt}          1 {c |}{res}        357        2.46      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,488      100.00
{txt}
{com}. tab csdmard_hcd_6m if psa_code==1

{txt}csdmard_hcd {c |}
        _6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     13,786       95.15       95.15
{txt}          1 {c |}{res}        702        4.85      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,488      100.00
{txt}
{com}. tab csdmard_hcd_12m if psa_code==1

{txt}csdmard_hcd {c |}
       _12m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     12,889       88.96       88.96
{txt}          1 {c |}{res}      1,599       11.04      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,488      100.00
{txt}
{com}. 
. **What was first shared care csDMARD (not including high cost MTX prescriptions)
. gen first_csD=""
{txt}(43,260 missing values generated)

{com}. foreach var of varlist hydroxychloroquine_date leflunomide_date methotrexate_date methotrexate_inj_date sulfasalazine_date {c -(}
{txt}  2{com}.         replace first_csD="`var'" if csdmard_date==`var' & csdmard_date!=.
{txt}  3{com}.         {c )-}
{txt}variable {bf}first_csD{sf} was {bf}{res}str1{sf}{txt} now {bf}{res}str23{sf}
{txt}(3,144 real changes made)
(3,104 real changes made)
(3,130 real changes made)
(3,105 real changes made)
(3,004 real changes made)

{com}. gen first_csDMARD = substr(first_csD, 1, length(first_csD) - 5) if first_csD!=""
{txt}(27,777 missing values generated)

{com}. drop first_csD
{txt}
{com}. tab first_csDMARD if ra_code==1 //for RA patients

     {txt}first_csDMARD {c |}      Freq.     Percent        Cum.
{hline 19}{c +}{hline 35}
hydroxychloroquine {c |}{res}      1,010       19.68       19.68
{txt}       leflunomide {c |}{res}      1,023       19.93       39.61
{txt}      methotrexate {c |}{res}      1,053       20.51       60.12
{txt}  methotrexate_inj {c |}{res}      1,066       20.77       80.89
{txt}     sulfasalazine {c |}{res}        981       19.11      100.00
{txt}{hline 19}{c +}{hline 35}
             Total {c |}{res}      5,133      100.00
{txt}
{com}. tab first_csDMARD if psa_code==1 //for PsA patients

     {txt}first_csDMARD {c |}      Freq.     Percent        Cum.
{hline 19}{c +}{hline 35}
hydroxychloroquine {c |}{res}      1,061       20.63       20.63
{txt}       leflunomide {c |}{res}      1,013       19.70       40.33
{txt}      methotrexate {c |}{res}      1,021       19.85       60.18
{txt}  methotrexate_inj {c |}{res}      1,051       20.44       80.61
{txt}     sulfasalazine {c |}{res}        997       19.39      100.00
{txt}{hline 19}{c +}{hline 35}
             Total {c |}{res}      5,143      100.00
{txt}
{com}. 
. 
. **What was first csDMARD (including high cost MTX prescriptions)
. gen first_csD_hcd=""
{txt}(43,260 missing values generated)

{com}. foreach var of varlist hydroxychloroquine_date leflunomide_date methotrexate_date methotrexate_inj_date methotrexate_hcd_date sulfasalazine_date {c -(}
{txt}  2{com}.         replace first_csD_hcd="`var'" if csdmard_hcd_date==`var' & csdmard_hcd_date!=.
{txt}  3{com}.         {c )-}
{txt}variable {bf}first_csD_hcd{sf} was {bf}{res}str1{sf}{txt} now {bf}{res}str23{sf}
{txt}(3,000 real changes made)
(2,934 real changes made)
(2,960 real changes made)
(2,950 real changes made)
(3,618 real changes made)
(2,845 real changes made)

{com}. gen first_csDMARD_hcd = substr(first_csD_hcd, 1, length(first_csD_hcd) - 5) if first_csD_hcd!=""
{txt}(24,958 missing values generated)

{com}. drop first_csD_hcd
{txt}
{com}. tab first_csDMARD_hcd if ra_code==1 //for RA patients

 {txt}first_csDMARD_hcd {c |}      Freq.     Percent        Cum.
{hline 19}{c +}{hline 35}
hydroxychloroquine {c |}{res}        963       15.88       15.88
{txt}       leflunomide {c |}{res}        964       15.90       31.78
{txt}      methotrexate {c |}{res}        996       16.42       48.20
{txt}  methotrexate_hcd {c |}{res}      1,207       19.90       68.11
{txt}  methotrexate_inj {c |}{res}      1,007       16.61       84.71
{txt}     sulfasalazine {c |}{res}        927       15.29      100.00
{txt}{hline 19}{c +}{hline 35}
             Total {c |}{res}      6,064      100.00
{txt}
{com}. tab first_csDMARD_hcd if psa_code==1 //for PsA patients

 {txt}first_csDMARD_hcd {c |}      Freq.     Percent        Cum.
{hline 19}{c +}{hline 35}
hydroxychloroquine {c |}{res}      1,007       16.48       16.48
{txt}       leflunomide {c |}{res}        959       15.70       32.18
{txt}      methotrexate {c |}{res}        958       15.68       47.86
{txt}  methotrexate_hcd {c |}{res}      1,242       20.33       68.18
{txt}  methotrexate_inj {c |}{res}      1,001       16.38       84.57
{txt}     sulfasalazine {c |}{res}        943       15.43      100.00
{txt}{hline 19}{c +}{hline 35}
             Total {c |}{res}      6,110      100.00
{txt}
{com}.  
. **Methotrexate use (not including high cost MTX prescriptions)
. gen mtx=1 if methotrexate==1 | methotrexate_inj==1
{txt}(36,095 missing values generated)

{com}. recode mtx .=0 
{txt}(mtx: 36095 changes made)

{com}. tab mtx if ra_code==1 //for RA patients

        {txt}mtx {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     11,943       83.13       83.13
{txt}          1 {c |}{res}      2,423       16.87      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,366      100.00
{txt}
{com}. tab mtx if psa_code==1 //for PsA patients

        {txt}mtx {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     12,118       83.64       83.64
{txt}          1 {c |}{res}      2,370       16.36      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,488      100.00
{txt}
{com}. 
. **Methotrexate use (including high cost MTX prescriptions)
. gen mtx_hcd=1 if methotrexate==1 | methotrexate_inj==1 | methotrexate_hcd==1
{txt}(32,462 missing values generated)

{com}. recode mtx_hcd .=0 
{txt}(mtx_hcd: 32462 changes made)

{com}. tab mtx_hcd if ra_code==1 //for RA patients

    {txt}mtx_hcd {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     10,759       74.89       74.89
{txt}          1 {c |}{res}      3,607       25.11      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,366      100.00
{txt}
{com}. tab mtx_hcd if psa_code==1 //for PsA patients

    {txt}mtx_hcd {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     10,856       74.93       74.93
{txt}          1 {c |}{res}      3,632       25.07      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,488      100.00
{txt}
{com}. 
. **Date of first methotrexate script (not including high cost MTX prescriptions)
. gen mtx_date=min(methotrexate_date, methotrexate_inj_date)
{txt}(36,095 missing values generated)

{com}. format %td mtx_date
{txt}
{com}. 
. **Date of first methotrexate script (including high cost MTX prescriptions)
. gen mtx_hcd_date=min(methotrexate_date, methotrexate_inj_date, methotrexate_hcd_date)
{txt}(32,462 missing values generated)

{com}. format %td mtx_hcd_date
{txt}
{com}. 
. **Time to first methotrexate script for RA patients (not including high cost MTX prescriptions)
. gen time_to_mtx=(mtx_date-rheum_appt_date) if mtx==1 & rheum_appt_date!=. & mtx_date>rheum_appt_date 
{txt}(37,488 missing values generated)

{com}. tabstat time_to_mtx if ra_code==1, stats (n mean p50 p25 p75)

{txt}{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_mtx} {...}
{c |}{...}
 {res}     1978  592.9894     561.5       318       857
{txt}{hline 13}{c BT}{hline 50}

{com}. 
. **Time to first methotrexate script for RA patients (including high cost MTX prescriptions)
. gen time_to_mtx_hcd=(mtx_hcd_date-rheum_appt_date) if mtx_hcd==1 & rheum_appt_date!=. & mtx_hcd_date>rheum_appt_date 
{txt}(35,128 missing values generated)

{com}. tabstat time_to_mtx_hcd if ra_code==1, stats (n mean p50 p25 p75)

{txt}{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_mt~d} {...}
{c |}{...}
 {res}     2755  583.4508       553       307       846
{txt}{hline 13}{c BT}{hline 50}

{com}. 
. **Time to first methotrexate script for PsA patients (not including high cost MTX prescriptions)
. tabstat time_to_mtx if psa_code==1, stats (n mean p50 p25 p75)

{txt}{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_mtx} {...}
{c |}{...}
 {res}     1863  583.3553       557       294       844
{txt}{hline 13}{c BT}{hline 50}

{com}. tab mtx if rheum_appt_date!=. & mtx_date<rheum_appt_date & psa_code==1 //how many patients had precriptions pre-rheum appt
{txt}no observations

{com}. 
. **Time to first methotrexate script for PsA patients (including high cost MTX prescriptions)
. tabstat time_to_mtx_hcd if psa_code==1, stats (n mean p50 p25 p75)

{txt}{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_mt~d} {...}
{c |}{...}
 {res}     2680  575.7325       541     294.5       828
{txt}{hline 13}{c BT}{hline 50}

{com}. tab mtx_hcd if rheum_appt_date!=. & mtx_hcd_date<rheum_appt_date & psa_code==1 //how many patients had precriptions pre-rheum appt

    {txt}mtx_hcd {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}        252      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        252      100.00
{txt}
{com}. 
. **Methotrexate time categories for RA patients (not including high-cost MTX) //Nb. this is time period from rheum appt (i.e. diagnosis) to shared care, not from referral to first script 
. gen mtx_6w=1 if time_to_mtx<=42 & time_to_mtx!=.
{txt}(43,051 missing values generated)

{com}. recode mtx_6w .=0
{txt}(mtx_6w: 43051 changes made)

{com}. tab mtx_6w if ra_code==1

     {txt}mtx_6w {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     14,300       99.54       99.54
{txt}          1 {c |}{res}         66        0.46      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,366      100.00
{txt}
{com}. gen mtx_3m=1 if time_to_mtx<=90 & time_to_mtx!=.
{txt}(42,857 missing values generated)

{com}. recode mtx_3m .=0
{txt}(mtx_3m: 42857 changes made)

{com}. tab mtx_3m if ra_code==1

     {txt}mtx_3m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     14,228       99.04       99.04
{txt}          1 {c |}{res}        138        0.96      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,366      100.00
{txt}
{com}. gen mtx_6m=1 if time_to_mtx<=180 & time_to_mtx!=.
{txt}(42,431 missing values generated)

{com}. recode mtx_6m .=0
{txt}(mtx_6m: 42431 changes made)

{com}. tab mtx_6m if ra_code==1

     {txt}mtx_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     14,076       97.98       97.98
{txt}          1 {c |}{res}        290        2.02      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,366      100.00
{txt}
{com}. gen mtx_12m=1 if time_to_mtx<=365 & time_to_mtx!=.
{txt}(41,460 missing values generated)

{com}. recode mtx_12m .=0
{txt}(mtx_12m: 41460 changes made)

{com}. tab mtx_12m if ra_code==1

    {txt}mtx_12m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     13,752       95.73       95.73
{txt}          1 {c |}{res}        614        4.27      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,366      100.00
{txt}
{com}. 
. **Methotrexate time categories for RA patients (including high-cost MTX)
. gen mtx_hcd_6w=1 if time_to_mtx_hcd<=42 & time_to_mtx_hcd!=.
{txt}(42,976 missing values generated)

{com}. recode mtx_hcd_6w .=0
{txt}(mtx_hcd_6w: 42976 changes made)

{com}. tab mtx_hcd_6w if ra_code==1

 {txt}mtx_hcd_6w {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     14,275       99.37       99.37
{txt}          1 {c |}{res}         91        0.63      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,366      100.00
{txt}
{com}. gen mtx_hcd_3m=1 if time_to_mtx_hcd<=90 & time_to_mtx_hcd!=.
{txt}(42,699 missing values generated)

{com}. recode mtx_hcd_3m .=0
{txt}(mtx_hcd_3m: 42699 changes made)

{com}. tab mtx_hcd_3m if ra_code==1

 {txt}mtx_hcd_3m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     14,183       98.73       98.73
{txt}          1 {c |}{res}        183        1.27      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,366      100.00
{txt}
{com}. gen mtx_hcd_6m=1 if time_to_mtx_hcd<=180 & time_to_mtx_hcd!=.
{txt}(42,082 missing values generated)

{com}. recode mtx_hcd_6m .=0
{txt}(mtx_hcd_6m: 42082 changes made)

{com}. tab mtx_hcd_6m if ra_code==1

 {txt}mtx_hcd_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     13,973       97.26       97.26
{txt}          1 {c |}{res}        393        2.74      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,366      100.00
{txt}
{com}. gen mtx_hcd_12m=1 if time_to_mtx_hcd<=365 & time_to_mtx_hcd!=.
{txt}(40,645 missing values generated)

{com}. recode mtx_hcd_12m .=0
{txt}(mtx_hcd_12m: 40645 changes made)

{com}. tab mtx_hcd_12m if ra_code==1

{txt}mtx_hcd_12m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     13,481       93.84       93.84
{txt}          1 {c |}{res}        885        6.16      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,366      100.00
{txt}
{com}. 
. **Methotrexate time categories for PsA patients (not including high-cost MTX)
. tab mtx_6w if psa_code==1

     {txt}mtx_6w {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     14,416       99.50       99.50
{txt}          1 {c |}{res}         72        0.50      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,488      100.00
{txt}
{com}. tab mtx_3m if psa_code==1

     {txt}mtx_3m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     14,355       99.08       99.08
{txt}          1 {c |}{res}        133        0.92      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,488      100.00
{txt}
{com}. tab mtx_6m if psa_code==1

     {txt}mtx_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     14,224       98.18       98.18
{txt}          1 {c |}{res}        264        1.82      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,488      100.00
{txt}
{com}. tab mtx_12m if psa_code==1

    {txt}mtx_12m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     13,909       96.00       96.00
{txt}          1 {c |}{res}        579        4.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,488      100.00
{txt}
{com}. 
. **Methotrexate time categories for PsA patients (including high-cost MTX)
. tab mtx_hcd_6w if psa_code==1

 {txt}mtx_hcd_6w {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     14,388       99.31       99.31
{txt}          1 {c |}{res}        100        0.69      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,488      100.00
{txt}
{com}. tab mtx_hcd_3m if psa_code==1

 {txt}mtx_hcd_3m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     14,299       98.70       98.70
{txt}          1 {c |}{res}        189        1.30      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,488      100.00
{txt}
{com}. tab mtx_hcd_6m if psa_code==1

 {txt}mtx_hcd_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     14,110       97.39       97.39
{txt}          1 {c |}{res}        378        2.61      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,488      100.00
{txt}
{com}. tab mtx_hcd_12m if psa_code==1

{txt}mtx_hcd_12m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     13,639       94.14       94.14
{txt}          1 {c |}{res}        849        5.86      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,488      100.00
{txt}
{com}. 
. **Time to first biologic script, whereby first rheum appt is classed as diagnosis date (assumes rheum appt present)
. gen time_to_biologic=(biologic_date-rheum_appt_date) if biologic==1 & rheum_appt_date!=. & biologic_date>rheum_appt_date 
{txt}(17,545 missing values generated)

{com}. tabstat time_to_biologic, stats (n mean p50 p25 p75) //for all EIA patients

{txt}{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_bi~c} {...}
{c |}{...}
 {res}    25715  456.3272       397       203       660
{txt}{hline 13}{c BT}{hline 50}

{com}. bys eia_diagnosis: tabstat time_to_biologic, stats (n mean p50 p25 p75) 

{txt}{hline}
-> eia_diagnosis = RA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_bi~c} {...}
{c |}{...}
 {res}     8508  455.1014       391     200.5       662
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = PsA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_bi~c} {...}
{c |}{...}
 {res}     8627  458.9744       403       207       660
{txt}{hline 13}{c BT}{hline 50}

{hline}
-> eia_diagnosis = AxSpA

{ralign 12:variable} {...}
{c |}         N      mean       p50       p25       p75
{hline 13}{c +}{hline 50}
{ralign 12:time_to_bi~c} {...}
{c |}{...}
 {res}     8580  454.8811     397.5       201     657.5
{txt}{hline 13}{c BT}{hline 50}

{com}. 
. **What was first biologic
. gen first_bio=""
{txt}(43,260 missing values generated)

{com}. foreach var of varlist abatacept_date adalimumab_date baricitinib_date certolizumab_date etanercept_date golimumab_date guselkumab_date infliximab_date ixekizumab_date rituximab_date sarilumab_date secukinumab_date tocilizumab_date tofacitinib_date upadacitinib_date ustekinumab_date {c -(}
{txt}  2{com}.         replace first_bio="`var'" if biologic_date==`var' & biologic_date!=.
{txt}  3{com}.         {c )-}
{txt}variable {bf}first_bio{sf} was {bf}{res}str1{sf}{txt} now {bf}{res}str14{sf}
{txt}(2,049 real changes made)
variable {bf}first_bio{sf} was {bf}{res}str14{sf}{txt} now {bf}{res}str15{sf}
{txt}(2,039 real changes made)
variable {bf}first_bio{sf} was {bf}{res}str15{sf}{txt} now {bf}{res}str16{sf}
{txt}(1,970 real changes made)
variable {bf}first_bio{sf} was {bf}{res}str16{sf}{txt} now {bf}{res}str17{sf}
{txt}(2,059 real changes made)
(2,029 real changes made)
(1,981 real changes made)
(1,987 real changes made)
(1,985 real changes made)
(2,007 real changes made)
(1,992 real changes made)
(2,091 real changes made)
(2,026 real changes made)
(1,961 real changes made)
(2,113 real changes made)
(2,061 real changes made)
(2,035 real changes made)

{com}. gen first_biologic = substr(first_bio, 1, length(first_bio) - 5)        
{txt}(11,582 missing values generated)

{com}. drop first_bio
{txt}
{com}. tab first_biologic //for all EIA patients

{txt}first_biolog {c |}
          ic {c |}      Freq.     Percent        Cum.
{hline 13}{c +}{hline 35}
   abatacept {c |}{res}      1,973        6.23        6.23
{txt}  adalimumab {c |}{res}      1,947        6.15       12.37
{txt} baricitinib {c |}{res}      1,891        5.97       18.34
{txt}certolizumab {c |}{res}      1,995        6.30       24.64
{txt}  etanercept {c |}{res}      1,961        6.19       30.83
{txt}   golimumab {c |}{res}      1,924        6.07       36.91
{txt}  guselkumab {c |}{res}      1,949        6.15       43.06
{txt}  infliximab {c |}{res}      1,933        6.10       49.16
{txt}  ixekizumab {c |}{res}      1,965        6.20       55.36
{txt}   rituximab {c |}{res}      1,958        6.18       61.54
{txt}   sarilumab {c |}{res}      2,056        6.49       68.03
{txt} secukinumab {c |}{res}      1,997        6.30       74.34
{txt} tocilizumab {c |}{res}      1,944        6.14       80.48
{txt} tofacitinib {c |}{res}      2,092        6.60       87.08
{txt}upadacitinib {c |}{res}      2,058        6.50       93.58
{txt} ustekinumab {c |}{res}      2,035        6.42      100.00
{txt}{hline 13}{c +}{hline 35}
       Total {c |}{res}     31,678      100.00
{txt}
{com}. bys eia_diagnosis: tab first_biologic 

{txt}{hline}
-> eia_diagnosis = RA

first_biolog {c |}
          ic {c |}      Freq.     Percent        Cum.
{hline 13}{c +}{hline 35}
   abatacept {c |}{res}        674        6.42        6.42
{txt}  adalimumab {c |}{res}        643        6.12       12.54
{txt} baricitinib {c |}{res}        629        5.99       18.53
{txt}certolizumab {c |}{res}        629        5.99       24.52
{txt}  etanercept {c |}{res}        648        6.17       30.69
{txt}   golimumab {c |}{res}        629        5.99       36.68
{txt}  guselkumab {c |}{res}        688        6.55       43.23
{txt}  infliximab {c |}{res}        630        6.00       49.23
{txt}  ixekizumab {c |}{res}        623        5.93       55.17
{txt}   rituximab {c |}{res}        626        5.96       61.13
{txt}   sarilumab {c |}{res}        730        6.95       68.08
{txt} secukinumab {c |}{res}        646        6.15       74.23
{txt} tocilizumab {c |}{res}        661        6.29       80.53
{txt} tofacitinib {c |}{res}        719        6.85       87.37
{txt}upadacitinib {c |}{res}        670        6.38       93.75
{txt} ustekinumab {c |}{res}        656        6.25      100.00
{txt}{hline 13}{c +}{hline 35}
       Total {c |}{res}     10,501      100.00

{txt}{hline}
-> eia_diagnosis = PsA

first_biolog {c |}
          ic {c |}      Freq.     Percent        Cum.
{hline 13}{c +}{hline 35}
   abatacept {c |}{res}        648        6.13        6.13
{txt}  adalimumab {c |}{res}        657        6.21       12.34
{txt} baricitinib {c |}{res}        646        6.11       18.45
{txt}certolizumab {c |}{res}        668        6.32       24.76
{txt}  etanercept {c |}{res}        639        6.04       30.80
{txt}   golimumab {c |}{res}        628        5.94       36.74
{txt}  guselkumab {c |}{res}        632        5.98       42.72
{txt}  infliximab {c |}{res}        658        6.22       48.94
{txt}  ixekizumab {c |}{res}        661        6.25       55.19
{txt}   rituximab {c |}{res}        655        6.19       61.38
{txt}   sarilumab {c |}{res}        687        6.50       67.87
{txt} secukinumab {c |}{res}        662        6.26       74.13
{txt} tocilizumab {c |}{res}        659        6.23       80.36
{txt} tofacitinib {c |}{res}        694        6.56       86.92
{txt}upadacitinib {c |}{res}        686        6.49       93.41
{txt} ustekinumab {c |}{res}        697        6.59      100.00
{txt}{hline 13}{c +}{hline 35}
       Total {c |}{res}     10,577      100.00

{txt}{hline}
-> eia_diagnosis = AxSpA

first_biolog {c |}
          ic {c |}      Freq.     Percent        Cum.
{hline 13}{c +}{hline 35}
   abatacept {c |}{res}        651        6.14        6.14
{txt}  adalimumab {c |}{res}        647        6.10       12.25
{txt} baricitinib {c |}{res}        616        5.81       18.06
{txt}certolizumab {c |}{res}        698        6.58       24.64
{txt}  etanercept {c |}{res}        674        6.36       31.00
{txt}   golimumab {c |}{res}        667        6.29       37.29
{txt}  guselkumab {c |}{res}        629        5.93       43.23
{txt}  infliximab {c |}{res}        645        6.08       49.31
{txt}  ixekizumab {c |}{res}        681        6.42       55.74
{txt}   rituximab {c |}{res}        677        6.39       62.12
{txt}   sarilumab {c |}{res}        639        6.03       68.15
{txt} secukinumab {c |}{res}        689        6.50       74.65
{txt} tocilizumab {c |}{res}        624        5.89       80.54
{txt} tofacitinib {c |}{res}        679        6.41       86.94
{txt}upadacitinib {c |}{res}        702        6.62       93.57
{txt} ustekinumab {c |}{res}        682        6.43      100.00
{txt}{hline 13}{c +}{hline 35}
       Total {c |}{res}     10,600      100.00

{txt}
{com}. 
. **Biologic time categories (for all patients)
. gen biologic_6m=1 if time_to_biologic<=180 & time_to_biologic!=.
{txt}(37,607 missing values generated)

{com}. recode biologic_6m .=0
{txt}(biologic_6m: 37607 changes made)

{com}. tab biologic_6m //for all EIA patients

{txt}biologic_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     37,607       86.93       86.93
{txt}          1 {c |}{res}      5,653       13.07      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     43,260      100.00
{txt}
{com}. bys eia_diagnosis: tab biologic_6m 

{txt}{hline}
-> eia_diagnosis = RA

biologic_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     12,484       86.90       86.90
{txt}          1 {c |}{res}      1,882       13.10      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,366      100.00

{txt}{hline}
-> eia_diagnosis = PsA

biologic_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     12,620       87.11       87.11
{txt}          1 {c |}{res}      1,868       12.89      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,488      100.00

{txt}{hline}
-> eia_diagnosis = AxSpA

biologic_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     12,503       86.79       86.79
{txt}          1 {c |}{res}      1,903       13.21      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,406      100.00

{txt}
{com}. gen biologic_12m=1 if time_to_biologic<=365 & time_to_biologic!=.
{txt}(31,406 missing values generated)

{com}. recode biologic_12m .=0
{txt}(biologic_12m: 31406 changes made)

{com}. tab biologic_12m //for all EIA patients

{txt}biologic_12 {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     31,406       72.60       72.60
{txt}          1 {c |}{res}     11,854       27.40      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     43,260      100.00
{txt}
{com}. bys eia_diagnosis: tab biologic_12m 

{txt}{hline}
-> eia_diagnosis = RA

biologic_12 {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     10,378       72.24       72.24
{txt}          1 {c |}{res}      3,988       27.76      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,366      100.00

{txt}{hline}
-> eia_diagnosis = PsA

biologic_12 {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     10,574       72.98       72.98
{txt}          1 {c |}{res}      3,914       27.02      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,488      100.00

{txt}{hline}
-> eia_diagnosis = AxSpA

biologic_12 {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     10,454       72.57       72.57
{txt}          1 {c |}{res}      3,952       27.43      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     14,406      100.00

{txt}
{com}. 
. **Biologic time categories (by year)
. bys diagnosis_year: tab biologic_6m //for all EIA patients

{txt}{hline}
-> diagnosis_year = March 2019-March 2020

biologic_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     12,212       87.60       87.60
{txt}          1 {c |}{res}      1,728       12.40      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     13,940      100.00

{txt}{hline}
-> diagnosis_year = March 2020-March 2021

biologic_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     11,849       86.45       86.45
{txt}          1 {c |}{res}      1,857       13.55      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     13,706      100.00

{txt}{hline}
-> diagnosis_year = March 2021-March 2022

biologic_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     11,863       86.64       86.64
{txt}          1 {c |}{res}      1,829       13.36      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     13,692      100.00

{txt}{hline}
-> diagnosis_year = .

biologic_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      1,683       87.57       87.57
{txt}          1 {c |}{res}        239       12.43      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,922      100.00

{txt}
{com}. bys diagnosis_year eia_diagnosis: tab biologic_6m //for each diagnosis

{txt}{hline}
-> diagnosis_year = March 2019-March 2020, eia_diagnosis = RA

biologic_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      4,049       87.26       87.26
{txt}          1 {c |}{res}        591       12.74      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      4,640      100.00

{txt}{hline}
-> diagnosis_year = March 2019-March 2020, eia_diagnosis = PsA

biologic_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      4,126       87.56       87.56
{txt}          1 {c |}{res}        586       12.44      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      4,712      100.00

{txt}{hline}
-> diagnosis_year = March 2019-March 2020, eia_diagnosis = AxSpA

biologic_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      4,037       87.99       87.99
{txt}          1 {c |}{res}        551       12.01      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      4,588      100.00

{txt}{hline}
-> diagnosis_year = March 2020-March 2021, eia_diagnosis = RA

biologic_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      3,903       86.46       86.46
{txt}          1 {c |}{res}        611       13.54      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      4,514      100.00

{txt}{hline}
-> diagnosis_year = March 2020-March 2021, eia_diagnosis = PsA

biologic_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      3,941       86.63       86.63
{txt}          1 {c |}{res}        608       13.37      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      4,549      100.00

{txt}{hline}
-> diagnosis_year = March 2020-March 2021, eia_diagnosis = AxSpA

biologic_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      4,005       86.26       86.26
{txt}          1 {c |}{res}        638       13.74      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      4,643      100.00

{txt}{hline}
-> diagnosis_year = March 2021-March 2022, eia_diagnosis = RA

biologic_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      3,930       86.41       86.41
{txt}          1 {c |}{res}        618       13.59      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      4,548      100.00

{txt}{hline}
-> diagnosis_year = March 2021-March 2022, eia_diagnosis = PsA

biologic_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      3,984       87.23       87.23
{txt}          1 {c |}{res}        583       12.77      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      4,567      100.00

{txt}{hline}
-> diagnosis_year = March 2021-March 2022, eia_diagnosis = AxSpA

biologic_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      3,949       86.28       86.28
{txt}          1 {c |}{res}        628       13.72      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      4,577      100.00

{txt}{hline}
-> diagnosis_year = ., eia_diagnosis = RA

biologic_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}        602       90.66       90.66
{txt}          1 {c |}{res}         62        9.34      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        664      100.00

{txt}{hline}
-> diagnosis_year = ., eia_diagnosis = PsA

biologic_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}        569       86.21       86.21
{txt}          1 {c |}{res}         91       13.79      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        660      100.00

{txt}{hline}
-> diagnosis_year = ., eia_diagnosis = AxSpA

biologic_6m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}        512       85.62       85.62
{txt}          1 {c |}{res}         86       14.38      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        598      100.00

{txt}
{com}. bys diagnosis_year: tab biologic_12m //for all EIA patients

{txt}{hline}
-> diagnosis_year = March 2019-March 2020

biologic_12 {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     10,220       73.31       73.31
{txt}          1 {c |}{res}      3,720       26.69      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     13,940      100.00

{txt}{hline}
-> diagnosis_year = March 2020-March 2021

biologic_12 {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      9,912       72.32       72.32
{txt}          1 {c |}{res}      3,794       27.68      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     13,706      100.00

{txt}{hline}
-> diagnosis_year = March 2021-March 2022

biologic_12 {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      9,871       72.09       72.09
{txt}          1 {c |}{res}      3,821       27.91      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     13,692      100.00

{txt}{hline}
-> diagnosis_year = .

biologic_12 {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      1,403       73.00       73.00
{txt}          1 {c |}{res}        519       27.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,922      100.00

{txt}
{com}. bys diagnosis_year eia_diagnosis: tab biologic_12m //for each diagnosis

{txt}{hline}
-> diagnosis_year = March 2019-March 2020, eia_diagnosis = RA

biologic_12 {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      3,398       73.23       73.23
{txt}          1 {c |}{res}      1,242       26.77      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      4,640      100.00

{txt}{hline}
-> diagnosis_year = March 2019-March 2020, eia_diagnosis = PsA

biologic_12 {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      3,448       73.17       73.17
{txt}          1 {c |}{res}      1,264       26.83      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      4,712      100.00

{txt}{hline}
-> diagnosis_year = March 2019-March 2020, eia_diagnosis = AxSpA

biologic_12 {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      3,374       73.54       73.54
{txt}          1 {c |}{res}      1,214       26.46      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      4,588      100.00

{txt}{hline}
-> diagnosis_year = March 2020-March 2021, eia_diagnosis = RA

biologic_12 {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      3,222       71.38       71.38
{txt}          1 {c |}{res}      1,292       28.62      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      4,514      100.00

{txt}{hline}
-> diagnosis_year = March 2020-March 2021, eia_diagnosis = PsA

biologic_12 {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      3,337       73.36       73.36
{txt}          1 {c |}{res}      1,212       26.64      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      4,549      100.00

{txt}{hline}
-> diagnosis_year = March 2020-March 2021, eia_diagnosis = AxSpA

biologic_12 {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      3,353       72.22       72.22
{txt}          1 {c |}{res}      1,290       27.78      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      4,643      100.00

{txt}{hline}
-> diagnosis_year = March 2021-March 2022, eia_diagnosis = RA

biologic_12 {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      3,258       71.64       71.64
{txt}          1 {c |}{res}      1,290       28.36      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      4,548      100.00

{txt}{hline}
-> diagnosis_year = March 2021-March 2022, eia_diagnosis = PsA

biologic_12 {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      3,323       72.76       72.76
{txt}          1 {c |}{res}      1,244       27.24      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      4,567      100.00

{txt}{hline}
-> diagnosis_year = March 2021-March 2022, eia_diagnosis = AxSpA

biologic_12 {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      3,290       71.88       71.88
{txt}          1 {c |}{res}      1,287       28.12      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      4,577      100.00

{txt}{hline}
-> diagnosis_year = ., eia_diagnosis = RA

biologic_12 {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}        500       75.30       75.30
{txt}          1 {c |}{res}        164       24.70      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        664      100.00

{txt}{hline}
-> diagnosis_year = ., eia_diagnosis = PsA

biologic_12 {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}        466       70.61       70.61
{txt}          1 {c |}{res}        194       29.39      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        660      100.00

{txt}{hline}
-> diagnosis_year = ., eia_diagnosis = AxSpA

biologic_12 {c |}
          m {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}        437       73.08       73.08
{txt}          1 {c |}{res}        161       26.92      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        598      100.00

{txt}
{com}. 
. **Create and label variables ===========================================================*/
. 
. **Demographics
. ***Sex
. gen male = 1 if sex == "M"
{txt}(22,218 missing values generated)

{com}. replace male = 0 if sex == "F"
{txt}(22,218 real changes made)

{com}. lab var male "Male"
{txt}
{com}. 
. ***Ethnicity
. replace ethnicity = .u if ethnicity == .
{txt}(10,777 real changes made, 10,777 to missing)

{com}. ****rearrange in order of prevalence
. recode ethnicity 2=6 /* mixed to 6 */
{txt}(ethnicity: 6484 changes made)

{com}. recode ethnicity 3=2 /* south asian to 2 */
{txt}(ethnicity: 3313 changes made)

{com}. recode ethnicity 4=3 /* black to 3 */
{txt}(ethnicity: 3172 changes made)

{com}. recode ethnicity 6=4 /* mixed to 4 */
{txt}(ethnicity: 6484 changes made)

{com}. recode ethnicity 5=4 /* other to 4 */
{txt}(ethnicity: 3269 changes made)

{com}. 
. label define ethnicity  1 "White"                                       ///
>                                                 2 "Asian/Asian British"         ///
>                                                 3 "Black"                                       ///
>                                                 4 "Mixed/Other"                         ///
>                                                 .u "Missing"
{txt}
{com}. label values ethnicity ethnicity
{txt}
{com}. lab var ethnicity "Ethnicity"
{txt}
{com}. 
. ***STP 
. rename stp stp_old
{res}{txt}
{com}. bysort stp_old: gen stp = 1 if _n==1
{txt}(43,258 missing values generated)

{com}. replace stp = sum(stp) //
{txt}(43,259 real changes made)

{com}. drop stp_old
{txt}
{com}. 
. ***IMD
. *Group into 5 groups
. rename imd imd_o
{res}{txt}
{com}. egen imd = cut(imd_o), group(5) icodes 
{txt}
{com}. *Add one to create groups 1-5 
. replace imd = imd + 1
{txt}(43,260 real changes made)

{com}. *-1 is missing, should be excluded from population 
. replace imd = .u if imd_o == -1
{txt}(0 real changes made)

{com}. drop imd_o
{txt}
{com}. *Reverse the order (so high is more deprived)
. recode imd 5 = 1 4 = 2 3 = 3 2 = 4 1 = 5 .u = .u
{txt}(imd: 43260 changes made)

{com}. label define imd 1 "1 least deprived" 2 "2" 3 "3" 4 "4" 5 "5 most deprived" .u "Missing"
{txt}
{com}. label values imd imd 
{txt}
{com}. lab var imd "Index of multiple deprivation"
{txt}
{com}. 
. ***Age variables
. *Nb. works if ages 18 and over
. *Create categorised age
. drop if age<18 & age !=.
{txt}(9,170 observations deleted)

{com}. drop if age>109 & age !=.
{txt}(0 observations deleted)

{com}. drop if age==.
{txt}(0 observations deleted)

{com}. lab var age "Age"
{txt}
{com}. 
. recode age 18/39.9999 = 1 /// 
>            40/49.9999 = 2 ///
>                    50/59.9999 = 3 ///
>                60/69.9999 = 4 ///
>                    70/79.9999 = 5 ///
>                    80/max = 6, gen(agegroup) 
{txt}(34090 differences between age and agegroup)

{com}. 
. label define agegroup   1 "18-39" ///
>                                                 2 "40-49" ///
>                                                 3 "50-59" ///
>                                                 4 "60-69" ///
>                                                 5 "70-79" ///
>                                                 6 "80+"
{txt}
{com}.                                                 
. label values agegroup agegroup
{txt}
{com}. lab var agegroup "Age group"
{txt}
{com}. 
. *Create binary age
. recode age min/69.999 = 0 ///
>            70/max = 1, gen(age70)
{txt}(34090 differences between age and age70)

{com}. 
. *Create restricted cubic splines for age
. mkspline age = age, cubic nknots(4)
{txt}
{com}. 
. ***Body Mass Index
. *Recode strange values 
. replace bmi_value = . if bmi_value == 0 
{txt}(13,712 real changes made, 13,712 to missing)

{com}. replace bmi_value = . if !inrange(bmi_value, 10, 80)
{txt}(130 real changes made, 130 to missing)

{com}. 
. *Restrict to within 10 years of EIA diagnosis date and aged>16 
. gen bmi_time = (eia_code_date - bmi_date)/365.25
{txt}(13,712 missing values generated)

{com}. gen bmi_age = age - bmi_time
{txt}(13,712 missing values generated)

{com}. replace bmi_value = . if bmi_age < 16 
{txt}(14,599 real changes made, 14,599 to missing)

{com}. replace bmi_value = . if bmi_time > 10 & bmi_time != . 
{txt}(3,822 real changes made, 3,822 to missing)

{com}. 
. *Set to missing if no date, and vice versa 
. replace bmi_value = . if bmi_date == . 
{txt}(0 real changes made)

{com}. replace bmi_date = . if bmi_value == . 
{txt}(18,551 real changes made, 18,551 to missing)

{com}. replace bmi_time = . if bmi_value == . 
{txt}(18,551 real changes made, 18,551 to missing)

{com}. replace bmi_age = . if bmi_value == . 
{txt}(18,551 real changes made, 18,551 to missing)

{com}. 
. *Create BMI categories
. gen     bmicat = .
{txt}(34,090 missing values generated)

{com}. recode  bmicat . = 1 if bmi_value < 18.5
{txt}(bmicat: 76 changes made)

{com}. recode  bmicat . = 2 if bmi_value < 25
{txt}(bmicat: 200 changes made)

{com}. recode  bmicat . = 3 if bmi_value < 30
{txt}(bmicat: 265 changes made)

{com}. recode  bmicat . = 4 if bmi_value < 35
{txt}(bmicat: 353 changes made)

{com}. recode  bmicat . = 5 if bmi_value < 40
{txt}(bmicat: 368 changes made)

{com}. recode  bmicat . = 6 if bmi_value < .
{txt}(bmicat: 565 changes made)

{com}. replace bmicat = .u if bmi_value >= .
{txt}(32,263 real changes made, 32,263 to missing)

{com}. 
. label define bmicat 1 "Underweight (<18.5)"     ///
>                                         2 "Normal (18.5-24.9)"          ///
>                                         3 "Overweight (25-29.9)"        ///
>                                         4 "Obese I (30-34.9)"           ///
>                                         5 "Obese II (35-39.9)"          ///
>                                         6 "Obese III (40+)"                     ///
>                                         .u "Missing"
{txt}
{com}.                                         
. label values bmicat bmicat
{txt}
{com}. lab var bmicat "BMI"
{txt}
{com}. 
. *Create less granular categorisation
. recode bmicat 1/3 .u = 1 4 = 2 5 = 3 6 = 4, gen(obese4cat)
{txt}(34014 differences between bmicat and obese4cat)

{com}. 
. label define obese4cat  1 "No record of obesity"        ///
>                                                 2 "Obese I (30-34.9)"           ///
>                                                 3 "Obese II (35-39.9)"          ///
>                                                 4 "Obese III (40+)"             
{txt}
{com}. 
. label values obese4cat obese4cat
{txt}
{com}. order obese4cat, after(bmicat)
{txt}
{com}. 
. ***Smoking 
. label define smoke 1 "Never" 2 "Former" 3 "Current" .u "Missing"
{txt}
{com}. 
. gen     smoke = 1  if smoking_status == "N"
{txt}(30,667 missing values generated)

{com}. replace smoke = 2  if smoking_status == "E"
{txt}(1,726 real changes made)

{com}. replace smoke = 3  if smoking_status == "S"
{txt}(10,188 real changes made)

{com}. replace smoke = .u if smoking_status == "M"
{txt}(1,712 real changes made, 1,712 to missing)

{com}. replace smoke = .u if smoking_status == "" 
{txt}(17,041 real changes made, 17,041 to missing)

{com}. 
. label values smoke smoke
{txt}
{com}. lab var smoke "Smoking status"
{txt}
{com}. drop smoking_status
{txt}
{com}. 
. *Create non-missing 3-category variable for current smoking (assumes missing smoking is never smoking)
. recode smoke .u = 1, gen(smoke_nomiss)
{txt}(18753 differences between smoke and smoke_nomiss)

{com}. order smoke_nomiss, after(smoke)
{txt}
{com}. label values smoke_nomiss smoke
{txt}
{com}. 
. **Clinical comorbidities
. ***eGFR
. *Set implausible creatinine values to missing (Note: zero changed to missing)
. replace creatinine_value = . if !inrange(creatinine_value, 20, 3000) 
{txt}(8,578 real changes made, 8,578 to missing)

{com}. 
. *Remove creatinine dates if no measurements, and vice versa 
. replace creatinine_value = . if creatinine_date == . 
{txt}(0 real changes made)

{com}. replace creatinine_date = . if creatinine_value == . 
{txt}(6,863 real changes made, 6,863 to missing)

{com}. replace creatinine = . if creatinine_value == .
{txt}(8,578 real changes made, 8,578 to missing)

{com}. recode creatinine .=0
{txt}(creatinine: 8578 changes made)

{com}. 
. *Divide by 88.4 (to convert umol/l to mg/dl) 
. gen SCr_adj = creatinine_value/88.4
{txt}(8,578 missing values generated)

{com}. 
. gen min = .
{txt}(34,090 missing values generated)

{com}. replace min = SCr_adj/0.7 if male==0
{txt}(13,093 real changes made)

{com}. replace min = SCr_adj/0.9 if male==1
{txt}(12,419 real changes made)

{com}. replace min = min^-0.329  if male==0
{txt}(13,093 real changes made)

{com}. replace min = min^-0.411  if male==1
{txt}(12,419 real changes made)

{com}. replace min = 1 if min<1
{txt}(19,917 real changes made)

{com}. 
. gen max=.
{txt}(34,090 missing values generated)

{com}. replace max=SCr_adj/0.7 if male==0
{txt}(13,093 real changes made)

{com}. replace max=SCr_adj/0.9 if male==1
{txt}(12,419 real changes made)

{com}. replace max=max^-1.209
{txt}(25,512 real changes made)

{com}. replace max=1 if max>1
{txt}(14,173 real changes made)

{com}. 
. gen egfr=min*max*141
{txt}(8,578 missing values generated)

{com}. replace egfr=egfr*(0.993^age)
{txt}(25,512 real changes made)

{com}. replace egfr=egfr*1.018 if male==0
{txt}(13,093 real changes made)

{com}. label var egfr "egfr calculated using CKD-EPI formula with no ethnicity"
{txt}
{com}. 
. *Categorise into ckd stages
. egen egfr_cat_all = cut(egfr), at(0, 15, 30, 45, 60, 5000)
{txt}(8578 missing values generated)

{com}. recode egfr_cat_all 0 = 5 15 = 4 30 = 3 45 = 2 60 = 0, generate(ckd_egfr)
{txt}(25512 differences between egfr_cat_all and ckd_egfr)

{com}. 
. gen egfr_cat = .
{txt}(34,090 missing values generated)

{com}. recode egfr_cat . = 3 if egfr < 30
{txt}(egfr_cat: 5988 changes made)

{com}. recode egfr_cat . = 2 if egfr < 60
{txt}(egfr_cat: 8929 changes made)

{com}. recode egfr_cat . = 1 if egfr < .
{txt}(egfr_cat: 10595 changes made)

{com}. replace egfr_cat = .u if egfr >= .
{txt}(8,578 real changes made, 8,578 to missing)

{com}. 
. label define egfr_cat   1 ">=60"                ///
>                                                 2 "30-59"               ///
>                                                 3 "<30"                 ///
>                                                 .u "Missing"
{txt}
{com}.                                         
. label values egfr_cat egfr_cat
{txt}
{com}. lab var egfr_cat "eGFR"
{txt}
{com}. 
. *If missing eGFR, assume normal
. gen egfr_cat_nomiss = egfr_cat
{txt}(8,578 missing values generated)

{com}. replace egfr_cat_nomiss = 1 if egfr_cat == .u
{txt}(8,578 real changes made)

{com}. 
. label define egfr_cat_nomiss    1 ">=60/missing"        ///
>                                                                 2 "30-59"                       ///
>                                                                 3 "<30" 
{txt}
{com}. label values egfr_cat_nomiss egfr_cat_nomiss
{txt}
{com}. lab var egfr_cat_nomiss "eGFR"
{txt}
{com}. 
. gen egfr_date = creatinine_date
{txt}(8,578 missing values generated)

{com}. format egfr_date %td
{txt}
{com}. 
. *Add in end stage renal failure and create a single CKD variable 
. *Missing assumed to not have CKD 
. gen ckd = 0
{txt}
{com}. replace ckd = 1 if ckd_egfr != . & ckd_egfr >= 1
{txt}(14,917 real changes made)

{com}. replace ckd = 1 if esrf == 1
{txt}(3,870 real changes made)

{com}. 
. label define ckd 0 "No CKD" 1 "CKD"
{txt}
{com}. label values ckd ckd
{txt}
{com}. label var ckd "Chronic kidney disease"
{txt}
{com}. 
. *Create date (most recent measure prior to index)
. gen temp1_ckd_date = creatinine_date if ckd_egfr >=1
{txt}(19,173 missing values generated)

{com}. gen temp2_ckd_date = esrf_date if esrf == 1
{txt}(27,257 missing values generated)

{com}. gen ckd_date = max(temp1_ckd_date,temp2_ckd_date) 
{txt}(15,303 missing values generated)

{com}. format ckd_date %td 
{txt}
{com}. 
. drop temp1_ckd_date temp2_ckd_date SCr_adj min max ckd_egfr egfr_cat_all
{txt}
{com}. 
. ***HbA1c
. *Set zero or negative to missing
. replace hba1c_percentage   = . if hba1c_percentage <= 0
{txt}(1,963 real changes made, 1,963 to missing)

{com}. replace hba1c_mmol_per_mol = . if hba1c_mmol_per_mol <= 0
{txt}(2,419 real changes made, 2,419 to missing)

{com}. 
. *Change implausible values to missing
. replace hba1c_percentage   = . if !inrange(hba1c_percentage, 1, 20)
{txt}(507 real changes made, 507 to missing)

{com}. replace hba1c_mmol_per_mol = . if !inrange(hba1c_mmol_per_mol, 10, 200)
{txt}(1,491 real changes made, 1,491 to missing)

{com}. 
. *Set most recent values of >24 months prior to EIA diagnosis date to missing
. replace hba1c_percentage   = . if (eia_code_date - hba1c_percentage_date) > 24*30 & hba1c_percentage_date != .
{txt}(30,769 real changes made, 30,769 to missing)

{com}. replace hba1c_mmol_per_mol = . if (eia_code_date - hba1c_mmol_per_mol_date) > 24*30 & hba1c_mmol_per_mol_date != .
{txt}(29,321 real changes made, 29,321 to missing)

{com}. 
. *Clean up dates
. replace hba1c_percentage_date = . if hba1c_percentage == .
{txt}(31,491 real changes made, 31,491 to missing)

{com}. replace hba1c_mmol_per_mol_date = . if hba1c_mmol_per_mol == .
{txt}(31,508 real changes made, 31,508 to missing)

{com}. 
. *Express  HbA1c as percentage
. *Express all values as perecentage 
. noi summ hba1c_percentage hba1c_mmol_per_mol 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
hba1c_per~ge {c |}{res}        851    5.119219     1.90048   1.013093   10.88882
{txt}hba1c_mmol~l {c |}{res}        859    43.31088    17.60646   10.04703   112.7664
{txt}
{com}. gen     hba1c_pct = hba1c_percentage 
{txt}(33,239 missing values generated)

{com}. replace hba1c_pct = (hba1c_mmol_per_mol/10.929)+2.15 if hba1c_mmol_per_mol<. 
{txt}(859 real changes made)

{com}. 
. *Valid % range between 0-20  
. replace hba1c_pct = . if !inrange(hba1c_pct, 1, 20) 
{txt}(0 real changes made)

{com}. replace hba1c_pct = round(hba1c_pct, 0.1)
{txt}(1,686 real changes made)

{com}. 
. *Categorise HbA1c and diabetes
. *Group hba1c pct
. gen     hba1ccat = 0 if hba1c_pct <  6.5
{txt}(32,949 missing values generated)

{com}. replace hba1ccat = 1 if hba1c_pct >= 6.5  & hba1c_pct < 7.5
{txt}(278 real changes made)

{com}. replace hba1ccat = 2 if hba1c_pct >= 7.5  & hba1c_pct < 8
{txt}(92 real changes made)

{com}. replace hba1ccat = 3 if hba1c_pct >= 8    & hba1c_pct < 9
{txt}(113 real changes made)

{com}. replace hba1ccat = 4 if hba1c_pct >= 9    & hba1c_pct !=.
{txt}(62 real changes made)

{com}. label define hba1ccat 0 "<6.5%" 1">=6.5-7.4" 2">=7.5-7.9" 3">=8-8.9" 4">=9"
{txt}
{com}. label values hba1ccat hba1ccat
{txt}
{com}. 
. *Express all values as mmol
. gen hba1c_mmol = hba1c_mmol_per_mol
{txt}(33,231 missing values generated)

{com}. replace hba1c_mmol = (hba1c_percentage*10.929)-23.5 if hba1c_percentage<. & hba1c_mmol==.
{txt}(827 real changes made)

{com}. 
. *Group hba1c mmol
. gen     hba1ccatmm = 0 if hba1c_mmol < 58
{txt}(32,669 missing values generated)

{com}. replace hba1ccatmm = 1 if hba1c_mmol >= 58 & hba1c_pct !=.
{txt}(265 real changes made)

{com}. replace hba1ccatmm =.u if hba1ccatmm==. 
{txt}(32,404 real changes made, 32,404 to missing)

{com}. label define hba1ccatmm 0 "HbA1c <58mmol/mol" 1 "HbA1c >=58mmol/mol" .u "Missing"
{txt}
{com}. label values hba1ccatmm hba1ccatmm
{txt}
{com}. lab var hba1ccatmm "HbA1c"
{txt}
{com}. 
. *Create diabetes, split by control/not (assumes missing = no diabetes)
. gen     diabcat = 1 if diabetes==0
{txt}(6,876 missing values generated)

{com}. replace diabcat = 2 if diabetes==1 & inlist(hba1ccat, 0, 1)
{txt}(281 real changes made)

{com}. replace diabcat = 3 if diabetes==1 & inlist(hba1ccat, 2, 3, 4)
{txt}(61 real changes made)

{com}. replace diabcat = 4 if diabetes==1 & !inlist(hba1ccat, 0, 1, 2, 3, 4)
{txt}(6,534 real changes made)

{com}. 
. label define diabcat    1 "No diabetes"                         ///
>                                                 2 "Controlled diabetes"         ///
>                                                 3 "Uncontrolled diabetes"       ///
>                                                 4 "Diabetes, no hba1c measure"
{txt}
{com}. label values diabcat diabcat
{txt}
{com}. 
. *Create cancer variable 'other cancer currently', includes carcinoma of the head and neck - need to confirm if this excludes NMSC
. gen cancer =0
{txt}
{com}. replace cancer =1 if lung_cancer ==1 | haem_cancer ==1 | other_cancer ==1
{txt}(16,618 real changes made)

{com}. lab var cancer "Cancer"
{txt}
{com}. 
. *Create other comorbid variables
. gen combined_cv_comorbid =1 if chronic_cardiac_disease ==1 | stroke==1
{txt}(21,841 missing values generated)

{com}. recode combined_cv_comorbid .=0
{txt}(combined_cv_comorbid: 21841 changes made)

{com}. 
. *Delete unneeded variables
. drop hba1c_pct hba1c_percentage hba1c_mmol_per_mol
{txt}
{com}. 
. *Label variables
. lab var hypertension "Hypertension"
{txt}
{com}. lab var diabetes "Diabetes"
{txt}
{com}. lab var stroke "Stroke"
{txt}
{com}. lab var chronic_resp_disease "Chronic respiratory disease"
{txt}
{com}. lab var copd "COPD"
{txt}
{com}. lab var esrf "End-stage renal failure"
{txt}
{com}. lab var chronic_liver_disease "Chronic liver disease"
{txt}
{com}. lab var chronic_cardiac_disease "Chronic cardiac disease"
{txt}
{com}. 
. save "$projectdir/output/data/file_eia_all.dta", replace        
{txt}(note: file /workspace/output/data/file_eia_all.dta not found)
{err}{p 0 4 2}
file /workspace/output/data/file_eia_all.dta
could not be opened
{p_end}
{txt}{search r(603), local:r(603);}

end of do-file
{search r(603), local:r(603);}

end of do-file

{search r(603), local:r(603);}


{com}. 