-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/cleaning_dataset.log
  log type:  text
 opened on:  11 Apr 2022, 21:03:10

. 
. di "$projectdir"
/workspace

. di "$logdir"
/workspace/logs

. 
. import delimited "$projectdir/output/input.csv", clear
(64 vars, 100,000 obs)

. 
. **Set Ado file path
. adopath + "$projectdir/analysis/extra_ados"
  [1]  (BASE)      "/usr/local/stata/ado/base/"
  [2]  (SITE)      "/usr/local/ado/"
  [3]              "."
  [4]  (PERSONAL)  "~/ado/personal/"
  [5]  (PLUS)      "~/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "/workspace/analysis/extra_ados"

. 
. **Set index dates ===========================================================
> */
. global year_preceding = "01/03/2018"

. global start_date = "01/03/2019"

. global outpatient_date = "01/10/2019"

. global end_date = "01/03/2022"

. 
. **Rename variables (some are too long for Stata to handle) ==================
> =====================*/
. rename chronic_respiratory_disease chronic_resp_disease

. 
. **Convert date strings to dates =============================================
> =======*/
. ***Some dates are given with month/year only, so adding day 15 to enable them
>  to be processed as dates 
. 
. foreach var of varlist   hba1c_mmol_per_mol_date                        ///
>                                                  hba1c_percentage_date       
>                    ///
>                                                  creatinine_date             
>                    ///
>                                                  bmi_date_measured           
>                ///
>                                                  abatacept                   
>                                    ///
>                                                  adalimumab                  
>                                    ///     
>                                                  baricitinib                 
>                            ///
>                                                  certolizumab                
>                            ///
>                                                  etanercept                  
>                                    ///
>                                                  golimumab                   
>                                    ///
>                                                  guselkumab                  
>                                    ///     
>                                                  infliximab                  
>                                    ///
>                                                  ixekizumab                  
>                                    ///
>                                                  methotrexate_hcd            
>                            ///
>                                                  rituximab                   
>                                    ///
>                                                  sarilumab                   
>                                    ///
>                                                  secukinumab                 
>                            ///     
>                                                  tocilizumab                 
>                            ///
>                                                  tofacitinib                 
>                            ///
>                                                  upadacitinib                
>                            ///
>                                                  ustekinumab                 
>                            ///
>                                                  {
  2.                                                         
.                 capture confirm string variable `var'
  3.                 if _rc!=0 {
  4.                         assert `var'==.
  5.                         rename `var' `var'_date
  6.                 }
  7.         
.                 else {
  8.                                 replace `var' = `var' + "-15"
  9.                                 rename `var' `var'_dstr
 10.                                 replace `var'_dstr = " " if `var'_dstr == 
> "-15"
 11.                                 gen `var'_date = date(`var'_dstr, "YMD") 
 12.                                 order `var'_date, after(`var'_dstr)
 13.                                 drop `var'_dstr
 14.                 }
 15.         
.         format `var'_date %td
 16. }
variable hba1c_mmol_per_mol_date was str7 now str10
(100,000 real changes made)
(5,000 real changes made)
(5,000 missing values generated)
variable hba1c_percentage_date was str7 now str10
(100,000 real changes made)
(5,000 real changes made)
(5,000 missing values generated)
variable creatinine_date was str7 now str10
(100,000 real changes made)
(5,000 real changes made)
(5,000 missing values generated)
variable bmi_date_measured was str7 now str10
(100,000 real changes made)
(40,000 real changes made)
(40,000 missing values generated)
variable abatacept was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable adalimumab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable baricitinib was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable certolizumab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable etanercept was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable golimumab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable guselkumab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable infliximab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable ixekizumab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable methotrexate_hcd was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable rituximab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable sarilumab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable secukinumab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable tocilizumab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable tofacitinib was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable upadacitinib was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable ustekinumab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)

. 
. **Conversion for dates with day already included ============================
> ========================*/
. 
. foreach var of varlist   died_date_ons                                       
>    ///
>                                              eia_code_date                   
>                            ///
>                                                  rheum_appt_date             
>                            ///
>                                              ra_code_date                    
>                            ///
>                                                  psa_code_date               
>                            ///
>                                                  anksp_code_date             
>                            ///
>                                                  last_gp_prerheum_date       
>                    ///
>                                                  last_gp_precode_date        
>                    ///     
>                                                  last_gp_refrheum_date       
>                    ///
>                                                  last_gp_refcode_date        
>                    ///
>                                                  referral_rheum_prerheum     
>                    ///
>                                                  referral_rheum_precode      
>                    ///     
>                                                  chronic_cardiac_disease     
>                    ///
>                                                  diabetes                    
>                                    ///
>                                                  hypertension                
>                            ///     
>                                                  chronic_resp_disease        
>                    ///
>                                                  copd                        
>                                    ///
>                                                  chronic_liver_disease       
>                    ///
>                                                  stroke                      
>                                    ///
>                                                  lung_cancer                 
>                            ///
>                                                  haem_cancer                 
>                            ///
>                                                  other_cancer                
>                            ///
>                                                  esrf                        
>                                    ///
>                                                  organ_transplant            
>                            ///
>                                                  hydroxychloroquine          
>                            ///
>                                                  leflunomide                 
>                            ///
>                                                  methotrexate                
>                            ///
>                                                  methotrexate_inj            
>                            ///
>                                                  sulfasalazine               
>                            ///
>                                                  {
  2.                                                                  
.                 capture confirm string variable `var'
  3.                 if _rc!=0 {
  4.                         assert `var'==.
  5.                         rename `var' `var'_date
  6.                 }
  7.         
.                 else {
  8.                                 rename `var' `var'_dstr
  9.                                 gen `var'_date = date(`var'_dstr, "YMD") 
 10.                                 order `var'_date, after(`var'_dstr)
 11.                                 drop `var'_dstr
 12.                                 gen `var'_date15 = `var'_date+15
 13.                                 order `var'_date15, after(`var'_date)
 14.                                 drop `var'_date
 15.                                 rename `var'_date15 `var'_date
 16.                 }
 17.         
.         format `var'_date %td
 18. }
(90,000 missing values generated)
(90,000 missing values generated)
(1,000 missing values generated)
(1,000 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(1,000 missing values generated)
(1,000 missing values generated)
(1,000 missing values generated)
(1,000 missing values generated)
(1,000 missing values generated)
(1,000 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(90,000 missing values generated)
(90,000 missing values generated)
(90,000 missing values generated)
(90,000 missing values generated)
(90,000 missing values generated)
(90,000 missing values generated)
(90,000 missing values generated)
(90,000 missing values generated)
(90,000 missing values generated)
(90,000 missing values generated)

.                                                  
. **Rename variables with extra 'date' added to the end of variable names======
> =====================================================*/ 
. rename rheum_appt_date_date rheum_appt_date

. rename eia_code_date_date eia_code_date

. rename ra_code_date_date ra_code_date

. rename psa_code_date_date psa_code_date

. rename anksp_code_date_date anksp_code_date

. rename died_date_ons_date died_ons_date

. rename last_gp_prerheum_date_date last_gp_prerheum_date

. rename last_gp_refrheum_date_date last_gp_refrheum_date

. rename last_gp_refcode_date_date last_gp_refcode_date

. rename last_gp_precode_date_date last_gp_precode_date

. rename hba1c_mmol_per_mol_date_date hba1c_mmol_per_mol_date

. rename hba1c_percentage_date_date hba1c_percentage_date

. rename creatinine_date_date creatinine_date

. rename creatinine creatinine_value 

. rename bmi_date_measured_date bmi_date

. rename bmi bmi_value

. 
. **Create binary indicator variables for relevant conditions =================
> ===================================*/
. 
. foreach var of varlist   eia_code_date                                       
>    ///
>                                                  rheum_appt_date             
>                            ///
>                                              ra_code_date                    
>                            ///
>                                                  psa_code_date               
>                            ///
>                                                  anksp_code_date             
>                            ///
>                                                  died_ons_date               
>                            ///
>                                                  last_gp_prerheum_date       
>                    ///
>                                                  last_gp_precode_date        
>                    ///     
>                                                  last_gp_refrheum_date       
>                    ///
>                                                  last_gp_refcode_date        
>                    ///
>                                                  referral_rheum_prerheum_date
>            ///
>                                                  referral_rheum_precode_date 
>            ///     
>                                                  chronic_cardiac_disease_date
>            ///
>                                                  diabetes_date               
>                            ///
>                                                  hypertension_date           
>                            ///
>                                                  chronic_resp_disease_date   
>                    ///
>                                                  copd_date                   
>                                    ///
>                                                  chronic_liver_disease_date  
>                    ///
>                                                  stroke_date                 
>                            ///
>                                                  lung_cancer_date            
>                            ///
>                                                  haem_cancer_date            
>                            ///             
>                                                  other_cancer_date           
>                            ///
>                                                  esrf_date                   
>                                    ///
>                                                  creatinine_date             
>                            ///
>                                                  organ_transplant_date       
>                    ///
>                                                  hydroxychloroquine_date     
>                    ///     
>                                                  leflunomide_date            
>                            ///
>                                                  methotrexate_date           
>                            ///
>                                                  methotrexate_inj_date       
>                    ///             
>                                                  sulfasalazine_date          
>                            ///
>                                                  abatacept_date              
>                            ///
>                                                  adalimumab_date             
>                            ///
>                                                  baricitinib_date            
>                            ///
>                                                  certolizumab_date           
>                            ///
>                                                  etanercept_date             
>                            ///
>                                                  golimumab_date              
>                            ///
>                                                  guselkumab_date             
>                            ///
>                                                  infliximab_date             
>                            ///
>                                                  ixekizumab_date             
>                            ///
>                                                  methotrexate_hcd_date       
>                    ///
>                                                  rituximab_date              
>                            ///             
>                                                  sarilumab_date              
>                            ///
>                                                  secukinumab_date            
>                            ///
>                                                  tocilizumab_date            
>                            ///             
>                                                  tofacitinib_date            
>                            ///
>                                                  upadacitinib_date           
>                            ///
>                                                  ustekinumab_date   {        
>                    
  2.         /*date ranges are applied in python, so presence of date indicates
>  presence of 
>           disease in the correct time frame*/ 
.         local newvar =  substr("`var'", 1, length("`var'") - 5)
  3.         gen `newvar' = (`var'!=. )
  4.         order `newvar', after(`var')
  5. }

. 
. **Create and label variables ================================================
> ===========*/
. 
. **Demographics
. ***Sex
. gen male = 1 if sex == "M"
(51,137 missing values generated)

. replace male = 0 if sex == "F"
(51,137 real changes made)

. lab var male "Male"

. lab define male 0 "No" 1 "Yes", modify

. lab val male male

. tab male, missing

       Male |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |     51,137       51.14       51.14
        Yes |     48,863       48.86      100.00
------------+-----------------------------------
      Total |    100,000      100.00

. 
. ***Ethnicity
. replace ethnicity = .u if ethnicity == .
(25,000 real changes made, 25,000 to missing)

. ****rearrange in order of prevalence
. recode ethnicity 2=6 /* mixed to 6 */
(ethnicity: 14952 changes made)

. recode ethnicity 3=2 /* south asian to 2 */
(ethnicity: 7503 changes made)

. recode ethnicity 4=3 /* black to 3 */
(ethnicity: 7441 changes made)

. recode ethnicity 6=4 /* mixed to 4 */
(ethnicity: 14952 changes made)

. recode ethnicity 5=4 /* other to 4 */
(ethnicity: 7451 changes made)

. 
. label define ethnicity  1 "White"                                       ///
>                                                 2 "Asian/Asian British"      
>    ///
>                                                 3 "Black"                    
>                    ///
>                                                 4 "Mixed/Other"              
>            ///
>                                                 .u "Missing"

. label values ethnicity ethnicity

. lab var ethnicity "Ethnicity"

. tab ethnicity, missing

          Ethnicity |      Freq.     Percent        Cum.
--------------------+-----------------------------------
              White |     37,653       37.65       37.65
Asian/Asian British |      7,503        7.50       45.16
              Black |      7,441        7.44       52.60
        Mixed/Other |     22,403       22.40       75.00
            Missing |     25,000       25.00      100.00
--------------------+-----------------------------------
              Total |    100,000      100.00

. 
. ***STP 
. rename stp stp_old

. bysort stp_old: gen stp = 1 if _n==1
(99,998 missing values generated)

. replace stp = sum(stp) //
(99,999 real changes made)

. drop stp_old

. 
. ***Regions
. encode region, gen(nuts_region)

. tab region, missing

                  region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
                         |      1,000        1.00        1.00
           East Midlands |      9,894        9.89       10.89
         East of England |      9,868        9.87       20.76
                  London |     19,850       19.85       40.61
              North East |      9,874        9.87       50.49
              North West |      9,907        9.91       60.39
              South East |     19,820       19.82       80.21
           West Midlands |      9,924        9.92       90.14
Yorkshire and the Humber |      9,863        9.86      100.00
-------------------------+-----------------------------------
                   Total |    100,000      100.00

. replace region="Missing" if region==""
(1,000 real changes made)

. 
. ***IMD
. *Reverse the order (so high is more deprived)
. recode imd 5 = 1 4 = 2 3 = 3 2 = 4 1 = 5 0 = .u
(imd: 81093 changes made)

. label define imd 1 "1 least deprived" 2 "2" 3 "3" 4 "4" 5 "5 most deprived" .
> u "Missing"

. label values imd imd 

. lab var imd "Index of multiple deprivation"

. tab imd, missing

        Index of |
        multiple |
     deprivation |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |     19,043       19.04       19.04
               2 |     18,847       18.85       37.89
               3 |     18,907       18.91       56.80
               4 |     19,156       19.16       75.95
 5 most deprived |     19,010       19.01       94.96
         Missing |      5,037        5.04      100.00
-----------------+-----------------------------------
           Total |    100,000      100.00

. 
. ***Age variables
. *Nb. works if ages 18 and over
. *Create categorised age
. drop if age<18 & age !=.
(21,307 observations deleted)

. drop if age>109 & age !=.
(0 observations deleted)

. drop if age==.
(0 observations deleted)

. lab var age "Age"

. 
. recode age 18/39.9999 = 1 /// 
>            40/49.9999 = 2 ///
>                    50/59.9999 = 3 ///
>                60/69.9999 = 4 ///
>                    70/79.9999 = 5 ///
>                    80/max = 6, gen(agegroup) 
(78693 differences between age and agegroup)

. 
. label define agegroup   1 "18-39" ///
>                                                 2 "40-49" ///
>                                                 3 "50-59" ///
>                                                 4 "60-69" ///
>                                                 5 "70-79" ///
>                                                 6 "80+"

.                                                 
. label values agegroup agegroup

. lab var agegroup "Age group"

. tab agegroup, missing

  Age group |      Freq.     Percent        Cum.
------------+-----------------------------------
      18-39 |     28,398       36.09       36.09
      40-49 |     12,868       16.35       52.44
      50-59 |     13,403       17.03       69.47
      60-69 |     10,608       13.48       82.95
      70-79 |      8,406       10.68       93.63
        80+ |      5,010        6.37      100.00
------------+-----------------------------------
      Total |     78,693      100.00

. 
. *Create binary age
. recode age min/69.999 = 0 ///
>            70/max = 1, gen(age70)
(78693 differences between age and age70)

. 
. ***Body Mass Index
. *Recode strange values 
. replace bmi_value = . if bmi_value == 0 
(31,486 real changes made, 31,486 to missing)

. replace bmi_value = . if !inrange(bmi_value, 10, 80)
(314 real changes made, 314 to missing)

. 
. *Restrict to within 10 years of EIA diagnosis date and aged>16 
. gen bmi_time = (eia_code_date - bmi_date)/365.25
(31,979 missing values generated)

. gen bmi_age = age - bmi_time
(31,979 missing values generated)

. replace bmi_value = . if bmi_age < 16 
(33,169 real changes made, 33,169 to missing)

. replace bmi_value = . if bmi_time > 10 & bmi_time != . 
(8,910 real changes made, 8,910 to missing)

. 
. *Set to missing if no date, and vice versa 
. replace bmi_value = . if bmi_date == . 
(0 real changes made)

. replace bmi_date = . if bmi_value == . 
(42,393 real changes made, 42,393 to missing)

. replace bmi_time = . if bmi_value == . 
(42,386 real changes made, 42,386 to missing)

. replace bmi_age = . if bmi_value == . 
(42,386 real changes made, 42,386 to missing)

. 
. *Create BMI categories
. gen     bmicat = .
(78,693 missing values generated)

. recode  bmicat . = 1 if bmi_value < 18.5
(bmicat: 225 changes made)

. recode  bmicat . = 2 if bmi_value < 25
(bmicat: 537 changes made)

. recode  bmicat . = 3 if bmi_value < 30
(bmicat: 719 changes made)

. recode  bmicat . = 4 if bmi_value < 35
(bmicat: 922 changes made)

. recode  bmicat . = 5 if bmi_value < 40
(bmicat: 911 changes made)

. recode  bmicat . = 6 if bmi_value < .
(bmicat: 1500 changes made)

. replace bmicat = .u if bmi_value >= .
(73,879 real changes made, 73,879 to missing)

. 
. label define bmicat 1 "Underweight (<18.5)"     ///
>                                         2 "Normal (18.5-24.9)"          ///
>                                         3 "Overweight (25-29.9)"        ///
>                                         4 "Obese I (30-34.9)"           ///
>                                         5 "Obese II (35-39.9)"          ///
>                                         6 "Obese III (40+)"                  
>    ///
>                                         .u "Missing"

.                                         
. label values bmicat bmicat

. lab var bmicat "BMI"

. tab bmicat, missing

                 BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |        225        0.29        0.29
  Normal (18.5-24.9) |        537        0.68        0.97
Overweight (25-29.9) |        719        0.91        1.88
   Obese I (30-34.9) |        922        1.17        3.05
  Obese II (35-39.9) |        911        1.16        4.21
     Obese III (40+) |      1,500        1.91        6.12
             Missing |     73,879       93.88      100.00
---------------------+-----------------------------------
               Total |     78,693      100.00

. 
. *Create less granular categorisation
. recode bmicat 1/3 .u = 1 4 = 2 5 = 3 6 = 4, gen(obese4cat)
(78468 differences between bmicat and obese4cat)

. 
. label define obese4cat  1 "No record of obesity"        ///
>                                                 2 "Obese I (30-34.9)"        
>    ///
>                                                 3 "Obese II (35-39.9)"       
>    ///
>                                                 4 "Obese III (40+)"          
>    

. 
. label values obese4cat obese4cat

. order obese4cat, after(bmicat)

. 
. ***Smoking 
. label define smoke 1 "Never" 2 "Former" 3 "Current" .u "Missing"

. 
. gen     smoke = 1  if smoking_status == "N"
(70,871 missing values generated)

. replace smoke = 2  if smoking_status == "E"
(3,875 real changes made)

. replace smoke = 3  if smoking_status == "S"
(23,654 real changes made)

. replace smoke = .u if smoking_status == "M"
(3,895 real changes made, 3,895 to missing)

. replace smoke = .u if smoking_status == "" 
(39,447 real changes made, 39,447 to missing)

. 
. label values smoke smoke

. lab var smoke "Smoking status"

. drop smoking_status

. tab smoke, missing

    Smoking |
     status |      Freq.     Percent        Cum.
------------+-----------------------------------
      Never |      7,822        9.94        9.94
     Former |      3,875        4.92       14.86
    Current |     23,654       30.06       44.92
    Missing |     43,342       55.08      100.00
------------+-----------------------------------
      Total |     78,693      100.00

. 
. *Create non-missing 3-category variable for current smoking (assumes missing 
> smoking is never smoking)
. recode smoke .u = 1, gen(smoke_nomiss)
(43342 differences between smoke and smoke_nomiss)

. order smoke_nomiss, after(smoke)

. label values smoke_nomiss smoke

. 
. **Clinical comorbidities
. ***eGFR
. *Set implausible creatinine values to missing (Note: zero changed to missing)
. replace creatinine_value = . if !inrange(creatinine_value, 20, 3000) 
(19,777 real changes made, 19,777 to missing)

. 
. *Remove creatinine dates if no measurements, and vice versa 
. replace creatinine_value = . if creatinine_date == . 
(0 real changes made)

. replace creatinine_date = . if creatinine_value == . 
(15,887 real changes made, 15,887 to missing)

. replace creatinine = . if creatinine_value == .
(19,777 real changes made, 19,777 to missing)

. recode creatinine .=0
(creatinine: 19777 changes made)

. tab creatinine, missing

 creatinine |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     19,777       25.13       25.13
          1 |     58,916       74.87      100.00
------------+-----------------------------------
      Total |     78,693      100.00

. 
. *Divide by 88.4 (to convert umol/l to mg/dl) 
. gen SCr_adj = creatinine_value/88.4
(19,777 missing values generated)

. 
. gen min = .
(78,693 missing values generated)

. replace min = SCr_adj/0.7 if male==0
(30,178 real changes made)

. replace min = SCr_adj/0.9 if male==1
(28,738 real changes made)

. replace min = min^-0.329  if male==0
(30,178 real changes made)

. replace min = min^-0.411  if male==1
(28,738 real changes made)

. replace min = 1 if min<1
(46,078 real changes made)

. 
. gen max=.
(78,693 missing values generated)

. replace max=SCr_adj/0.7 if male==0
(30,178 real changes made)

. replace max=SCr_adj/0.9 if male==1
(28,738 real changes made)

. replace max=max^-1.209
(58,916 real changes made)

. replace max=1 if max>1
(32,615 real changes made)

. 
. gen egfr=min*max*141
(19,777 missing values generated)

. replace egfr=egfr*(0.993^age)
(58,916 real changes made)

. replace egfr=egfr*1.018 if male==0
(30,178 real changes made)

. label var egfr "egfr calculated using CKD-EPI formula with no ethnicity"

. 
. *Categorise into ckd stages
. egen egfr_cat_all = cut(egfr), at(0, 15, 30, 45, 60, 5000)
(19777 missing values generated)

. recode egfr_cat_all 0 = 5 15 = 4 30 = 3 45 = 2 60 = 0, generate(ckd_egfr)
(58916 differences between egfr_cat_all and ckd_egfr)

. 
. gen egfr_cat = .
(78,693 missing values generated)

. recode egfr_cat . = 3 if egfr < 30
(egfr_cat: 14013 changes made)

. recode egfr_cat . = 2 if egfr < 60
(egfr_cat: 20728 changes made)

. recode egfr_cat . = 1 if egfr < .
(egfr_cat: 24175 changes made)

. replace egfr_cat = .u if egfr >= .
(19,777 real changes made, 19,777 to missing)

. 
. label define egfr_cat   1 ">=60"                ///
>                                                 2 "30-59"               ///
>                                                 3 "<30"                 ///
>                                                 .u "Missing"

.                                         
. label values egfr_cat egfr_cat

. lab var egfr_cat "eGFR"

. tab egfr_cat, missing

       eGFR |      Freq.     Percent        Cum.
------------+-----------------------------------
       >=60 |     24,175       30.72       30.72
      30-59 |     20,728       26.34       57.06
        <30 |     14,013       17.81       74.87
    Missing |     19,777       25.13      100.00
------------+-----------------------------------
      Total |     78,693      100.00

. 
. *If missing eGFR, assume normal
. gen egfr_cat_nomiss = egfr_cat
(19,777 missing values generated)

. replace egfr_cat_nomiss = 1 if egfr_cat == .u
(19,777 real changes made)

. 
. label define egfr_cat_nomiss    1 ">=60/missing"        ///
>                                                                 2 "30-59"    
>                    ///
>                                                                 3 "<30" 

. label values egfr_cat_nomiss egfr_cat_nomiss

. lab var egfr_cat_nomiss "eGFR"

. tab egfr_cat_nomiss, missing

        eGFR |      Freq.     Percent        Cum.
-------------+-----------------------------------
>=60/missing |     43,952       55.85       55.85
       30-59 |     20,728       26.34       82.19
         <30 |     14,013       17.81      100.00
-------------+-----------------------------------
       Total |     78,693      100.00

. 
. gen egfr_date = creatinine_date
(19,777 missing values generated)

. format egfr_date %td

. 
. *Add in end stage renal failure and create a single CKD variable 
. *Missing assumed to not have CKD 
. gen ckd = 0

. replace ckd = 1 if ckd_egfr != . & ckd_egfr >= 1
(34,741 real changes made)

. replace ckd = 1 if esrf == 1
(8,812 real changes made)

. 
. label define ckd 0 "No CKD" 1 "CKD"

. label values ckd ckd

. label var ckd "Chronic kidney disease"

. tab ckd, missing

    Chronic |
     kidney |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
     No CKD |     35,140       44.65       44.65
        CKD |     43,553       55.35      100.00
------------+-----------------------------------
      Total |     78,693      100.00

. 
. *Create date (most recent measure prior to index)
. gen temp1_ckd_date = creatinine_date if ckd_egfr >=1
(43,952 missing values generated)

. gen temp2_ckd_date = esrf_date if esrf == 1
(63,007 missing values generated)

. gen ckd_date = max(temp1_ckd_date,temp2_ckd_date) 
(35,140 missing values generated)

. format ckd_date %td 

. 
. drop temp1_ckd_date temp2_ckd_date SCr_adj min max ckd_egfr egfr_cat_all

. 
. ***HbA1c
. *Set zero or negative to missing
. replace hba1c_percentage   = . if hba1c_percentage <= 0
(4,351 real changes made, 4,351 to missing)

. replace hba1c_mmol_per_mol = . if hba1c_mmol_per_mol <= 0
(5,578 real changes made, 5,578 to missing)

. 
. *Change implausible values to missing
. replace hba1c_percentage   = . if !inrange(hba1c_percentage, 1, 20)
(1,186 real changes made, 1,186 to missing)

. replace hba1c_mmol_per_mol = . if !inrange(hba1c_mmol_per_mol, 10, 200)
(3,268 real changes made, 3,268 to missing)

. 
. *Set most recent values of >24 months prior to EIA diagnosis date to missing
. replace hba1c_percentage   = . if (eia_code_date - hba1c_percentage_date) > 2
> 4*30 & hba1c_percentage_date != .
(70,875 real changes made, 70,875 to missing)

. replace hba1c_mmol_per_mol = . if (eia_code_date - hba1c_mmol_per_mol_date) >
>  24*30 & hba1c_mmol_per_mol_date != .
(67,537 real changes made, 67,537 to missing)

. 
. *Clean up dates
. replace hba1c_percentage_date = . if hba1c_percentage == .
(72,514 real changes made, 72,514 to missing)

. replace hba1c_mmol_per_mol_date = . if hba1c_mmol_per_mol == .
(72,449 real changes made, 72,449 to missing)

. 
. *Express  HbA1c as percentage
. *Express all values as perecentage 
. noi summ hba1c_percentage hba1c_mmol_per_mol 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hba1c_per~ge |      2,281    5.133888    1.877551   1.005783   12.70569
hba1c_mmol~l |      2,310    42.87144    17.85806   10.10241   104.0887

. gen     hba1c_pct = hba1c_percentage 
(76,412 missing values generated)

. replace hba1c_pct = (hba1c_mmol_per_mol/10.929)+2.15 if hba1c_mmol_per_mol<. 
(2,310 real changes made)

. 
. *Valid % range between 0-20  
. replace hba1c_pct = . if !inrange(hba1c_pct, 1, 20) 
(0 real changes made)

. replace hba1c_pct = round(hba1c_pct, 0.1)
(4,525 real changes made)

. 
. *Categorise HbA1c and diabetes
. *Group hba1c pct
. gen     hba1ccat = 0 if hba1c_pct <  6.5
(75,642 missing values generated)

. replace hba1ccat = 1 if hba1c_pct >= 6.5  & hba1c_pct < 7.5
(757 real changes made)

. replace hba1ccat = 2 if hba1c_pct >= 7.5  & hba1c_pct < 8
(256 real changes made)

. replace hba1ccat = 3 if hba1c_pct >= 8    & hba1c_pct < 9
(302 real changes made)

. replace hba1ccat = 4 if hba1c_pct >= 9    & hba1c_pct !=.
(159 real changes made)

. label define hba1ccat 0 "<6.5%" 1">=6.5-7.4" 2">=7.5-7.9" 3">=8-8.9" 4">=9"

. label values hba1ccat hba1ccat

. tab hba1ccat, missing

   hba1ccat |      Freq.     Percent        Cum.
------------+-----------------------------------
      <6.5% |      3,051        3.88        3.88
  >=6.5-7.4 |        757        0.96        4.84
  >=7.5-7.9 |        256        0.33        5.16
    >=8-8.9 |        302        0.38        5.55
        >=9 |        159        0.20        5.75
          . |     74,168       94.25      100.00
------------+-----------------------------------
      Total |     78,693      100.00

. 
. *Express all values as mmol
. gen hba1c_mmol = hba1c_mmol_per_mol
(76,383 missing values generated)

. replace hba1c_mmol = (hba1c_percentage*10.929)-23.5 if hba1c_percentage<. & h
> ba1c_mmol==.
(2,215 real changes made)

. 
. *Group hba1c mmol
. gen     hba1ccatmm = 0 if hba1c_mmol < 58
(74,879 missing values generated)

. replace hba1ccatmm = 1 if hba1c_mmol >= 58 & hba1c_mmol !=.
(711 real changes made)

. replace hba1ccatmm =.u if hba1ccatmm==. 
(74,168 real changes made, 74,168 to missing)

. label define hba1ccatmm 0 "HbA1c <58mmol/mol" 1 "HbA1c >=58mmol/mol" .u "Miss
> ing"

. label values hba1ccatmm hba1ccatmm

. lab var hba1ccatmm "HbA1c"

. tab hba1ccatmm, missing

             HbA1c |      Freq.     Percent        Cum.
-------------------+-----------------------------------
 HbA1c <58mmol/mol |      3,814        4.85        4.85
HbA1c >=58mmol/mol |        711        0.90        5.75
           Missing |     74,168       94.25      100.00
-------------------+-----------------------------------
             Total |     78,693      100.00

. 
. *Create diabetes, split by control/not (assumes missing = no diabetes)
. gen     diabcatm = 1 if diabetes==0
(15,667 missing values generated)

. replace diabcatm = 2 if diabetes==1 & hba1ccatmm==0
(772 real changes made)

. replace diabcatm = 3 if diabetes==1 & hba1ccatmm==1
(148 real changes made)

. replace diabcatm = 4 if diabetes==1 & hba1ccatmm==.u
(14,747 real changes made)

. 
. label define diabcatm   1 "No diabetes"                         ///
>                                                 2 "Diabetes with HbA1c <58mmo
> l/mol"             ///
>                                                 3 "Diabetes with HbA1c >58mmo
> l/mol"     ///
>                                                 4 "Diabetes with no HbA1c mea
> sure"

. label values diabcatm diabcatm

. lab var diabcatm "Diabetes"

. 
. *Create cancer variable 'other cancer currently', includes carcinoma of the h
> ead and neck - need to confirm if this excludes NMSC
. gen cancer =0

. replace cancer =1 if lung_cancer ==1 | haem_cancer ==1 | other_cancer ==1
(38,463 real changes made)

. lab var cancer "Cancer"

. tab cancer, missing

     Cancer |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     40,230       51.12       51.12
          1 |     38,463       48.88      100.00
------------+-----------------------------------
      Total |     78,693      100.00

. 
. *Create other comorbid variables
. gen combined_cv_comorbid =1 if chronic_cardiac_disease ==1 | stroke==1
(50,313 missing values generated)

. recode combined_cv_comorbid .=0
(combined_cv_comorbid: 50313 changes made)

. 
. *Label variables
. lab var hypertension "Hypertension"

. lab var diabetes "Diabetes"

. lab var stroke "Stroke"

. lab var chronic_resp_disease "Chronic respiratory disease"

. lab var copd "COPD"

. lab var esrf "End-stage renal failure"

. lab var chronic_liver_disease "Chronic liver disease"

. lab var chronic_cardiac_disease "Chronic cardiac disease"

. 
. drop age

. 
. *Refine diagnostic window====================================================
> =========*/
. 
. **All patients should have EIA code
. tab eia_code, missing

   eia_code |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        794        1.01        1.01
          1 |     77,899       98.99      100.00
------------+-----------------------------------
      Total |     78,693      100.00

. keep if eia_code==1
(794 observations deleted)

. 
. **Keep patients with first EIA code in GP record if code was after 1st March 
> 2019
. keep if eia_code_date>=date("$start_date", "DMY") & eia_code_date!=. 
(18,025 observations deleted)

. tab eia_code, missing

   eia_code |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     59,874      100.00      100.00
------------+-----------------------------------
      Total |     59,874      100.00

. keep if eia_code_date<=date("$end_date", "DMY") & eia_code_date!=. 
(2,952 observations deleted)

. tab eia_code, missing

   eia_code |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     56,922      100.00      100.00
------------+-----------------------------------
      Total |     56,922      100.00

. 
. **Month/Year of EIA code
. gen year_diag=year(eia_code_date)

. format year_diag %ty

. gen month_diag=month(eia_code_date)

. gen mo_year_diagn=ym(year_diag, month_diag)

. format mo_year_diagn %tm

. generate str16 mo_year_diagn_s = strofreal(mo_year_diagn,"%tmCCYY!mNN")

. 
. *Include only most recent EIA sub-diagnosis==================================
> ===========*/
. 
. replace ra_code =0 if psa_code_date > ra_code_date & psa_code_date !=.
(27,769 real changes made)

. replace ra_code =0 if anksp_code_date > ra_code_date & anksp_code_date !=.
(9,473 real changes made)

. replace psa_code =0 if ra_code_date >= psa_code_date & ra_code_date !=.
(27,994 real changes made)

. replace psa_code =0 if anksp_code_date > psa_code_date & anksp_code_date !=.
(9,345 real changes made)

. replace anksp_code =0 if psa_code_date >= anksp_code_date & psa_code_date !=.
(27,942 real changes made)

. replace anksp_code =0 if ra_code_date >= anksp_code_date & ra_code_date !=.
(9,558 real changes made)

. gen eia_diagnosis=1 if ra_code==1
(37,827 missing values generated)

. replace eia_diagnosis=2 if psa_code==1
(19,006 real changes made)

. replace eia_diagnosis=3 if anksp_code==1
(18,821 real changes made)

. lab define eia_diagnosis 1 "RA" 2 "PsA" 3 "AxSpA", modify

. lab val eia_diagnosis eia_diagnosis

. tab eia_diagnosis, missing

eia_diagnos |
         is |      Freq.     Percent        Cum.
------------+-----------------------------------
         RA |     19,095       33.55       33.55
        PsA |     19,006       33.39       66.94
      AxSpA |     18,821       33.06      100.00
------------+-----------------------------------
      Total |     56,922      100.00

. drop if eia_diagnosis==. //should be none
(0 observations deleted)

. 
. *Define drugs and dates=====================================================*
> /
. 
. **csDMARDs (not including high cost MTX; wouldn't be shared care)
. gen csdmard=1 if hydroxychloroquine==1 | leflunomide==1 | methotrexate==1 | m
> ethotrexate_inj==1 | sulfasalazine==1
(33,449 missing values generated)

. recode csdmard .=0 
(csdmard: 33449 changes made)

. tab csdmard, missing

    csdmard |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     33,449       58.76       58.76
          1 |     23,473       41.24      100.00
------------+-----------------------------------
      Total |     56,922      100.00

. bys eia_diagnosis: tab csdmard

-------------------------------------------------------------------------------
-> eia_diagnosis = RA

    csdmard |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     11,196       58.63       58.63
          1 |      7,899       41.37      100.00
------------+-----------------------------------
      Total |     19,095      100.00

-------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    csdmard |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     11,202       58.94       58.94
          1 |      7,804       41.06      100.00
------------+-----------------------------------
      Total |     19,006      100.00

-------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    csdmard |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     11,051       58.72       58.72
          1 |      7,770       41.28      100.00
------------+-----------------------------------
      Total |     18,821      100.00


. 
. **csDMARDs (including high cost MTX)
. gen csdmard_hcd=1 if hydroxychloroquine==1 | leflunomide==1 | methotrexate==1
>  | methotrexate_inj==1 | methotrexate_hcd==1 | sulfasalazine==1
(30,131 missing values generated)

. recode csdmard_hcd .=0 
(csdmard_hcd: 30131 changes made)

. tab csdmard_hcd, missing

csdmard_hcd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,131       52.93       52.93
          1 |     26,791       47.07      100.00
------------+-----------------------------------
      Total |     56,922      100.00

. bys eia_diagnosis: tab csdmard_hcd, missing

-------------------------------------------------------------------------------
-> eia_diagnosis = RA

csdmard_hcd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,116       52.98       52.98
          1 |      8,979       47.02      100.00
------------+-----------------------------------
      Total |     19,095      100.00

-------------------------------------------------------------------------------
-> eia_diagnosis = PsA

csdmard_hcd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,092       53.10       53.10
          1 |      8,914       46.90      100.00
------------+-----------------------------------
      Total |     19,006      100.00

-------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

csdmard_hcd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      9,923       52.72       52.72
          1 |      8,898       47.28      100.00
------------+-----------------------------------
      Total |     18,821      100.00


. 
. **Date of first csDMARD script (not including high cost MTX prescriptions)
. gen csdmard_date=min(hydroxychloroquine_date, leflunomide_date, methotrexate_
> date, methotrexate_inj_date, sulfasalazine_date)
(33,449 missing values generated)

. format %td csdmard_date

. 
. **Date of first csDMARD script (including high cost MTX prescriptions)
. gen csdmard_hcd_date=min(hydroxychloroquine_date, leflunomide_date, methotrex
> ate_date, methotrexate_inj_date, methotrexate_hcd_date, sulfasalazine_date)
(30,131 missing values generated)

. format %td csdmard_hcd_date

. 
. **Biologic use
. gen biologic=1 if abatacept==1 | adalimumab==1 | baricitinib==1 | certolizuma
> b==1 | etanercept==1 | golimumab==1 | guselkumab==1 | infliximab==1 | ixekizu
> mab==1 | rituximab==1 | sarilumab==1 | secukinumab==1 | tocilizumab==1 | tofa
> citinib==1 | upadacitinib==1 | ustekinumab==1 
(10,568 missing values generated)

. recode biologic .=0
(biologic: 10568 changes made)

. tab biologic, missing

   biologic |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,568       18.57       18.57
          1 |     46,354       81.43      100.00
------------+-----------------------------------
      Total |     56,922      100.00

. bys eia_diagnosis: tab biologic, missing 

-------------------------------------------------------------------------------
-> eia_diagnosis = RA

   biologic |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,565       18.67       18.67
          1 |     15,530       81.33      100.00
------------+-----------------------------------
      Total |     19,095      100.00

-------------------------------------------------------------------------------
-> eia_diagnosis = PsA

   biologic |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,495       18.39       18.39
          1 |     15,511       81.61      100.00
------------+-----------------------------------
      Total |     19,006      100.00

-------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

   biologic |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,508       18.64       18.64
          1 |     15,313       81.36      100.00
------------+-----------------------------------
      Total |     18,821      100.00


. 
. **Date of first biologic script
. gen biologic_date=min(abatacept_date, adalimumab_date, baricitinib_date, cert
> olizumab_date, etanercept_date, golimumab_date, guselkumab_date, infliximab_d
> ate, ixekizumab_date, rituximab_date, sarilumab_date, secukinumab_date, tocil
> izumab_date, tofacitinib_date, upadacitinib_date, ustekinumab_date)
(10,568 missing values generated)

. format %td biologic_date

. 
. **Exclude if first csdmard or biologic was before first rheum appt
. tab csdmard if rheum_appt_date!=. & csdmard_date!=. & csdmard_date<rheum_appt
> _date

    csdmard |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      8,486      100.00      100.00
------------+-----------------------------------
      Total |      8,486      100.00

. tab csdmard if rheum_appt_date!=. & csdmard_date!=. & (csdmard_date + 60)<rhe
> um_appt_date 

    csdmard |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      7,660      100.00      100.00
------------+-----------------------------------
      Total |      7,660      100.00

. drop if rheum_appt_date!=. & csdmard_date!=. & (csdmard_date + 60)<rheum_appt
> _date //drop if first csDMARD more than 60 days before first rheum_appt_date
(7,660 observations deleted)

. tab biologic if rheum_appt_date!=. & biologic_date!=. & biologic_date<rheum_a
> ppt_date 

   biologic |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     15,188      100.00      100.00
------------+-----------------------------------
      Total |     15,188      100.00

. tab biologic if rheum_appt_date!=. & biologic_date!=. & (biologic_date + 60)<
> rheum_appt_date 

   biologic |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     13,753      100.00      100.00
------------+-----------------------------------
      Total |     13,753      100.00

. drop if rheum_appt_date!=. & biologic_date!=. & (biologic_date + 60)<rheum_ap
> pt_date //drop if first biologic more than 60 days before first rheum_appt_da
> te
(13,753 observations deleted)

. 
. *Number of EIA diagnoses in 1-year time windows==============================
> ===========*/
. 
. gen diagnosis_year=1 if eia_code_date>=td(01mar2019) & eia_code_date<td(01mar
> 2020)
(23,560 missing values generated)

. replace diagnosis_year=2 if eia_code_date>=td(01mar2020) & eia_code_date<td(0
> 1mar2021)
(11,912 real changes made)

. replace diagnosis_year=3 if eia_code_date>=td(01mar2021) & eia_code_date<=td(
> 01mar2022)
(11,648 real changes made)

. lab define diagnosis_year 1 "March 2019-March 2020" 2 "March 2020-March 2021"
>  3 "March 2021-March 2022", modify

. lab val diagnosis_year diagnosis_year

. lab var diagnosis_year "Year of diagnosis"

. tab diagnosis_year, missing

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |     11,949       33.65       33.65
March 2020-March 2021 |     11,912       33.55       67.20
March 2021-March 2022 |     11,648       32.80      100.00
----------------------+-----------------------------------
                Total |     35,509      100.00

. bys eia_diagnosis: tab diagnosis_year, missing

-------------------------------------------------------------------------------
-> eia_diagnosis = RA

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |      4,017       33.51       33.51
March 2020-March 2021 |      4,060       33.86       67.37
March 2021-March 2022 |      3,912       32.63      100.00
----------------------+-----------------------------------
                Total |     11,989      100.00

-------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |      3,978       33.71       33.71
March 2020-March 2021 |      3,875       32.83       66.54
March 2021-March 2022 |      3,949       33.46      100.00
----------------------+-----------------------------------
                Total |     11,802      100.00

-------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |      3,954       33.74       33.74
March 2020-March 2021 |      3,977       33.94       67.68
March 2021-March 2022 |      3,787       32.32      100.00
----------------------+-----------------------------------
                Total |     11,718      100.00


. 
. **Proportion of patients with at least 6 or 12 months of GP follow-up after E
> IA code
. tab has_6m_follow_up

has_6m_foll |
      ow_up |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,761        4.96        4.96
          1 |     33,748       95.04      100.00
------------+-----------------------------------
      Total |     35,509      100.00

. tab has_12m_follow_up 

has_12m_fol |
     low_up |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,522        9.92        9.92
          1 |     31,987       90.08      100.00
------------+-----------------------------------
      Total |     35,509      100.00

. tab mo_year_diagn has_6m_follow_up

mo_year_di |   has_6m_follow_up
       agn |         0          1 |     Total
-----------+----------------------+----------
    2019m3 |        53        978 |     1,031 
    2019m4 |        51        977 |     1,028 
    2019m5 |        48        892 |       940 
    2019m6 |        53        952 |     1,005 
    2019m7 |        41        904 |       945 
    2019m8 |        51        930 |       981 
    2019m9 |        60        944 |     1,004 
   2019m10 |        54        971 |     1,025 
   2019m11 |        61        953 |     1,014 
   2019m12 |        55        928 |       983 
    2020m1 |        58        988 |     1,046 
    2020m2 |        46        901 |       947 
    2020m3 |        52        997 |     1,049 
    2020m4 |        35        888 |       923 
    2020m5 |        57        937 |       994 
    2020m6 |        55        958 |     1,013 
    2020m7 |        47        980 |     1,027 
    2020m8 |        40        955 |       995 
    2020m9 |        45        921 |       966 
   2020m10 |        37        979 |     1,016 
   2020m11 |        48        920 |       968 
   2020m12 |        52        934 |       986 
    2021m1 |        58        962 |     1,020 
    2021m2 |        45        910 |       955 
    2021m3 |        38        938 |       976 
    2021m4 |        45        975 |     1,020 
    2021m5 |        47      1,017 |     1,064 
    2021m6 |        44        883 |       927 
    2021m7 |        54        923 |       977 
    2021m8 |        60        955 |     1,015 
    2021m9 |        39        887 |       926 
   2021m10 |        52        886 |       938 
   2021m11 |        45        933 |       978 
   2021m12 |        46        896 |       942 
    2022m1 |        51        910 |       961 
    2022m2 |        36        851 |       887 
    2022m3 |         2         35 |        37 
-----------+----------------------+----------
     Total |     1,761     33,748 |    35,509 

. tab mo_year_diagn has_12m_follow_up

mo_year_di |   has_12m_follow_up
       agn |         0          1 |     Total
-----------+----------------------+----------
    2019m3 |       100        931 |     1,031 
    2019m4 |       108        920 |     1,028 
    2019m5 |        94        846 |       940 
    2019m6 |        83        922 |     1,005 
    2019m7 |       100        845 |       945 
    2019m8 |        88        893 |       981 
    2019m9 |       107        897 |     1,004 
   2019m10 |        93        932 |     1,025 
   2019m11 |        97        917 |     1,014 
   2019m12 |        90        893 |       983 
    2020m1 |        99        947 |     1,046 
    2020m2 |        81        866 |       947 
    2020m3 |       123        926 |     1,049 
    2020m4 |        82        841 |       923 
    2020m5 |        92        902 |       994 
    2020m6 |       107        906 |     1,013 
    2020m7 |       107        920 |     1,027 
    2020m8 |        95        900 |       995 
    2020m9 |       109        857 |       966 
   2020m10 |       100        916 |     1,016 
   2020m11 |        91        877 |       968 
   2020m12 |       109        877 |       986 
    2021m1 |        93        927 |     1,020 
    2021m2 |        95        860 |       955 
    2021m3 |       108        868 |       976 
    2021m4 |       105        915 |     1,020 
    2021m5 |       109        955 |     1,064 
    2021m6 |        88        839 |       927 
    2021m7 |        82        895 |       977 
    2021m8 |        99        916 |     1,015 
    2021m9 |        95        831 |       926 
   2021m10 |        93        845 |       938 
   2021m11 |       106        872 |       978 
   2021m12 |        98        844 |       942 
    2022m1 |        96        865 |       961 
    2022m2 |        95        792 |       887 
    2022m3 |         5         32 |        37 
-----------+----------------------+----------
     Total |     3,522     31,987 |    35,509 

. tab has_6m_follow_up if eia_code_date<=td(01sep2021)

has_6m_foll |
      ow_up |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,490        4.99        4.99
          1 |     28,371       95.01      100.00
------------+-----------------------------------
      Total |     29,861      100.00

. tab has_12m_follow_up if eia_code_date<=td(01mar2021)

has_12m_fol |
     low_up |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,349        9.83        9.83
          1 |     21,543       90.17      100.00
------------+-----------------------------------
      Total |     23,892      100.00

. 
. *Define appointments and referrals======================================*/
. 
. **Rheumatology appt 
. tab rheum_appt, missing //proportion of patients with a rheum outpatient date
>  in the two years before EIA code appeared in GP record; but, data only from 
> April 2019 onwards

 rheum_appt |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,749       16.19       16.19
          1 |     29,760       83.81      100.00
------------+-----------------------------------
      Total |     35,509      100.00

. tab rheum_appt if eia_code_date>=date("$outpatient_date", "DMY"), missing //p
> roportion of patients with a code date from Oct 2019 onward with a rheum outp
> atient date in the two years before EIA code appeared in GP record (i.e. 6m+ 
> preceding)

 rheum_appt |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,630       16.20       16.20
          1 |     23,945       83.80      100.00
------------+-----------------------------------
      Total |     28,575      100.00

. 
. **Check timeframe of rheum appt relative to EIA codebook
. tab rheum_appt if eia_code_date>=date("$outpatient_date", "DMY") & rheum_appt
> _date>eia_code_date & rheum_appt_date!=. //confirm proportion who had rheum a
> ppt (i.e. not missing) and appt after EIA code

 rheum_appt |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      3,351      100.00      100.00
------------+-----------------------------------
      Total |      3,351      100.00

. tab rheum_appt if eia_code_date>=date("$outpatient_date", "DMY") & rheum_appt
> _date>(eia_code_date + 30) & rheum_appt_date!=. //confirm proportion who had 
> rheum appt 30 days after EIA code 

 rheum_appt |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      3,099      100.00      100.00
------------+-----------------------------------
      Total |      3,099      100.00

. tab rheum_appt if eia_code_date>=date("$outpatient_date", "DMY") & rheum_appt
> _date>(eia_code_date + 60) & rheum_appt_date!=. //confirm proportion who had 
> rheum appt 60 days after EIA code 

 rheum_appt |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      2,834      100.00      100.00
------------+-----------------------------------
      Total |      2,834      100.00

. replace rheum_appt=0 if rheum_appt_date>(eia_code_date + 60) & rheum_appt_dat
> e!=. //replace as missing those appts >60 days after EIA code
(5,273 real changes made)

. replace rheum_appt_date=. if rheum_appt_date>(eia_code_date + 60) & rheum_app
> t_date!=. //replace as missing those appts >60 days after EIA code
(5,273 real changes made, 5,273 to missing)

. 
. **Rheumatology referrals
. tab referral_rheum_prerheum //last rheum referral in the 2 years before rheum
> atology outpatient (requires rheum appt to have been present, and rheum appt 
> to be before EIA code)

referral_rh |
eum_prerheu |
          m |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,595       10.12       10.12
          1 |     31,914       89.88      100.00
------------+-----------------------------------
      Total |     35,509      100.00

. tab referral_rheum_prerheum if rheum_appt!=0 & referral_rheum_prerheum_date<=
> rheum_appt_date  //last rheum referral in the year before rheumatology outpat
> ient, assuming ref date before rheum appt date (should be accounted for by Py
> thon code)

referral_rh |
eum_prerheu |
          m |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      5,927      100.00      100.00
------------+-----------------------------------
      Total |      5,927      100.00

. tab referral_rheum_precode //last rheum referral in the year before EIA code 
> (could potentially use if rheum appt missing)

referral_rh |
eum_precode |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,582       10.09       10.09
          1 |     31,927       89.91      100.00
------------+-----------------------------------
      Total |     35,509      100.00

. gen referral_rheum_comb_date = referral_rheum_prerheum_date if referral_rheum
> _prerheum_date!=.
(3,595 missing values generated)

. replace referral_rheum_comb_date = referral_rheum_precode_date if referral_rh
> eum_prerheum_date==. & referral_rheum_precode_date!=.
(3,238 real changes made)

. format %td referral_rheum_comb_date

. tab referral_rheum_comb_date

referral_rh |
eum_comb_da |
         te |      Freq.     Percent        Cum.
------------+-----------------------------------
  17mar2018 |         24        0.07        0.07
  18mar2018 |         27        0.08        0.15
  19mar2018 |         22        0.06        0.21
  20mar2018 |         30        0.09        0.29
  21mar2018 |         14        0.04        0.33
  22mar2018 |         27        0.08        0.41
  23mar2018 |         25        0.07        0.48
  24mar2018 |         29        0.08        0.56
  25mar2018 |         27        0.08        0.64
  26mar2018 |         20        0.06        0.70
  27mar2018 |         19        0.05        0.75
  28mar2018 |         23        0.07        0.82
  29mar2018 |         22        0.06        0.88
  30mar2018 |         19        0.05        0.93
  31mar2018 |         14        0.04        0.97
  01apr2018 |         23        0.07        1.04
  02apr2018 |         23        0.07        1.10
  03apr2018 |         17        0.05        1.15
  04apr2018 |         29        0.08        1.23
  05apr2018 |         27        0.08        1.31
  06apr2018 |         17        0.05        1.36
  07apr2018 |         23        0.07        1.43
  08apr2018 |         25        0.07        1.50
  09apr2018 |         26        0.07        1.57
  10apr2018 |         21        0.06        1.63
  11apr2018 |         19        0.05        1.68
  12apr2018 |         22        0.06        1.75
  13apr2018 |         20        0.06        1.80
  14apr2018 |         24        0.07        1.87
  15apr2018 |         25        0.07        1.94
  16apr2018 |         19        0.05        2.00
  17apr2018 |         21        0.06        2.06
  18apr2018 |         20        0.06        2.11
  19apr2018 |         18        0.05        2.16
  20apr2018 |         17        0.05        2.21
  21apr2018 |         18        0.05        2.26
  22apr2018 |         19        0.05        2.32
  23apr2018 |         26        0.07        2.39
  24apr2018 |         20        0.06        2.45
  25apr2018 |         16        0.05        2.49
  26apr2018 |         17        0.05        2.54
  27apr2018 |         25        0.07        2.61
  28apr2018 |         20        0.06        2.67
  29apr2018 |         25        0.07        2.74
  30apr2018 |         19        0.05        2.80
  01may2018 |         17        0.05        2.84
  02may2018 |         25        0.07        2.92
  03may2018 |         12        0.03        2.95
  04may2018 |         25        0.07        3.02
  05may2018 |         19        0.05        3.08
  06may2018 |         21        0.06        3.13
  07may2018 |         27        0.08        3.21
  08may2018 |         25        0.07        3.28
  09may2018 |         22        0.06        3.35
  10may2018 |         22        0.06        3.41
  11may2018 |         25        0.07        3.48
  12may2018 |         30        0.09        3.56
  13may2018 |         21        0.06        3.62
  14may2018 |         15        0.04        3.67
  15may2018 |         37        0.11        3.77
  16may2018 |         30        0.09        3.86
  17may2018 |         20        0.06        3.91
  18may2018 |         26        0.07        3.99
  19may2018 |         26        0.07        4.06
  20may2018 |         31        0.09        4.15
  21may2018 |         21        0.06        4.21
  22may2018 |         20        0.06        4.27
  23may2018 |         15        0.04        4.31
  24may2018 |         18        0.05        4.36
  25may2018 |         22        0.06        4.42
  26may2018 |         20        0.06        4.48
  27may2018 |         28        0.08        4.56
  28may2018 |         32        0.09        4.65
  29may2018 |         26        0.07        4.73
  30may2018 |         27        0.08        4.80
  31may2018 |         31        0.09        4.89
  01jun2018 |         22        0.06        4.95
  02jun2018 |         15        0.04        5.00
  03jun2018 |         22        0.06        5.06
  04jun2018 |         22        0.06        5.12
  05jun2018 |         25        0.07        5.19
  06jun2018 |         28        0.08        5.27
  07jun2018 |         27        0.08        5.35
  08jun2018 |         21        0.06        5.41
  09jun2018 |         32        0.09        5.50
  10jun2018 |         26        0.07        5.57
  11jun2018 |         21        0.06        5.63
  12jun2018 |         13        0.04        5.67
  13jun2018 |         25        0.07        5.74
  14jun2018 |         25        0.07        5.81
  15jun2018 |         28        0.08        5.89
  16jun2018 |         29        0.08        5.97
  17jun2018 |         19        0.05        6.03
  18jun2018 |         23        0.07        6.09
  19jun2018 |         17        0.05        6.14
  20jun2018 |         23        0.07        6.21
  21jun2018 |         22        0.06        6.27
  22jun2018 |         31        0.09        6.36
  23jun2018 |         16        0.05        6.40
  24jun2018 |         24        0.07        6.47
  25jun2018 |         20        0.06        6.53
  26jun2018 |         16        0.05        6.57
  27jun2018 |         19        0.05        6.63
  28jun2018 |         19        0.05        6.68
  29jun2018 |         19        0.05        6.74
  30jun2018 |         30        0.09        6.82
  01jul2018 |         30        0.09        6.91
  02jul2018 |         23        0.07        6.97
  03jul2018 |         22        0.06        7.04
  04jul2018 |         25        0.07        7.11
  05jul2018 |         21        0.06        7.17
  06jul2018 |         26        0.07        7.24
  07jul2018 |         23        0.07        7.31
  08jul2018 |         25        0.07        7.38
  09jul2018 |         25        0.07        7.45
  10jul2018 |         33        0.09        7.54
  11jul2018 |         22        0.06        7.60
  12jul2018 |         27        0.08        7.68
  13jul2018 |         26        0.07        7.75
  14jul2018 |         28        0.08        7.83
  15jul2018 |         16        0.05        7.88
  16jul2018 |         20        0.06        7.94
  17jul2018 |         22        0.06        8.00
  18jul2018 |         12        0.03        8.03
  19jul2018 |         20        0.06        8.09
  20jul2018 |         25        0.07        8.16
  21jul2018 |         27        0.08        8.24
  22jul2018 |         19        0.05        8.29
  23jul2018 |         14        0.04        8.33
  24jul2018 |         25        0.07        8.40
  25jul2018 |         26        0.07        8.48
  26jul2018 |         20        0.06        8.53
  27jul2018 |         21        0.06        8.59
  28jul2018 |         22        0.06        8.66
  29jul2018 |         24        0.07        8.72
  30jul2018 |         24        0.07        8.79
  31jul2018 |         14        0.04        8.83
  01aug2018 |         24        0.07        8.90
  02aug2018 |         17        0.05        8.95
  03aug2018 |         24        0.07        9.02
  04aug2018 |         26        0.07        9.09
  05aug2018 |         25        0.07        9.16
  06aug2018 |         21        0.06        9.22
  07aug2018 |         27        0.08        9.30
  08aug2018 |         21        0.06        9.36
  09aug2018 |         31        0.09        9.45
  10aug2018 |         13        0.04        9.48
  11aug2018 |         29        0.08        9.57
  12aug2018 |         19        0.05        9.62
  13aug2018 |         24        0.07        9.69
  14aug2018 |         30        0.09        9.77
  15aug2018 |         19        0.05        9.83
  16aug2018 |         24        0.07        9.90
  17aug2018 |         28        0.08        9.98
  18aug2018 |         22        0.06       10.04
  19aug2018 |         31        0.09       10.13
  20aug2018 |         28        0.08       10.21
  21aug2018 |         15        0.04       10.25
  22aug2018 |         24        0.07       10.32
  23aug2018 |         23        0.07       10.38
  24aug2018 |         32        0.09       10.47
  25aug2018 |         26        0.07       10.55
  26aug2018 |         26        0.07       10.62
  27aug2018 |         21        0.06       10.68
  28aug2018 |         24        0.07       10.75
  29aug2018 |         25        0.07       10.82
  30aug2018 |         19        0.05       10.88
  31aug2018 |         21        0.06       10.94
  01sep2018 |         23        0.07       11.00
  02sep2018 |         25        0.07       11.07
  03sep2018 |         24        0.07       11.14
  04sep2018 |         22        0.06       11.20
  05sep2018 |         29        0.08       11.29
  06sep2018 |         29        0.08       11.37
  07sep2018 |         12        0.03       11.40
  08sep2018 |         24        0.07       11.47
  09sep2018 |         21        0.06       11.53
  10sep2018 |         28        0.08       11.61
  11sep2018 |         20        0.06       11.67
  12sep2018 |         26        0.07       11.74
  13sep2018 |         28        0.08       11.82
  14sep2018 |         23        0.07       11.89
  15sep2018 |         24        0.07       11.95
  16sep2018 |         19        0.05       12.01
  17sep2018 |         17        0.05       12.06
  18sep2018 |         16        0.05       12.10
  19sep2018 |         23        0.07       12.17
  20sep2018 |         26        0.07       12.24
  21sep2018 |         28        0.08       12.32
  22sep2018 |         23        0.07       12.39
  23sep2018 |         23        0.07       12.45
  24sep2018 |         24        0.07       12.52
  25sep2018 |         27        0.08       12.60
  26sep2018 |         26        0.07       12.67
  27sep2018 |         24        0.07       12.74
  28sep2018 |         29        0.08       12.82
  29sep2018 |         19        0.05       12.88
  30sep2018 |         31        0.09       12.96
  01oct2018 |         20        0.06       13.02
  02oct2018 |         26        0.07       13.09
  03oct2018 |         26        0.07       13.17
  04oct2018 |         21        0.06       13.23
  05oct2018 |         27        0.08       13.31
  06oct2018 |         18        0.05       13.36
  07oct2018 |         14        0.04       13.40
  08oct2018 |         32        0.09       13.49
  09oct2018 |         24        0.07       13.56
  10oct2018 |         21        0.06       13.62
  11oct2018 |         19        0.05       13.67
  12oct2018 |         16        0.05       13.71
  13oct2018 |         23        0.07       13.78
  14oct2018 |         25        0.07       13.85
  15oct2018 |         22        0.06       13.91
  16oct2018 |         24        0.07       13.98
  17oct2018 |         24        0.07       14.05
  18oct2018 |         33        0.09       14.14
  19oct2018 |         21        0.06       14.20
  20oct2018 |         24        0.07       14.27
  21oct2018 |         17        0.05       14.32
  22oct2018 |         25        0.07       14.39
  23oct2018 |         26        0.07       14.47
  24oct2018 |         25        0.07       14.54
  25oct2018 |         25        0.07       14.61
  26oct2018 |         26        0.07       14.68
  27oct2018 |         22        0.06       14.74
  28oct2018 |         23        0.07       14.81
  29oct2018 |         22        0.06       14.87
  30oct2018 |         19        0.05       14.93
  31oct2018 |         30        0.09       15.01
  01nov2018 |         24        0.07       15.08
  02nov2018 |         33        0.09       15.17
  03nov2018 |         30        0.09       15.26
  04nov2018 |         19        0.05       15.31
  05nov2018 |         30        0.09       15.40
  06nov2018 |         20        0.06       15.46
  07nov2018 |         22        0.06       15.52
  08nov2018 |         23        0.07       15.58
  09nov2018 |         19        0.05       15.64
  10nov2018 |         22        0.06       15.70
  11nov2018 |         29        0.08       15.78
  12nov2018 |         21        0.06       15.84
  13nov2018 |         13        0.04       15.88
  14nov2018 |         22        0.06       15.94
  15nov2018 |         25        0.07       16.01
  16nov2018 |         16        0.05       16.06
  17nov2018 |         33        0.09       16.15
  18nov2018 |         28        0.08       16.23
  19nov2018 |         21        0.06       16.29
  20nov2018 |         20        0.06       16.35
  21nov2018 |         29        0.08       16.43
  22nov2018 |         27        0.08       16.51
  23nov2018 |         29        0.08       16.59
  24nov2018 |         22        0.06       16.65
  25nov2018 |         26        0.07       16.73
  26nov2018 |         15        0.04       16.77
  27nov2018 |         18        0.05       16.82
  28nov2018 |         27        0.08       16.90
  29nov2018 |         30        0.09       16.98
  30nov2018 |         21        0.06       17.04
  01dec2018 |         18        0.05       17.09
  02dec2018 |         19        0.05       17.15
  03dec2018 |         22        0.06       17.21
  04dec2018 |         23        0.07       17.28
  05dec2018 |         31        0.09       17.36
  06dec2018 |         21        0.06       17.42
  07dec2018 |         23        0.07       17.49
  08dec2018 |         34        0.10       17.59
  09dec2018 |         31        0.09       17.67
  10dec2018 |         24        0.07       17.74
  11dec2018 |         22        0.06       17.81
  12dec2018 |         23        0.07       17.87
  13dec2018 |         24        0.07       17.94
  14dec2018 |         21        0.06       18.00
  15dec2018 |         30        0.09       18.08
  16dec2018 |         17        0.05       18.13
  17dec2018 |         30        0.09       18.22
  18dec2018 |         20        0.06       18.27
  19dec2018 |         25        0.07       18.35
  20dec2018 |         14        0.04       18.39
  21dec2018 |         27        0.08       18.46
  22dec2018 |         25        0.07       18.53
  23dec2018 |         27        0.08       18.61
  24dec2018 |         27        0.08       18.69
  25dec2018 |         22        0.06       18.75
  26dec2018 |         21        0.06       18.81
  27dec2018 |         18        0.05       18.86
  28dec2018 |         28        0.08       18.94
  29dec2018 |         23        0.07       19.01
  30dec2018 |         29        0.08       19.09
  31dec2018 |         24        0.07       19.16
  01jan2019 |         18        0.05       19.21
  02jan2019 |         21        0.06       19.27
  03jan2019 |         23        0.07       19.33
  04jan2019 |         18        0.05       19.38
  05jan2019 |         32        0.09       19.48
  06jan2019 |         26        0.07       19.55
  07jan2019 |         27        0.08       19.63
  08jan2019 |         22        0.06       19.69
  09jan2019 |         24        0.07       19.76
  10jan2019 |         17        0.05       19.81
  11jan2019 |         25        0.07       19.88
  12jan2019 |         19        0.05       19.93
  13jan2019 |         18        0.05       19.98
  14jan2019 |         25        0.07       20.05
  15jan2019 |         31        0.09       20.14
  16jan2019 |         28        0.08       20.22
  17jan2019 |         23        0.07       20.29
  18jan2019 |         24        0.07       20.35
  19jan2019 |         22        0.06       20.42
  20jan2019 |         25        0.07       20.49
  21jan2019 |         26        0.07       20.56
  22jan2019 |         28        0.08       20.64
  23jan2019 |         19        0.05       20.70
  24jan2019 |         15        0.04       20.74
  25jan2019 |         26        0.07       20.81
  26jan2019 |         27        0.08       20.89
  27jan2019 |         23        0.07       20.95
  28jan2019 |         26        0.07       21.03
  29jan2019 |         30        0.09       21.11
  30jan2019 |         16        0.05       21.16
  31jan2019 |         28        0.08       21.24
  01feb2019 |         21        0.06       21.30
  02feb2019 |         26        0.07       21.37
  03feb2019 |         24        0.07       21.44
  04feb2019 |         26        0.07       21.52
  05feb2019 |         19        0.05       21.57
  06feb2019 |         26        0.07       21.64
  07feb2019 |         32        0.09       21.73
  08feb2019 |         22        0.06       21.80
  09feb2019 |         24        0.07       21.87
  10feb2019 |         28        0.08       21.94
  11feb2019 |         30        0.09       22.03
  12feb2019 |         21        0.06       22.09
  13feb2019 |         21        0.06       22.15
  14feb2019 |         18        0.05       22.20
  15feb2019 |         26        0.07       22.27
  16feb2019 |         21        0.06       22.33
  17feb2019 |         21        0.06       22.39
  18feb2019 |         28        0.08       22.47
  19feb2019 |         30        0.09       22.56
  20feb2019 |         22        0.06       22.62
  21feb2019 |         19        0.05       22.68
  22feb2019 |         24        0.07       22.74
  23feb2019 |         14        0.04       22.78
  24feb2019 |         26        0.07       22.86
  25feb2019 |         21        0.06       22.92
  26feb2019 |         18        0.05       22.97
  27feb2019 |         23        0.07       23.03
  28feb2019 |         26        0.07       23.11
  01mar2019 |         20        0.06       23.17
  02mar2019 |         29        0.08       23.25
  03mar2019 |         22        0.06       23.31
  04mar2019 |         19        0.05       23.36
  05mar2019 |         18        0.05       23.42
  06mar2019 |         17        0.05       23.46
  07mar2019 |         20        0.06       23.52
  08mar2019 |         25        0.07       23.59
  09mar2019 |         32        0.09       23.68
  10mar2019 |         16        0.05       23.73
  11mar2019 |         21        0.06       23.79
  12mar2019 |         17        0.05       23.84
  13mar2019 |         30        0.09       23.92
  14mar2019 |         25        0.07       23.99
  15mar2019 |         21        0.06       24.05
  16mar2019 |         23        0.07       24.12
  17mar2019 |         24        0.07       24.19
  18mar2019 |         22        0.06       24.25
  19mar2019 |         19        0.05       24.30
  20mar2019 |         23        0.07       24.37
  21mar2019 |         25        0.07       24.44
  22mar2019 |         33        0.09       24.53
  23mar2019 |         32        0.09       24.62
  24mar2019 |         22        0.06       24.69
  25mar2019 |         33        0.09       24.78
  26mar2019 |         21        0.06       24.84
  27mar2019 |         26        0.07       24.91
  28mar2019 |         25        0.07       24.99
  29mar2019 |         30        0.09       25.07
  30mar2019 |         23        0.07       25.14
  31mar2019 |         20        0.06       25.19
  01apr2019 |         23        0.07       25.26
  02apr2019 |         23        0.07       25.32
  03apr2019 |         26        0.07       25.40
  04apr2019 |         22        0.06       25.46
  05apr2019 |         32        0.09       25.55
  06apr2019 |         35        0.10       25.65
  07apr2019 |         24        0.07       25.72
  08apr2019 |         22        0.06       25.78
  09apr2019 |         24        0.07       25.85
  10apr2019 |         23        0.07       25.92
  11apr2019 |         32        0.09       26.01
  12apr2019 |         21        0.06       26.07
  13apr2019 |         19        0.05       26.12
  14apr2019 |         21        0.06       26.18
  15apr2019 |         28        0.08       26.26
  16apr2019 |         30        0.09       26.35
  17apr2019 |         19        0.05       26.40
  18apr2019 |         15        0.04       26.44
  19apr2019 |         24        0.07       26.51
  20apr2019 |         16        0.05       26.56
  21apr2019 |         28        0.08       26.64
  22apr2019 |         23        0.07       26.70
  23apr2019 |         25        0.07       26.77
  24apr2019 |         28        0.08       26.85
  25apr2019 |         20        0.06       26.91
  26apr2019 |         19        0.05       26.96
  27apr2019 |         19        0.05       27.02
  28apr2019 |         17        0.05       27.07
  29apr2019 |         24        0.07       27.13
  30apr2019 |         22        0.06       27.20
  01may2019 |         36        0.10       27.30
  02may2019 |         31        0.09       27.39
  03may2019 |         28        0.08       27.47
  04may2019 |         29        0.08       27.55
  05may2019 |         22        0.06       27.61
  06may2019 |         29        0.08       27.69
  07may2019 |         27        0.08       27.77
  08may2019 |         30        0.09       27.86
  09may2019 |         24        0.07       27.92
  10may2019 |         16        0.05       27.97
  11may2019 |         22        0.06       28.03
  12may2019 |         22        0.06       28.10
  13may2019 |         23        0.07       28.16
  14may2019 |         28        0.08       28.24
  15may2019 |         26        0.07       28.31
  16may2019 |         17        0.05       28.36
  17may2019 |         21        0.06       28.42
  18may2019 |         31        0.09       28.51
  19may2019 |         32        0.09       28.60
  20may2019 |         25        0.07       28.67
  21may2019 |         22        0.06       28.74
  22may2019 |         19        0.05       28.79
  23may2019 |         19        0.05       28.84
  24may2019 |         28        0.08       28.92
  25may2019 |         20        0.06       28.98
  26may2019 |         25        0.07       29.05
  27may2019 |         25        0.07       29.12
  28may2019 |         15        0.04       29.16
  29may2019 |         18        0.05       29.22
  30may2019 |         26        0.07       29.29
  31may2019 |         19        0.05       29.34
  01jun2019 |         21        0.06       29.40
  02jun2019 |         21        0.06       29.46
  03jun2019 |         30        0.09       29.55
  04jun2019 |         24        0.07       29.62
  05jun2019 |         18        0.05       29.67
  06jun2019 |         32        0.09       29.76
  07jun2019 |         24        0.07       29.83
  08jun2019 |         25        0.07       29.90
  09jun2019 |         23        0.07       29.96
  10jun2019 |         31        0.09       30.05
  11jun2019 |         25        0.07       30.12
  12jun2019 |         23        0.07       30.19
  13jun2019 |         25        0.07       30.26
  14jun2019 |         20        0.06       30.32
  15jun2019 |         15        0.04       30.36
  16jun2019 |         27        0.08       30.44
  17jun2019 |         27        0.08       30.51
  18jun2019 |         23        0.07       30.58
  19jun2019 |         34        0.10       30.68
  20jun2019 |         24        0.07       30.74
  21jun2019 |         24        0.07       30.81
  22jun2019 |         28        0.08       30.89
  23jun2019 |         27        0.08       30.97
  24jun2019 |         24        0.07       31.04
  25jun2019 |         27        0.08       31.11
  26jun2019 |         28        0.08       31.19
  27jun2019 |         20        0.06       31.25
  28jun2019 |         27        0.08       31.33
  29jun2019 |         25        0.07       31.40
  30jun2019 |         26        0.07       31.47
  01jul2019 |         24        0.07       31.54
  02jul2019 |         20        0.06       31.60
  03jul2019 |         32        0.09       31.69
  04jul2019 |         27        0.08       31.76
  05jul2019 |         24        0.07       31.83
  06jul2019 |         20        0.06       31.89
  07jul2019 |         22        0.06       31.95
  08jul2019 |         28        0.08       32.03
  09jul2019 |         21        0.06       32.09
  10jul2019 |         26        0.07       32.17
  11jul2019 |         19        0.05       32.22
  12jul2019 |         24        0.07       32.29
  13jul2019 |         28        0.08       32.37
  14jul2019 |         16        0.05       32.41
  15jul2019 |         22        0.06       32.48
  16jul2019 |         23        0.07       32.54
  17jul2019 |         24        0.07       32.61
  18jul2019 |         23        0.07       32.68
  19jul2019 |         18        0.05       32.73
  20jul2019 |         25        0.07       32.80
  21jul2019 |         23        0.07       32.86
  22jul2019 |         25        0.07       32.93
  23jul2019 |         25        0.07       33.01
  24jul2019 |         26        0.07       33.08
  25jul2019 |         31        0.09       33.17
  26jul2019 |         27        0.08       33.24
  27jul2019 |         32        0.09       33.34
  28jul2019 |         20        0.06       33.39
  29jul2019 |         20        0.06       33.45
  30jul2019 |         22        0.06       33.51
  31jul2019 |         26        0.07       33.59
  01aug2019 |         21        0.06       33.65
  02aug2019 |         25        0.07       33.72
  03aug2019 |         28        0.08       33.80
  04aug2019 |         27        0.08       33.87
  05aug2019 |         25        0.07       33.94
  06aug2019 |         25        0.07       34.02
  07aug2019 |         25        0.07       34.09
  08aug2019 |         28        0.08       34.17
  09aug2019 |         27        0.08       34.24
  10aug2019 |         20        0.06       34.30
  11aug2019 |         34        0.10       34.40
  12aug2019 |         28        0.08       34.48
  13aug2019 |         31        0.09       34.56
  14aug2019 |         26        0.07       34.64
  15aug2019 |         29        0.08       34.72
  16aug2019 |         22        0.06       34.78
  17aug2019 |         16        0.05       34.83
  18aug2019 |         21        0.06       34.89
  19aug2019 |         26        0.07       34.96
  20aug2019 |         26        0.07       35.04
  21aug2019 |         25        0.07       35.11
  22aug2019 |         22        0.06       35.17
  23aug2019 |         23        0.07       35.24
  24aug2019 |         22        0.06       35.30
  25aug2019 |         39        0.11       35.41
  26aug2019 |         30        0.09       35.49
  27aug2019 |         24        0.07       35.56
  28aug2019 |         22        0.06       35.63
  29aug2019 |         26        0.07       35.70
  30aug2019 |         19        0.05       35.75
  31aug2019 |         25        0.07       35.82
  01sep2019 |         21        0.06       35.88
  02sep2019 |         20        0.06       35.94
  03sep2019 |         28        0.08       36.02
  04sep2019 |         24        0.07       36.09
  05sep2019 |         19        0.05       36.14
  06sep2019 |         22        0.06       36.21
  07sep2019 |         32        0.09       36.30
  08sep2019 |         23        0.07       36.36
  09sep2019 |         22        0.06       36.42
  10sep2019 |         26        0.07       36.50
  11sep2019 |         22        0.06       36.56
  12sep2019 |         31        0.09       36.65
  13sep2019 |         22        0.06       36.71
  14sep2019 |         16        0.05       36.76
  15sep2019 |         25        0.07       36.83
  16sep2019 |         24        0.07       36.90
  17sep2019 |         19        0.05       36.95
  18sep2019 |         24        0.07       37.02
  19sep2019 |         24        0.07       37.09
  20sep2019 |         35        0.10       37.19
  21sep2019 |         22        0.06       37.25
  22sep2019 |         29        0.08       37.33
  23sep2019 |         25        0.07       37.40
  24sep2019 |         18        0.05       37.45
  25sep2019 |         24        0.07       37.52
  26sep2019 |         23        0.07       37.59
  27sep2019 |         17        0.05       37.64
  28sep2019 |         18        0.05       37.69
  29sep2019 |         23        0.07       37.75
  30sep2019 |         25        0.07       37.82
  01oct2019 |         24        0.07       37.89
  02oct2019 |         22        0.06       37.96
  03oct2019 |         27        0.08       38.03
  04oct2019 |         17        0.05       38.08
  05oct2019 |         21        0.06       38.14
  06oct2019 |         24        0.07       38.21
  07oct2019 |         19        0.05       38.26
  08oct2019 |         23        0.07       38.33
  09oct2019 |         23        0.07       38.39
  10oct2019 |         20        0.06       38.45
  11oct2019 |         31        0.09       38.54
  12oct2019 |         19        0.05       38.59
  13oct2019 |         16        0.05       38.64
  14oct2019 |         23        0.07       38.70
  15oct2019 |         26        0.07       38.78
  16oct2019 |         23        0.07       38.84
  17oct2019 |         26        0.07       38.92
  18oct2019 |         16        0.05       38.96
  19oct2019 |         25        0.07       39.03
  20oct2019 |         27        0.08       39.11
  21oct2019 |         22        0.06       39.17
  22oct2019 |         18        0.05       39.22
  23oct2019 |         26        0.07       39.30
  24oct2019 |         19        0.05       39.35
  25oct2019 |         21        0.06       39.41
  26oct2019 |         21        0.06       39.47
  27oct2019 |         26        0.07       39.55
  28oct2019 |         21        0.06       39.61
  29oct2019 |         28        0.08       39.68
  30oct2019 |         20        0.06       39.74
  31oct2019 |         12        0.03       39.78
  01nov2019 |         27        0.08       39.85
  02nov2019 |         21        0.06       39.91
  03nov2019 |         22        0.06       39.97
  04nov2019 |         24        0.07       40.04
  05nov2019 |         10        0.03       40.07
  06nov2019 |         19        0.05       40.13
  07nov2019 |         23        0.07       40.19
  08nov2019 |         22        0.06       40.25
  09nov2019 |         26        0.07       40.33
  10nov2019 |         18        0.05       40.38
  11nov2019 |         16        0.05       40.42
  12nov2019 |         17        0.05       40.47
  13nov2019 |         22        0.06       40.54
  14nov2019 |         24        0.07       40.60
  15nov2019 |         29        0.08       40.69
  16nov2019 |         30        0.09       40.77
  17nov2019 |         18        0.05       40.82
  18nov2019 |         24        0.07       40.89
  19nov2019 |         24        0.07       40.96
  20nov2019 |         19        0.05       41.01
  21nov2019 |         21        0.06       41.07
  22nov2019 |         18        0.05       41.12
  23nov2019 |         25        0.07       41.20
  24nov2019 |         18        0.05       41.25
  25nov2019 |         19        0.05       41.30
  26nov2019 |         23        0.07       41.37
  27nov2019 |         22        0.06       41.43
  28nov2019 |         23        0.07       41.49
  29nov2019 |         14        0.04       41.53
  30nov2019 |         23        0.07       41.60
  01dec2019 |         23        0.07       41.66
  02dec2019 |         28        0.08       41.74
  03dec2019 |         23        0.07       41.81
  04dec2019 |         15        0.04       41.85
  05dec2019 |         32        0.09       41.94
  06dec2019 |         28        0.08       42.02
  07dec2019 |         22        0.06       42.09
  08dec2019 |         19        0.05       42.14
  09dec2019 |         17        0.05       42.19
  10dec2019 |         19        0.05       42.24
  11dec2019 |         20        0.06       42.30
  12dec2019 |         21        0.06       42.36
  13dec2019 |         23        0.07       42.42
  14dec2019 |         22        0.06       42.49
  15dec2019 |         18        0.05       42.54
  16dec2019 |         21        0.06       42.60
  17dec2019 |         20        0.06       42.65
  18dec2019 |         20        0.06       42.71
  19dec2019 |         20        0.06       42.77
  20dec2019 |         28        0.08       42.85
  21dec2019 |         23        0.07       42.91
  22dec2019 |         24        0.07       42.98
  23dec2019 |         26        0.07       43.06
  24dec2019 |         13        0.04       43.09
  25dec2019 |         20        0.06       43.15
  26dec2019 |         30        0.09       43.24
  27dec2019 |         17        0.05       43.28
  28dec2019 |         22        0.06       43.35
  29dec2019 |         33        0.09       43.44
  30dec2019 |         20        0.06       43.50
  31dec2019 |         26        0.07       43.57
  01jan2020 |         25        0.07       43.64
  02jan2020 |         25        0.07       43.71
  03jan2020 |         39        0.11       43.82
  04jan2020 |         19        0.05       43.88
  05jan2020 |         13        0.04       43.91
  06jan2020 |         13        0.04       43.95
  07jan2020 |         15        0.04       43.99
  08jan2020 |         19        0.05       44.05
  09jan2020 |         27        0.08       44.13
  10jan2020 |         20        0.06       44.18
  11jan2020 |         21        0.06       44.24
  12jan2020 |         20        0.06       44.30
  13jan2020 |         22        0.06       44.36
  14jan2020 |         26        0.07       44.44
  15jan2020 |         18        0.05       44.49
  16jan2020 |         27        0.08       44.56
  17jan2020 |         23        0.07       44.63
  18jan2020 |         28        0.08       44.71
  19jan2020 |         23        0.07       44.77
  20jan2020 |         16        0.05       44.82
  21jan2020 |         24        0.07       44.89
  22jan2020 |         26        0.07       44.96
  23jan2020 |         21        0.06       45.02
  24jan2020 |         27        0.08       45.10
  25jan2020 |         30        0.09       45.18
  26jan2020 |         21        0.06       45.24
  27jan2020 |         25        0.07       45.31
  28jan2020 |         15        0.04       45.36
  29jan2020 |         21        0.06       45.42
  30jan2020 |         22        0.06       45.48
  31jan2020 |         24        0.07       45.55
  01feb2020 |         23        0.07       45.61
  02feb2020 |         24        0.07       45.68
  03feb2020 |         23        0.07       45.75
  04feb2020 |         20        0.06       45.80
  05feb2020 |         22        0.06       45.87
  06feb2020 |         19        0.05       45.92
  07feb2020 |         24        0.07       45.99
  08feb2020 |         22        0.06       46.05
  09feb2020 |         18        0.05       46.10
  10feb2020 |         19        0.05       46.16
  11feb2020 |         19        0.05       46.21
  12feb2020 |         19        0.05       46.26
  13feb2020 |         25        0.07       46.34
  14feb2020 |         25        0.07       46.41
  15feb2020 |         20        0.06       46.46
  16feb2020 |         17        0.05       46.51
  17feb2020 |         19        0.05       46.57
  18feb2020 |         24        0.07       46.63
  19feb2020 |         23        0.07       46.70
  20feb2020 |         23        0.07       46.77
  21feb2020 |         23        0.07       46.83
  22feb2020 |         26        0.07       46.90
  23feb2020 |         23        0.07       46.97
  24feb2020 |         27        0.08       47.05
  25feb2020 |         30        0.09       47.13
  26feb2020 |         32        0.09       47.22
  27feb2020 |         24        0.07       47.29
  28feb2020 |         24        0.07       47.36
  29feb2020 |         31        0.09       47.45
  01mar2020 |         30        0.09       47.53
  02mar2020 |         21        0.06       47.59
  03mar2020 |         25        0.07       47.66
  04mar2020 |         18        0.05       47.72
  05mar2020 |         22        0.06       47.78
  06mar2020 |         23        0.07       47.84
  07mar2020 |         18        0.05       47.89
  08mar2020 |         29        0.08       47.98
  09mar2020 |         20        0.06       48.03
  10mar2020 |         22        0.06       48.10
  11mar2020 |         30        0.09       48.18
  12mar2020 |         22        0.06       48.24
  13mar2020 |         25        0.07       48.32
  14mar2020 |         28        0.08       48.40
  15mar2020 |         25        0.07       48.47
  16mar2020 |         26        0.07       48.54
  17mar2020 |         31        0.09       48.63
  18mar2020 |         22        0.06       48.69
  19mar2020 |         26        0.07       48.77
  20mar2020 |         21        0.06       48.83
  21mar2020 |         18        0.05       48.88
  22mar2020 |         25        0.07       48.95
  23mar2020 |         18        0.05       49.00
  24mar2020 |         34        0.10       49.10
  25mar2020 |         23        0.07       49.16
  26mar2020 |         32        0.09       49.25
  27mar2020 |         16        0.05       49.30
  28mar2020 |         35        0.10       49.40
  29mar2020 |         31        0.09       49.49
  30mar2020 |         21        0.06       49.54
  31mar2020 |         23        0.07       49.61
  01apr2020 |         23        0.07       49.68
  02apr2020 |         24        0.07       49.74
  03apr2020 |         26        0.07       49.82
  04apr2020 |         20        0.06       49.87
  05apr2020 |         31        0.09       49.96
  06apr2020 |         20        0.06       50.02
  07apr2020 |         29        0.08       50.10
  08apr2020 |         31        0.09       50.19
  09apr2020 |         32        0.09       50.28
  10apr2020 |         23        0.07       50.35
  11apr2020 |         22        0.06       50.41
  12apr2020 |         18        0.05       50.46
  13apr2020 |         27        0.08       50.54
  14apr2020 |         18        0.05       50.59
  15apr2020 |         25        0.07       50.66
  16apr2020 |         24        0.07       50.73
  17apr2020 |         21        0.06       50.79
  18apr2020 |         21        0.06       50.85
  19apr2020 |         21        0.06       50.91
  20apr2020 |         21        0.06       50.97
  21apr2020 |         32        0.09       51.06
  22apr2020 |         27        0.08       51.14
  23apr2020 |         23        0.07       51.20
  24apr2020 |         18        0.05       51.25
  25apr2020 |         29        0.08       51.33
  26apr2020 |         16        0.05       51.38
  27apr2020 |         22        0.06       51.44
  28apr2020 |         24        0.07       51.51
  29apr2020 |         29        0.08       51.59
  30apr2020 |         21        0.06       51.65
  01may2020 |         30        0.09       51.74
  02may2020 |         21        0.06       51.80
  03may2020 |         26        0.07       51.87
  04may2020 |         27        0.08       51.95
  05may2020 |         22        0.06       52.01
  06may2020 |         27        0.08       52.09
  07may2020 |         21        0.06       52.15
  08may2020 |         27        0.08       52.22
  09may2020 |         22        0.06       52.29
  10may2020 |         33        0.09       52.38
  11may2020 |         27        0.08       52.46
  12may2020 |         29        0.08       52.54
  13may2020 |         25        0.07       52.61
  14may2020 |         23        0.07       52.68
  15may2020 |         19        0.05       52.73
  16may2020 |         27        0.08       52.81
  17may2020 |         28        0.08       52.89
  18may2020 |         18        0.05       52.94
  19may2020 |         21        0.06       53.00
  20may2020 |         26        0.07       53.07
  21may2020 |         27        0.08       53.15
  22may2020 |         27        0.08       53.23
  23may2020 |         27        0.08       53.30
  24may2020 |         22        0.06       53.37
  25may2020 |         21        0.06       53.43
  26may2020 |         16        0.05       53.47
  27may2020 |         15        0.04       53.51
  28may2020 |         20        0.06       53.57
  29may2020 |         20        0.06       53.63
  30may2020 |         25        0.07       53.70
  31may2020 |         31        0.09       53.79
  01jun2020 |         25        0.07       53.86
  02jun2020 |         19        0.05       53.91
  03jun2020 |         26        0.07       53.99
  04jun2020 |         25        0.07       54.06
  05jun2020 |         28        0.08       54.14
  06jun2020 |         15        0.04       54.18
  07jun2020 |         22        0.06       54.24
  08jun2020 |         16        0.05       54.29
  09jun2020 |         25        0.07       54.36
  10jun2020 |         22        0.06       54.42
  11jun2020 |         24        0.07       54.49
  12jun2020 |         23        0.07       54.55
  13jun2020 |         21        0.06       54.61
  14jun2020 |         23        0.07       54.68
  15jun2020 |         23        0.07       54.75
  16jun2020 |         31        0.09       54.83
  17jun2020 |         31        0.09       54.92
  18jun2020 |         21        0.06       54.98
  19jun2020 |         31        0.09       55.07
  20jun2020 |         21        0.06       55.13
  21jun2020 |         16        0.05       55.17
  22jun2020 |         28        0.08       55.25
  23jun2020 |         28        0.08       55.33
  24jun2020 |         18        0.05       55.39
  25jun2020 |         22        0.06       55.45
  26jun2020 |         25        0.07       55.52
  27jun2020 |         41        0.12       55.64
  28jun2020 |         23        0.07       55.70
  29jun2020 |         32        0.09       55.79
  30jun2020 |         19        0.05       55.85
  01jul2020 |         25        0.07       55.92
  02jul2020 |         34        0.10       56.01
  03jul2020 |         26        0.07       56.09
  04jul2020 |         34        0.10       56.18
  05jul2020 |         23        0.07       56.25
  06jul2020 |         20        0.06       56.31
  07jul2020 |         22        0.06       56.37
  08jul2020 |         26        0.07       56.44
  09jul2020 |         17        0.05       56.49
  10jul2020 |         21        0.06       56.55
  11jul2020 |         23        0.07       56.62
  12jul2020 |         24        0.07       56.69
  13jul2020 |         19        0.05       56.74
  14jul2020 |         38        0.11       56.85
  15jul2020 |         22        0.06       56.91
  16jul2020 |         23        0.07       56.98
  17jul2020 |         30        0.09       57.06
  18jul2020 |         19        0.05       57.11
  19jul2020 |         32        0.09       57.21
  20jul2020 |         25        0.07       57.28
  21jul2020 |         28        0.08       57.36
  22jul2020 |         29        0.08       57.44
  23jul2020 |         21        0.06       57.50
  24jul2020 |         27        0.08       57.58
  25jul2020 |         25        0.07       57.65
  26jul2020 |         28        0.08       57.73
  27jul2020 |         34        0.10       57.82
  28jul2020 |         27        0.08       57.90
  29jul2020 |         27        0.08       57.98
  30jul2020 |         17        0.05       58.03
  31jul2020 |         27        0.08       58.10
  01aug2020 |         21        0.06       58.16
  02aug2020 |         25        0.07       58.23
  03aug2020 |         31        0.09       58.32
  04aug2020 |         28        0.08       58.40
  05aug2020 |         24        0.07       58.47
  06aug2020 |         21        0.06       58.53
  07aug2020 |         19        0.05       58.58
  08aug2020 |         23        0.07       58.65
  09aug2020 |         17        0.05       58.70
  10aug2020 |         25        0.07       58.77
  11aug2020 |         21        0.06       58.83
  12aug2020 |         13        0.04       58.86
  13aug2020 |         19        0.05       58.92
  14aug2020 |         21        0.06       58.98
  15aug2020 |         21        0.06       59.04
  16aug2020 |         20        0.06       59.09
  17aug2020 |         25        0.07       59.17
  18aug2020 |         28        0.08       59.25
  19aug2020 |         26        0.07       59.32
  20aug2020 |         22        0.06       59.38
  21aug2020 |         25        0.07       59.45
  22aug2020 |         20        0.06       59.51
  23aug2020 |         23        0.07       59.58
  24aug2020 |         29        0.08       59.66
  25aug2020 |         25        0.07       59.73
  26aug2020 |         20        0.06       59.79
  27aug2020 |         27        0.08       59.86
  28aug2020 |         16        0.05       59.91
  29aug2020 |         24        0.07       59.98
  30aug2020 |         20        0.06       60.03
  31aug2020 |         24        0.07       60.10
  01sep2020 |         30        0.09       60.19
  02sep2020 |         29        0.08       60.27
  03sep2020 |         24        0.07       60.34
  04sep2020 |         23        0.07       60.40
  05sep2020 |         17        0.05       60.45
  06sep2020 |         19        0.05       60.51
  07sep2020 |         24        0.07       60.57
  08sep2020 |         28        0.08       60.65
  09sep2020 |         22        0.06       60.72
  10sep2020 |         23        0.07       60.78
  11sep2020 |         25        0.07       60.85
  12sep2020 |         24        0.07       60.92
  13sep2020 |         19        0.05       60.98
  14sep2020 |         21        0.06       61.03
  15sep2020 |         21        0.06       61.09
  16sep2020 |         22        0.06       61.16
  17sep2020 |         17        0.05       61.21
  18sep2020 |         18        0.05       61.26
  19sep2020 |         18        0.05       61.31
  20sep2020 |         19        0.05       61.36
  21sep2020 |         29        0.08       61.44
  22sep2020 |         20        0.06       61.50
  23sep2020 |         18        0.05       61.55
  24sep2020 |         23        0.07       61.62
  25sep2020 |         27        0.08       61.69
  26sep2020 |         23        0.07       61.76
  27sep2020 |         28        0.08       61.84
  28sep2020 |         17        0.05       61.89
  29sep2020 |         21        0.06       61.95
  30sep2020 |         24        0.07       62.02
  01oct2020 |         18        0.05       62.07
  02oct2020 |         20        0.06       62.12
  03oct2020 |         22        0.06       62.19
  04oct2020 |         24        0.07       62.26
  05oct2020 |         22        0.06       62.32
  06oct2020 |         14        0.04       62.36
  07oct2020 |         28        0.08       62.44
  08oct2020 |         28        0.08       62.52
  09oct2020 |         18        0.05       62.57
  10oct2020 |         24        0.07       62.64
  11oct2020 |         27        0.08       62.71
  12oct2020 |         20        0.06       62.77
  13oct2020 |         26        0.07       62.84
  14oct2020 |         23        0.07       62.91
  15oct2020 |         20        0.06       62.97
  16oct2020 |         15        0.04       63.01
  17oct2020 |         24        0.07       63.08
  18oct2020 |         24        0.07       63.15
  19oct2020 |         21        0.06       63.21
  20oct2020 |         14        0.04       63.25
  21oct2020 |         24        0.07       63.31
  22oct2020 |         23        0.07       63.38
  23oct2020 |         24        0.07       63.45
  24oct2020 |         27        0.08       63.52
  25oct2020 |         19        0.05       63.58
  26oct2020 |         18        0.05       63.63
  27oct2020 |         23        0.07       63.69
  28oct2020 |         25        0.07       63.77
  29oct2020 |         25        0.07       63.84
  30oct2020 |         36        0.10       63.94
  31oct2020 |         23        0.07       64.00
  01nov2020 |         18        0.05       64.06
  02nov2020 |         24        0.07       64.12
  03nov2020 |         22        0.06       64.19
  04nov2020 |         20        0.06       64.24
  05nov2020 |         24        0.07       64.31
  06nov2020 |         24        0.07       64.38
  07nov2020 |         26        0.07       64.45
  08nov2020 |         31        0.09       64.54
  09nov2020 |         31        0.09       64.63
  10nov2020 |         27        0.08       64.71
  11nov2020 |         27        0.08       64.78
  12nov2020 |         17        0.05       64.83
  13nov2020 |         22        0.06       64.90
  14nov2020 |         18        0.05       64.95
  15nov2020 |         33        0.09       65.04
  16nov2020 |         19        0.05       65.09
  17nov2020 |         26        0.07       65.17
  18nov2020 |         24        0.07       65.24
  19nov2020 |         20        0.06       65.29
  20nov2020 |         33        0.09       65.39
  21nov2020 |         25        0.07       65.46
  22nov2020 |         20        0.06       65.52
  23nov2020 |         28        0.08       65.60
  24nov2020 |         16        0.05       65.64
  25nov2020 |         21        0.06       65.70
  26nov2020 |         23        0.07       65.77
  27nov2020 |         18        0.05       65.82
  28nov2020 |         20        0.06       65.87
  29nov2020 |         24        0.07       65.94
  30nov2020 |         23        0.07       66.01
  01dec2020 |         25        0.07       66.08
  02dec2020 |         20        0.06       66.14
  03dec2020 |         20        0.06       66.19
  04dec2020 |         18        0.05       66.24
  05dec2020 |         24        0.07       66.31
  06dec2020 |         17        0.05       66.36
  07dec2020 |         21        0.06       66.42
  08dec2020 |         20        0.06       66.48
  09dec2020 |         18        0.05       66.53
  10dec2020 |         25        0.07       66.60
  11dec2020 |         24        0.07       66.67
  12dec2020 |         23        0.07       66.73
  13dec2020 |         33        0.09       66.83
  14dec2020 |         25        0.07       66.90
  15dec2020 |         24        0.07       66.97
  16dec2020 |         26        0.07       67.04
  17dec2020 |         33        0.09       67.13
  18dec2020 |         22        0.06       67.20
  19dec2020 |         26        0.07       67.27
  20dec2020 |         16        0.05       67.32
  21dec2020 |         23        0.07       67.38
  22dec2020 |         16        0.05       67.43
  23dec2020 |         20        0.06       67.48
  24dec2020 |         24        0.07       67.55
  25dec2020 |         20        0.06       67.61
  26dec2020 |         25        0.07       67.68
  27dec2020 |         30        0.09       67.77
  28dec2020 |         27        0.08       67.84
  29dec2020 |         26        0.07       67.92
  30dec2020 |         18        0.05       67.97
  31dec2020 |         24        0.07       68.04
  01jan2021 |         24        0.07       68.10
  02jan2021 |         21        0.06       68.16
  03jan2021 |         13        0.04       68.20
  04jan2021 |         18        0.05       68.25
  05jan2021 |         23        0.07       68.32
  06jan2021 |         16        0.05       68.36
  07jan2021 |         23        0.07       68.43
  08jan2021 |         28        0.08       68.51
  09jan2021 |         26        0.07       68.58
  10jan2021 |         25        0.07       68.65
  11jan2021 |         19        0.05       68.71
  12jan2021 |         23        0.07       68.77
  13jan2021 |         26        0.07       68.85
  14jan2021 |         24        0.07       68.91
  15jan2021 |         23        0.07       68.98
  16jan2021 |         23        0.07       69.05
  17jan2021 |         18        0.05       69.10
  18jan2021 |         26        0.07       69.17
  19jan2021 |         25        0.07       69.24
  20jan2021 |         24        0.07       69.31
  21jan2021 |         23        0.07       69.38
  22jan2021 |         25        0.07       69.45
  23jan2021 |         22        0.06       69.51
  24jan2021 |         17        0.05       69.56
  25jan2021 |         29        0.08       69.64
  26jan2021 |         21        0.06       69.70
  27jan2021 |         31        0.09       69.79
  28jan2021 |         29        0.08       69.87
  29jan2021 |         24        0.07       69.94
  30jan2021 |         26        0.07       70.01
  31jan2021 |         20        0.06       70.07
  01feb2021 |         23        0.07       70.14
  02feb2021 |         22        0.06       70.20
  03feb2021 |         19        0.05       70.25
  04feb2021 |         19        0.05       70.31
  05feb2021 |         26        0.07       70.38
  06feb2021 |         25        0.07       70.45
  07feb2021 |         25        0.07       70.52
  08feb2021 |         24        0.07       70.59
  09feb2021 |         25        0.07       70.66
  10feb2021 |         19        0.05       70.72
  11feb2021 |         18        0.05       70.77
  12feb2021 |         27        0.08       70.84
  13feb2021 |         21        0.06       70.90
  14feb2021 |         29        0.08       70.99
  15feb2021 |         26        0.07       71.06
  16feb2021 |         20        0.06       71.12
  17feb2021 |         23        0.07       71.18
  18feb2021 |         17        0.05       71.23
  19feb2021 |         24        0.07       71.30
  20feb2021 |         30        0.09       71.38
  21feb2021 |         28        0.08       71.46
  22feb2021 |         20        0.06       71.52
  23feb2021 |         21        0.06       71.58
  24feb2021 |         20        0.06       71.64
  25feb2021 |         33        0.09       71.73
  26feb2021 |         17        0.05       71.78
  27feb2021 |         28        0.08       71.86
  28feb2021 |         18        0.05       71.91
  01mar2021 |         28        0.08       71.99
  02mar2021 |         22        0.06       72.05
  03mar2021 |         24        0.07       72.12
  04mar2021 |         21        0.06       72.18
  05mar2021 |         25        0.07       72.25
  06mar2021 |         24        0.07       72.32
  07mar2021 |         23        0.07       72.39
  08mar2021 |         25        0.07       72.46
  09mar2021 |         19        0.05       72.51
  10mar2021 |         22        0.06       72.57
  11mar2021 |         23        0.07       72.64
  12mar2021 |         15        0.04       72.68
  13mar2021 |         22        0.06       72.74
  14mar2021 |         26        0.07       72.82
  15mar2021 |         34        0.10       72.91
  16mar2021 |         29        0.08       73.00
  17mar2021 |         24        0.07       73.07
  18mar2021 |         21        0.06       73.13
  19mar2021 |         25        0.07       73.20
  20mar2021 |         21        0.06       73.26
  21mar2021 |         21        0.06       73.32
  22mar2021 |         16        0.05       73.36
  23mar2021 |         28        0.08       73.44
  24mar2021 |         20        0.06       73.50
  25mar2021 |         30        0.09       73.58
  26mar2021 |         19        0.05       73.64
  27mar2021 |         21        0.06       73.70
  28mar2021 |         21        0.06       73.76
  29mar2021 |         21        0.06       73.82
  30mar2021 |         33        0.09       73.91
  31mar2021 |         24        0.07       73.98
  01apr2021 |         20        0.06       74.04
  02apr2021 |         26        0.07       74.11
  03apr2021 |         25        0.07       74.18
  04apr2021 |         22        0.06       74.24
  05apr2021 |         28        0.08       74.32
  06apr2021 |         28        0.08       74.40
  07apr2021 |         19        0.05       74.46
  08apr2021 |         27        0.08       74.53
  09apr2021 |         23        0.07       74.60
  10apr2021 |         25        0.07       74.67
  11apr2021 |         26        0.07       74.74
  12apr2021 |         30        0.09       74.83
  13apr2021 |         22        0.06       74.89
  14apr2021 |         18        0.05       74.94
  15apr2021 |         27        0.08       75.02
  16apr2021 |         17        0.05       75.07
  17apr2021 |         22        0.06       75.13
  18apr2021 |         26        0.07       75.20
  19apr2021 |         37        0.11       75.31
  20apr2021 |         22        0.06       75.37
  21apr2021 |         15        0.04       75.42
  22apr2021 |          9        0.03       75.44
  23apr2021 |         16        0.05       75.49
  24apr2021 |         18        0.05       75.54
  25apr2021 |         15        0.04       75.58
  26apr2021 |         33        0.09       75.67
  27apr2021 |         27        0.08       75.75
  28apr2021 |         24        0.07       75.82
  29apr2021 |         24        0.07       75.89
  30apr2021 |         20        0.06       75.94
  01may2021 |         22        0.06       76.01
  02may2021 |         17        0.05       76.06
  03may2021 |         23        0.07       76.12
  04may2021 |         22        0.06       76.18
  05may2021 |         28        0.08       76.26
  06may2021 |         24        0.07       76.33
  07may2021 |         25        0.07       76.40
  08may2021 |         26        0.07       76.48
  09may2021 |         26        0.07       76.55
  10may2021 |         22        0.06       76.61
  11may2021 |         22        0.06       76.68
  12may2021 |         14        0.04       76.72
  13may2021 |         27        0.08       76.79
  14may2021 |         25        0.07       76.86
  15may2021 |         28        0.08       76.94
  16may2021 |         22        0.06       77.01
  17may2021 |         22        0.06       77.07
  18may2021 |         14        0.04       77.11
  19may2021 |         21        0.06       77.17
  20may2021 |         28        0.08       77.25
  21may2021 |         23        0.07       77.31
  22may2021 |         22        0.06       77.38
  23may2021 |         16        0.05       77.42
  24may2021 |         15        0.04       77.46
  25may2021 |         19        0.05       77.52
  26may2021 |         25        0.07       77.59
  27may2021 |         30        0.09       77.67
  28may2021 |         25        0.07       77.75
  29may2021 |         24        0.07       77.81
  30may2021 |         24        0.07       77.88
  31may2021 |         26        0.07       77.96
  01jun2021 |         37        0.11       78.06
  02jun2021 |         20        0.06       78.12
  03jun2021 |         17        0.05       78.17
  04jun2021 |         22        0.06       78.23
  05jun2021 |         22        0.06       78.29
  06jun2021 |         14        0.04       78.33
  07jun2021 |         21        0.06       78.39
  08jun2021 |         14        0.04       78.43
  09jun2021 |         23        0.07       78.50
  10jun2021 |         24        0.07       78.56
  11jun2021 |         28        0.08       78.64
  12jun2021 |         22        0.06       78.71
  13jun2021 |         28        0.08       78.79
  14jun2021 |         24        0.07       78.85
  15jun2021 |         28        0.08       78.93
  16jun2021 |         25        0.07       79.01
  17jun2021 |         23        0.07       79.07
  18jun2021 |         32        0.09       79.16
  19jun2021 |         22        0.06       79.22
  20jun2021 |         22        0.06       79.29
  21jun2021 |         15        0.04       79.33
  22jun2021 |         21        0.06       79.39
  23jun2021 |         25        0.07       79.46
  24jun2021 |         16        0.05       79.51
  25jun2021 |         23        0.07       79.57
  26jun2021 |         16        0.05       79.62
  27jun2021 |         29        0.08       79.70
  28jun2021 |         22        0.06       79.76
  29jun2021 |         16        0.05       79.81
  30jun2021 |         19        0.05       79.86
  01jul2021 |         26        0.07       79.94
  02jul2021 |         22        0.06       80.00
  03jul2021 |         29        0.08       80.08
  04jul2021 |         30        0.09       80.17
  05jul2021 |         26        0.07       80.24
  06jul2021 |         21        0.06       80.30
  07jul2021 |         20        0.06       80.36
  08jul2021 |         23        0.07       80.42
  09jul2021 |         18        0.05       80.47
  10jul2021 |         16        0.05       80.52
  11jul2021 |         22        0.06       80.58
  12jul2021 |         40        0.11       80.70
  13jul2021 |         33        0.09       80.79
  14jul2021 |         24        0.07       80.86
  15jul2021 |         22        0.06       80.92
  16jul2021 |         25        0.07       80.99
  17jul2021 |         14        0.04       81.03
  18jul2021 |         31        0.09       81.12
  19jul2021 |         24        0.07       81.19
  20jul2021 |         30        0.09       81.27
  21jul2021 |         18        0.05       81.32
  22jul2021 |         22        0.06       81.39
  23jul2021 |         38        0.11       81.49
  24jul2021 |         22        0.06       81.56
  25jul2021 |         23        0.07       81.62
  26jul2021 |         24        0.07       81.69
  27jul2021 |         15        0.04       81.73
  28jul2021 |         31        0.09       81.82
  29jul2021 |         31        0.09       81.91
  30jul2021 |         32        0.09       82.00
  31jul2021 |         27        0.08       82.08
  01aug2021 |         24        0.07       82.15
  02aug2021 |         16        0.05       82.19
  03aug2021 |         23        0.07       82.26
  04aug2021 |         25        0.07       82.33
  05aug2021 |         26        0.07       82.40
  06aug2021 |         32        0.09       82.49
  07aug2021 |         25        0.07       82.56
  08aug2021 |         28        0.08       82.64
  09aug2021 |         26        0.07       82.72
  10aug2021 |         22        0.06       82.78
  11aug2021 |         18        0.05       82.83
  12aug2021 |         27        0.08       82.91
  13aug2021 |         18        0.05       82.96
  14aug2021 |         24        0.07       83.03
  15aug2021 |         20        0.06       83.08
  16aug2021 |         20        0.06       83.14
  17aug2021 |         20        0.06       83.20
  18aug2021 |         19        0.05       83.25
  19aug2021 |         22        0.06       83.32
  20aug2021 |         27        0.08       83.39
  21aug2021 |         31        0.09       83.48
  22aug2021 |         25        0.07       83.55
  23aug2021 |         21        0.06       83.61
  24aug2021 |         19        0.05       83.67
  25aug2021 |         20        0.06       83.72
  26aug2021 |         36        0.10       83.82
  27aug2021 |         25        0.07       83.90
  28aug2021 |         26        0.07       83.97
  29aug2021 |         27        0.08       84.05
  30aug2021 |         27        0.08       84.12
  31aug2021 |         26        0.07       84.20
  01sep2021 |         22        0.06       84.26
  02sep2021 |         22        0.06       84.32
  03sep2021 |         19        0.05       84.38
  04sep2021 |         22        0.06       84.44
  05sep2021 |         12        0.03       84.47
  06sep2021 |         29        0.08       84.56
  07sep2021 |         21        0.06       84.62
  08sep2021 |         23        0.07       84.68
  09sep2021 |         16        0.05       84.73
  10sep2021 |         25        0.07       84.80
  11sep2021 |         27        0.08       84.87
  12sep2021 |         24        0.07       84.94
  13sep2021 |         23        0.07       85.01
  14sep2021 |         28        0.08       85.09
  15sep2021 |         26        0.07       85.16
  16sep2021 |         19        0.05       85.22
  17sep2021 |         28        0.08       85.30
  18sep2021 |         27        0.08       85.37
  19sep2021 |         23        0.07       85.44
  20sep2021 |         14        0.04       85.48
  21sep2021 |         27        0.08       85.55
  22sep2021 |         22        0.06       85.62
  23sep2021 |         20        0.06       85.67
  24sep2021 |         28        0.08       85.75
  25sep2021 |         25        0.07       85.82
  26sep2021 |         26        0.07       85.90
  27sep2021 |         19        0.05       85.95
  28sep2021 |         28        0.08       86.03
  29sep2021 |         20        0.06       86.09
  30sep2021 |         33        0.09       86.18
  01oct2021 |         16        0.05       86.23
  02oct2021 |         27        0.08       86.31
  03oct2021 |         28        0.08       86.38
  04oct2021 |         33        0.09       86.48
  05oct2021 |         33        0.09       86.57
  06oct2021 |         19        0.05       86.63
  07oct2021 |         23        0.07       86.69
  08oct2021 |         19        0.05       86.75
  09oct2021 |         24        0.07       86.81
  10oct2021 |         22        0.06       86.88
  11oct2021 |         24        0.07       86.95
  12oct2021 |         30        0.09       87.03
  13oct2021 |         25        0.07       87.10
  14oct2021 |         22        0.06       87.16
  15oct2021 |         22        0.06       87.23
  16oct2021 |         28        0.08       87.31
  17oct2021 |         22        0.06       87.37
  18oct2021 |         25        0.07       87.44
  19oct2021 |         16        0.05       87.49
  20oct2021 |         23        0.07       87.55
  21oct2021 |         20        0.06       87.61
  22oct2021 |         25        0.07       87.68
  23oct2021 |         15        0.04       87.72
  24oct2021 |         23        0.07       87.79
  25oct2021 |         23        0.07       87.85
  26oct2021 |         23        0.07       87.92
  27oct2021 |         22        0.06       87.98
  28oct2021 |         22        0.06       88.04
  29oct2021 |         30        0.09       88.13
  30oct2021 |         16        0.05       88.17
  31oct2021 |         27        0.08       88.25
  01nov2021 |         17        0.05       88.30
  02nov2021 |         18        0.05       88.35
  03nov2021 |         19        0.05       88.40
  04nov2021 |         25        0.07       88.48
  05nov2021 |         22        0.06       88.54
  06nov2021 |         28        0.08       88.62
  07nov2021 |         19        0.05       88.67
  08nov2021 |         22        0.06       88.73
  09nov2021 |         21        0.06       88.79
  10nov2021 |         29        0.08       88.88
  11nov2021 |         22        0.06       88.94
  12nov2021 |         23        0.07       89.00
  13nov2021 |         28        0.08       89.08
  14nov2021 |         24        0.07       89.15
  15nov2021 |         22        0.06       89.22
  16nov2021 |         27        0.08       89.29
  17nov2021 |         20        0.06       89.35
  18nov2021 |         28        0.08       89.43
  19nov2021 |         25        0.07       89.50
  20nov2021 |         23        0.07       89.57
  21nov2021 |         20        0.06       89.62
  22nov2021 |         29        0.08       89.70
  23nov2021 |         24        0.07       89.77
  24nov2021 |         26        0.07       89.85
  25nov2021 |         22        0.06       89.91
  26nov2021 |         24        0.07       89.98
  27nov2021 |         17        0.05       90.03
  28nov2021 |         17        0.05       90.07
  29nov2021 |         26        0.07       90.15
  30nov2021 |         30        0.09       90.23
  01dec2021 |         20        0.06       90.29
  02dec2021 |         25        0.07       90.36
  03dec2021 |         29        0.08       90.44
  04dec2021 |         22        0.06       90.51
  05dec2021 |         26        0.07       90.58
  06dec2021 |         25        0.07       90.65
  07dec2021 |         22        0.06       90.71
  08dec2021 |         16        0.05       90.76
  09dec2021 |         20        0.06       90.82
  10dec2021 |          9        0.03       90.84
  11dec2021 |         20        0.06       90.90
  12dec2021 |         18        0.05       90.95
  13dec2021 |         30        0.09       91.04
  14dec2021 |         29        0.08       91.12
  15dec2021 |         25        0.07       91.19
  16dec2021 |         16        0.05       91.24
  17dec2021 |         20        0.06       91.29
  18dec2021 |         19        0.05       91.35
  19dec2021 |         17        0.05       91.39
  20dec2021 |         20        0.06       91.45
  21dec2021 |         20        0.06       91.51
  22dec2021 |         31        0.09       91.60
  23dec2021 |         25        0.07       91.67
  24dec2021 |         28        0.08       91.75
  25dec2021 |         31        0.09       91.84
  26dec2021 |         25        0.07       91.91
  27dec2021 |         33        0.09       92.00
  28dec2021 |         23        0.07       92.07
  29dec2021 |         22        0.06       92.13
  30dec2021 |         25        0.07       92.20
  31dec2021 |         19        0.05       92.25
  01jan2022 |         29        0.08       92.34
  02jan2022 |         26        0.07       92.41
  03jan2022 |         18        0.05       92.46
  04jan2022 |         24        0.07       92.53
  05jan2022 |         22        0.06       92.59
  06jan2022 |         24        0.07       92.66
  07jan2022 |         28        0.08       92.74
  08jan2022 |         26        0.07       92.81
  09jan2022 |         29        0.08       92.90
  10jan2022 |         22        0.06       92.96
  11jan2022 |         19        0.05       93.01
  12jan2022 |         21        0.06       93.07
  13jan2022 |         20        0.06       93.13
  14jan2022 |         26        0.07       93.20
  15jan2022 |         26        0.07       93.28
  16jan2022 |         18        0.05       93.33
  17jan2022 |         23        0.07       93.39
  18jan2022 |         22        0.06       93.46
  19jan2022 |         27        0.08       93.53
  20jan2022 |         20        0.06       93.59
  21jan2022 |         28        0.08       93.67
  22jan2022 |         18        0.05       93.72
  23jan2022 |         17        0.05       93.77
  24jan2022 |         26        0.07       93.84
  25jan2022 |         20        0.06       93.90
  26jan2022 |         28        0.08       93.98
  27jan2022 |         16        0.05       94.03
  28jan2022 |         30        0.09       94.11
  29jan2022 |         34        0.10       94.21
  30jan2022 |         29        0.08       94.29
  31jan2022 |         22        0.06       94.35
  01feb2022 |         16        0.05       94.40
  02feb2022 |         30        0.09       94.48
  03feb2022 |         22        0.06       94.55
  04feb2022 |         22        0.06       94.61
  05feb2022 |         21        0.06       94.67
  06feb2022 |         34        0.10       94.77
  07feb2022 |         21        0.06       94.83
  08feb2022 |         13        0.04       94.86
  09feb2022 |         17        0.05       94.91
  10feb2022 |         25        0.07       94.98
  11feb2022 |         18        0.05       95.03
  12feb2022 |         31        0.09       95.12
  13feb2022 |         17        0.05       95.17
  14feb2022 |         26        0.07       95.24
  15feb2022 |         22        0.06       95.31
  16feb2022 |         24        0.07       95.37
  17feb2022 |         21        0.06       95.43
  18feb2022 |         20        0.06       95.49
  19feb2022 |         25        0.07       95.56
  20feb2022 |         25        0.07       95.63
  21feb2022 |         21        0.06       95.69
  22feb2022 |         23        0.07       95.76
  23feb2022 |         17        0.05       95.81
  24feb2022 |         28        0.08       95.89
  25feb2022 |         22        0.06       95.95
  26feb2022 |         23        0.07       96.01
  27feb2022 |         24        0.07       96.08
  28feb2022 |         30        0.09       96.17
  01mar2022 |         19        0.05       96.22
  02mar2022 |         29        0.08       96.30
  03mar2022 |         14        0.04       96.34
  04mar2022 |         28        0.08       96.42
  05mar2022 |         20        0.06       96.48
  06mar2022 |         12        0.03       96.52
  07mar2022 |         23        0.07       96.58
  08mar2022 |         19        0.05       96.63
  09mar2022 |         31        0.09       96.72
  10mar2022 |         24        0.07       96.79
  11mar2022 |         20        0.06       96.85
  12mar2022 |         19        0.05       96.90
  13mar2022 |         29        0.08       96.98
  14mar2022 |         30        0.09       97.07
  15mar2022 |         21        0.06       97.13
  16mar2022 |         21        0.06       97.19
  17mar2022 |         18        0.05       97.24
  18mar2022 |         21        0.06       97.30
  19mar2022 |         25        0.07       97.37
  20mar2022 |         24        0.07       97.44
  21mar2022 |         28        0.08       97.52
  22mar2022 |         25        0.07       97.59
  23mar2022 |         25        0.07       97.66
  24mar2022 |         32        0.09       97.75
  25mar2022 |         26        0.07       97.83
  26mar2022 |         20        0.06       97.88
  27mar2022 |         21        0.06       97.94
  28mar2022 |         24        0.07       98.01
  29mar2022 |         25        0.07       98.08
  30mar2022 |         22        0.06       98.15
  31mar2022 |         31        0.09       98.23
  01apr2022 |         37        0.11       98.34
  02apr2022 |         31        0.09       98.43
  03apr2022 |         21        0.06       98.49
  04apr2022 |         20        0.06       98.54
  05apr2022 |         32        0.09       98.63
  06apr2022 |         23        0.07       98.70
  07apr2022 |         26        0.07       98.77
  08apr2022 |         26        0.07       98.85
  09apr2022 |         26        0.07       98.92
  10apr2022 |         15        0.04       98.96
  11apr2022 |         23        0.07       99.03
  12apr2022 |         19        0.05       99.08
  13apr2022 |         23        0.07       99.15
  14apr2022 |         22        0.06       99.21
  15apr2022 |         24        0.07       99.28
  16apr2022 |         18        0.05       99.33
  17apr2022 |         26        0.07       99.41
  18apr2022 |         15        0.04       99.45
  19apr2022 |         25        0.07       99.52
  20apr2022 |         21        0.06       99.58
  21apr2022 |         22        0.06       99.64
  22apr2022 |         26        0.07       99.72
  23apr2022 |         29        0.08       99.80
  24apr2022 |         30        0.09       99.88
  25apr2022 |         29        0.08       99.97
  26apr2022 |         12        0.03      100.00
------------+-----------------------------------
      Total |     35,152      100.00

. 
. **GP appointments
. tab last_gp_refrheum //proportion with last GP appointment in year before rhe
> um referral (pre-rheum appt); requires there to have been a rheum referral, b
> efore a rheum appt, before an EIA code

last_gp_ref |
      rheum |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,528        9.94        9.94
          1 |     31,981       90.06      100.00
------------+-----------------------------------
      Total |     35,509      100.00

. gen all_appts=1 if last_gp_refrheum==1 & referral_rheum_prerheum==1 & rheum_a
> ppt==1 & eia_code==1 & last_gp_refrheum_date<=referral_rheum_prerheum_date & 
> referral_rheum_prerheum_date<=rheum_appt_date & rheum_appt_date<=eia_code_dat
> e 
(34,484 missing values generated)

. recode all_appts .=0
(all_appts: 34484 changes made)

. tab all_appts, missing //KEY - proportion who had a last gp appt, then rheum 
> ref, then rheum appt, then EIA code 

  all_appts |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     34,484       97.11       97.11
          1 |      1,025        2.89      100.00
------------+-----------------------------------
      Total |     35,509      100.00

. tab last_gp_refcode //last GP appointment before rheum ref (i.e. pre-eia code
>  ref); requires there to have been a rheum referral before an EIA code (i.e. 
> rheum appt could have been missing)

last_gp_ref |
       code |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,547        9.99        9.99
          1 |     31,962       90.01      100.00
------------+-----------------------------------
      Total |     35,509      100.00

. tab last_gp_prerheum //last GP appointment before rheum appt; requires there 
> to have been a rheum appt before and EIA code

last_gp_pre |
      rheum |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,569       10.05       10.05
          1 |     31,940       89.95      100.00
------------+-----------------------------------
      Total |     35,509      100.00

. tab last_gp_precode //last GP appointment before EIA code

last_gp_pre |
       code |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,563       10.03       10.03
          1 |     31,946       89.97      100.00
------------+-----------------------------------
      Total |     35,509      100.00

. 
. **For sensitivity analyses for those without rheum_appt, replace diagnosis da
> te as EIA code date if rheum appt pre-code is missing or after
. gen eia_diagnosis_date_nomiss=rheum_appt_date if rheum_appt_date!=.
(11,022 missing values generated)

. format %td eia_diagnosis_date_nomiss

. replace eia_diagnosis_date_nomiss=eia_code_date if (rheum_appt_date==. | rheu
> m_appt_date>eia_code_date) & eia_code_date!=.
(11,898 real changes made)

. gen eia_diagnosis_nomiss=1 if eia_diagnosis_date_nomiss!=.

. recode eia_diagnosis_nomiss .=0
(eia_diagnosis_nomiss: 0 changes made)

. tab eia_diagnosis_nomiss

eia_diagnos |
  is_nomiss |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     35,509      100.00      100.00
------------+-----------------------------------
      Total |     35,509      100.00

. 
. *Time to referral, appointment and EIA code==================================
> ===========*/
. 
. **Time from last GP to rheum ref before rheum appt (i.e. if appts are present
>  and in correct time order) //Note - referral could (in theory) be coded just
>  before GP appt
. gen time_gp_rheum_ref_appt = (referral_rheum_prerheum_date - last_gp_refrheum
> _date) if referral_rheum_prerheum_date!=. & last_gp_refrheum_date!=. & rheum_
> appt_date!=. & referral_rheum_prerheum_date>=last_gp_refrheum_date & referral
> _rheum_prerheum_date<=rheum_appt_date & rheum_appt_date<=eia_code_date
(34,484 missing values generated)

. tabstat time_gp_rheum_ref_appt, stats (n mean p50 p25 p75) //all patients (sh
> ould be same number as all_appts)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~t |      1025  231.8312       174        75       346
----------------------------------------------------------------

. 
. gen gp_ref_cat=1 if time_gp_rheum_ref_appt<=3 & time_gp_rheum_ref_appt!=. 
(35,489 missing values generated)

. replace gp_ref_cat=2 if time_gp_rheum_ref_appt<=7 & time_gp_rheum_ref_appt!=.
>  & gp_ref_cat==.
(24 real changes made)

. replace gp_ref_cat=3 if time_gp_rheum_ref_appt>7 & time_gp_rheum_ref_appt!=. 
> & gp_ref_cat==.
(981 real changes made)

. lab define gp_ref_cat 1 "Referred within 3 days" 2 "Referred within 7 days" 3
>  "Referral delay >7 days", modify

. lab val gp_ref_cat gp_ref_cat

. lab var gp_ref_cat "Time to GP referral"

. tab gp_ref_cat, missing

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |         20        0.06        0.06
Referred within 7 days |         24        0.07        0.12
Referral delay >7 days |        981        2.76        2.89
                     . |     34,484       97.11      100.00
-----------------------+-----------------------------------
                 Total |     35,509      100.00

. 
. gen gp_ref_3d=1 if time_gp_rheum_ref_appt<=3 & time_gp_rheum_ref_appt!=. 
(35,489 missing values generated)

. replace gp_ref_3d=2 if time_gp_rheum_ref_appt>3 & time_gp_rheum_ref_appt!=.
(1,005 real changes made)

. lab define gp_ref_3d 1 "Referred within 3 days" 2 "Referral delay >3 days", m
> odify

. lab val gp_ref_3d gp_ref_3d

. lab var gp_ref_3d "Time to GP referral"

. tab gp_ref_3d, missing

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |         20        0.06        0.06
Referral delay >3 days |      1,005        2.83        2.89
                     . |     34,484       97.11      100.00
-----------------------+-----------------------------------
                 Total |     35,509      100.00

. 
. **Time from last GP to rheum ref before eia code (sensitivity analysis; inclu
> des those with no rheum appt)
. gen time_gp_rheum_ref_code = (referral_rheum_precode_date - last_gp_refcode_d
> ate) if referral_rheum_precode_date!=. & last_gp_refcode_date!=. & referral_r
> heum_precode_date>=last_gp_refcode_date & referral_rheum_precode_date<=eia_co
> de_date
(29,808 missing values generated)

. tabstat time_gp_rheum_ref_code, stats (n mean p50 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~e |      5701    366.18       303       139       535
----------------------------------------------------------------

. 
. **Time from last GP to rheum ref (combined - sensitivity analysis; includes t
> hose with no rheum appt)
. gen time_gp_rheum_ref_comb = time_gp_rheum_ref_appt 
(34,484 missing values generated)

. replace time_gp_rheum_ref_comb = time_gp_rheum_ref_code if time_gp_rheum_ref_
> appt==. & time_gp_rheum_ref_code!=.
(5,470 real changes made)

. tabstat time_gp_rheum_ref_comb, stats (n mean p50 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~b |      6495  345.2547       281       126       506
----------------------------------------------------------------

. 
. **Time from last GP pre-rheum appt to first rheum appt (key sensitivity analy
> sis; includes those with no rheum ref)
. gen time_gp_rheum_appt = (rheum_appt_date - last_gp_prerheum_date) if rheum_a
> ppt_date!=. & last_gp_prerheum_date!=. & rheum_appt_date>=last_gp_prerheum_da
> te & rheum_appt_date<=eia_code_date
(29,906 missing values generated)

. tabstat time_gp_rheum_appt, stats (n mean p50 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_~m_appt |      5603  290.8836       236       107       420
----------------------------------------------------------------

. 
. **Time from last GP pre-code to EIA code (sensitivity analysis; includes thos
> e with no rheum ref and/or no rheum appt)
. gen time_gp_eia_code = (eia_code_date - last_gp_precode_date) if eia_code_dat
> e!=. & last_gp_precode_date!=. & eia_code_date>=last_gp_precode_date
(16,451 missing values generated)

. tabstat time_gp_eia_code, stats (n mean p50 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_ei~e |     19058    500.73       448       224       733
----------------------------------------------------------------

. 
. **Time from last GP to EIA diagnosis (combined - sensitivity analysis; includ
> es those with no rheum appt)
. gen time_gp_eia_diag = time_gp_rheum_appt
(29,906 missing values generated)

. replace time_gp_eia_diag = time_gp_eia_code if time_gp_rheum_appt==. & time_g
> p_eia_code!=.
(15,610 real changes made)

. tabstat time_gp_eia_diag, stats (n mean p50 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_ei~g |     21213  437.7065       371       173       644
----------------------------------------------------------------

. 
. **Time from rheum ref to rheum appt (i.e. if appts are present and in correct
>  time order)
. gen time_ref_rheum_appt = (rheum_appt_date - referral_rheum_prerheum_date) if
>  rheum_appt_date!=. & referral_rheum_prerheum_date!=. & referral_rheum_prerhe
> um_date<=rheum_appt_date & rheum_appt_date<=eia_code_date
(29,972 missing values generated)

. tabstat time_ref_rheum_appt, stats (n mean p50 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~t |      5537  289.7919       232       110       411
----------------------------------------------------------------

. 
. gen ref_appt_cat=1 if time_ref_rheum_appt<=21 & time_ref_rheum_appt!=. 
(35,213 missing values generated)

. replace ref_appt_cat=2 if time_ref_rheum_appt<=42 & time_ref_rheum_appt!=. & 
> ref_appt_cat==.
(256 real changes made)

. replace ref_appt_cat=3 if time_ref_rheum_appt>42 & time_ref_rheum_appt!=. & r
> ef_appt_cat==.
(4,985 real changes made)

. lab define ref_appt_cat 1 "Seen within 3 weeks" 2 "Seen within 6 weeks" 3 "As
> sessment delay >6 weeks", modify

. lab val ref_appt_cat ref_appt_cat

. lab var ref_appt_cat "Time to rheumatology assessment"

. tab ref_appt_cat, missing

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |        296        0.83        0.83
      Seen within 6 weeks |        256        0.72        1.55
Assessment delay >6 weeks |      4,985       14.04       15.59
                        . |     29,972       84.41      100.00
--------------------------+-----------------------------------
                    Total |     35,509      100.00

. 
. gen ref_appt_3w=1 if time_ref_rheum_appt<=21 & time_ref_rheum_appt!=. 
(35,213 missing values generated)

. replace ref_appt_3w=2 if time_ref_rheum_appt>21 & time_ref_rheum_appt!=.
(5,241 real changes made)

. lab define ref_appt_3w 1 "Seen within 3 weeks" 2 "Assessment delay >3 weeks",
>  modify

. lab val ref_appt_3w ref_appt_3w

. lab var ref_appt_3w "Time to rheumatology assessment"

. tab ref_appt_3w, missing

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |        296        0.83        0.83
Assessment delay >3 weeks |      5,241       14.76       15.59
                        . |     29,972       84.41      100.00
--------------------------+-----------------------------------
                    Total |     35,509      100.00

. 
. **Time from rheum ref or last GP to rheum appt (combined - sensitivity analys
> is; includes those with no rheum ref)
. gen time_refgp_rheum_appt = time_ref_rheum_appt
(29,972 missing values generated)

. replace time_refgp_rheum_appt = time_gp_rheum_appt if time_ref_rheum_appt==. 
> & time_gp_rheum_appt!=.
(3,644 real changes made)

. tabstat time_refgp_rheum_appt, stats (n mean p50 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_refgp~t |      9181   275.113       220       102       393
----------------------------------------------------------------

. 
. **Time from rheum ref to EIA code (sensitivity analysis; includes those with 
> no rheum appt)
. gen time_ref_rheum_eia = (eia_code_date - referral_rheum_precode_date) if eia
> _code_date!=. & referral_rheum_precode_date!=. & referral_rheum_precode_date<
> =eia_code_date  
(16,582 missing values generated)

. tabstat time_ref_rheum_eia, stats (n mean p50 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~a |     18927  503.9145       452       227       740
----------------------------------------------------------------

. 
. **Time from rheum ref to EIA diagnosis (combined - sensitivity analysis; incl
> udes those with no rheum appt)
. gen time_ref_rheum_eia_comb = time_ref_rheum_appt
(29,972 missing values generated)

. replace time_ref_rheum_eia_comb = time_ref_rheum_eia if time_ref_rheum_appt==
> . & time_ref_rheum_eia!=.
(15,539 real changes made)

. tabstat time_ref_rheum_eia_comb, stats (n mean p50 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~b |     21076  438.8386       372       177       645
----------------------------------------------------------------

. 
. **Time from rheum appt to EIA code (i.e. if appts are present and in correct 
> time order)
. gen time_rheum_eia_code = (eia_code_date - rheum_appt_date) if eia_code_date!
> =. & rheum_appt_date!=. & rheum_appt_date<=eia_code_date 
(11,898 missing values generated)

. tabstat time_rheum_eia_code, stats (n mean p50 p25 p75) 

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_rheum~e |     23611  566.5437       535       294       817
----------------------------------------------------------------

. 
. *Time to first csDMARD prescriptions - all of the below are shared care presc
> riptions, aside from those with MTX_high cost drug data included=============
> =========================================================*/
. 
. *All patients below must have at least six months of GP registration after EI
> A code
. 
. **Time to first csDMARD script for RA patients, whereby first rheum appt is c
> lassed as diagnosis date (if rheum appt present and before csDMARD date; not 
> including high cost MTX prescriptions)
. gen time_to_csdmard=(csdmard_date-rheum_appt_date) if csdmard==1 & rheum_appt
> _date!=. & csdmard_date>=rheum_appt_date 
(26,420 missing values generated)

. tabstat time_to_csdmard if ra_code==1 & has_6m_follow_up==1, stats (n mean p5
> 0 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_cs~d |      2938  590.3792       559       307       840
----------------------------------------------------------------

. 
. **Time to first csDMARD script for RA patients (including high cost MTX presc
> riptions)
. gen time_to_csdmard_hcd=(csdmard_hcd_date-rheum_appt_date) if csdmard_hcd==1 
> & rheum_appt_date!=. & csdmard_hcd_date>=rheum_appt_date 
(25,176 missing values generated)

. tabstat time_to_csdmard_hcd if ra_code==1 & has_6m_follow_up==1, stats (n mea
> n p50 p25 p75) 

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_c~cd |      3334  580.2244       541       298       826
----------------------------------------------------------------

. 
. **Time to first csDMARD script for PsA patients (not including high cost MTX 
> prescriptions)
. tabstat time_to_csdmard if psa_code==1 & has_6m_follow_up==1, stats (n mean p
> 50 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_c~rd |      2832  593.4601       558       326       850
----------------------------------------------------------------

. 
. **Time to first csDMARD script for PsA patients (including high cost MTX pres
> criptions)
. tabstat time_to_csdmard_hcd if psa_code==1 & has_6m_follow_up==1, stats (n me
> an p50 p25 p75) 

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_c~cd |      3216  586.6437       551       322     834.5
----------------------------------------------------------------

. 
. **csDMARD time categories for RA patients (not including high cost MTX prescr
> iptions)
. gen csdmard_3m=1 if time_to_csdmard<=90 & time_to_csdmard!=. 
(34,952 missing values generated)

. replace csdmard_3m=2 if time_to_csdmard>90 & time_to_csdmard!=.
(8,532 real changes made)

. lab define csdmard_3m 1 "Yes" 2 "No", modify

. lab val csdmard_3m csdmard_3m

. lab var csdmard_3m "csDMARD within 3 months" 

. tab csdmard_3m if ra_code==1 & has_6m_follow_up==1, missing //missing will be
>  patients with no rheum appt and/or rheum appt after csDMARD script

    csDMARD |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        185        1.63        1.63
         No |      2,753       24.20       25.83
          . |      8,437       74.17      100.00
------------+-----------------------------------
      Total |     11,375      100.00

. gen csdmard_6m=1 if time_to_csdmard<=180 & time_to_csdmard!=. 
(34,323 missing values generated)

. replace csdmard_6m=2 if time_to_csdmard>180 & time_to_csdmard!=.
(7,903 real changes made)

. lab define csdmard_6m 1 "Yes" 2 "No", modify

. lab val csdmard_6m csdmard_6m

. lab var csdmard_6m "csDMARD within 6 months" 

. tab csdmard_6m if ra_code==1 & has_6m_follow_up==1, missing //missing will be
>  patients with no rheum appt and/or rheum appt after csDMARD script

    csDMARD |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        388        3.41        3.41
         No |      2,550       22.42       25.83
          . |      8,437       74.17      100.00
------------+-----------------------------------
      Total |     11,375      100.00

. gen csdmard_12m=1 if time_to_csdmard<=365 & time_to_csdmard!=. 
(32,721 missing values generated)

. replace csdmard_12m=2 if time_to_csdmard>365 & time_to_csdmard!=.
(6,301 real changes made)

. lab define csdmard_12m 1 "Yes" 2 "No", modify

. lab val csdmard_12m csdmard_12m

. lab var csdmard_12m "csDMARD within 12 months" 

. tab csdmard_12m if ra_code==1 & has_12m_follow_up==1, missing //missing will 
> be patients with no rheum appt and/or rheum appt after csDMARD script

    csDMARD |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        868        8.08        8.08
         No |      1,882       17.51       25.59
          . |      7,998       74.41      100.00
------------+-----------------------------------
      Total |     10,748      100.00

. 
. **csDMARD time categories for RA patients (including high cost MTX prescripti
> ons)
. gen csdmard_hcd_3m=1 if time_to_csdmard_hcd<=90 & time_to_csdmard_hcd!=. 
(34,865 missing values generated)

. replace csdmard_hcd_3m=2 if time_to_csdmard_hcd>90 & time_to_csdmard_hcd!=.
(9,689 real changes made)

. lab define csdmard_hcd_3m 1 "Yes" 2 "No", modify

. lab val csdmard_hcd_3m csdmard_hcd_3m

. lab var csdmard_hcd_3m "csDMARD within 3 months" 

. tab csdmard_hcd_3m if ra_code==1 & has_6m_follow_up==1, missing //missing wil
> l be patients with no rheum appt and/or rheum appt after csDMARD script

    csDMARD |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        211        1.85        1.85
         No |      3,123       27.45       29.31
          . |      8,041       70.69      100.00
------------+-----------------------------------
      Total |     11,375      100.00

. gen csdmard_hcd_6m=1 if time_to_csdmard_hcd<=180 & time_to_csdmard_hcd!=. 
(34,126 missing values generated)

. replace csdmard_hcd_6m=2 if time_to_csdmard_hcd>180 & time_to_csdmard_hcd!=.
(8,950 real changes made)

. lab define csdmard_hcd_6m 1 "Yes" 2 "No", modify

. lab val csdmard_hcd_6m csdmard_hcd_6m

. lab var csdmard_hcd_6m "csDMARD within 6 months" 

. tab csdmard_hcd_6m if ra_code==1 & has_6m_follow_up==1, missing //missing wil
> l be patients with no rheum appt and/or rheum appt after csDMARD script

    csDMARD |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        444        3.90        3.90
         No |      2,890       25.41       29.31
          . |      8,041       70.69      100.00
------------+-----------------------------------
      Total |     11,375      100.00

. gen csdmard_hcd_12m=1 if time_to_csdmard_hcd<=365 & time_to_csdmard_hcd!=. 
(32,255 missing values generated)

. replace csdmard_hcd_12m=2 if time_to_csdmard_hcd>365 & time_to_csdmard_hcd!=.
(7,079 real changes made)

. lab define csdmard_hcd_12m 1 "Yes" 2 "No", modify

. lab val csdmard_hcd_12m csdmard_hcd_12m

. lab var csdmard_hcd_12m "csDMARD within 12 months" 

. tab csdmard_hcd_12m if ra_code==1 & has_12m_follow_up==1, missing //missing w
> ill be patients with no rheum appt and/or rheum appt after csDMARD script

    csDMARD |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,024        9.53        9.53
         No |      2,114       19.67       29.20
          . |      7,610       70.80      100.00
------------+-----------------------------------
      Total |     10,748      100.00

. 
. **csDMARD time categories for PsA patients (not including high cost MTX presc
> riptions)
. tab csdmard_3m if psa_code==1 & has_6m_follow_up==1, missing

    csDMARD |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        167        1.48        1.48
         No |      2,665       23.63       25.12
          . |      8,444       74.88      100.00
------------+-----------------------------------
      Total |     11,276      100.00

. tab csdmard_6m if psa_code==1 & has_6m_follow_up==1, missing

    csDMARD |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        350        3.10        3.10
         No |      2,482       22.01       25.12
          . |      8,444       74.88      100.00
------------+-----------------------------------
      Total |     11,276      100.00

. tab csdmard_12m if psa_code==1 & has_12m_follow_up==1, missing

    csDMARD |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        803        7.55        7.55
         No |      1,867       17.55       25.09
          . |      7,971       74.91      100.00
------------+-----------------------------------
      Total |     10,641      100.00

. 
. **csDMARD time categories for PsA patients (including high cost MTX prescript
> ions)
. tab csdmard_hcd_3m if psa_code==1 & has_6m_follow_up==1, missing

    csDMARD |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        197        1.75        1.75
         No |      3,019       26.77       28.52
          . |      8,060       71.48      100.00
------------+-----------------------------------
      Total |     11,276      100.00

. tab csdmard_hcd_6m if psa_code==1 & has_6m_follow_up==1, missing

    csDMARD |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        415        3.68        3.68
         No |      2,801       24.84       28.52
          . |      8,060       71.48      100.00
------------+-----------------------------------
      Total |     11,276      100.00

. tab csdmard_hcd_12m if psa_code==1 & has_12m_follow_up==1, missing

    csDMARD |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        921        8.66        8.66
         No |      2,102       19.75       28.41
          . |      7,618       71.59      100.00
------------+-----------------------------------
      Total |     10,641      100.00

. 
. **What was first shared care csDMARD (not including high cost MTX prescriptio
> ns)
. gen first_csD=""
(35,509 missing values generated)

. foreach var of varlist hydroxychloroquine_date leflunomide_date methotrexate_
> date methotrexate_inj_date sulfasalazine_date {
  2.         replace first_csD="`var'" if csdmard_date==`var' & csdmard_date!=.
  3.         }
variable first_csD was str1 now str23
(2,637 real changes made)
(2,595 real changes made)
(2,562 real changes made)
(2,614 real changes made)
(2,553 real changes made)

. gen first_csDMARD = substr(first_csD, 1, length(first_csD) - 5) if first_csD!
> =""
(22,552 missing values generated)

. drop first_csD

. tab first_csDMARD if ra_code==1 & has_6m_follow_up==1 //for RA patients

     first_csDMARD |      Freq.     Percent        Cum.
-------------------+-----------------------------------
hydroxychloroquine |        874       20.85       20.85
       leflunomide |        820       19.57       40.42
      methotrexate |        826       19.71       60.13
  methotrexate_inj |        838       20.00       80.12
     sulfasalazine |        833       19.88      100.00
-------------------+-----------------------------------
             Total |      4,191      100.00

. tab first_csDMARD if psa_code==1 & has_6m_follow_up==1 //for PsA patients

     first_csDMARD |      Freq.     Percent        Cum.
-------------------+-----------------------------------
hydroxychloroquine |        870       21.16       21.16
       leflunomide |        802       19.51       40.67
      methotrexate |        793       19.29       59.96
  methotrexate_inj |        852       20.72       80.69
     sulfasalazine |        794       19.31      100.00
-------------------+-----------------------------------
             Total |      4,111      100.00

. 
. **What was first csDMARD (including high cost MTX prescriptions)
. gen first_csD_hcd=""
(35,509 missing values generated)

. foreach var of varlist hydroxychloroquine_date leflunomide_date methotrexate_
> date methotrexate_inj_date methotrexate_hcd_date sulfasalazine_date {
  2.         replace first_csD_hcd="`var'" if csdmard_hcd_date==`var' & csdmard
> _hcd_date!=.
  3.         }
variable first_csD_hcd was str1 now str23
(2,519 real changes made)
(2,477 real changes made)
(2,408 real changes made)
(2,478 real changes made)
(2,903 real changes made)
(2,413 real changes made)

. gen first_csDMARD_hcd = substr(first_csD_hcd, 1, length(first_csD_hcd) - 5) i
> f first_csD_hcd!=""
(20,316 missing values generated)

. drop first_csD_hcd

. tab first_csDMARD_hcd if ra_code==1 & has_6m_follow_up==1 //for RA patients

 first_csDMARD_hcd |      Freq.     Percent        Cum.
-------------------+-----------------------------------
hydroxychloroquine |        827       17.00       17.00
       leflunomide |        785       16.14       33.13
      methotrexate |        776       15.95       49.09
  methotrexate_hcd |        895       18.40       67.48
  methotrexate_inj |        795       16.34       83.82
     sulfasalazine |        787       16.18      100.00
-------------------+-----------------------------------
             Total |      4,865      100.00

. tab first_csDMARD_hcd if psa_code==1 & has_6m_follow_up==1 //for PsA patients

 first_csDMARD_hcd |      Freq.     Percent        Cum.
-------------------+-----------------------------------
hydroxychloroquine |        839       17.38       17.38
       leflunomide |        767       15.89       33.27
      methotrexate |        750       15.54       48.81
  methotrexate_hcd |        918       19.02       67.83
  methotrexate_inj |        808       16.74       84.57
     sulfasalazine |        745       15.43      100.00
-------------------+-----------------------------------
             Total |      4,827      100.00

.  
. **Methotrexate use (not including high cost MTX prescriptions)
. gen mtx=1 if methotrexate==1 | methotrexate_inj==1
(29,592 missing values generated)

. recode mtx .=0 
(mtx: 29592 changes made)

. tab mtx if ra_code==1 & has_6m_follow_up==1 //for RA patients; Nb. this is ju
> st a check; need time-to-MTX instead (below)

        mtx |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      9,457       83.14       83.14
          1 |      1,918       16.86      100.00
------------+-----------------------------------
      Total |     11,375      100.00

. tab mtx if psa_code==1 & has_6m_follow_up==1 //for PsA patients

        mtx |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      9,408       83.43       83.43
          1 |      1,868       16.57      100.00
------------+-----------------------------------
      Total |     11,276      100.00

. 
. **Methotrexate use (including high cost MTX prescriptions)
. gen mtx_hcd=1 if methotrexate==1 | methotrexate_inj==1 | methotrexate_hcd==1
(26,658 missing values generated)

. recode mtx_hcd .=0 
(mtx_hcd: 26658 changes made)

. tab mtx_hcd if ra_code==1 & has_6m_follow_up==1 //for RA patients

    mtx_hcd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,547       75.14       75.14
          1 |      2,828       24.86      100.00
------------+-----------------------------------
      Total |     11,375      100.00

. tab mtx_hcd if psa_code==1 & has_6m_follow_up==1 //for PsA patients

    mtx_hcd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,493       75.32       75.32
          1 |      2,783       24.68      100.00
------------+-----------------------------------
      Total |     11,276      100.00

. 
. **Date of first methotrexate script (not including high cost MTX prescription
> s)
. gen mtx_date=min(methotrexate_date, methotrexate_inj_date)
(29,592 missing values generated)

. format %td mtx_date

. 
. **Date of first methotrexate script (including high cost MTX prescriptions)
. gen mtx_hcd_date=min(methotrexate_date, methotrexate_inj_date, methotrexate_h
> cd_date)
(26,658 missing values generated)

. format %td mtx_hcd_date

. 
. **Time to first methotrexate script for RA patients (not including high cost 
> MTX prescriptions)
. gen time_to_mtx=(mtx_date-rheum_appt_date) if mtx==1 & rheum_appt_date!=. & m
> tx_date>=rheum_appt_date 
(31,341 missing values generated)

. tabstat time_to_mtx if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p2
> 5 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |      1345  621.2974       604       334       879
----------------------------------------------------------------

. 
. **Time to first methotrexate script for RA patients (including high cost MTX 
> prescriptions)
. gen time_to_mtx_hcd=(mtx_hcd_date-rheum_appt_date) if mtx_hcd==1 & rheum_appt
> _date!=. & mtx_hcd_date>=rheum_appt_date 
(29,599 missing values generated)

. tabstat time_to_mtx_hcd if ra_code==1 & has_6m_follow_up==1, stats (n mean p5
> 0 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_mt~d |      1912  610.2442     581.5       326       869
----------------------------------------------------------------

. 
. **Time to first methotrexate script for PsA patients (not including high cost
>  MTX prescriptions)
. tabstat time_to_mtx if psa_code==1 & has_6m_follow_up==1, stats (n mean p50 p
> 25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |      1304  616.0544       579     349.5       866
----------------------------------------------------------------

. 
. **Time to first methotrexate script for PsA patients (including high cost MTX
>  prescriptions)
. tabstat time_to_mtx_hcd if psa_code==1 & has_6m_follow_up==1, stats (n mean p
> 50 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_mt~d |      1829  611.0153       578       348       858
----------------------------------------------------------------

. 
. **Methotrexate time categories for RA patients (not including high-cost MTX) 
> //Nb. this is time period from rheum appt (i.e. diagnosis) to shared care, no
> t from referral to first script 
. gen mtx_3m=1 if time_to_mtx<=90 & time_to_mtx!=. 
(35,289 missing values generated)

. replace mtx_3m=2 if time_to_mtx>90 & time_to_mtx!=.
(3,948 real changes made)

. lab define mtx_3m 1 "Yes" 2 "No", modify

. lab val mtx_3m mtx_3m

. lab var mtx_3m "Methotrexate within 3 months" 

. tab mtx_3m if ra_code==1 & has_6m_follow_up==1, missing //missing will be pat
> ients with no rheum appt and/or rheum appt after csDMARD script

Methotrexat |
 e within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         75        0.66        0.66
         No |      1,270       11.16       11.82
          . |     10,030       88.18      100.00
------------+-----------------------------------
      Total |     11,375      100.00

. gen mtx_6m=1 if time_to_mtx<=180 & time_to_mtx!=. 
(35,040 missing values generated)

. replace mtx_6m=2 if time_to_mtx>180 & time_to_mtx!=.
(3,699 real changes made)

. lab define mtx_6m 1 "Yes" 2 "No", modify

. lab val mtx_6m mtx_6m

. lab var mtx_6m "Methotrexate within 6 months" 

. tab mtx_6m if ra_code==1 & has_6m_follow_up==1, missing //missing will be pat
> ients with no rheum appt and/or rheum appt after csDMARD script

Methotrexat |
 e within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        157        1.38        1.38
         No |      1,188       10.44       11.82
          . |     10,030       88.18      100.00
------------+-----------------------------------
      Total |     11,375      100.00

. gen mtx_12m=1 if time_to_mtx<=365 & time_to_mtx!=. 
(34,349 missing values generated)

. replace mtx_12m=2 if time_to_mtx>365 & time_to_mtx!=.
(3,008 real changes made)

. lab define mtx_12m 1 "Yes" 2 "No", modify

. lab val mtx_12m mtx_12m

. lab var mtx_12m "Methotrexate within 12 months" 

. tab mtx_12m if ra_code==1 & has_12m_follow_up==1, missing //missing will be p
> atients with no rheum appt and/or rheum appt after mtx script

Methotrexat |
e within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        354        3.29        3.29
         No |        902        8.39       11.69
          . |      9,492       88.31      100.00
------------+-----------------------------------
      Total |     10,748      100.00

. 
. **Methotrexate time categories for RA patients (including high-cost MTX)
. gen mtx_hcd_3m=1 if time_to_mtx_hcd<=90 & time_to_mtx_hcd!=. 
(35,193 missing values generated)

. replace mtx_hcd_3m=2 if time_to_mtx_hcd>90 & time_to_mtx_hcd!=.
(5,594 real changes made)

. lab define mtx_hcd_3m 1 "Yes" 2 "No", modify

. lab val mtx_hcd_3m mtx_hcd_3m

. lab var mtx_hcd_3m "Methotrexate within 3 months" 

. tab mtx_hcd_3m if ra_code==1 & has_6m_follow_up==1, missing //missing will be
>  patients with no rheum appt and/or rheum appt after csDMARD script

Methotrexat |
 e within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        102        0.90        0.90
         No |      1,810       15.91       16.81
          . |      9,463       83.19      100.00
------------+-----------------------------------
      Total |     11,375      100.00

. gen mtx_hcd_6m=1 if time_to_mtx_hcd<=180 & time_to_mtx_hcd!=. 
(34,822 missing values generated)

. replace mtx_hcd_6m=2 if time_to_mtx_hcd>180 & time_to_mtx_hcd!=.
(5,223 real changes made)

. lab define mtx_hcd_6m 1 "Yes" 2 "No", modify

. lab val mtx_hcd_6m mtx_hcd_6m

. lab var mtx_hcd_6m "Methotrexate within 6 months" 

. tab mtx_hcd_6m if ra_code==1 & has_6m_follow_up==1, missing //missing will be
>  patients with no rheum appt and/or rheum appt after csDMARD script

Methotrexat |
 e within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        220        1.93        1.93
         No |      1,692       14.87       16.81
          . |      9,463       83.19      100.00
------------+-----------------------------------
      Total |     11,375      100.00

. gen mtx_hcd_12m=1 if time_to_mtx_hcd<=365 & time_to_mtx_hcd!=. 
(33,813 missing values generated)

. replace mtx_hcd_12m=2 if time_to_mtx_hcd>365 & time_to_mtx_hcd!=.
(4,214 real changes made)

. lab define mtx_hcd_12m 1 "Yes" 2 "No", modify

. lab val mtx_hcd_12m mtx_hcd_12m

. lab var mtx_hcd_12m "Methotrexate within 12 months" 

. tab mtx_hcd_12m if ra_code==1 & has_12m_follow_up==1, missing //missing will 
> be patients with no rheum appt and/or rheum appt after csDMARD script

Methotrexat |
e within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        528        4.91        4.91
         No |      1,271       11.83       16.74
          . |      8,949       83.26      100.00
------------+-----------------------------------
      Total |     10,748      100.00

. 
. **Methotrexate time categories for PsA patients (not including high-cost MTX)
. tab mtx_3m if psa_code==1 & has_6m_follow_up==1, missing

Methotrexat |
 e within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         67        0.59        0.59
         No |      1,237       10.97       11.56
          . |      9,972       88.44      100.00
------------+-----------------------------------
      Total |     11,276      100.00

. tab mtx_6m if psa_code==1 & has_6m_follow_up==1, missing

Methotrexat |
 e within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        139        1.23        1.23
         No |      1,165       10.33       11.56
          . |      9,972       88.44      100.00
------------+-----------------------------------
      Total |     11,276      100.00

. tab mtx_12m if psa_code==1 & has_12m_follow_up==1, missing //with a least 12m
>  registration

Methotrexat |
e within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        334        3.14        3.14
         No |        886        8.33       11.47
          . |      9,421       88.53      100.00
------------+-----------------------------------
      Total |     10,641      100.00

. 
. **Methotrexate time categories for PsA patients (including high-cost MTX)
. tab mtx_hcd_3m if psa_code==1 & has_6m_follow_up==1, missing

Methotrexat |
 e within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        100        0.89        0.89
         No |      1,729       15.33       16.22
          . |      9,447       83.78      100.00
------------+-----------------------------------
      Total |     11,276      100.00

. tab mtx_hcd_6m if psa_code==1 & has_6m_follow_up==1, missing

Methotrexat |
 e within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        208        1.84        1.84
         No |      1,621       14.38       16.22
          . |      9,447       83.78      100.00
------------+-----------------------------------
      Total |     11,276      100.00

. tab mtx_hcd_12m if psa_code==1 & has_12m_follow_up==1, missing //with a least
>  12m registration

Methotrexat |
e within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        471        4.43        4.43
         No |      1,234       11.60       16.02
          . |      8,936       83.98      100.00
------------+-----------------------------------
      Total |     10,641      100.00

. 
. **Sulfasalazine use
. gen time_to_ssz=(sulfasalazine_date-rheum_appt_date) if sulfasalazine==1 & rh
> eum_appt_date!=. & sulfasalazine_date>=rheum_appt_date 
(33,305 missing values generated)

. tabstat time_to_ssz if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p2
> 5 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |       713  632.6073       608       343       896
----------------------------------------------------------------

. 
. **Sulfasalazine time categories for RA patients //Nb. this is time period fro
> m rheum appt (i.e. diagnosis) to shared care, not from referral to first scri
> pt 
. gen ssz_3m=1 if time_to_ssz<=90 & time_to_ssz!=. 
(35,414 missing values generated)

. replace ssz_3m=2 if time_to_ssz>90 & time_to_ssz!=.
(2,109 real changes made)

. lab define ssz_3m 1 "Yes" 2 "No", modify

. lab val ssz_3m ssz_3m

. lab var ssz_3m "Sulfasalazine within 3 months" 

. tab ssz_3m if ra_code==1 & has_6m_follow_up==1, missing //missing will be pat
> ients with no rheum appt and/or rheum appt after csDMARD script

Sulfasalazi |
ne within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         29        0.25        0.25
         No |        684        6.01        6.27
          . |     10,662       93.73      100.00
------------+-----------------------------------
      Total |     11,375      100.00

. gen ssz_6m=1 if time_to_ssz<=180 & time_to_ssz!=. 
(35,268 missing values generated)

. replace ssz_6m=2 if time_to_ssz>180 & time_to_ssz!=.
(1,963 real changes made)

. lab define ssz_6m 1 "Yes" 2 "No", modify

. lab val ssz_6m ssz_6m

. lab var ssz_6m "Sulfasalazine within 6 months" 

. tab ssz_6m if ra_code==1 & has_6m_follow_up==1, missing //missing will be pat
> ients with no rheum appt and/or rheum appt after csDMARD script

Sulfasalazi |
ne within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         72        0.63        0.63
         No |        641        5.64        6.27
          . |     10,662       93.73      100.00
------------+-----------------------------------
      Total |     11,375      100.00

. gen ssz_12m=1 if time_to_ssz<=365 & time_to_ssz!=. 
(34,921 missing values generated)

. replace ssz_12m=2 if time_to_ssz>365 & time_to_ssz!=.
(1,616 real changes made)

. lab define ssz_12m 1 "Yes" 2 "No", modify

. lab val ssz_12m ssz_12m

. lab var ssz_12m "Sulfasalazine within 12 months" 

. tab ssz_12m if ra_code==1 & has_12m_follow_up==1, missing //missing will be p
> atients with no rheum appt and/or rheum appt after ssz script

Sulfasalazi |
  ne within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        195        1.81        1.81
         No |        486        4.52        6.34
          . |     10,067       93.66      100.00
------------+-----------------------------------
      Total |     10,748      100.00

. 
. **Sulfasalazine time categories for PsA patients
. tab ssz_3m if psa_code==1 & has_6m_follow_up==1, missing

Sulfasalazi |
ne within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         27        0.24        0.24
         No |        651        5.77        6.01
          . |     10,598       93.99      100.00
------------+-----------------------------------
      Total |     11,276      100.00

. tab ssz_6m if psa_code==1 & has_6m_follow_up==1, missing

Sulfasalazi |
ne within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         71        0.63        0.63
         No |        607        5.38        6.01
          . |     10,598       93.99      100.00
------------+-----------------------------------
      Total |     11,276      100.00

. tab ssz_12m if psa_code==1 & has_12m_follow_up==1, missing //with a least 12m
>  registration

Sulfasalazi |
  ne within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        165        1.55        1.55
         No |        477        4.48        6.03
          . |      9,999       93.97      100.00
------------+-----------------------------------
      Total |     10,641      100.00

. 
. **Hydroxychloroquine use
. gen time_to_hcq=(hydroxychloroquine_date-rheum_appt_date) if hydroxychloroqui
> ne==1 & rheum_appt_date!=. & hydroxychloroquine_date>=rheum_appt_date 
(33,278 missing values generated)

. tabstat time_to_hcq if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p2
> 5 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |       734  630.5082     608.5       340       897
----------------------------------------------------------------

. 
. **Hydroxychloroquine time categories for RA patients //Nb. this is time perio
> d from rheum appt (i.e. diagnosis) to shared care, not from referral to first
>  script 
. gen hcq_3m=1 if time_to_hcq<=90 & time_to_hcq!=. 
(35,384 missing values generated)

. replace hcq_3m=2 if time_to_hcq>90 & time_to_hcq!=.
(2,106 real changes made)

. lab define hcq_3m 1 "Yes" 2 "No", modify

. lab val hcq_3m hcq_3m

. lab var hcq_3m "Hydroxychloroquine within 3 months" 

. tab hcq_3m if ra_code==1 & has_6m_follow_up==1, missing //missing will be pat
> ients with no rheum appt and/or rheum appt after csDMARD script

Hydroxychlo |
    roquine |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         46        0.40        0.40
         No |        688        6.05        6.45
          . |     10,641       93.55      100.00
------------+-----------------------------------
      Total |     11,375      100.00

. gen hcq_6m=1 if time_to_hcq<=180 & time_to_hcq!=. 
(35,248 missing values generated)

. replace hcq_6m=2 if time_to_hcq>180 & time_to_hcq!=.
(1,970 real changes made)

. lab define hcq_6m 1 "Yes" 2 "No", modify

. lab val hcq_6m hcq_6m

. lab var hcq_6m "Hydroxychloroquine within 6 months" 

. tab hcq_6m if ra_code==1 & has_6m_follow_up==1, missing //missing will be pat
> ients with no rheum appt and/or rheum appt after csDMARD script

Hydroxychlo |
    roquine |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         91        0.80        0.80
         No |        643        5.65        6.45
          . |     10,641       93.55      100.00
------------+-----------------------------------
      Total |     11,375      100.00

. gen hcq_12m=1 if time_to_hcq<=365 & time_to_hcq!=. 
(34,893 missing values generated)

. replace hcq_12m=2 if time_to_hcq>365 & time_to_hcq!=.
(1,615 real changes made)

. lab define hcq_12m 1 "Yes" 2 "No", modify

. lab val hcq_12m hcq_12m

. lab var hcq_12m "Hydroxychloroquine within 12 months" 

. tab hcq_12m if ra_code==1 & has_12m_follow_up==1, missing //missing will be p
> atients with no rheum appt and/or rheum appt after hcq script

Hydroxychlo |
    roquine |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        194        1.80        1.80
         No |        497        4.62        6.43
          . |     10,057       93.57      100.00
------------+-----------------------------------
      Total |     10,748      100.00

. 
. **Hydroxychloroquine time categories for PsA patients
. tab hcq_3m if psa_code==1 & has_6m_follow_up==1, missing

Hydroxychlo |
    roquine |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         37        0.33        0.33
         No |        675        5.99        6.31
          . |     10,564       93.69      100.00
------------+-----------------------------------
      Total |     11,276      100.00

. tab hcq_6m if psa_code==1 & has_6m_follow_up==1, missing

Hydroxychlo |
    roquine |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         78        0.69        0.69
         No |        634        5.62        6.31
          . |     10,564       93.69      100.00
------------+-----------------------------------
      Total |     11,276      100.00

. tab hcq_12m if psa_code==1 & has_12m_follow_up==1, missing //with a least 12m
>  registration

Hydroxychlo |
    roquine |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        185        1.74        1.74
         No |        490        4.60        6.34
          . |      9,966       93.66      100.00
------------+-----------------------------------
      Total |     10,641      100.00

. 
. **Leflunomide use
. gen time_to_lef=(leflunomide_date-rheum_appt_date) if leflunomide==1 & rheum_
> appt_date!=. & leflunomide_date>=rheum_appt_date 
(33,263 missing values generated)

. tabstat time_to_lef if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p2
> 5 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |       724  631.8218     591.5       338       912
----------------------------------------------------------------

. 
. **Leflunomide time categories for RA patients //Nb. this is time period from 
> rheum appt (i.e. diagnosis) to shared care, not from referral to first script
>  
. gen lef_3m=1 if time_to_lef<=90 & time_to_lef!=. 
(35,386 missing values generated)

. replace lef_3m=2 if time_to_lef>90 & time_to_lef!=.
(2,123 real changes made)

. lab define lef_3m 1 "Yes" 2 "No", modify

. lab val lef_3m lef_3m

. lab var lef_3m "Leflunomide within 3 months" 

. tab lef_3m if ra_code==1 & has_6m_follow_up==1, missing //missing will be pat
> ients with no rheum appt and/or rheum appt after csDMARD script

Leflunomide |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         38        0.33        0.33
         No |        686        6.03        6.36
          . |     10,651       93.64      100.00
------------+-----------------------------------
      Total |     11,375      100.00

. gen lef_6m=1 if time_to_lef<=180 & time_to_lef!=. 
(35,265 missing values generated)

. replace lef_6m=2 if time_to_lef>180 & time_to_lef!=.
(2,002 real changes made)

. lab define lef_6m 1 "Yes" 2 "No", modify

. lab val lef_6m lef_6m

. lab var lef_6m "Leflunomide within 6 months" 

. tab lef_6m if ra_code==1 & has_6m_follow_up==1, missing //missing will be pat
> ients with no rheum appt and/or rheum appt after csDMARD script

Leflunomide |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         78        0.69        0.69
         No |        646        5.68        6.36
          . |     10,651       93.64      100.00
------------+-----------------------------------
      Total |     11,375      100.00

. gen lef_12m=1 if time_to_lef<=365 & time_to_lef!=. 
(34,906 missing values generated)

. replace lef_12m=2 if time_to_lef>365 & time_to_lef!=.
(1,643 real changes made)

. lab define lef_12m 1 "Yes" 2 "No", modify

. lab val lef_12m lef_12m

. lab var lef_12m "Leflunomide within 12 months" 

. tab lef_12m if ra_code==1 & has_12m_follow_up==1, missing //missing will be p
> atients with no rheum appt and/or rheum appt after lef script

Leflunomide |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        184        1.71        1.71
         No |        482        4.48        6.20
          . |     10,082       93.80      100.00
------------+-----------------------------------
      Total |     10,748      100.00

. 
. **Leflunomide time categories for PsA patients
. tab lef_3m if psa_code==1 & has_6m_follow_up==1, missing

Leflunomide |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         38        0.34        0.34
         No |        636        5.64        5.98
          . |     10,602       94.02      100.00
------------+-----------------------------------
      Total |     11,276      100.00

. tab lef_6m if psa_code==1 & has_6m_follow_up==1, missing

Leflunomide |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         72        0.64        0.64
         No |        602        5.34        5.98
          . |     10,602       94.02      100.00
------------+-----------------------------------
      Total |     11,276      100.00

. tab lef_12m if psa_code==1 & has_12m_follow_up==1, missing //with a least 12m
>  registration

Leflunomide |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        175        1.64        1.64
         No |        466        4.38        6.02
          . |     10,000       93.98      100.00
------------+-----------------------------------
      Total |     10,641      100.00

. 
. **Time to first biologic script, whereby first rheum appt is classed as diagn
> osis date (assumes rheum appt present); high_cost drug data available to Nov 
> 2020======================================================================*/
. 
. *Below analyses are only for patients with at least 12 months of follow-up av
> ailable after EIA code
. gen time_to_biologic=(biologic_date-rheum_appt_date) if biologic==1 & rheum_a
> ppt_date!=. & biologic_date>=rheum_appt_date 
(17,555 missing values generated)

. tabstat time_to_biologic if has_12m_follow_up==1, stats (n mean p50 p25 p75) 
> //for all EIA patients

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_bi~c |     16125  489.3084       439       235       699
----------------------------------------------------------------

. 
. /* Suppress due to small numbers
> **What was first biologic
> gen first_bio=""
> foreach var of varlist abatacept_date adalimumab_date baricitinib_date certol
> izumab_date etanercept_date golimumab_date guselkumab_date infliximab_date ix
> ekizumab_date rituximab_date sarilumab_date secukinumab_date tocilizumab_date
>  tofacitinib_date upadacitinib_date ustekinumab_date {
>         replace first_bio="`var'" if biologic_date==`var' & biologic_date!=.
>         }
> gen first_biologic = substr(first_bio, 1, length(first_bio) - 5)        
> drop first_bio
> tab first_biologic if has_12m_follow_up==1 //for all EIA patients
> */
. 
. **Biologic time categories (for all patients)
. gen biologic_3m=1 if time_to_biologic<=90 & time_to_biologic!=. 
(33,936 missing values generated)

. replace biologic_3m=2 if time_to_biologic>90 & time_to_biologic!=.
(16,381 real changes made)

. lab define biologic_3m 1 "Yes" 2 "No", modify

. lab val biologic_3m biologic_3m

. lab var biologic_3m "bDMARD/tsDMARD within 3 months" 

. tab biologic_3m if has_6m_follow_up==1, missing //missing will be patients wi
> th no rheum appt and/or rheum appt after bDMARD/tsDMARD script

bDMARD/tsDM |
 ARD within |
   3 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,507        4.47        4.47
         No |     15,533       46.03       50.49
          . |     16,708       49.51      100.00
------------+-----------------------------------
      Total |     33,748      100.00

. gen biologic_6m=1 if time_to_biologic<=180 & time_to_biologic!=. 
(32,168 missing values generated)

. replace biologic_6m=2 if time_to_biologic>180 & time_to_biologic!=.
(14,613 real changes made)

. lab define biologic_6m 1 "Yes" 2 "No", modify

. lab val biologic_6m biologic_6m

. lab var biologic_6m "bDMARD/tsDMARD within 6 months" 

. tab biologic_6m if has_6m_follow_up==1, missing //missing will be patients wi
> th no rheum appt and/or rheum appt after bDMARD/tsDMARD script

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      3,182        9.43        9.43
         No |     13,858       41.06       50.49
          . |     16,708       49.51      100.00
------------+-----------------------------------
      Total |     33,748      100.00

. gen biologic_12m=1 if time_to_biologic<=365 & time_to_biologic!=. 
(28,139 missing values generated)

. replace biologic_12m=2 if time_to_biologic>365 & time_to_biologic!=.
(10,584 real changes made)

. lab define biologic_12m 1 "Yes" 2 "No", modify

. lab val biologic_12m biologic_12m

. lab var biologic_12m "bDMARD/tsDMARD within 12 months" 

. tab biologic_12m if has_12m_follow_up==1, missing //missing will be patients 
> with no rheum appt and/or rheum appt after bDMARD/tsDMARD script

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      6,619       20.69       20.69
         No |      9,506       29.72       50.41
          . |     15,862       49.59      100.00
------------+-----------------------------------
      Total |     31,987      100.00

. 
. **Biologic time categories (by year)
. bys diagnosis_year: tab biologic_6m if has_6m_follow_up==1, missing //for all
>  EIA patients with at least 6m follow-up

-------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        701        6.19        6.19
         No |      4,066       35.93       42.12
          . |      6,551       57.88      100.00
------------+-----------------------------------
      Total |     11,318      100.00

-------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,143       10.08       10.08
         No |      4,886       43.08       53.16
          . |      5,312       46.84      100.00
------------+-----------------------------------
      Total |     11,341      100.00

-------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,338       12.07       12.07
         No |      4,906       44.24       56.31
          . |      4,845       43.69      100.00
------------+-----------------------------------
      Total |     11,089      100.00


. bys diagnosis_year: tab biologic_12m if has_12m_follow_up==1, missing //for a
> ll EIA patients

-------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,603       14.83       14.83
         No |      2,969       27.47       42.30
          . |      6,237       57.70      100.00
------------+-----------------------------------
      Total |     10,809      100.00

-------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      2,402       22.43       22.43
         No |      3,266       30.50       52.93
          . |      5,041       47.07      100.00
------------+-----------------------------------
      Total |     10,709      100.00

-------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      2,614       24.97       24.97
         No |      3,271       31.24       56.21
          . |      4,584       43.79      100.00
------------+-----------------------------------
      Total |     10,469      100.00


. 
. save "$projectdir/output/data/file_eia_all", replace
(note: file /workspace/output/data/file_eia_all.dta not found)
file /workspace/output/data/file_eia_all.dta saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/cleaning_dataset.log
  log type:  text
 closed on:  11 Apr 2022, 21:03:23
-------------------------------------------------------------------------------
