-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:/Users/k1754142/OneDrive/PhD Project/OpenSAFELY/Github Practice/logs/cleaning_dataset.log
  log type:  text
 opened on:   6 Apr 2022, 16:36:14

. 
. di "$projectdir"
C:/Users/k1754142/OneDrive/PhD Project/OpenSAFELY/Github Practice

. di "$logdir"
C:/Users/k1754142/OneDrive/PhD Project/OpenSAFELY/Github Practice/logs

. 
. import delimited "$projectdir/output/input.csv", clear
(65 vars, 100,000 obs)

. 
. **Set Ado file path
. adopath + "$projectdir/analysis/extra_ados"
  [1]  (BASE)      "C:\Program Files\Stata17\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata17\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "C:\Users\k1754142\ado\personal/"
  [5]  (PLUS)      "C:\Users\k1754142\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "C:/Users/k1754142/OneDrive/PhD Project/OpenSAFELY/Github Practice/analysis/extra_ados"

. 
. **Set index dates ===========================================================*/
. global year_preceding = "01/03/2018"

. global start_date = "01/03/2019"

. global end_date = "01/03/2022"

. 
. **Rename variables (some are too long for Stata to handle) =======================================*/
. rename chronic_respiratory_disease chronic_resp_disease

. 
. **Convert date strings to dates ====================================================*/
. ***Some dates are given with month/year only, so adding day 15 to enable them to be processed as dates 
. 
. foreach var of varlist   hba1c_mmol_per_mol_date                        ///
>                                                  hba1c_percentage_date                          ///
>                                                  creatinine_date                                ///
>                                                  bmi_date_measured                          ///
>                                                  abatacept                                                      ///
>                                                  adalimumab                                                     ///     
>                                                  baricitinib                                            ///
>                                                  certolizumab                                           ///
>                                                  etanercept                                                     ///
>                                                  golimumab                                                      ///
>                                                  guselkumab                                                     ///     
>                                                  infliximab                                                     ///
>                                                  ixekizumab                                                     ///
>                                                  methotrexate_hcd                                       ///
>                                                  rituximab                                                      ///
>                                                  sarilumab                                                      ///
>                                                  secukinumab                                            ///     
>                                                  tocilizumab                                            ///
>                                                  tofacitinib                                            ///
>                                                  upadacitinib                                           ///
>                                                  ustekinumab                                            ///
>                                                  {
  2.                                                         
.                 capture confirm string variable `var'
  3.                 if _rc!=0 {
  4.                         assert `var'==.
  5.                         rename `var' `var'_date
  6.                 }
  7.         
.                 else {
  8.                                 replace `var' = `var' + "-15"
  9.                                 rename `var' `var'_dstr
 10.                                 replace `var'_dstr = " " if `var'_dstr == "-15"
 11.                                 gen `var'_date = date(`var'_dstr, "YMD") 
 12.                                 order `var'_date, after(`var'_dstr)
 13.                                 drop `var'_dstr
 14.                 }
 15.         
.         format `var'_date %td
 16. }
variable hba1c_mmol_per_mol_date was str7 now str10
(100,000 real changes made)
(5,000 real changes made)
(5,000 missing values generated)
variable hba1c_percentage_date was str7 now str10
(100,000 real changes made)
(5,000 real changes made)
(5,000 missing values generated)
variable creatinine_date was str7 now str10
(100,000 real changes made)
(5,000 real changes made)
(5,000 missing values generated)
variable bmi_date_measured was str7 now str10
(100,000 real changes made)
(40,000 real changes made)
(40,000 missing values generated)
variable abatacept was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable adalimumab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable baricitinib was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable certolizumab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable etanercept was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable golimumab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable guselkumab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable infliximab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable ixekizumab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable methotrexate_hcd was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable rituximab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable sarilumab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable secukinumab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable tocilizumab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable tofacitinib was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable upadacitinib was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)
variable ustekinumab was str7 now str10
(100,000 real changes made)
(90,000 real changes made)
(90,000 missing values generated)

. 
. **Conversion for dates with day already included ====================================================*/
. 
. foreach var of varlist   died_date_ons                                          ///
>                                              eia_code_date                                              ///
>                                                  rheum_appt_date                                        ///
>                                              ra_code_date                                               ///
>                                                  psa_code_date                                          ///
>                                                  anksp_code_date                                        ///
>                                                  last_gp_prerheum_date                          ///
>                                                  last_gp_precode_date                           ///     
>                                                  last_gp_refrheum_date                          ///
>                                                  last_gp_refcode_date                           ///
>                                                  referral_rheum_prerheum                        ///
>                                                  referral_rheum_precode                         ///     
>                                                  chronic_cardiac_disease                        ///
>                                                  diabetes                                                       ///
>                                                  hypertension                                           ///     
>                                                  chronic_resp_disease                           ///
>                                                  copd                                                           ///
>                                                  chronic_liver_disease                          ///
>                                                  stroke                                                         ///
>                                                  lung_cancer                                            ///
>                                                  haem_cancer                                            ///
>                                                  other_cancer                                           ///
>                                                  esrf                                                           ///
>                                                  organ_transplant                                       ///
>                                                  hydroxychloroquine                                     ///
>                                                  leflunomide                                            ///
>                                                  methotrexate                                           ///
>                                                  methotrexate_inj                                       ///
>                                                  sulfasalazine                                          ///
>                                                  {
  2.                                                                  
.                 capture confirm string variable `var'
  3.                 if _rc!=0 {
  4.                         assert `var'==.
  5.                         rename `var' `var'_date
  6.                 }
  7.         
.                 else {
  8.                                 rename `var' `var'_dstr
  9.                                 gen `var'_date = date(`var'_dstr, "YMD") 
 10.                                 order `var'_date, after(`var'_dstr)
 11.                                 drop `var'_dstr
 12.                                 gen `var'_date15 = `var'_date+15
 13.                                 order `var'_date15, after(`var'_date)
 14.                                 drop `var'_date
 15.                                 rename `var'_date15 `var'_date
 16.                 }
 17.         
.         format `var'_date %td
 18. }
(90,000 missing values generated)
(90,000 missing values generated)
(1,000 missing values generated)
(1,000 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(1,000 missing values generated)
(1,000 missing values generated)
(1,000 missing values generated)
(1,000 missing values generated)
(1,000 missing values generated)
(1,000 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(9,999 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(80,000 missing values generated)
(90,000 missing values generated)
(90,000 missing values generated)
(90,000 missing values generated)
(90,000 missing values generated)
(90,000 missing values generated)
(90,000 missing values generated)
(90,000 missing values generated)
(90,000 missing values generated)
(90,000 missing values generated)
(90,000 missing values generated)

.                                                  
. **Rename variables with extra 'date' added to the end of variable names===========================================================*/ 
. rename rheum_appt_date_date rheum_appt_date

. rename eia_code_date_date eia_code_date

. rename ra_code_date_date ra_code_date

. rename psa_code_date_date psa_code_date

. rename anksp_code_date_date anksp_code_date

. rename died_date_ons_date died_ons_date

. rename last_gp_prerheum_date_date last_gp_prerheum_date

. rename last_gp_refrheum_date_date last_gp_refrheum_date

. rename last_gp_refcode_date_date last_gp_refcode_date

. rename last_gp_precode_date_date last_gp_precode_date

. rename hba1c_mmol_per_mol_date_date hba1c_mmol_per_mol_date

. rename hba1c_percentage_date_date hba1c_percentage_date

. rename creatinine_date_date creatinine_date

. rename creatinine creatinine_value 

. rename bmi_date_measured_date bmi_date

. rename bmi bmi_value

. 
. **Create binary indicator variables for relevant conditions ====================================================*/
. 
. foreach var of varlist   eia_code_date                                          ///
>                                                  rheum_appt_date                                        ///
>                                              ra_code_date                                               ///
>                                                  psa_code_date                                          ///
>                                                  anksp_code_date                                        ///
>                                                  died_ons_date                                          ///
>                                                  last_gp_prerheum_date                          ///
>                                                  last_gp_precode_date                           ///     
>                                                  last_gp_refrheum_date                          ///
>                                                  last_gp_refcode_date                           ///
>                                                  referral_rheum_prerheum_date           ///
>                                                  referral_rheum_precode_date            ///     
>                                                  chronic_cardiac_disease_date           ///
>                                                  diabetes_date                                          ///
>                                                  hypertension_date                                      ///
>                                                  chronic_resp_disease_date                      ///
>                                                  copd_date                                                      ///
>                                                  chronic_liver_disease_date                     ///
>                                                  stroke_date                                            ///
>                                                  lung_cancer_date                                       ///
>                                                  haem_cancer_date                                       ///             
>                                                  other_cancer_date                                      ///
>                                                  esrf_date                                                      ///
>                                                  creatinine_date                                        ///
>                                                  organ_transplant_date                          ///
>                                                  hydroxychloroquine_date                        ///     
>                                                  leflunomide_date                                       ///
>                                                  methotrexate_date                                      ///
>                                                  methotrexate_inj_date                          ///             
>                                                  sulfasalazine_date                                     ///
>                                                  abatacept_date                                         ///
>                                                  adalimumab_date                                        ///
>                                                  baricitinib_date                                       ///
>                                                  certolizumab_date                                      ///
>                                                  etanercept_date                                        ///
>                                                  golimumab_date                                         ///
>                                                  guselkumab_date                                        ///
>                                                  infliximab_date                                        ///
>                                                  ixekizumab_date                                        ///
>                                                  methotrexate_hcd_date                          ///
>                                                  rituximab_date                                         ///             
>                                                  sarilumab_date                                         ///
>                                                  secukinumab_date                                       ///
>                                                  tocilizumab_date                                       ///             
>                                                  tofacitinib_date                                       ///
>                                                  upadacitinib_date                                      ///
>                                                  ustekinumab_date   {                           
  2.         /*date ranges are applied in python, so presence of date indicates presence of 
>           disease in the correct time frame*/ 
.         local newvar =  substr("`var'", 1, length("`var'") - 5)
  3.         gen `newvar' = (`var'!=. )
  4.         order `newvar', after(`var')
  5. }

. 
. **Create and label variables ===========================================================*/
. 
. **Demographics
. ***Sex
. gen male = 1 if sex == "M"
(51,367 missing values generated)

. replace male = 0 if sex == "F"
(51,367 real changes made)

. lab var male "Male"

. tab male, missing

       Male |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     51,367       51.37       51.37
          1 |     48,633       48.63      100.00
------------+-----------------------------------
      Total |    100,000      100.00

. 
. ***Ethnicity
. replace ethnicity = .u if ethnicity == .
(25,000 real changes made, 25,000 to missing)

. ****rearrange in order of prevalence
. recode ethnicity 2=6 /* mixed to 6 */
(15074 changes made to ethnicity)

. recode ethnicity 3=2 /* south asian to 2 */
(7648 changes made to ethnicity)

. recode ethnicity 4=3 /* black to 3 */
(7524 changes made to ethnicity)

. recode ethnicity 6=4 /* mixed to 4 */
(15074 changes made to ethnicity)

. recode ethnicity 5=4 /* other to 4 */
(7375 changes made to ethnicity)

. 
. label define ethnicity  1 "White"                                       ///
>                                                 2 "Asian/Asian British"         ///
>                                                 3 "Black"                                       ///
>                                                 4 "Mixed/Other"                         ///
>                                                 .u "Missing"

. label values ethnicity ethnicity

. lab var ethnicity "Ethnicity"

. tab ethnicity, missing

          Ethnicity |      Freq.     Percent        Cum.
--------------------+-----------------------------------
              White |     37,379       37.38       37.38
Asian/Asian British |      7,648        7.65       45.03
              Black |      7,524        7.52       52.55
        Mixed/Other |     22,449       22.45       75.00
            Missing |     25,000       25.00      100.00
--------------------+-----------------------------------
              Total |    100,000      100.00

. 
. ***STP 
. rename stp stp_old

. bysort stp_old: gen stp = 1 if _n==1
(99,998 missing values generated)

. replace stp = sum(stp) //
(99,999 real changes made)

. drop stp_old

. 
. ***Regions
. encode region, gen(nuts_region)

. tab region, missing

                  region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
           East Midlands |      9,872        9.87        9.87
         East of England |     10,055       10.05       19.93
                  London |     20,143       20.14       40.07
              North East |      9,996       10.00       50.07
              North West |     10,068       10.07       60.13
              South East |     20,000       20.00       80.13
           West Midlands |      9,915        9.91       90.05
Yorkshire and the Humber |      9,951        9.95      100.00
-------------------------+-----------------------------------
                   Total |    100,000      100.00

. 
. ***IMD
. *Group into 5 groups
. rename imd imd_o

. egen imd = cut(imd_o), group(5) icodes 

. *Add one to create groups 1-5 
. replace imd = imd + 1
(100,000 real changes made)

. *-1 is missing, should be excluded from population 
. replace imd = .u if imd_o == -1
(0 real changes made)

. drop imd_o

. *Reverse the order (so high is more deprived)
. recode imd 5 = 1 4 = 2 3 = 3 2 = 4 1 = 5 .u = .u
(100000 changes made to imd)

. label define imd 1 "1 least deprived" 2 "2" 3 "3" 4 "4" 5 "5 most deprived" .u "Missing"

. label values imd imd 

. lab var imd "Index of multiple deprivation"

. tab imd, missing

        Index of |
        multiple |
     deprivation |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |     69,866       69.87       69.87
               4 |     20,122       20.12       89.99
 5 most deprived |     10,012       10.01      100.00
-----------------+-----------------------------------
           Total |    100,000      100.00

. 
. ***Age variables
. *Nb. works if ages 18 and over
. *Create categorised age
. drop if age<18 & age !=.
(21,082 observations deleted)

. drop if age>109 & age !=.
(0 observations deleted)

. drop if age==.
(0 observations deleted)

. lab var age "Age"

. 
. recode age 18/39.9999 = 1 /// 
>            40/49.9999 = 2 ///
>                    50/59.9999 = 3 ///
>                60/69.9999 = 4 ///
>                    70/79.9999 = 5 ///
>                    80/max = 6, gen(agegroup) 
(78918 differences between age and agegroup)

. 
. label define agegroup   1 "18-39" ///
>                                                 2 "40-49" ///
>                                                 3 "50-59" ///
>                                                 4 "60-69" ///
>                                                 5 "70-79" ///
>                                                 6 "80+"

.                                                 
. label values agegroup agegroup

. lab var agegroup "Age group"

. tab agegroup, missing

  Age group |      Freq.     Percent        Cum.
------------+-----------------------------------
      18-39 |     28,721       36.39       36.39
      40-49 |     12,876       16.32       52.71
      50-59 |     13,374       16.95       69.66
      60-69 |     10,722       13.59       83.24
      70-79 |      8,180       10.37       93.61
        80+ |      5,045        6.39      100.00
------------+-----------------------------------
      Total |     78,918      100.00

. 
. *Create binary age
. recode age min/69.999 = 0 ///
>            70/max = 1, gen(age70)
(78918 differences between age and age70)

. 
. *Create restricted cubic splines for age
. mkspline age = age, cubic nknots(4)

. 
. ***Body Mass Index
. *Recode strange values 
. replace bmi_value = . if bmi_value == 0 
(31,574 real changes made, 31,574 to missing)

. replace bmi_value = . if !inrange(bmi_value, 10, 80)
(296 real changes made, 296 to missing)

. 
. *Restrict to within 10 years of EIA diagnosis date and aged>16 
. gen bmi_time = (eia_code_date - bmi_date)/365.25
(32,047 missing values generated)

. gen bmi_age = age - bmi_time
(32,047 missing values generated)

. replace bmi_value = . if bmi_age < 16 
(33,285 real changes made, 33,285 to missing)

. replace bmi_value = . if bmi_time > 10 & bmi_time != . 
(9,063 real changes made, 9,063 to missing)

. 
. *Set to missing if no date, and vice versa 
. replace bmi_value = . if bmi_date == . 
(0 real changes made)

. replace bmi_date = . if bmi_value == . 
(42,644 real changes made, 42,644 to missing)

. replace bmi_time = . if bmi_value == . 
(42,641 real changes made, 42,641 to missing)

. replace bmi_age = . if bmi_value == . 
(42,641 real changes made, 42,641 to missing)

. 
. *Create BMI categories
. gen     bmicat = .
(78,918 missing values generated)

. recode  bmicat . = 1 if bmi_value < 18.5
(200 changes made to bmicat)

. recode  bmicat . = 2 if bmi_value < 25
(509 changes made to bmicat)

. recode  bmicat . = 3 if bmi_value < 30
(699 changes made to bmicat)

. recode  bmicat . = 4 if bmi_value < 35
(963 changes made to bmicat)

. recode  bmicat . = 5 if bmi_value < 40
(868 changes made to bmicat)

. recode  bmicat . = 6 if bmi_value < .
(1461 changes made to bmicat)

. replace bmicat = .u if bmi_value >= .
(74,218 real changes made, 74,218 to missing)

. 
. label define bmicat 1 "Underweight (<18.5)"     ///
>                                         2 "Normal (18.5-24.9)"          ///
>                                         3 "Overweight (25-29.9)"        ///
>                                         4 "Obese I (30-34.9)"           ///
>                                         5 "Obese II (35-39.9)"          ///
>                                         6 "Obese III (40+)"                     ///
>                                         .u "Missing"

.                                         
. label values bmicat bmicat

. lab var bmicat "BMI"

. tab bmicat, missing

                 BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |        200        0.25        0.25
  Normal (18.5-24.9) |        509        0.64        0.90
Overweight (25-29.9) |        699        0.89        1.78
   Obese I (30-34.9) |        963        1.22        3.00
  Obese II (35-39.9) |        868        1.10        4.10
     Obese III (40+) |      1,461        1.85        5.96
             Missing |     74,218       94.04      100.00
---------------------+-----------------------------------
               Total |     78,918      100.00

. 
. *Create less granular categorisation
. recode bmicat 1/3 .u = 1 4 = 2 5 = 3 6 = 4, gen(obese4cat)
(78718 differences between bmicat and obese4cat)

. 
. label define obese4cat  1 "No record of obesity"        ///
>                                                 2 "Obese I (30-34.9)"           ///
>                                                 3 "Obese II (35-39.9)"          ///
>                                                 4 "Obese III (40+)"             

. 
. label values obese4cat obese4cat

. order obese4cat, after(bmicat)

. 
. ***Smoking 
. label define smoke 1 "Never" 2 "Former" 3 "Current" .u "Missing"

. 
. gen     smoke = 1  if smoking_status == "N"
(70,955 missing values generated)

. replace smoke = 2  if smoking_status == "E"
(4,073 real changes made)

. replace smoke = 3  if smoking_status == "S"
(23,489 real changes made)

. replace smoke = .u if smoking_status == "M"
(3,922 real changes made, 3,922 to missing)

. replace smoke = .u if smoking_status == "" 
(39,471 real changes made, 39,471 to missing)

. 
. label values smoke smoke

. lab var smoke "Smoking status"

. drop smoking_status

. tab smoke, missing

    Smoking |
     status |      Freq.     Percent        Cum.
------------+-----------------------------------
      Never |      7,963       10.09       10.09
     Former |      4,073        5.16       15.25
    Current |     23,489       29.76       45.02
    Missing |     43,393       54.98      100.00
------------+-----------------------------------
      Total |     78,918      100.00

. 
. *Create non-missing 3-category variable for current smoking (assumes missing smoking is never smoking)
. recode smoke .u = 1, gen(smoke_nomiss)
(43393 differences between smoke and smoke_nomiss)

. order smoke_nomiss, after(smoke)

. label values smoke_nomiss smoke

. 
. **Clinical comorbidities
. ***eGFR
. *Set implausible creatinine values to missing (Note: zero changed to missing)
. replace creatinine_value = . if !inrange(creatinine_value, 20, 3000) 
(19,794 real changes made, 19,794 to missing)

. 
. *Remove creatinine dates if no measurements, and vice versa 
. replace creatinine_value = . if creatinine_date == . 
(0 real changes made)

. replace creatinine_date = . if creatinine_value == . 
(15,833 real changes made, 15,833 to missing)

. replace creatinine = . if creatinine_value == .
(19,794 real changes made, 19,794 to missing)

. recode creatinine .=0
(19794 changes made to creatinine)

. tab creatinine, missing

 creatinine |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     19,794       25.08       25.08
          1 |     59,124       74.92      100.00
------------+-----------------------------------
      Total |     78,918      100.00

. tabstat creatinine_value, stat(n mean p50)

    Variable |         N      Mean       p50
-------------+------------------------------
creatinin~ue |     59124  136.8187  126.6414
--------------------------------------------

. 
. *Divide by 88.4 (to convert umol/l to mg/dl) 
. gen SCr_adj = creatinine_value/88.4
(19,794 missing values generated)

. 
. gen min = .
(78,918 missing values generated)

. replace min = SCr_adj/0.7 if male==0
(30,368 real changes made)

. replace min = SCr_adj/0.9 if male==1
(28,756 real changes made)

. replace min = min^-0.329  if male==0
(30,368 real changes made)

. replace min = min^-0.411  if male==1
(28,756 real changes made)

. replace min = 1 if min<1
(46,240 real changes made)

. 
. gen max=.
(78,918 missing values generated)

. replace max=SCr_adj/0.7 if male==0
(30,368 real changes made)

. replace max=SCr_adj/0.9 if male==1
(28,756 real changes made)

. replace max=max^-1.209
(59,124 real changes made)

. replace max=1 if max>1
(32,678 real changes made)

. 
. gen egfr=min*max*141
(19,794 missing values generated)

. replace egfr=egfr*(0.993^age)
(59,124 real changes made)

. replace egfr=egfr*1.018 if male==0
(30,368 real changes made)

. label var egfr "egfr calculated using CKD-EPI formula with no ethnicity"

. 
. *Categorise into ckd stages
. egen egfr_cat_all = cut(egfr), at(0, 15, 30, 45, 60, 5000)
(19,794 missing values generated)

. recode egfr_cat_all 0 = 5 15 = 4 30 = 3 45 = 2 60 = 0, generate(ckd_egfr)
(59124 differences between egfr_cat_all and ckd_egfr)

. 
. gen egfr_cat = .
(78,918 missing values generated)

. recode egfr_cat . = 3 if egfr < 30
(13919 changes made to egfr_cat)

. recode egfr_cat . = 2 if egfr < 60
(21034 changes made to egfr_cat)

. recode egfr_cat . = 1 if egfr < .
(24171 changes made to egfr_cat)

. replace egfr_cat = .u if egfr >= .
(19,794 real changes made, 19,794 to missing)

. 
. label define egfr_cat   1 ">=60"                ///
>                                                 2 "30-59"               ///
>                                                 3 "<30"                 ///
>                                                 .u "Missing"

.                                         
. label values egfr_cat egfr_cat

. lab var egfr_cat "eGFR"

. tab egfr_cat, missing

       eGFR |      Freq.     Percent        Cum.
------------+-----------------------------------
       >=60 |     24,171       30.63       30.63
      30-59 |     21,034       26.65       57.28
        <30 |     13,919       17.64       74.92
    Missing |     19,794       25.08      100.00
------------+-----------------------------------
      Total |     78,918      100.00

. 
. *If missing eGFR, assume normal
. gen egfr_cat_nomiss = egfr_cat
(19,794 missing values generated)

. replace egfr_cat_nomiss = 1 if egfr_cat == .u
(19,794 real changes made)

. 
. label define egfr_cat_nomiss    1 ">=60/missing"        ///
>                                                                 2 "30-59"                       ///
>                                                                 3 "<30" 

. label values egfr_cat_nomiss egfr_cat_nomiss

. lab var egfr_cat_nomiss "eGFR"

. 
. gen egfr_date = creatinine_date
(19,794 missing values generated)

. format egfr_date %td

. 
. *Add in end stage renal failure and create a single CKD variable 
. *Missing assumed to not have CKD 
. gen ckd = 0

. replace ckd = 1 if ckd_egfr != . & ckd_egfr >= 1
(34,953 real changes made)

. replace ckd = 1 if esrf == 1
(8,836 real changes made)

. 
. label define ckd 0 "No CKD" 1 "CKD"

. label values ckd ckd

. label var ckd "Chronic kidney disease"

. tab ckd, missing

    Chronic |
     kidney |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
     No CKD |     35,129       44.51       44.51
        CKD |     43,789       55.49      100.00
------------+-----------------------------------
      Total |     78,918      100.00

. 
. *Create date (most recent measure prior to index)
. gen temp1_ckd_date = creatinine_date if ckd_egfr >=1
(43,965 missing values generated)

. gen temp2_ckd_date = esrf_date if esrf == 1
(63,120 missing values generated)

. gen ckd_date = max(temp1_ckd_date,temp2_ckd_date) 
(35,129 missing values generated)

. format ckd_date %td 

. 
. drop temp1_ckd_date temp2_ckd_date SCr_adj min max ckd_egfr egfr_cat_all

. 
. ***HbA1c
. *Set zero or negative to missing
. replace hba1c_percentage   = . if hba1c_percentage <= 0
(4,453 real changes made, 4,453 to missing)

. replace hba1c_mmol_per_mol = . if hba1c_mmol_per_mol <= 0
(5,592 real changes made, 5,592 to missing)

. 
. *Change implausible values to missing
. replace hba1c_percentage   = . if !inrange(hba1c_percentage, 1, 20)
(1,195 real changes made, 1,195 to missing)

. replace hba1c_mmol_per_mol = . if !inrange(hba1c_mmol_per_mol, 10, 200)
(3,293 real changes made, 3,293 to missing)

. 
. *Set most recent values of >24 months prior to EIA diagnosis date to missing
. replace hba1c_percentage   = . if (eia_code_date - hba1c_percentage_date) > 24*30 & hba1c_percentage_date != .
(71,041 real changes made, 71,041 to missing)

. replace hba1c_mmol_per_mol = . if (eia_code_date - hba1c_mmol_per_mol_date) > 24*30 & hba1c_mmol_per_mol_date != .
(67,829 real changes made, 67,829 to missing)

. 
. *Clean up dates
. replace hba1c_percentage_date = . if hba1c_percentage == .
(72,709 real changes made, 72,709 to missing)

. replace hba1c_mmol_per_mol_date = . if hba1c_mmol_per_mol == .
(72,767 real changes made, 72,767 to missing)

. 
. *Express  HbA1c as percentage
. *Express all values as perecentage 
. noi summ hba1c_percentage hba1c_mmol_per_mol 

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
hba1c_per~ge |      2,229    5.027094    1.884875   1.032104   11.89189
hba1c_mmol~l |      2,204    42.78192    17.81123   10.11178   112.0113

. gen     hba1c_pct = hba1c_percentage 
(76,689 missing values generated)

. replace hba1c_pct = (hba1c_mmol_per_mol/10.929)+2.15 if hba1c_mmol_per_mol<. 
(2,204 real changes made)

. 
. *Valid % range between 0-20  
. replace hba1c_pct = . if !inrange(hba1c_pct, 1, 20) 
(0 real changes made)

. replace hba1c_pct = round(hba1c_pct, 0.1)
(4,359 real changes made)

. 
. *Categorise HbA1c and diabetes
. *Group hba1c pct
. gen     hba1ccat = 0 if hba1c_pct <  6.5
(75,872 missing values generated)

. replace hba1ccat = 1 if hba1c_pct >= 6.5  & hba1c_pct < 7.5
(637 real changes made)

. replace hba1ccat = 2 if hba1c_pct >= 7.5  & hba1c_pct < 8
(217 real changes made)

. replace hba1ccat = 3 if hba1c_pct >= 8    & hba1c_pct < 9
(309 real changes made)

. replace hba1ccat = 4 if hba1c_pct >= 9    & hba1c_pct !=.
(150 real changes made)

. label define hba1ccat 0 "<6.5%" 1">=6.5-7.4" 2">=7.5-7.9" 3">=8-8.9" 4">=9"

. label values hba1ccat hba1ccat

. tab hba1ccat, missing

   hba1ccat |      Freq.     Percent        Cum.
------------+-----------------------------------
      <6.5% |      3,046        3.86        3.86
  >=6.5-7.4 |        637        0.81        4.67
  >=7.5-7.9 |        217        0.27        4.94
    >=8-8.9 |        309        0.39        5.33
        >=9 |        150        0.19        5.52
          . |     74,559       94.48      100.00
------------+-----------------------------------
      Total |     78,918      100.00

. 
. *Express all values as mmol
. gen hba1c_mmol = hba1c_mmol_per_mol
(76,714 missing values generated)

. replace hba1c_mmol = (hba1c_percentage*10.929)-23.5 if hba1c_percentage<. & hba1c_mmol==.
(2,155 real changes made)

. 
. *Group hba1c mmol
. gen     hba1ccatmm = 0 if hba1c_mmol < 58
(75,231 missing values generated)

. replace hba1ccatmm = 1 if hba1c_mmol >= 58 & hba1c_mmol !=.
(672 real changes made)

. replace hba1ccatmm =.u if hba1ccatmm==. 
(74,559 real changes made, 74,559 to missing)

. label define hba1ccatmm 0 "HbA1c <58mmol/mol" 1 "HbA1c >=58mmol/mol" .u "Missing"

. label values hba1ccatmm hba1ccatmm

. lab var hba1ccatmm "HbA1c"

. tab hba1ccatmm, missing

             HbA1c |      Freq.     Percent        Cum.
-------------------+-----------------------------------
 HbA1c <58mmol/mol |      3,687        4.67        4.67
HbA1c >=58mmol/mol |        672        0.85        5.52
           Missing |     74,559       94.48      100.00
-------------------+-----------------------------------
             Total |     78,918      100.00

. 
. *Create diabetes, split by control/not (assumes missing = no diabetes)
. gen     diabcat = 1 if diabetes==0
(15,681 missing values generated)

. replace diabcat = 2 if diabetes==1 & inlist(hba1ccat, 0, 1)
(711 real changes made)

. replace diabcat = 3 if diabetes==1 & inlist(hba1ccat, 2, 3, 4)
(137 real changes made)

. replace diabcat = 4 if diabetes==1 & !inlist(hba1ccat, 0, 1, 2, 3, 4)
(14,833 real changes made)

. 
. label define diabcat    1 "No diabetes"                         ///
>                                                 2 "Controlled diabetes"         ///
>                                                 3 "Uncontrolled diabetes"       ///
>                                                 4 "Diabetes, no hba1c measure"

. label values diabcat diabcat

. 
. *Create cancer variable 'other cancer currently', includes carcinoma of the head and neck - need to confirm if this excludes NMSC
. gen cancer =0

. replace cancer =1 if lung_cancer ==1 | haem_cancer ==1 | other_cancer ==1
(38,595 real changes made)

. lab var cancer "Cancer"

. tab cancer, missing

     Cancer |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     40,323       51.09       51.09
          1 |     38,595       48.91      100.00
------------+-----------------------------------
      Total |     78,918      100.00

. 
. *Create other comorbid variables
. gen combined_cv_comorbid =1 if chronic_cardiac_disease ==1 | stroke==1
(50,437 missing values generated)

. recode combined_cv_comorbid .=0
(50437 changes made to combined_cv_comorbid)

. 
. *Delete unneeded variables
. drop hba1c_pct hba1c_percentage hba1c_mmol_per_mol

. 
. *Label variables
. lab var hypertension "Hypertension"

. lab var diabetes "Diabetes"

. lab var stroke "Stroke"

. lab var chronic_resp_disease "Chronic respiratory disease"

. lab var copd "COPD"

. lab var esrf "End-stage renal failure"

. lab var chronic_liver_disease "Chronic liver disease"

. lab var chronic_cardiac_disease "Chronic cardiac disease"

. 
. *Refine diagnostic window=============================================================*/
. 
. **All patients should have EIA code
. tab eia_code, missing

   eia_code |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        775        0.98        0.98
          1 |     78,143       99.02      100.00
------------+-----------------------------------
      Total |     78,918      100.00

. keep if eia_code==1
(775 observations deleted)

. 
. **Keep patients with first EIA code in GP record if code was after 1st March 2019
. keep if eia_code_date>=date("$start_date", "DMY") & eia_code_date!=. 
(18,349 observations deleted)

. tab eia_code

   eia_code |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     59,794      100.00      100.00
------------+-----------------------------------
      Total |     59,794      100.00

. 
. **Month/Year of EIA code
. gen year_diag=year(eia_code_date)

. format year_diag %ty

. gen month_diag=month(eia_code_date)

. gen mo_year_diagn=ym(year_diag, month_diag)

. format mo_year_diagn %tm

. 
. *Include only most recent EIA sub-diagnosis=============================================*/
. 
. replace ra_code =0 if psa_code_date >= ra_code_date & psa_code_date !=.
(29,198 real changes made)

. replace ra_code =0 if anksp_code_date >= ra_code_date & anksp_code_date !=.
(9,959 real changes made)

. replace psa_code =0 if ra_code_date >= psa_code_date & ra_code_date !=.
(29,435 real changes made)

. replace psa_code =0 if anksp_code_date >= psa_code_date & anksp_code_date !=.
(9,943 real changes made)

. replace anksp_code =0 if psa_code_date >= anksp_code_date & psa_code_date !=.
(29,346 real changes made)

. replace anksp_code =0 if ra_code_date >= anksp_code_date & ra_code_date !=.
(9,967 real changes made)

. gen eia_diagnosis=1 if ra_code==1
(39,751 missing values generated)

. replace eia_diagnosis=2 if psa_code==1
(19,809 real changes made)

. replace eia_diagnosis=3 if anksp_code==1
(19,887 real changes made)

. lab define eia_diagnosis 1 "RA" 2 "PsA" 3 "AxSpA", modify

. lab val eia_diagnosis eia_diagnosis

. tab eia_diagnosis, missing

eia_diagnos |
         is |      Freq.     Percent        Cum.
------------+-----------------------------------
         RA |     20,043       33.52       33.52
        PsA |     19,809       33.13       66.65
      AxSpA |     19,887       33.26       99.91
          . |         55        0.09      100.00
------------+-----------------------------------
      Total |     59,794      100.00

. drop if eia_diagnosis==.
(55 observations deleted)

. 
. *Define drugs and dates=====================================================*/
. 
. **csDMARDs (not including high cost MTX; wouldn't be shared care)
. gen csdmard=1 if hydroxychloroquine==1 | leflunomide==1 | methotrexate==1 | methotrexate_inj==1 | sulfasalazine==1
(35,271 missing values generated)

. recode csdmard .=0 
(35271 changes made to csdmard)

. tab csdmard, missing

    csdmard |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     35,271       59.04       59.04
          1 |     24,468       40.96      100.00
------------+-----------------------------------
      Total |     59,739      100.00

. bys eia_diagnosis: tab csdmard

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

    csdmard |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     11,893       59.34       59.34
          1 |      8,150       40.66      100.00
------------+-----------------------------------
      Total |     20,043      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    csdmard |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     11,665       58.89       58.89
          1 |      8,144       41.11      100.00
------------+-----------------------------------
      Total |     19,809      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    csdmard |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     11,713       58.90       58.90
          1 |      8,174       41.10      100.00
------------+-----------------------------------
      Total |     19,887      100.00


. 
. **csDMARDs (including high cost MTX)
. gen csdmard_hcd=1 if hydroxychloroquine==1 | leflunomide==1 | methotrexate==1 | methotrexate_inj==1 | methotrexate_hcd==1 | sulfasalazine==1
(31,692 missing values generated)

. recode csdmard_hcd .=0 
(31692 changes made to csdmard_hcd)

. tab csdmard_hcd, missing

csdmard_hcd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     31,692       53.05       53.05
          1 |     28,047       46.95      100.00
------------+-----------------------------------
      Total |     59,739      100.00

. bys eia_diagnosis: tab csdmard_hcd, missing

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

csdmard_hcd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,701       53.39       53.39
          1 |      9,342       46.61      100.00
------------+-----------------------------------
      Total |     20,043      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

csdmard_hcd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,476       52.89       52.89
          1 |      9,333       47.11      100.00
------------+-----------------------------------
      Total |     19,809      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

csdmard_hcd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,515       52.87       52.87
          1 |      9,372       47.13      100.00
------------+-----------------------------------
      Total |     19,887      100.00


. 
. **Date of first csDMARD script (not including high cost MTX prescriptions)
. gen csdmard_date=min(hydroxychloroquine_date, leflunomide_date, methotrexate_date, methotrexate_inj_date, sulfasalazine_date)
(35,271 missing values generated)

. format %td csdmard_date

. 
. **Date of first csDMARD script (including high cost MTX prescriptions)
. gen csdmard_hcd_date=min(hydroxychloroquine_date, leflunomide_date, methotrexate_date, methotrexate_inj_date, methotrexate_hcd_date, sulfasalazine_date)
(31,692 missing values generated)

. format %td csdmard_hcd_date

. 
. **Biologic use
. gen biologic=1 if abatacept==1 | adalimumab==1 | baricitinib==1 | certolizumab==1 | etanercept==1 | golimumab==1 | guselkumab==1 | infliximab==1 | ixekizumab==1 | rituximab==1 | sarilumab==1 | secukinumab==1 | tocilizumab
> ==1 | tofacitinib==1 | upadacitinib==1 | ustekinumab==1 
(11,123 missing values generated)

. recode biologic .=0
(11123 changes made to biologic)

. tab biologic, missing

   biologic |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     11,123       18.62       18.62
          1 |     48,616       81.38      100.00
------------+-----------------------------------
      Total |     59,739      100.00

. bys eia_diagnosis: tab biologic, missing 

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

   biologic |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,684       18.38       18.38
          1 |     16,359       81.62      100.00
------------+-----------------------------------
      Total |     20,043      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

   biologic |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,712       18.74       18.74
          1 |     16,097       81.26      100.00
------------+-----------------------------------
      Total |     19,809      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

   biologic |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,727       18.74       18.74
          1 |     16,160       81.26      100.00
------------+-----------------------------------
      Total |     19,887      100.00


. 
. **Date of first biologic script
. gen biologic_date=min(abatacept_date, adalimumab_date, baricitinib_date, certolizumab_date, etanercept_date, golimumab_date, guselkumab_date, infliximab_date, ixekizumab_date, rituximab_date, sarilumab_date, secukinumab_d
> ate, tocilizumab_date, tofacitinib_date, upadacitinib_date, ustekinumab_date)
(11,123 missing values generated)

. format %td biologic_date

. 
. **Exclude if first csdmard or biologic was before first rheum appt
. ***Nb. could introduce leeway e.g. 30 days?
. tab csdmard if rheum_appt_date!=. & csdmard_date!=. & csdmard_date<rheum_appt_date

    csdmard |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      8,775      100.00      100.00
------------+-----------------------------------
      Total |      8,775      100.00

. drop if rheum_appt_date!=. & csdmard_date!=. & csdmard_date<rheum_appt_date
(8,775 observations deleted)

. tab biologic if rheum_appt_date!=. & biologic_date!=. & biologic_date<rheum_appt_date 

   biologic |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     15,545      100.00      100.00
------------+-----------------------------------
      Total |     15,545      100.00

. drop if rheum_appt_date!=. & biologic_date!=. & biologic_date<rheum_appt_date 
(15,545 observations deleted)

. 
. *Number of EIA diagnoses in 1-year time windows=========================================*/
. 
. gen diagnosis_year=1 if eia_code_date>=td(01mar2019) & eia_code_date<td(01mar2020)
(24,160 missing values generated)

. replace diagnosis_year=2 if eia_code_date>=td(01mar2020) & eia_code_date<td(01mar2021)
(11,276 real changes made)

. replace diagnosis_year=3 if eia_code_date>=td(01mar2021) & eia_code_date<td(01mar2022)
(11,325 real changes made)

. lab define diagnosis_year 1 "March 2019-March 2020" 2 "March 2020-March 2021" 3 "March 2021-March 2022", modify

. lab val diagnosis_year diagnosis_year

. lab var diagnosis_year "Year of diagnosis"

. tab diagnosis_year, missing

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |     11,259       31.79       31.79
March 2020-March 2021 |     11,276       31.84       63.62
March 2021-March 2022 |     11,325       31.97       95.60
                    . |      1,559        4.40      100.00
----------------------+-----------------------------------
                Total |     35,419      100.00

. bys eia_diagnosis: tab diagnosis_year, missing

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |      3,857       32.35       32.35
March 2020-March 2021 |      3,753       31.48       63.84
March 2021-March 2022 |      3,776       31.68       95.51
                    . |        535        4.49      100.00
----------------------+-----------------------------------
                Total |     11,921      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |      3,699       31.38       31.38
March 2020-March 2021 |      3,785       32.11       63.48
March 2021-March 2022 |      3,793       32.17       95.66
                    . |        512        4.34      100.00
----------------------+-----------------------------------
                Total |     11,789      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |      3,703       31.63       31.63
March 2020-March 2021 |      3,738       31.92       63.55
March 2021-March 2022 |      3,756       32.08       95.63
                    . |        512        4.37      100.00
----------------------+-----------------------------------
                Total |     11,709      100.00


. 
. **Proportion of patients with at least 6 or 12 months of GP follow-up after EIA code
. tab has_6m_follow_up

has_6m_foll |
      ow_up |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,782        5.03        5.03
          1 |     33,637       94.97      100.00
------------+-----------------------------------
      Total |     35,419      100.00

. tab has_12m_follow_up

has_12m_fol |
     low_up |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,516        9.93        9.93
          1 |     31,903       90.07      100.00
------------+-----------------------------------
      Total |     35,419      100.00

. tab mo_year_diagn has_6m_follow_up

mo_year_di |   has_6m_follow_up
       agn |         0          1 |     Total
-----------+----------------------+----------
    2019m3 |        42        880 |       922 
    2019m4 |        47        873 |       920 
    2019m5 |        52        925 |       977 
    2019m6 |        53        900 |       953 
    2019m7 |        51        878 |       929 
    2019m8 |        41        907 |       948 
    2019m9 |        45        890 |       935 
   2019m10 |        42        877 |       919 
   2019m11 |        47        937 |       984 
   2019m12 |        52        901 |       953 
    2020m1 |        51        876 |       927 
    2020m2 |        56        836 |       892 
    2020m3 |        52        940 |       992 
    2020m4 |        38        852 |       890 
    2020m5 |        49        890 |       939 
    2020m6 |        37        879 |       916 
    2020m7 |        64        981 |     1,045 
    2020m8 |        44        856 |       900 
    2020m9 |        48        875 |       923 
   2020m10 |        43        917 |       960 
   2020m11 |        57        879 |       936 
   2020m12 |        43        891 |       934 
    2021m1 |        52        852 |       904 
    2021m2 |        44        893 |       937 
    2021m3 |        47        904 |       951 
    2021m4 |        61        883 |       944 
    2021m5 |        47        912 |       959 
    2021m6 |        43        945 |       988 
    2021m7 |        49        917 |       966 
    2021m8 |        45        895 |       940 
    2021m9 |        38        881 |       919 
   2021m10 |        50        855 |       905 
   2021m11 |        44        905 |       949 
   2021m12 |        50        919 |       969 
    2022m1 |        58        920 |       978 
    2022m2 |        37        820 |       857 
    2022m3 |        35        870 |       905 
    2022m4 |        28        626 |       654 
-----------+----------------------+----------
     Total |     1,782     33,637 |    35,419 

. tab mo_year_diagn has_12m_follow_up

mo_year_di |   has_12m_follow_up
       agn |         0          1 |     Total
-----------+----------------------+----------
    2019m3 |        91        831 |       922 
    2019m4 |        98        822 |       920 
    2019m5 |        89        888 |       977 
    2019m6 |        87        866 |       953 
    2019m7 |        86        843 |       929 
    2019m8 |       117        831 |       948 
    2019m9 |        95        840 |       935 
   2019m10 |        96        823 |       919 
   2019m11 |        97        887 |       984 
   2019m12 |       116        837 |       953 
    2020m1 |        91        836 |       927 
    2020m2 |        93        799 |       892 
    2020m3 |       101        891 |       992 
    2020m4 |        94        796 |       890 
    2020m5 |        83        856 |       939 
    2020m6 |        75        841 |       916 
    2020m7 |        97        948 |     1,045 
    2020m8 |        94        806 |       900 
    2020m9 |        90        833 |       923 
   2020m10 |        94        866 |       960 
   2020m11 |        90        846 |       936 
   2020m12 |        92        842 |       934 
    2021m1 |        88        816 |       904 
    2021m2 |        92        845 |       937 
    2021m3 |        90        861 |       951 
    2021m4 |        86        858 |       944 
    2021m5 |        97        862 |       959 
    2021m6 |        93        895 |       988 
    2021m7 |        83        883 |       966 
    2021m8 |       103        837 |       940 
    2021m9 |        87        832 |       919 
   2021m10 |        83        822 |       905 
   2021m11 |        97        852 |       949 
   2021m12 |       113        856 |       969 
    2022m1 |        99        879 |       978 
    2022m2 |        80        777 |       857 
    2022m3 |        83        822 |       905 
    2022m4 |        76        578 |       654 
-----------+----------------------+----------
     Total |     3,516     31,903 |    35,419 

. tab diagnosis_year if has_6m_follow_up==1, missing

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |     10,680       31.75       31.75
March 2020-March 2021 |     10,705       31.83       63.58
March 2021-March 2022 |     10,756       31.98       95.55
                    . |      1,496        4.45      100.00
----------------------+-----------------------------------
                Total |     33,637      100.00

. bys eia_diagnosis: tab diagnosis_year if has_6m_follow_up==1, missing

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |      3,662       32.32       32.32
March 2020-March 2021 |      3,575       31.55       63.87
March 2021-March 2022 |      3,586       31.65       95.52
                    . |        508        4.48      100.00
----------------------+-----------------------------------
                Total |     11,331      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |      3,516       31.47       31.47
March 2020-March 2021 |      3,569       31.95       63.42
March 2021-March 2022 |      3,597       32.20       95.62
                    . |        489        4.38      100.00
----------------------+-----------------------------------
                Total |     11,171      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |      3,502       31.45       31.45
March 2020-March 2021 |      3,561       31.98       63.43
March 2021-March 2022 |      3,573       32.09       95.52
                    . |        499        4.48      100.00
----------------------+-----------------------------------
                Total |     11,135      100.00


. tab diagnosis_year if has_12m_follow_up==1, missing

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |     10,103       31.67       31.67
March 2020-March 2021 |     10,186       31.93       63.60
March 2021-March 2022 |     10,214       32.02       95.61
                    . |      1,400        4.39      100.00
----------------------+-----------------------------------
                Total |     31,903      100.00

. bys eia_diagnosis: tab diagnosis_year if has_12m_follow_up==1, missing

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |      3,460       32.26       32.26
March 2020-March 2021 |      3,379       31.51       63.77
March 2021-March 2022 |      3,395       31.66       95.42
                    . |        491        4.58      100.00
----------------------+-----------------------------------
                Total |     10,725      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |      3,340       31.30       31.30
March 2020-March 2021 |      3,436       32.20       63.50
March 2021-March 2022 |      3,447       32.30       95.80
                    . |        448        4.20      100.00
----------------------+-----------------------------------
                Total |     10,671      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |      3,303       31.44       31.44
March 2020-March 2021 |      3,371       32.08       63.52
March 2021-March 2022 |      3,372       32.09       95.61
                    . |        461        4.39      100.00
----------------------+-----------------------------------
                Total |     10,507      100.00


. 
. *Define appointments and referrals======================================*/
. **Nb. not excluding those without 6m+ follow-up
. 
. **Rheumatology appt 
. tab rheum_appt  //proportion with first rheum outpatient date in the year before EIA code appears in GP record (could change to two years)

 rheum_appt |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,012       16.97       16.97
          1 |     29,407       83.03      100.00
------------+-----------------------------------
      Total |     35,419      100.00

. tab rheum_appt if rheum_appt_date<eia_code_date & rheum_appt_date!=. //confirm proportion who had rheum appt (i.e. not missing) and appt before EIA code (should be accounted for by Python code)

 rheum_appt |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     23,860      100.00      100.00
------------+-----------------------------------
      Total |     23,860      100.00

. 
. **Rheumatology referrals
. tab referral_rheum_prerheum //last rheum referral in the year before rheumatology outpatient (requires rheum appt to have been present, and rheum appt to be before EIA code)

referral_rh |
eum_prerheu |
          m |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,497        9.87        9.87
          1 |     31,922       90.13      100.00
------------+-----------------------------------
      Total |     35,419      100.00

. tab referral_rheum_prerheum if rheum_appt!=0  //last rheum referral in the year before rheumatology outpatient if rheum appt date present

referral_rh |
eum_prerheu |
          m |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,897        9.85        9.85
          1 |     26,510       90.15      100.00
------------+-----------------------------------
      Total |     29,407      100.00

. tab referral_rheum_prerheum if rheum_appt!=0 & referral_rheum_prerheum_date<rheum_appt_date  //last rheum referral in the year before rheumatology outpatient, assuming ref date before rheum appt date (should be accounted 
> for by Python code)

referral_rh |
eum_prerheu |
          m |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      8,645      100.00      100.00
------------+-----------------------------------
      Total |      8,645      100.00

. tab referral_rheum_precode //last rheum referral in the year before EIA code (could use if rheum appt missing)

referral_rh |
eum_precode |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,516        9.93        9.93
          1 |     31,903       90.07      100.00
------------+-----------------------------------
      Total |     35,419      100.00

. gen referral_rheum_comb_date = referral_rheum_prerheum_date if referral_rheum_prerheum_date!=.
(3,497 missing values generated)

. replace referral_rheum_comb_date = referral_rheum_precode_date if referral_rheum_prerheum_date==. & referral_rheum_precode_date!=.
(3,119 real changes made)

. format %td referral_rheum_comb_date

. codebook referral_rheum_comb_date

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
referral_rheum_comb_date                                                                                                                                                                                            (unlabeled)
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

                  Type: Numeric daily date (float)

                 Range: [21260,22756]                 Units: 1
       Or equivalently: [17mar2018,21apr2022]         Units: days
         Unique values: 1,497                     Missing .: 378/35,419

                  Mean: 22006.9 = 01apr2020(+ 22 hours)
             Std. dev.: 431.146
           Percentiles:       10%        25%        50%        75%        90%
                            21410      21635      22005      22382      22604
                        14aug2018  27mar2019  31mar2020  12apr2021  20nov2021

. 
. **GP appointments
. tab last_gp_refrheum //proportion with last GP appointment in year before rheum referral (pre-rheum appt); requires there to have been a rheum referral, before a rheum appt, before an EIA code

last_gp_ref |
      rheum |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,503        9.89        9.89
          1 |     31,916       90.11      100.00
------------+-----------------------------------
      Total |     35,419      100.00

. gen all_appts=1 if last_gp_refrheum==1 & referral_rheum_prerheum==1 & rheum_appt==1 & eia_code==1 & last_gp_refrheum_date<referral_rheum_prerheum_date & referral_rheum_prerheum_date<rheum_appt_date & rheum_appt_date<eia_c
> ode_date 
(34,462 missing values generated)

. recode all_appts .=0
(34462 changes made to all_appts)

. tab all_appts, missing //KEY - proportion who had a last gp appt, then rheum ref, then rheum appt, then EIA code 

  all_appts |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     34,462       97.30       97.30
          1 |        957        2.70      100.00
------------+-----------------------------------
      Total |     35,419      100.00

. tab last_gp_refcode //last GP appointment before rheum ref (i.e. pre-eia code ref); requires there to have been a rheum referral before an EIA code (i.e. rheum appt could have been missing)

last_gp_ref |
       code |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,572       10.08       10.08
          1 |     31,847       89.92      100.00
------------+-----------------------------------
      Total |     35,419      100.00

. tab last_gp_prerheum //last GP appointment before rheum appt; requires there to have been a rheum appt before and EIA code

last_gp_pre |
      rheum |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,558       10.05       10.05
          1 |     31,861       89.95      100.00
------------+-----------------------------------
      Total |     35,419      100.00

. tab last_gp_precode //last GP appointment before EIA code

last_gp_pre |
       code |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,589       10.13       10.13
          1 |     31,830       89.87      100.00
------------+-----------------------------------
      Total |     35,419      100.00

. 
. **For sensitivity analyses for those without rheum_appt, replace diagnosis date as EIA code date if rheum appt pre-code is missing or after
. gen eia_diagnosis_date_nomiss=rheum_appt_date if rheum_appt_date!=.
(6,012 missing values generated)

. format %td eia_diagnosis_date_nomiss

. replace eia_diagnosis_date_nomiss=eia_code_date if (rheum_appt_date==. | rheum_appt_date>eia_code_date) & eia_code_date!=.
(11,531 real changes made)

. gen eia_diagnosis_nomiss=1 if eia_diagnosis_date_nomiss!=.

. recode eia_diagnosis_nomiss .=0
(0 changes made to eia_diagnosis_nomiss)

. tab eia_diagnosis_nomiss

eia_diagnos |
  is_nomiss |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     35,419      100.00      100.00
------------+-----------------------------------
      Total |     35,419      100.00

. 
. *Time to referral, appointment and EIA code=============================================*/
. 
. **Time from last GP to rheum ref before rheum appt (i.e. if appts are present and in correct time order) //Note - referral could (in theory) be coded just before GP appt
. gen time_gp_rheum_ref_appt = (referral_rheum_prerheum_date - last_gp_refrheum_date) if referral_rheum_prerheum_date!=. & last_gp_refrheum_date!=. & rheum_appt_date!=. & referral_rheum_prerheum_date>last_gp_refrheum_date &
>  referral_rheum_prerheum_date<rheum_appt_date & rheum_appt_date<eia_code_date
(34,462 missing values generated)

. tabstat time_gp_rheum_ref_appt, stats (n mean p50 p25 p75) //all patients (should be same number as all_appts)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~t |       957  239.1275       176        73       354
----------------------------------------------------------------

. bys eia_diagnosis: tabstat time_gp_rheum_ref_appt, stats (n mean p50 p25 p75) //by eia diagnosis

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~t |       328  228.4817     165.5      72.5       326
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~t |       312   241.984     175.5      71.5     353.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~t |       317  247.3312       188        77       376
----------------------------------------------------------------

. bys diagnosis_year: tabstat time_gp_rheum_ref_appt, stats (n mean p50 p25 p75) //by diagnosis year

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~t |       103   140.165       112        42       217
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~t |       267  215.5768       162        60       321
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~t |       512  259.5977       192        82     386.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~t |        75  319.1333       233       101       506
----------------------------------------------------------------

. bys nuts_region: tabstat time_gp_rheum_ref_appt, stats (n mean p50 p25 p75) //by region

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~t |        94   219.617       164        67       324
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~t |        88  243.1818     200.5      89.5     364.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~t |       203   251.734       172        71       367
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~t |       101  228.1683       162        65       330
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~t |       101  210.6337       159        58       317
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~t |       182  237.2967       172        71       355
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~t |        96  257.9583       206     104.5       400
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~t |        92  254.6522     193.5      77.5     363.5
----------------------------------------------------------------

. 
. gen gp_ref_cat=1 if time_gp_rheum_ref_appt<=3 & time_gp_rheum_ref_appt!=. 
(35,408 missing values generated)

. replace gp_ref_cat=2 if time_gp_rheum_ref_appt<=7 & time_gp_rheum_ref_appt!=. & gp_ref_cat==.
(11 real changes made)

. replace gp_ref_cat=3 if time_gp_rheum_ref_appt>7 & time_gp_rheum_ref_appt!=. & gp_ref_cat==.
(935 real changes made)

. lab define gp_ref_cat 1 "Referred within 3 days" 2 "Referred within 7 days" 3 "Referral delay >7 days", modify

. lab val gp_ref_cat gp_ref_cat

. lab var gp_ref_cat "Time to GP referral"

. tab gp_ref_cat, missing

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |         11        0.03        0.03
Referred within 7 days |         11        0.03        0.06
Referral delay >7 days |        935        2.64        2.70
                     . |     34,462       97.30      100.00
-----------------------+-----------------------------------
                 Total |     35,419      100.00

. tab gp_ref_cat

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |         11        1.15        1.15
Referred within 7 days |         11        1.15        2.30
Referral delay >7 days |        935       97.70      100.00
-----------------------+-----------------------------------
                 Total |        957      100.00

. bys eia_diagnosis: tab gp_ref_cat, missing

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        0.01        0.01
Referred within 7 days |          4        0.03        0.04
Referral delay >7 days |        323        2.71        2.75
                     . |     11,593       97.25      100.00
-----------------------+-----------------------------------
                 Total |     11,921      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          8        0.07        0.07
Referred within 7 days |          3        0.03        0.09
Referral delay >7 days |        301        2.55        2.65
                     . |     11,477       97.35      100.00
-----------------------+-----------------------------------
                 Total |     11,789      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          2        0.02        0.02
Referred within 7 days |          4        0.03        0.05
Referral delay >7 days |        311        2.66        2.71
                     . |     11,392       97.29      100.00
-----------------------+-----------------------------------
                 Total |     11,709      100.00


. bys eia_diagnosis: tab gp_ref_cat

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        0.30        0.30
Referred within 7 days |          4        1.22        1.52
Referral delay >7 days |        323       98.48      100.00
-----------------------+-----------------------------------
                 Total |        328      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          8        2.56        2.56
Referred within 7 days |          3        0.96        3.53
Referral delay >7 days |        301       96.47      100.00
-----------------------+-----------------------------------
                 Total |        312      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          2        0.63        0.63
Referred within 7 days |          4        1.26        1.89
Referral delay >7 days |        311       98.11      100.00
-----------------------+-----------------------------------
                 Total |        317      100.00


. bys diagnosis_year: tab gp_ref_cat, missing

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        0.01        0.01
Referred within 7 days |          2        0.02        0.03
Referral delay >7 days |        100        0.89        0.91
                     . |     11,156       99.09      100.00
-----------------------+-----------------------------------
                 Total |     11,259      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          6        0.05        0.05
Referred within 7 days |          3        0.03        0.08
Referral delay >7 days |        258        2.29        2.37
                     . |     11,009       97.63      100.00
-----------------------+-----------------------------------
                 Total |     11,276      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          4        0.04        0.04
Referred within 7 days |          6        0.05        0.09
Referral delay >7 days |        502        4.43        4.52
                     . |     10,813       95.48      100.00
-----------------------+-----------------------------------
                 Total |     11,325      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referral delay >7 days |         75        4.81        4.81
                     . |      1,484       95.19      100.00
-----------------------+-----------------------------------
                 Total |      1,559      100.00


. bys diagnosis_year: tab gp_ref_cat

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        0.97        0.97
Referred within 7 days |          2        1.94        2.91
Referral delay >7 days |        100       97.09      100.00
-----------------------+-----------------------------------
                 Total |        103      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          6        2.25        2.25
Referred within 7 days |          3        1.12        3.37
Referral delay >7 days |        258       96.63      100.00
-----------------------+-----------------------------------
                 Total |        267      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          4        0.78        0.78
Referred within 7 days |          6        1.17        1.95
Referral delay >7 days |        502       98.05      100.00
-----------------------+-----------------------------------
                 Total |        512      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referral delay >7 days |         75      100.00      100.00
-----------------------+-----------------------------------
                 Total |         75      100.00


. bys nuts_region: tab gp_ref_cat, missing

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        0.03        0.03
Referred within 7 days |          2        0.06        0.09
Referral delay >7 days |         91        2.59        2.68
                     . |      3,419       97.32      100.00
-----------------------+-----------------------------------
                 Total |      3,513      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 7 days |          2        0.06        0.06
Referral delay >7 days |         86        2.42        2.48
                     . |      3,463       97.52      100.00
-----------------------+-----------------------------------
                 Total |      3,551      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          3        0.04        0.04
Referred within 7 days |          1        0.01        0.06
Referral delay >7 days |        199        2.80        2.85
                     . |      6,912       97.15      100.00
-----------------------+-----------------------------------
                 Total |      7,115      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        0.03        0.03
Referred within 7 days |          1        0.03        0.06
Referral delay >7 days |         99        2.81        2.87
                     . |      3,416       97.13      100.00
-----------------------+-----------------------------------
                 Total |      3,517      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        0.03        0.03
Referred within 7 days |          2        0.06        0.08
Referral delay >7 days |         98        2.72        2.80
                     . |      3,503       97.20      100.00
-----------------------+-----------------------------------
                 Total |      3,604      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          5        0.07        0.07
Referral delay >7 days |        177        2.49        2.56
                     . |      6,915       97.44      100.00
-----------------------+-----------------------------------
                 Total |      7,097      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 7 days |          1        0.03        0.03
Referral delay >7 days |         95        2.75        2.78
                     . |      3,355       97.22      100.00
-----------------------+-----------------------------------
                 Total |      3,451      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 7 days |          2        0.06        0.06
Referral delay >7 days |         90        2.52        2.58
                     . |      3,479       97.42      100.00
-----------------------+-----------------------------------
                 Total |      3,571      100.00


. bys nuts_region: tab gp_ref_cat

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        1.06        1.06
Referred within 7 days |          2        2.13        3.19
Referral delay >7 days |         91       96.81      100.00
-----------------------+-----------------------------------
                 Total |         94      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 7 days |          2        2.27        2.27
Referral delay >7 days |         86       97.73      100.00
-----------------------+-----------------------------------
                 Total |         88      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          3        1.48        1.48
Referred within 7 days |          1        0.49        1.97
Referral delay >7 days |        199       98.03      100.00
-----------------------+-----------------------------------
                 Total |        203      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        0.99        0.99
Referred within 7 days |          1        0.99        1.98
Referral delay >7 days |         99       98.02      100.00
-----------------------+-----------------------------------
                 Total |        101      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        0.99        0.99
Referred within 7 days |          2        1.98        2.97
Referral delay >7 days |         98       97.03      100.00
-----------------------+-----------------------------------
                 Total |        101      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          5        2.75        2.75
Referral delay >7 days |        177       97.25      100.00
-----------------------+-----------------------------------
                 Total |        182      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 7 days |          1        1.04        1.04
Referral delay >7 days |         95       98.96      100.00
-----------------------+-----------------------------------
                 Total |         96      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 7 days |          2        2.17        2.17
Referral delay >7 days |         90       97.83      100.00
-----------------------+-----------------------------------
                 Total |         92      100.00


. 
. gen gp_ref_3d=1 if time_gp_rheum_ref_appt<=3 & time_gp_rheum_ref_appt!=. 
(35,408 missing values generated)

. replace gp_ref_3d=2 if time_gp_rheum_ref_appt>3 & time_gp_rheum_ref_appt!=.
(946 real changes made)

. lab define gp_ref_3d 1 "Referred within 3 days" 2 "Referral delay >3 days", modify

. lab val gp_ref_3d gp_ref_3d

. lab var gp_ref_3d "Time to GP referral"

. tab gp_ref_3d, missing

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |         11        0.03        0.03
Referral delay >3 days |        946        2.67        2.70
                     . |     34,462       97.30      100.00
-----------------------+-----------------------------------
                 Total |     35,419      100.00

. tab gp_ref_3d

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |         11        1.15        1.15
Referral delay >3 days |        946       98.85      100.00
-----------------------+-----------------------------------
                 Total |        957      100.00

. bys eia_diagnosis: tab gp_ref_3d, missing

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        0.01        0.01
Referral delay >3 days |        327        2.74        2.75
                     . |     11,593       97.25      100.00
-----------------------+-----------------------------------
                 Total |     11,921      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          8        0.07        0.07
Referral delay >3 days |        304        2.58        2.65
                     . |     11,477       97.35      100.00
-----------------------+-----------------------------------
                 Total |     11,789      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          2        0.02        0.02
Referral delay >3 days |        315        2.69        2.71
                     . |     11,392       97.29      100.00
-----------------------+-----------------------------------
                 Total |     11,709      100.00


. bys eia_diagnosis: tab gp_ref_3d

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        0.30        0.30
Referral delay >3 days |        327       99.70      100.00
-----------------------+-----------------------------------
                 Total |        328      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          8        2.56        2.56
Referral delay >3 days |        304       97.44      100.00
-----------------------+-----------------------------------
                 Total |        312      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          2        0.63        0.63
Referral delay >3 days |        315       99.37      100.00
-----------------------+-----------------------------------
                 Total |        317      100.00


. bys diagnosis_year: tab gp_ref_3d, missing

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        0.01        0.01
Referral delay >3 days |        102        0.91        0.91
                     . |     11,156       99.09      100.00
-----------------------+-----------------------------------
                 Total |     11,259      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          6        0.05        0.05
Referral delay >3 days |        261        2.31        2.37
                     . |     11,009       97.63      100.00
-----------------------+-----------------------------------
                 Total |     11,276      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          4        0.04        0.04
Referral delay >3 days |        508        4.49        4.52
                     . |     10,813       95.48      100.00
-----------------------+-----------------------------------
                 Total |     11,325      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referral delay >3 days |         75        4.81        4.81
                     . |      1,484       95.19      100.00
-----------------------+-----------------------------------
                 Total |      1,559      100.00


. bys diagnosis_year: tab gp_ref_3d

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        0.97        0.97
Referral delay >3 days |        102       99.03      100.00
-----------------------+-----------------------------------
                 Total |        103      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          6        2.25        2.25
Referral delay >3 days |        261       97.75      100.00
-----------------------+-----------------------------------
                 Total |        267      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          4        0.78        0.78
Referral delay >3 days |        508       99.22      100.00
-----------------------+-----------------------------------
                 Total |        512      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referral delay >3 days |         75      100.00      100.00
-----------------------+-----------------------------------
                 Total |         75      100.00


. bys nuts_region: tab gp_ref_3d, missing

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        0.03        0.03
Referral delay >3 days |         93        2.65        2.68
                     . |      3,419       97.32      100.00
-----------------------+-----------------------------------
                 Total |      3,513      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referral delay >3 days |         88        2.48        2.48
                     . |      3,463       97.52      100.00
-----------------------+-----------------------------------
                 Total |      3,551      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          3        0.04        0.04
Referral delay >3 days |        200        2.81        2.85
                     . |      6,912       97.15      100.00
-----------------------+-----------------------------------
                 Total |      7,115      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        0.03        0.03
Referral delay >3 days |        100        2.84        2.87
                     . |      3,416       97.13      100.00
-----------------------+-----------------------------------
                 Total |      3,517      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        0.03        0.03
Referral delay >3 days |        100        2.77        2.80
                     . |      3,503       97.20      100.00
-----------------------+-----------------------------------
                 Total |      3,604      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          5        0.07        0.07
Referral delay >3 days |        177        2.49        2.56
                     . |      6,915       97.44      100.00
-----------------------+-----------------------------------
                 Total |      7,097      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referral delay >3 days |         96        2.78        2.78
                     . |      3,355       97.22      100.00
-----------------------+-----------------------------------
                 Total |      3,451      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referral delay >3 days |         92        2.58        2.58
                     . |      3,479       97.42      100.00
-----------------------+-----------------------------------
                 Total |      3,571      100.00


. bys nuts_region: tab gp_ref_3d

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        1.06        1.06
Referral delay >3 days |         93       98.94      100.00
-----------------------+-----------------------------------
                 Total |         94      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referral delay >3 days |         88      100.00      100.00
-----------------------+-----------------------------------
                 Total |         88      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          3        1.48        1.48
Referral delay >3 days |        200       98.52      100.00
-----------------------+-----------------------------------
                 Total |        203      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        0.99        0.99
Referral delay >3 days |        100       99.01      100.00
-----------------------+-----------------------------------
                 Total |        101      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          1        0.99        0.99
Referral delay >3 days |        100       99.01      100.00
-----------------------+-----------------------------------
                 Total |        101      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referred within 3 days |          5        2.75        2.75
Referral delay >3 days |        177       97.25      100.00
-----------------------+-----------------------------------
                 Total |        182      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referral delay >3 days |         96      100.00      100.00
-----------------------+-----------------------------------
                 Total |         96      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

   Time to GP referral |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Referral delay >3 days |         92      100.00      100.00
-----------------------+-----------------------------------
                 Total |         92      100.00


. 
. **Time from last GP to rheum ref before eia code (sensitivity analysis; includes those with no rheum appt)
. gen time_gp_rheum_ref_code = (referral_rheum_precode_date - last_gp_refcode_date) if referral_rheum_precode_date!=. & last_gp_refcode_date!=. & referral_rheum_precode_date>last_gp_refcode_date & referral_rheum_precode_dat
> e<eia_code_date
(29,229 missing values generated)

. tabstat time_gp_rheum_ref_code, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~e |      6190  373.2814       305       142       548
----------------------------------------------------------------

. bys eia_diagnosis: tabstat time_gp_rheum_ref_code, stats (n mean p50 p25 p75)

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~e |      2010  372.2572       301       137       550
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~e |      2165  378.5058       314       148       557
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~e |      2015  368.6898       299       140       537
----------------------------------------------------------------

. 
. **Time from last GP to rheum ref (combined - sensitivity analysis; includes those with no rheum appt)
. gen time_gp_rheum_ref_comb = time_gp_rheum_ref_appt 
(34,462 missing values generated)

. replace time_gp_rheum_ref_comb = time_gp_rheum_ref_code if time_gp_rheum_ref_appt==. & time_gp_rheum_ref_code!=.
(5,982 real changes made)

. tabstat time_gp_rheum_ref_comb, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~b |      6939  353.1314       283       127       521
----------------------------------------------------------------

. bys eia_diagnosis: tabstat time_gp_rheum_ref_comb, stats (n mean p50 p25 p75)

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~b |      2261  351.0964       280       118       521
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~b |      2412  358.9838       291     132.5       533
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~b |      2266  348.9325     280.5       129       508
----------------------------------------------------------------

. 
. **Time from last GP pre-rheum appt to first rheum appt (key sensitivity analysis; includes those with no rheum ref)
. gen time_gp_rheum_appt = (rheum_appt_date - last_gp_prerheum_date) if rheum_appt_date!=. & last_gp_prerheum_date!=. & rheum_appt_date>last_gp_prerheum_date & rheum_appt_date<eia_code_date
(30,008 missing values generated)

. tabstat time_gp_rheum_appt, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_~m_appt |      5411  298.9763       241       111       431
----------------------------------------------------------------

. bys eia_diagnosis: tabstat time_gp_rheum_appt, stats (n mean p50 p25 p75)

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_~m_appt |      1789  300.8301       238       113       436
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_~m_appt |      1804  302.0399       244       109     436.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_~m_appt |      1818  294.1122     243.5       109       419
----------------------------------------------------------------

. bys diagnosis_year: tabstat time_gp_rheum_appt, stats (n mean p50 p25 p75) //by diagnosis year

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_~m_appt |       861  186.9919       166        77       280
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_~m_appt |      1752  267.7471       223       101     396.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_~m_appt |      2416  349.9346       296       134       517
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_~m_appt |       382  372.3194     291.5       146       547
----------------------------------------------------------------

. bys nuts_region: tabstat time_gp_rheum_appt, stats (n mean p50 p25 p75) //by region

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_~m_appt |       534  306.3165       263       120       433
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_~m_appt |       539  293.8089       248       119       409
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_~m_appt |      1072  301.7397       237     116.5       445
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_~m_appt |       528  294.6515       237        99     426.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_~m_appt |       563   312.087       250       120       452
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_~m_appt |      1093  296.3733       243       100       429
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_~m_appt |       515  291.6602       228       112       409
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_~m_appt |       567  294.4233       231       101       436
----------------------------------------------------------------

. 
. **Time from last GP pre-code to EIA code (sensitivity analysis; includes those with no rheum ref and/or no rheum appt)
. gen time_gp_eia_code = (eia_code_date - last_gp_precode_date) if eia_code_date!=. & last_gp_precode_date!=. & eia_code_date>last_gp_precode_date
(15,854 missing values generated)

. tabstat time_gp_eia_code, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_ei~e |     19565  523.2163       470       234       771
----------------------------------------------------------------

. bys eia_diagnosis: tabstat time_gp_eia_code, stats (n mean p50 p25 p75)

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_ei~e |      6617  523.5713       468       235       765
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_ei~e |      6547  521.4649       469       231       776
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_ei~e |      6401  524.6407       473       236       772
----------------------------------------------------------------

. 
. **Time from last GP to EIA diagnosis (combined - sensitivity analysis; includes those with no rheum appt)
. gen time_gp_eia_diag = time_gp_rheum_appt
(30,008 missing values generated)

. replace time_gp_eia_diag = time_gp_eia_code if time_gp_rheum_appt==. & time_gp_eia_code!=.
(16,125 real changes made)

. tabstat time_gp_eia_diag, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_ei~g |     21536   457.733       391       181       675
----------------------------------------------------------------

. bys eia_diagnosis: tabstat time_gp_eia_diag, stats (n mean p50 p25 p75)

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_ei~g |      7259  459.0906       394       186       671
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_ei~g |      7195  456.8694       389       179       677
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_ei~g |      7082  457.2187       388       179       675
----------------------------------------------------------------

. 
. **Time from rheum ref to rheum appt (i.e. if appts are present and in correct time order)
. gen time_ref_rheum_appt = (rheum_appt_date - referral_rheum_prerheum_date) if rheum_appt_date!=. & referral_rheum_prerheum_date!=. & referral_rheum_prerheum_date<rheum_appt_date & rheum_appt_date<eia_code_date
(29,964 missing values generated)

. tabstat time_ref_rheum_appt, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~t |      5455  292.3115       230       103       421
----------------------------------------------------------------

. bys eia_diagnosis: tabstat time_ref_rheum_appt, stats (n mean p50 p25 p75)

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~t |      1843  288.8709       226       101       417
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~t |      1831  288.3484       226       103       412
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~t |      1781  299.9461       241       105       431
----------------------------------------------------------------

. bys diagnosis_year: tabstat time_ref_rheum_appt, stats (n mean p50 p25 p75) //all patients by diagnosis year

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~t |       856  176.9182       149      66.5       266
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~t |      1796  271.1526       225       100     402.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~t |      2426  335.6628       269       124       494
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~t |       377  376.1512       293       118       548
----------------------------------------------------------------

. bys nuts_region: tabstat time_ref_rheum_appt, stats (n mean p50 p25 p75) //by region

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~t |       546  313.7015     263.5       119       448
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~t |       551  292.4519       233       110       431
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~t |      1093  283.3788       215        99       398
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~t |       542  287.6402       227       113       405
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~t |       561  309.2496       239       105       453
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~t |      1098  298.3087     235.5        99       431
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~t |       516  286.6221       219      99.5     404.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~t |       548  269.2956       218        92     375.5
----------------------------------------------------------------

. 
. gen ref_appt_cat=1 if time_ref_rheum_appt<=21 & time_ref_rheum_appt!=. 
(35,125 missing values generated)

. replace ref_appt_cat=2 if time_ref_rheum_appt<=42 & time_ref_rheum_appt!=. & ref_appt_cat==.
(285 real changes made)

. replace ref_appt_cat=3 if time_ref_rheum_appt>42 & time_ref_rheum_appt!=. & ref_appt_cat==.
(4,876 real changes made)

. lab define ref_appt_cat 1 "Seen within 3 weeks" 2 "Seen within 6 weeks" 3 "Assessment delay >6 weeks", modify

. lab val ref_appt_cat ref_appt_cat

. lab var ref_appt_cat "Time to rheumatology assessment"

. tab ref_appt_cat, missing

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |        294        0.83        0.83
      Seen within 6 weeks |        285        0.80        1.63
Assessment delay >6 weeks |      4,876       13.77       15.40
                        . |     29,964       84.60      100.00
--------------------------+-----------------------------------
                    Total |     35,419      100.00

. tab ref_appt_cat

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |        294        5.39        5.39
      Seen within 6 weeks |        285        5.22       10.61
Assessment delay >6 weeks |      4,876       89.39      100.00
--------------------------+-----------------------------------
                    Total |      5,455      100.00

. bys eia_diagnosis: tab ref_appt_cat, missing

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         96        0.81        0.81
      Seen within 6 weeks |         95        0.80        1.60
Assessment delay >6 weeks |      1,652       13.86       15.46
                        . |     10,078       84.54      100.00
--------------------------+-----------------------------------
                    Total |     11,921      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         96        0.81        0.81
      Seen within 6 weeks |        104        0.88        1.70
Assessment delay >6 weeks |      1,631       13.83       15.53
                        . |      9,958       84.47      100.00
--------------------------+-----------------------------------
                    Total |     11,789      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |        102        0.87        0.87
      Seen within 6 weeks |         86        0.73        1.61
Assessment delay >6 weeks |      1,593       13.60       15.21
                        . |      9,928       84.79      100.00
--------------------------+-----------------------------------
                    Total |     11,709      100.00


. bys eia_diagnosis: tab ref_appt_cat

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         96        5.21        5.21
      Seen within 6 weeks |         95        5.15       10.36
Assessment delay >6 weeks |      1,652       89.64      100.00
--------------------------+-----------------------------------
                    Total |      1,843      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         96        5.24        5.24
      Seen within 6 weeks |        104        5.68       10.92
Assessment delay >6 weeks |      1,631       89.08      100.00
--------------------------+-----------------------------------
                    Total |      1,831      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |        102        5.73        5.73
      Seen within 6 weeks |         86        4.83       10.56
Assessment delay >6 weeks |      1,593       89.44      100.00
--------------------------+-----------------------------------
                    Total |      1,781      100.00


. bys diagnosis_year: tab ref_appt_cat, missing

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         63        0.56        0.56
      Seen within 6 weeks |         76        0.68        1.23
Assessment delay >6 weeks |        717        6.37        7.60
                        . |     10,403       92.40      100.00
--------------------------+-----------------------------------
                    Total |     11,259      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         94        0.83        0.83
      Seen within 6 weeks |         90        0.80        1.63
Assessment delay >6 weeks |      1,612       14.30       15.93
                        . |      9,480       84.07      100.00
--------------------------+-----------------------------------
                    Total |     11,276      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |        117        1.03        1.03
      Seen within 6 weeks |        103        0.91        1.94
Assessment delay >6 weeks |      2,206       19.48       21.42
                        . |      8,899       78.58      100.00
--------------------------+-----------------------------------
                    Total |     11,325      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         20        1.28        1.28
      Seen within 6 weeks |         16        1.03        2.31
Assessment delay >6 weeks |        341       21.87       24.18
                        . |      1,182       75.82      100.00
--------------------------+-----------------------------------
                    Total |      1,559      100.00


. bys diagnosis_year: tab ref_appt_cat

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         63        7.36        7.36
      Seen within 6 weeks |         76        8.88       16.24
Assessment delay >6 weeks |        717       83.76      100.00
--------------------------+-----------------------------------
                    Total |        856      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         94        5.23        5.23
      Seen within 6 weeks |         90        5.01       10.24
Assessment delay >6 weeks |      1,612       89.76      100.00
--------------------------+-----------------------------------
                    Total |      1,796      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |        117        4.82        4.82
      Seen within 6 weeks |        103        4.25        9.07
Assessment delay >6 weeks |      2,206       90.93      100.00
--------------------------+-----------------------------------
                    Total |      2,426      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         20        5.31        5.31
      Seen within 6 weeks |         16        4.24        9.55
Assessment delay >6 weeks |        341       90.45      100.00
--------------------------+-----------------------------------
                    Total |        377      100.00


. bys nuts_region: tab ref_appt_cat, missing

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         21        0.60        0.60
      Seen within 6 weeks |         25        0.71        1.31
Assessment delay >6 weeks |        500       14.23       15.54
                        . |      2,967       84.46      100.00
--------------------------+-----------------------------------
                    Total |      3,513      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         28        0.79        0.79
      Seen within 6 weeks |         25        0.70        1.49
Assessment delay >6 weeks |        498       14.02       15.52
                        . |      3,000       84.48      100.00
--------------------------+-----------------------------------
                    Total |      3,551      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         62        0.87        0.87
      Seen within 6 weeks |         47        0.66        1.53
Assessment delay >6 weeks |        984       13.83       15.36
                        . |      6,022       84.64      100.00
--------------------------+-----------------------------------
                    Total |      7,115      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         28        0.80        0.80
      Seen within 6 weeks |         28        0.80        1.59
Assessment delay >6 weeks |        486       13.82       15.41
                        . |      2,975       84.59      100.00
--------------------------+-----------------------------------
                    Total |      3,517      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         27        0.75        0.75
      Seen within 6 weeks |         35        0.97        1.72
Assessment delay >6 weeks |        499       13.85       15.57
                        . |      3,043       84.43      100.00
--------------------------+-----------------------------------
                    Total |      3,604      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         66        0.93        0.93
      Seen within 6 weeks |         64        0.90        1.83
Assessment delay >6 weeks |        968       13.64       15.47
                        . |      5,999       84.53      100.00
--------------------------+-----------------------------------
                    Total |      7,097      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         30        0.87        0.87
      Seen within 6 weeks |         25        0.72        1.59
Assessment delay >6 weeks |        461       13.36       14.95
                        . |      2,935       85.05      100.00
--------------------------+-----------------------------------
                    Total |      3,451      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         32        0.90        0.90
      Seen within 6 weeks |         36        1.01        1.90
Assessment delay >6 weeks |        480       13.44       15.35
                        . |      3,023       84.65      100.00
--------------------------+-----------------------------------
                    Total |      3,571      100.00


. bys nuts_region: tab ref_appt_cat

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         21        3.85        3.85
      Seen within 6 weeks |         25        4.58        8.42
Assessment delay >6 weeks |        500       91.58      100.00
--------------------------+-----------------------------------
                    Total |        546      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         28        5.08        5.08
      Seen within 6 weeks |         25        4.54        9.62
Assessment delay >6 weeks |        498       90.38      100.00
--------------------------+-----------------------------------
                    Total |        551      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         62        5.67        5.67
      Seen within 6 weeks |         47        4.30        9.97
Assessment delay >6 weeks |        984       90.03      100.00
--------------------------+-----------------------------------
                    Total |      1,093      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         28        5.17        5.17
      Seen within 6 weeks |         28        5.17       10.33
Assessment delay >6 weeks |        486       89.67      100.00
--------------------------+-----------------------------------
                    Total |        542      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         27        4.81        4.81
      Seen within 6 weeks |         35        6.24       11.05
Assessment delay >6 weeks |        499       88.95      100.00
--------------------------+-----------------------------------
                    Total |        561      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         66        6.01        6.01
      Seen within 6 weeks |         64        5.83       11.84
Assessment delay >6 weeks |        968       88.16      100.00
--------------------------+-----------------------------------
                    Total |      1,098      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         30        5.81        5.81
      Seen within 6 weeks |         25        4.84       10.66
Assessment delay >6 weeks |        461       89.34      100.00
--------------------------+-----------------------------------
                    Total |        516      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         32        5.84        5.84
      Seen within 6 weeks |         36        6.57       12.41
Assessment delay >6 weeks |        480       87.59      100.00
--------------------------+-----------------------------------
                    Total |        548      100.00


. 
. gen ref_appt_3w=1 if time_ref_rheum_appt<=21 & time_ref_rheum_appt!=. 
(35,125 missing values generated)

. replace ref_appt_3w=2 if time_ref_rheum_appt>21 & time_ref_rheum_appt!=.
(5,161 real changes made)

. lab define ref_appt_3w 1 "Seen within 3 weeks" 2 "Assessment delay >3 weeks", modify

. lab val ref_appt_3w ref_appt_3w

. lab var ref_appt_3w "Time to rheumatology assessment"

. tab ref_appt_3w, missing

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |        294        0.83        0.83
Assessment delay >3 weeks |      5,161       14.57       15.40
                        . |     29,964       84.60      100.00
--------------------------+-----------------------------------
                    Total |     35,419      100.00

. tab ref_appt_3w

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |        294        5.39        5.39
Assessment delay >3 weeks |      5,161       94.61      100.00
--------------------------+-----------------------------------
                    Total |      5,455      100.00

. bys eia_diagnosis: tab ref_appt_3w, missing

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         96        0.81        0.81
Assessment delay >3 weeks |      1,747       14.65       15.46
                        . |     10,078       84.54      100.00
--------------------------+-----------------------------------
                    Total |     11,921      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         96        0.81        0.81
Assessment delay >3 weeks |      1,735       14.72       15.53
                        . |      9,958       84.47      100.00
--------------------------+-----------------------------------
                    Total |     11,789      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |        102        0.87        0.87
Assessment delay >3 weeks |      1,679       14.34       15.21
                        . |      9,928       84.79      100.00
--------------------------+-----------------------------------
                    Total |     11,709      100.00


. bys eia_diagnosis: tab ref_appt_3w

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         96        5.21        5.21
Assessment delay >3 weeks |      1,747       94.79      100.00
--------------------------+-----------------------------------
                    Total |      1,843      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         96        5.24        5.24
Assessment delay >3 weeks |      1,735       94.76      100.00
--------------------------+-----------------------------------
                    Total |      1,831      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |        102        5.73        5.73
Assessment delay >3 weeks |      1,679       94.27      100.00
--------------------------+-----------------------------------
                    Total |      1,781      100.00


. bys diagnosis_year: tab ref_appt_3w, missing

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         63        0.56        0.56
Assessment delay >3 weeks |        793        7.04        7.60
                        . |     10,403       92.40      100.00
--------------------------+-----------------------------------
                    Total |     11,259      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         94        0.83        0.83
Assessment delay >3 weeks |      1,702       15.09       15.93
                        . |      9,480       84.07      100.00
--------------------------+-----------------------------------
                    Total |     11,276      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |        117        1.03        1.03
Assessment delay >3 weeks |      2,309       20.39       21.42
                        . |      8,899       78.58      100.00
--------------------------+-----------------------------------
                    Total |     11,325      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         20        1.28        1.28
Assessment delay >3 weeks |        357       22.90       24.18
                        . |      1,182       75.82      100.00
--------------------------+-----------------------------------
                    Total |      1,559      100.00


. bys diagnosis_year: tab ref_appt_3w

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         63        7.36        7.36
Assessment delay >3 weeks |        793       92.64      100.00
--------------------------+-----------------------------------
                    Total |        856      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         94        5.23        5.23
Assessment delay >3 weeks |      1,702       94.77      100.00
--------------------------+-----------------------------------
                    Total |      1,796      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |        117        4.82        4.82
Assessment delay >3 weeks |      2,309       95.18      100.00
--------------------------+-----------------------------------
                    Total |      2,426      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         20        5.31        5.31
Assessment delay >3 weeks |        357       94.69      100.00
--------------------------+-----------------------------------
                    Total |        377      100.00


. bys nuts_region: tab ref_appt_3w, missing

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         21        0.60        0.60
Assessment delay >3 weeks |        525       14.94       15.54
                        . |      2,967       84.46      100.00
--------------------------+-----------------------------------
                    Total |      3,513      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         28        0.79        0.79
Assessment delay >3 weeks |        523       14.73       15.52
                        . |      3,000       84.48      100.00
--------------------------+-----------------------------------
                    Total |      3,551      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         62        0.87        0.87
Assessment delay >3 weeks |      1,031       14.49       15.36
                        . |      6,022       84.64      100.00
--------------------------+-----------------------------------
                    Total |      7,115      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         28        0.80        0.80
Assessment delay >3 weeks |        514       14.61       15.41
                        . |      2,975       84.59      100.00
--------------------------+-----------------------------------
                    Total |      3,517      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         27        0.75        0.75
Assessment delay >3 weeks |        534       14.82       15.57
                        . |      3,043       84.43      100.00
--------------------------+-----------------------------------
                    Total |      3,604      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         66        0.93        0.93
Assessment delay >3 weeks |      1,032       14.54       15.47
                        . |      5,999       84.53      100.00
--------------------------+-----------------------------------
                    Total |      7,097      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         30        0.87        0.87
Assessment delay >3 weeks |        486       14.08       14.95
                        . |      2,935       85.05      100.00
--------------------------+-----------------------------------
                    Total |      3,451      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         32        0.90        0.90
Assessment delay >3 weeks |        516       14.45       15.35
                        . |      3,023       84.65      100.00
--------------------------+-----------------------------------
                    Total |      3,571      100.00


. bys nuts_region: tab ref_appt_3w

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         21        3.85        3.85
Assessment delay >3 weeks |        525       96.15      100.00
--------------------------+-----------------------------------
                    Total |        546      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         28        5.08        5.08
Assessment delay >3 weeks |        523       94.92      100.00
--------------------------+-----------------------------------
                    Total |        551      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         62        5.67        5.67
Assessment delay >3 weeks |      1,031       94.33      100.00
--------------------------+-----------------------------------
                    Total |      1,093      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         28        5.17        5.17
Assessment delay >3 weeks |        514       94.83      100.00
--------------------------+-----------------------------------
                    Total |        542      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         27        4.81        4.81
Assessment delay >3 weeks |        534       95.19      100.00
--------------------------+-----------------------------------
                    Total |        561      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         66        6.01        6.01
Assessment delay >3 weeks |      1,032       93.99      100.00
--------------------------+-----------------------------------
                    Total |      1,098      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         30        5.81        5.81
Assessment delay >3 weeks |        486       94.19      100.00
--------------------------+-----------------------------------
                    Total |        516      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

     Time to rheumatology |
               assessment |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
      Seen within 3 weeks |         32        5.84        5.84
Assessment delay >3 weeks |        516       94.16      100.00
--------------------------+-----------------------------------
                    Total |        548      100.00


. 
. **Time from rheum ref or last GP to rheum appt (combined - sensitivity analysis; includes those with no rheum ref)
. gen time_refgp_rheum_appt = time_ref_rheum_appt
(29,964 missing values generated)

. replace time_refgp_rheum_appt = time_gp_rheum_appt if time_ref_rheum_appt==. & time_gp_rheum_appt!=.
(3,516 real changes made)

. bys eia_diagnosis: tabstat time_refgp_rheum_appt, stats (n mean p50 p25 p75)

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_refgp~t |      3008  276.1539       213        99       402
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_refgp~t |      2985  277.7233       215        99       393
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_refgp~t |      2978  282.4379     230.5       100       398
----------------------------------------------------------------

. bys diagnosis_year: tabstat time_refgp_rheum_appt, stats (n mean p50 p25 p75) //all patients by diagnosis year

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_refgp~t |      1529  178.6678       152        69       270
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_refgp~t |      2946  260.3099       212        94       383
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_refgp~t |      3907  321.1354       258       121       466
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_refgp~t |       589  349.8183       270       118       495
----------------------------------------------------------------

. bys nuts_region: tabstat time_refgp_rheum_appt, stats (n mean p50 p25 p75) //by region

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_refgp~t |       889  296.4499       244       112       422
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_refgp~t |       890  279.8742       227       105       405
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_refgp~t |      1804  274.0649     212.5       102       389
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_refgp~t |       878  275.8656       216        98       397
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_refgp~t |       908   298.293     233.5       103       426
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_refgp~t |      1811  280.6356       226        93       400
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_refgp~t |       857  268.3454       202        96       380
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_refgp~t |       934  259.6006     209.5        91       369
----------------------------------------------------------------

. 
. **Time from rheum ref to EIA code (sensitivity analysis; includes those with no rheum appt)
. gen time_ref_rheum_eia = (eia_code_date - referral_rheum_precode_date) if eia_code_date!=. & referral_rheum_precode_date!=. & referral_rheum_precode_date<eia_code_date  
(15,728 missing values generated)

. tabstat time_ref_rheum_eia, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~a |     19691  522.4115       467       236       768
----------------------------------------------------------------

. bys eia_diagnosis: tabstat time_ref_rheum_eia, stats (n mean p50 p25 p75)

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~a |      6610  527.0188       465       241       772
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~a |      6602  520.3028     465.5       235       760
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~a |      6479  519.8597       469       230       772
----------------------------------------------------------------

. 
. **Time from rheum ref to EIA diagnosis (combined - sensitivity analysis; includes those with no rheum appt)
. gen time_ref_rheum_eia_comb = time_ref_rheum_appt
(29,964 missing values generated)

. replace time_ref_rheum_eia_comb = time_ref_rheum_eia if time_ref_rheum_appt==. & time_ref_rheum_eia!=.
(16,263 real changes made)

. tabstat time_ref_rheum_eia_comb, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~b |     21718  457.0601       385       182       678
----------------------------------------------------------------

. bys eia_diagnosis: tabstat time_ref_rheum_eia_comb, stats (n mean p50 p25 p75)

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~b |      7292  459.7078       383       187     676.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~b |      7271  456.1848       384       179       675
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~b |      7155  455.2512       387       179       679
----------------------------------------------------------------

. 
. **Time from rheum appt to EIA code (i.e. if appts are present and in correct time order)
. gen time_rheum_eia_code = (eia_code_date - rheum_appt_date) if eia_code_date!=. & rheum_appt_date!=. & rheum_appt_date<eia_code_date 
(11,559 missing values generated)

. tabstat time_rheum_eia_code, stats (n mean p50 p25 p75) 

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_rheum~e |     23860  602.6203       575       312       871
----------------------------------------------------------------

. bys eia_diagnosis: tabstat time_rheum_eia_code, stats (n mean p50 p25 p75) 

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_rheum~e |      8012  604.1077       577       313       869
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_rheum~e |      7922  603.0566       578       312       871
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_rheum~e |      7926  600.6807       570       310       871
----------------------------------------------------------------

. 
. *Time to first csDMARD prescriptions - all of the below are shared care prescriptions, aside from those with MTX_high cost drug data included======================================================================*/
. 
. *All patients below must have at least six months of GP registration after EIA code
. 
. **Time to first csDMARD script for RA patients, whereby first rheum appt is classed as diagnosis date (if rheum appt present and before csDMARD date; not including high cost MTX prescriptions)
. gen time_to_csdmard=(csdmard_date-rheum_appt_date) if csdmard==1 & rheum_appt_date!=. & csdmard_date>rheum_appt_date 
(25,265 missing values generated)

. tabstat time_to_csdmard if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_cs~d |      3209  565.4478       530       290       807
----------------------------------------------------------------

. bys diagnosis_year: tabstat time_to_csdmard if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by diagnosis year

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_cs~d |      1016  580.7106       555       309     817.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_cs~d |      1031  566.8497       522       298       817
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_cs~d |      1034   550.264     515.5       263       797
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_cs~d |       128  555.6641     547.5     263.5       781
----------------------------------------------------------------

. bys nuts_region: tabstat time_to_csdmard if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by region

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_cs~d |       329  574.2918       559       264       859
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_cs~d |       344  546.8401       510     274.5       782
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_cs~d |       615  561.0862       527       286       816
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_cs~d |       333   598.039       556       317       849
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_cs~d |       323  554.0588       507       323       753
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_cs~d |       632  557.8892       527       295       771
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_cs~d |       295  572.3831       548       269       861
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_cs~d |       338   570.568       542       290       818
----------------------------------------------------------------

. 
. **Time to first csDMARD script for RA patients (including high cost MTX prescriptions)
. gen time_to_csdmard_hcd=(csdmard_hcd_date-rheum_appt_date) if csdmard_hcd==1 & rheum_appt_date!=. & csdmard_hcd_date>rheum_appt_date 
(23,850 missing values generated)

. tabstat time_to_csdmard_hcd if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) 

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_c~cd |      3691  557.3563       521       282       797
----------------------------------------------------------------

. 
. **Time to first csDMARD script for PsA patients (not including high cost MTX prescriptions)
. tabstat time_to_csdmard if psa_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_c~rd |      3208  555.3242     506.5       272     813.5
----------------------------------------------------------------

. bys diagnosis_year: tabstat time_to_csdmard if psa_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by diagnosis year

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_c~rd |      1018  559.1405     513.5       272       822
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_c~rd |      1051   558.726       515       279       813
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_c~rd |      1014   538.931       485       253       784
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_c~rd |       125   628.624       600       294       948
----------------------------------------------------------------

. bys nuts_region: tabstat time_to_csdmard if psa_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by region

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_c~rd |       322  530.1366     478.5       255       747
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_c~rd |       350  570.8829     535.5       276       828
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_c~rd |       697  559.6671       517       270       822
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_c~rd |       303  547.2475       473       263       806
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_c~rd |       320     579.4       560       281     810.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_c~rd |       607  559.9061       499       277       840
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_c~rd |       294  557.3197     515.5       241       838
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_c~rd |       315  526.7937       462       269       765
----------------------------------------------------------------

. 
. **Time to first csDMARD script for PsA patients (including high cost MTX prescriptions)
. tabstat time_to_csdmard_hcd if psa_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) 

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_c~cd |      3624  551.3088       503       272     805.5
----------------------------------------------------------------

. 
. **csDMARD time categories for RA patients (not including high cost MTX prescriptions)
. gen csdmard_3m=1 if time_to_csdmard<=90 & time_to_csdmard!=. 
(34,684 missing values generated)

. replace csdmard_3m=2 if time_to_csdmard>90 & time_to_csdmard!=.
(9,419 real changes made)

. lab define csdmard_3m 1 "Yes" 2 "No", modify

. lab val csdmard_3m csdmard_3m

. lab var csdmard_3m "csDMARD within 3 months" 

. tab csdmard_3m if ra_code==1 & has_6m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after csDMARD script

    csDMARD |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        236        2.08        2.08
         No |      2,973       26.24       28.32
          . |      8,122       71.68      100.00
------------+-----------------------------------
      Total |     11,331      100.00

. tab csdmard_3m if ra_code==1 & has_6m_follow_up==1

    csDMARD |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        236        7.35        7.35
         No |      2,973       92.65      100.00
------------+-----------------------------------
      Total |      3,209      100.00

. gen csdmard_6m=1 if time_to_csdmard<=180 & time_to_csdmard!=. 
(33,916 missing values generated)

. replace csdmard_6m=2 if time_to_csdmard>180 & time_to_csdmard!=.
(8,651 real changes made)

. lab define csdmard_6m 1 "Yes" 2 "No", modify

. lab val csdmard_6m csdmard_6m

. lab var csdmard_6m "csDMARD within 6 months" 

. tab csdmard_6m if ra_code==1 & has_6m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after csDMARD script

    csDMARD |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        485        4.28        4.28
         No |      2,724       24.04       28.32
          . |      8,122       71.68      100.00
------------+-----------------------------------
      Total |     11,331      100.00

. tab csdmard_6m if ra_code==1 & has_6m_follow_up==1

    csDMARD |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        485       15.11       15.11
         No |      2,724       84.89      100.00
------------+-----------------------------------
      Total |      3,209      100.00

. gen csdmard_12m=1 if time_to_csdmard<=365 & time_to_csdmard!=. 
(32,042 missing values generated)

. replace csdmard_12m=2 if time_to_csdmard>365 & time_to_csdmard!=.
(6,777 real changes made)

. lab define csdmard_12m 1 "Yes" 2 "No", modify

. lab val csdmard_12m csdmard_12m

. lab var csdmard_12m "csDMARD within 12 months" 

. tab csdmard_12m if ra_code==1 & has_12m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after csDMARD script

    csDMARD |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,013        9.45        9.45
         No |      2,016       18.80       28.24
          . |      7,696       71.76      100.00
------------+-----------------------------------
      Total |     10,725      100.00

. tab csdmard_12m if ra_code==1 & has_12m_follow_up==1 //for patients with at least 12m registration

    csDMARD |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,013       33.44       33.44
         No |      2,016       66.56      100.00
------------+-----------------------------------
      Total |      3,029      100.00

. 
. **csDMARD time categories for RA patients (including high cost MTX prescriptions)
. gen csdmard_hcd_3m=1 if time_to_csdmard_hcd<=90 & time_to_csdmard_hcd!=. 
(34,577 missing values generated)

. replace csdmard_hcd_3m=2 if time_to_csdmard_hcd>90 & time_to_csdmard_hcd!=.
(10,727 real changes made)

. lab define csdmard_hcd_3m 1 "Yes" 2 "No", modify

. lab val csdmard_hcd_3m csdmard_hcd_3m

. lab var csdmard_hcd_3m "csDMARD within 3 months" 

. tab csdmard_hcd_3m if ra_code==1 & has_6m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after csDMARD script

    csDMARD |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        270        2.38        2.38
         No |      3,421       30.19       32.57
          . |      7,640       67.43      100.00
------------+-----------------------------------
      Total |     11,331      100.00

. tab csdmard_hcd_3m if ra_code==1 & has_6m_follow_up==1

    csDMARD |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        270        7.32        7.32
         No |      3,421       92.68      100.00
------------+-----------------------------------
      Total |      3,691      100.00

. gen csdmard_hcd_6m=1 if time_to_csdmard_hcd<=180 & time_to_csdmard_hcd!=. 
(33,690 missing values generated)

. replace csdmard_hcd_6m=2 if time_to_csdmard_hcd>180 & time_to_csdmard_hcd!=.
(9,840 real changes made)

. lab define csdmard_hcd_6m 1 "Yes" 2 "No", modify

. lab val csdmard_hcd_6m csdmard_hcd_6m

. lab var csdmard_hcd_6m "csDMARD within 6 months" 

. tab csdmard_hcd_6m if ra_code==1 & has_6m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after csDMARD script

    csDMARD |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        562        4.96        4.96
         No |      3,129       27.61       32.57
          . |      7,640       67.43      100.00
------------+-----------------------------------
      Total |     11,331      100.00

. tab csdmard_hcd_6m if ra_code==1 & has_6m_follow_up==1

    csDMARD |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        562       15.23       15.23
         No |      3,129       84.77      100.00
------------+-----------------------------------
      Total |      3,691      100.00

. gen csdmard_hcd_12m=1 if time_to_csdmard_hcd<=365 & time_to_csdmard_hcd!=. 
(31,467 missing values generated)

. replace csdmard_hcd_12m=2 if time_to_csdmard_hcd>365 & time_to_csdmard_hcd!=.
(7,617 real changes made)

. lab define csdmard_hcd_12m 1 "Yes" 2 "No", modify

. lab val csdmard_hcd_12m csdmard_hcd_12m

. lab var csdmard_hcd_12m "csDMARD within 12 months" 

. tab csdmard_hcd_12m if ra_code==1 & has_12m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after csDMARD script

    csDMARD |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,198       11.17       11.17
         No |      2,296       21.41       32.58
          . |      7,231       67.42      100.00
------------+-----------------------------------
      Total |     10,725      100.00

. tab csdmard_hcd_12m if ra_code==1 & has_12m_follow_up==1 //for patients with at least 12m registration

    csDMARD |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,198       34.29       34.29
         No |      2,296       65.71      100.00
------------+-----------------------------------
      Total |      3,494      100.00

. 
. **csDMARD time categories for PsA patients (not including high cost MTX prescriptions)
. tab csdmard_3m if psa_code==1 & has_6m_follow_up==1, missing

    csDMARD |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        245        2.19        2.19
         No |      2,963       26.52       28.72
          . |      7,963       71.28      100.00
------------+-----------------------------------
      Total |     11,171      100.00

. tab csdmard_6m if psa_code==1 & has_6m_follow_up==1, missing

    csDMARD |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        496        4.44        4.44
         No |      2,712       24.28       28.72
          . |      7,963       71.28      100.00
------------+-----------------------------------
      Total |     11,171      100.00

. tab csdmard_12m if psa_code==1 & has_12m_follow_up==1, missing

    csDMARD |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,072       10.05       10.05
         No |      1,983       18.58       28.63
          . |      7,616       71.37      100.00
------------+-----------------------------------
      Total |     10,671      100.00

. 
. **csDMARD time categories for PsA patients (including high cost MTX prescriptions)
. tab csdmard_hcd_3m if psa_code==1 & has_6m_follow_up==1, missing

    csDMARD |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        275        2.46        2.46
         No |      3,349       29.98       32.44
          . |      7,547       67.56      100.00
------------+-----------------------------------
      Total |     11,171      100.00

. tab csdmard_hcd_6m if psa_code==1 & has_6m_follow_up==1, missing

    csDMARD |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        560        5.01        5.01
         No |      3,064       27.43       32.44
          . |      7,547       67.56      100.00
------------+-----------------------------------
      Total |     11,171      100.00

. tab csdmard_hcd_12m if psa_code==1 & has_12m_follow_up==1, missing

    csDMARD |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,227       11.50       11.50
         No |      2,231       20.91       32.41
          . |      7,213       67.59      100.00
------------+-----------------------------------
      Total |     10,671      100.00

. 
. **What was first shared care csDMARD (not including high cost MTX prescriptions)
. gen first_csD=""
(35,419 missing values generated)

. foreach var of varlist hydroxychloroquine_date leflunomide_date methotrexate_date methotrexate_inj_date sulfasalazine_date {
  2.         replace first_csD="`var'" if csdmard_date==`var' & csdmard_date!=.
  3.         }
variable first_csD was str1 now str23
(2,549 real changes made)
(2,570 real changes made)
(2,495 real changes made)
(2,464 real changes made)
(2,568 real changes made)

. gen first_csDMARD = substr(first_csD, 1, length(first_csD) - 5) if first_csD!=""
(22,777 missing values generated)

. drop first_csD

. tab first_csDMARD if ra_code==1 & has_6m_follow_up==1 //for RA patients

     first_csDMARD |      Freq.     Percent        Cum.
-------------------+-----------------------------------
hydroxychloroquine |        825       20.57       20.57
       leflunomide |        803       20.02       40.59
      methotrexate |        767       19.12       59.71
  methotrexate_inj |        773       19.27       78.98
     sulfasalazine |        843       21.02      100.00
-------------------+-----------------------------------
             Total |      4,011      100.00

. tab first_csDMARD if psa_code==1 & has_6m_follow_up==1 //for PsA patients

     first_csDMARD |      Freq.     Percent        Cum.
-------------------+-----------------------------------
hydroxychloroquine |        798       19.93       19.93
       leflunomide |        824       20.58       40.51
      methotrexate |        823       20.55       61.06
  methotrexate_inj |        744       18.58       79.65
     sulfasalazine |        815       20.35      100.00
-------------------+-----------------------------------
             Total |      4,004      100.00

. 
. **What was first csDMARD (including high cost MTX prescriptions)
. gen first_csD_hcd=""
(35,419 missing values generated)

. foreach var of varlist hydroxychloroquine_date leflunomide_date methotrexate_date methotrexate_inj_date methotrexate_hcd_date sulfasalazine_date {
  2.         replace first_csD_hcd="`var'" if csdmard_hcd_date==`var' & csdmard_hcd_date!=.
  3.         }
variable first_csD_hcd was str1 now str23
(2,418 real changes made)
(2,453 real changes made)
(2,368 real changes made)
(2,340 real changes made)
(2,994 real changes made)
(2,415 real changes made)

. gen first_csDMARD_hcd = substr(first_csD_hcd, 1, length(first_csD_hcd) - 5) if first_csD_hcd!=""
(20,435 missing values generated)

. drop first_csD_hcd

. tab first_csDMARD_hcd if ra_code==1 & has_6m_follow_up==1 //for RA patients

 first_csDMARD_hcd |      Freq.     Percent        Cum.
-------------------+-----------------------------------
hydroxychloroquine |        778       16.32       16.32
       leflunomide |        764       16.03       32.35
      methotrexate |        727       15.25       47.61
  methotrexate_hcd |        960       20.14       67.75
  methotrexate_inj |        741       15.55       83.30
     sulfasalazine |        796       16.70      100.00
-------------------+-----------------------------------
             Total |      4,766      100.00

. tab first_csDMARD_hcd if psa_code==1 & has_6m_follow_up==1 //for PsA patients

 first_csDMARD_hcd |      Freq.     Percent        Cum.
-------------------+-----------------------------------
hydroxychloroquine |        762       16.12       16.12
       leflunomide |        786       16.63       32.75
      methotrexate |        790       16.72       49.47
  methotrexate_hcd |        934       19.76       69.23
  methotrexate_inj |        701       14.83       84.07
     sulfasalazine |        753       15.93      100.00
-------------------+-----------------------------------
             Total |      4,726      100.00

.  
. **Methotrexate use (not including high cost MTX prescriptions)
. gen mtx=1 if methotrexate==1 | methotrexate_inj==1
(29,734 missing values generated)

. recode mtx .=0 
(29734 changes made to mtx)

. tab mtx if ra_code==1 & has_6m_follow_up==1 //for RA patients; Nb. this is just a check; need time-to-MTX instead (below)

        mtx |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      9,555       84.33       84.33
          1 |      1,776       15.67      100.00
------------+-----------------------------------
      Total |     11,331      100.00

. tab mtx if psa_code==1 & has_6m_follow_up==1 //for PsA patients

        mtx |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      9,372       83.90       83.90
          1 |      1,799       16.10      100.00
------------+-----------------------------------
      Total |     11,171      100.00

. 
. **Methotrexate use (including high cost MTX prescriptions)
. gen mtx_hcd=1 if methotrexate==1 | methotrexate_inj==1 | methotrexate_hcd==1
(26,713 missing values generated)

. recode mtx_hcd .=0 
(26713 changes made to mtx_hcd)

. tab mtx_hcd if ra_code==1 & has_6m_follow_up==1 //for RA patients

    mtx_hcd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,585       75.77       75.77
          1 |      2,746       24.23      100.00
------------+-----------------------------------
      Total |     11,331      100.00

. tab mtx_hcd if psa_code==1 & has_6m_follow_up==1 //for PsA patients

    mtx_hcd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,411       75.29       75.29
          1 |      2,760       24.71      100.00
------------+-----------------------------------
      Total |     11,171      100.00

. 
. **Date of first methotrexate script (not including high cost MTX prescriptions)
. gen mtx_date=min(methotrexate_date, methotrexate_inj_date)
(29,734 missing values generated)

. format %td mtx_date

. 
. **Date of first methotrexate script (including high cost MTX prescriptions)
. gen mtx_hcd_date=min(methotrexate_date, methotrexate_inj_date, methotrexate_hcd_date)
(26,713 missing values generated)

. format %td mtx_hcd_date

. 
. **Time to first methotrexate script for RA patients (not including high cost MTX prescriptions)
. gen time_to_mtx=(mtx_date-rheum_appt_date) if mtx==1 & rheum_appt_date!=. & mtx_date>rheum_appt_date 
(30,871 missing values generated)

. tabstat time_to_mtx if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |      1420  594.6592       557     324.5       846
----------------------------------------------------------------

. bys diagnosis_year: tabstat time_to_mtx if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by diagnosis year

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       456  602.6974       586       326     865.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       443  606.6072       536       332       915
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       476  576.9622     543.5     312.5     811.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |        45  582.7778       628       334       760
----------------------------------------------------------------

. bys nuts_region: tabstat time_to_mtx if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by region

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       154  581.0325       583       248       852
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       145  554.2966       528       279       801
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       273  603.7289       555       344       846
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       138  617.8043     573.5       364       880
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       139  571.0432       534       351       798
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       279  595.5556       548       324       830
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       136  615.1471       592       348       908
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       156   610.859     583.5       344       902
----------------------------------------------------------------

. 
. **Time to first methotrexate script for RA patients (including high cost MTX prescriptions)
. gen time_to_mtx_hcd=(mtx_hcd_date-rheum_appt_date) if mtx_hcd==1 & rheum_appt_date!=. & mtx_hcd_date>rheum_appt_date 
(28,922 missing values generated)

. tabstat time_to_mtx_hcd if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_mt~d |      2076  585.5559     545.5       311       837
----------------------------------------------------------------

. 
. **Time to first methotrexate script for PsA patients (not including high cost MTX prescriptions)
. tabstat time_to_mtx if psa_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |      1439  576.6602       539       293       829
----------------------------------------------------------------

. bys diagnosis_year: tabstat time_to_mtx if psa_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by diagnosis year

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       451  590.0222       545       302       864
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       475  583.1137       540       292       844
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       448  546.7366       516       276     786.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |        65  643.0308       614       295       969
----------------------------------------------------------------

. bys nuts_region: tabstat time_to_mtx if psa_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by region

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       147  594.5442       554       299       854
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       162  631.8519     592.5       352       919
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       309  563.9385       517       278       823
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       151  566.3245       498       288       813
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       125   629.712       615       375       899
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       276  572.0399       524     280.5       849
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       132  558.8636       539     240.5       841
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |       137  510.3431       468       294       679
----------------------------------------------------------------

. 
. **Time to first methotrexate script for PsA patients (including high cost MTX prescriptions)
. tabstat time_to_mtx_hcd if psa_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_mt~d |      2037  581.8807       545       297       841
----------------------------------------------------------------

. 
. **Methotrexate time categories for RA patients (not including high-cost MTX) //Nb. this is time period from rheum appt (i.e. diagnosis) to shared care, not from referral to first script 
. gen mtx_3m=1 if time_to_mtx<=90 & time_to_mtx!=. 
(35,147 missing values generated)

. replace mtx_3m=2 if time_to_mtx>90 & time_to_mtx!=.
(4,276 real changes made)

. lab define mtx_3m 1 "Yes" 2 "No", modify

. lab val mtx_3m mtx_3m

. lab var mtx_3m "Methotrexate within 3 months" 

. tab mtx_3m if ra_code==1 & has_6m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after csDMARD script

Methotrexat |
 e within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         84        0.74        0.74
         No |      1,336       11.79       12.53
          . |      9,911       87.47      100.00
------------+-----------------------------------
      Total |     11,331      100.00

. tab mtx_3m if ra_code==1 & has_6m_follow_up==1

Methotrexat |
 e within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         84        5.92        5.92
         No |      1,336       94.08      100.00
------------+-----------------------------------
      Total |      1,420      100.00

. gen mtx_6m=1 if time_to_mtx<=180 & time_to_mtx!=. 
(34,833 missing values generated)

. replace mtx_6m=2 if time_to_mtx>180 & time_to_mtx!=.
(3,962 real changes made)

. lab define mtx_6m 1 "Yes" 2 "No", modify

. lab val mtx_6m mtx_6m

. lab var mtx_6m "Methotrexate within 6 months" 

. tab mtx_6m if ra_code==1 & has_6m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after csDMARD script

Methotrexat |
 e within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        185        1.63        1.63
         No |      1,235       10.90       12.53
          . |      9,911       87.47      100.00
------------+-----------------------------------
      Total |     11,331      100.00

. tab mtx_6m if ra_code==1 & has_6m_follow_up==1

Methotrexat |
 e within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        185       13.03       13.03
         No |      1,235       86.97      100.00
------------+-----------------------------------
      Total |      1,420      100.00

. gen mtx_12m=1 if time_to_mtx<=365 & time_to_mtx!=. 
(34,067 missing values generated)

. replace mtx_12m=2 if time_to_mtx>365 & time_to_mtx!=.
(3,196 real changes made)

. lab define mtx_12m 1 "Yes" 2 "No", modify

. lab val mtx_12m mtx_12m

. lab var mtx_12m "Methotrexate within 12 months" 

. tab mtx_12m if ra_code==1 & has_12m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after mtx script

Methotrexat |
e within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        399        3.72        3.72
         No |        945        8.81       12.53
          . |      9,381       87.47      100.00
------------+-----------------------------------
      Total |     10,725      100.00

. tab mtx_12m if ra_code==1 & has_12m_follow_up==1 //for patients with at least 12m registration

Methotrexat |
e within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        399       29.69       29.69
         No |        945       70.31      100.00
------------+-----------------------------------
      Total |      1,344      100.00

. 
. **Methotrexate time categories for RA patients (including high-cost MTX)
. gen mtx_hcd_3m=1 if time_to_mtx_hcd<=90 & time_to_mtx_hcd!=. 
(35,024 missing values generated)

. replace mtx_hcd_3m=2 if time_to_mtx_hcd>90 & time_to_mtx_hcd!=.
(6,102 real changes made)

. lab define mtx_hcd_3m 1 "Yes" 2 "No", modify

. lab val mtx_hcd_3m mtx_hcd_3m

. lab var mtx_hcd_3m "Methotrexate within 3 months" 

. tab mtx_hcd_3m if ra_code==1 & has_6m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after csDMARD script

Methotrexat |
 e within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        123        1.09        1.09
         No |      1,953       17.24       18.32
          . |      9,255       81.68      100.00
------------+-----------------------------------
      Total |     11,331      100.00

. tab mtx_hcd_3m if ra_code==1 & has_6m_follow_up==1

Methotrexat |
 e within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        123        5.92        5.92
         No |      1,953       94.08      100.00
------------+-----------------------------------
      Total |      2,076      100.00

. gen mtx_hcd_6m=1 if time_to_mtx_hcd<=180 & time_to_mtx_hcd!=. 
(34,576 missing values generated)

. replace mtx_hcd_6m=2 if time_to_mtx_hcd>180 & time_to_mtx_hcd!=.
(5,654 real changes made)

. lab define mtx_hcd_6m 1 "Yes" 2 "No", modify

. lab val mtx_hcd_6m mtx_hcd_6m

. lab var mtx_hcd_6m "Methotrexate within 6 months" 

. tab mtx_hcd_6m if ra_code==1 & has_6m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after csDMARD script

Methotrexat |
 e within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        270        2.38        2.38
         No |      1,806       15.94       18.32
          . |      9,255       81.68      100.00
------------+-----------------------------------
      Total |     11,331      100.00

. tab mtx_hcd_6m if ra_code==1 & has_6m_follow_up==1

Methotrexat |
 e within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        270       13.01       13.01
         No |      1,806       86.99      100.00
------------+-----------------------------------
      Total |      2,076      100.00

. gen mtx_hcd_12m=1 if time_to_mtx_hcd<=365 & time_to_mtx_hcd!=. 
(33,413 missing values generated)

. replace mtx_hcd_12m=2 if time_to_mtx_hcd>365 & time_to_mtx_hcd!=.
(4,491 real changes made)

. lab define mtx_hcd_12m 1 "Yes" 2 "No", modify

. lab val mtx_hcd_12m mtx_hcd_12m

. lab var mtx_hcd_12m "Methotrexate within 12 months" 

. tab mtx_hcd_12m if ra_code==1 & has_12m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after csDMARD script

Methotrexat |
e within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        608        5.67        5.67
         No |      1,366       12.74       18.41
          . |      8,751       81.59      100.00
------------+-----------------------------------
      Total |     10,725      100.00

. tab mtx_hcd_12m if ra_code==1 & has_12m_follow_up==1 //for patients with at least 12m registration

Methotrexat |
e within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        608       30.80       30.80
         No |      1,366       69.20      100.00
------------+-----------------------------------
      Total |      1,974      100.00

. 
. **Methotrexate time categories for PsA patients (not including high-cost MTX)
. tab mtx_3m if psa_code==1 & has_6m_follow_up==1, missing

Methotrexat |
 e within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         84        0.75        0.75
         No |      1,355       12.13       12.88
          . |      9,732       87.12      100.00
------------+-----------------------------------
      Total |     11,171      100.00

. tab mtx_6m if psa_code==1 & has_6m_follow_up==1, missing

Methotrexat |
 e within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        192        1.72        1.72
         No |      1,247       11.16       12.88
          . |      9,732       87.12      100.00
------------+-----------------------------------
      Total |     11,171      100.00

. tab mtx_12m if psa_code==1 & has_12m_follow_up==1, missing //with a least 12m registration

Methotrexat |
e within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        429        4.02        4.02
         No |        916        8.58       12.60
          . |      9,326       87.40      100.00
------------+-----------------------------------
      Total |     10,671      100.00

. 
. **Methotrexate time categories for PsA patients (including high-cost MTX)
. tab mtx_hcd_3m if psa_code==1 & has_6m_follow_up==1, missing

Methotrexat |
 e within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        120        1.07        1.07
         No |      1,917       17.16       18.23
          . |      9,134       81.77      100.00
------------+-----------------------------------
      Total |     11,171      100.00

. tab mtx_hcd_6m if psa_code==1 & has_6m_follow_up==1, missing

Methotrexat |
 e within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        267        2.39        2.39
         No |      1,770       15.84       18.23
          . |      9,134       81.77      100.00
------------+-----------------------------------
      Total |     11,171      100.00

. tab mtx_hcd_12m if psa_code==1 & has_12m_follow_up==1, missing //with a least 12m registration

Methotrexat |
e within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        612        5.74        5.74
         No |      1,304       12.22       17.96
          . |      8,755       82.04      100.00
------------+-----------------------------------
      Total |     10,671      100.00

. 
. **Sulfasalazine use
. gen time_to_ssz=(sulfasalazine_date-rheum_appt_date) if sulfasalazine==1 & rheum_appt_date!=. & sulfasalazine_date>rheum_appt_date 
(33,027 missing values generated)

. tabstat time_to_ssz if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |       783  597.5913       577       312       862
----------------------------------------------------------------

. bys diagnosis_year: tabstat time_to_ssz if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by diagnosis year for RA

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |       260  636.7038     628.5       378     882.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |       244  576.6066     541.5       286     837.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |       243  581.9342       569       295       873
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |        36  563.0278       550     195.5     877.5
----------------------------------------------------------------

. bys diagnosis_year: tabstat time_to_ssz if psa_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by diagnosis year for PsA

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |       232  573.2629       516       276     863.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |       240  645.5292       622     349.5       930
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |       236  586.9322       519       276       887
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |        30  621.9333       566       236       935
----------------------------------------------------------------

. bys nuts_region: tabstat time_to_ssz if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by region for RA

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |        72  618.4028       635     286.5       918
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |        76  582.2105       516       351     825.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |       153  581.0327       588       288       860
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |        93  646.3763       679       349       912
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |        76  567.6053     524.5       372     797.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |       146  573.0479     569.5       289       780
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |        81  593.6543       576       240       893
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |        86  642.3372       598       322       874
----------------------------------------------------------------

. bys nuts_region: tabstat time_to_ssz if psa_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by region for PsA

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |        68  565.8088     544.5     279.5       892
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |        74  491.5946     396.5       197       781
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |       155  623.8774       554       283       927
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |        76  560.0132       452     240.5     851.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |        80  708.0125       756     396.5    1014.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |       136       608     554.5       321     871.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |        80  625.2625     586.5       347     863.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |        69  603.3768       607       315       905
----------------------------------------------------------------

. 
. **Sulfasalazine time categories for RA patients //Nb. this is time period from rheum appt (i.e. diagnosis) to shared care, not from referral to first script 
. gen ssz_3m=1 if time_to_ssz<=90 & time_to_ssz!=. 
(35,267 missing values generated)

. replace ssz_3m=2 if time_to_ssz>90 & time_to_ssz!=.
(2,240 real changes made)

. lab define ssz_3m 1 "Yes" 2 "No", modify

. lab val ssz_3m ssz_3m

. lab var ssz_3m "Sulfasalazine within 3 months" 

. tab ssz_3m if ra_code==1 & has_6m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after csDMARD script

Sulfasalazi |
ne within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         55        0.49        0.49
         No |        728        6.42        6.91
          . |     10,548       93.09      100.00
------------+-----------------------------------
      Total |     11,331      100.00

. tab ssz_3m if ra_code==1 & has_6m_follow_up==1

Sulfasalazi |
ne within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         55        7.02        7.02
         No |        728       92.98      100.00
------------+-----------------------------------
      Total |        783      100.00

. gen ssz_6m=1 if time_to_ssz<=180 & time_to_ssz!=. 
(35,098 missing values generated)

. replace ssz_6m=2 if time_to_ssz>180 & time_to_ssz!=.
(2,071 real changes made)

. lab define ssz_6m 1 "Yes" 2 "No", modify

. lab val ssz_6m ssz_6m

. lab var ssz_6m "Sulfasalazine within 6 months" 

. tab ssz_6m if ra_code==1 & has_6m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after csDMARD script

Sulfasalazi |
ne within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        106        0.94        0.94
         No |        677        5.97        6.91
          . |     10,548       93.09      100.00
------------+-----------------------------------
      Total |     11,331      100.00

. tab ssz_6m if ra_code==1 & has_6m_follow_up==1

Sulfasalazi |
ne within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        106       13.54       13.54
         No |        677       86.46      100.00
------------+-----------------------------------
      Total |        783      100.00

. gen ssz_12m=1 if time_to_ssz<=365 & time_to_ssz!=. 
(34,703 missing values generated)

. replace ssz_12m=2 if time_to_ssz>365 & time_to_ssz!=.
(1,676 real changes made)

. lab define ssz_12m 1 "Yes" 2 "No", modify

. lab val ssz_12m ssz_12m

. lab var ssz_12m "Sulfasalazine within 12 months" 

. tab ssz_12m if ra_code==1 & has_12m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after ssz script

Sulfasalazi |
  ne within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        228        2.13        2.13
         No |        512        4.77        6.90
          . |      9,985       93.10      100.00
------------+-----------------------------------
      Total |     10,725      100.00

. tab ssz_12m if ra_code==1 & has_12m_follow_up==1 //for patients with at least 12m registration

Sulfasalazi |
  ne within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        228       30.81       30.81
         No |        512       69.19      100.00
------------+-----------------------------------
      Total |        740      100.00

. 
. **Sulfasalazine time categories for PsA patients
. tab ssz_3m if psa_code==1 & has_6m_follow_up==1, missing

Sulfasalazi |
ne within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         49        0.44        0.44
         No |        689        6.17        6.61
          . |     10,433       93.39      100.00
------------+-----------------------------------
      Total |     11,171      100.00

. tab ssz_6m if psa_code==1 & has_6m_follow_up==1, missing

Sulfasalazi |
ne within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        104        0.93        0.93
         No |        634        5.68        6.61
          . |     10,433       93.39      100.00
------------+-----------------------------------
      Total |     11,171      100.00

. tab ssz_12m if psa_code==1 & has_12m_follow_up==1, missing //with a least 12m registration

Sulfasalazi |
  ne within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        215        2.01        2.01
         No |        494        4.63        6.64
          . |      9,962       93.36      100.00
------------+-----------------------------------
      Total |     10,671      100.00

. 
. **Hydroxychloroquine use
. gen time_to_hcq=(hydroxychloroquine_date-rheum_appt_date) if hydroxychloroquine==1 & rheum_appt_date!=. & hydroxychloroquine_date>rheum_appt_date 
(32,949 missing values generated)

. tabstat time_to_hcq if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |       793  602.4477       608       324       850
----------------------------------------------------------------

. bys diagnosis_year: tabstat time_to_hcq if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by diagnosis year for RA

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |       246  619.4553       623       341       866
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |       242  592.1281       588       324       810
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |       269  603.4164       616       312       871
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |        36  548.3611     561.5     240.5     748.5
----------------------------------------------------------------

. bys diagnosis_year: tabstat time_to_hcq if psa_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by diagnosis year for PsA

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |       265  611.0906       589       287       900
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |       225  555.9422       521       275       806
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |       256  569.7813       554     272.5       842
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |        26  736.8846     777.5       518       974
----------------------------------------------------------------

. bys nuts_region: tabstat time_to_hcq if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by region for RA

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |        68  591.1618       588       271     920.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |       100    610.37     615.5       300       825
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |       152  585.6645       562     316.5     839.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |        71  699.1127       722       409       929
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |        96  611.2708       600       335     805.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |       158  568.5949       592       304       792
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |        58  571.9483     617.5       293       894
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |        90  623.9333     653.5       385       901
----------------------------------------------------------------

. bys nuts_region: tabstat time_to_hcq if psa_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by region for PsA

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |        72  517.7361     461.5       232       720
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |        94  611.7021     576.5       330       851
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |       178  641.7191       635       351       923
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |        60  561.1833     533.5       246     819.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |        80  511.9125     510.5     263.5     718.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |       152  572.6579       523     278.5     892.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |        60  565.0167       512       256       840
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |        76  624.6974       595       307     896.5
----------------------------------------------------------------

. 
. **Hydroxychloroquine time categories for RA patients //Nb. this is time period from rheum appt (i.e. diagnosis) to shared care, not from referral to first script 
. gen hcq_3m=1 if time_to_hcq<=90 & time_to_hcq!=. 
(35,246 missing values generated)

. replace hcq_3m=2 if time_to_hcq>90 & time_to_hcq!=.
(2,297 real changes made)

. lab define hcq_3m 1 "Yes" 2 "No", modify

. lab val hcq_3m hcq_3m

. lab var hcq_3m "Hydroxychloroquine within 3 months" 

. tab hcq_3m if ra_code==1 & has_6m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after csDMARD script

Hydroxychlo |
    roquine |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         55        0.49        0.49
         No |        738        6.51        7.00
          . |     10,538       93.00      100.00
------------+-----------------------------------
      Total |     11,331      100.00

. tab hcq_3m if ra_code==1 & has_6m_follow_up==1

Hydroxychlo |
    roquine |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         55        6.94        6.94
         No |        738       93.06      100.00
------------+-----------------------------------
      Total |        793      100.00

. gen hcq_6m=1 if time_to_hcq<=180 & time_to_hcq!=. 
(35,097 missing values generated)

. replace hcq_6m=2 if time_to_hcq>180 & time_to_hcq!=.
(2,148 real changes made)

. lab define hcq_6m 1 "Yes" 2 "No", modify

. lab val hcq_6m hcq_6m

. lab var hcq_6m "Hydroxychloroquine within 6 months" 

. tab hcq_6m if ra_code==1 & has_6m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after csDMARD script

Hydroxychlo |
    roquine |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        104        0.92        0.92
         No |        689        6.08        7.00
          . |     10,538       93.00      100.00
------------+-----------------------------------
      Total |     11,331      100.00

. tab hcq_6m if ra_code==1 & has_6m_follow_up==1

Hydroxychlo |
    roquine |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        104       13.11       13.11
         No |        689       86.89      100.00
------------+-----------------------------------
      Total |        793      100.00

. gen hcq_12m=1 if time_to_hcq<=365 & time_to_hcq!=. 
(34,661 missing values generated)

. replace hcq_12m=2 if time_to_hcq>365 & time_to_hcq!=.
(1,712 real changes made)

. lab define hcq_12m 1 "Yes" 2 "No", modify

. lab val hcq_12m hcq_12m

. lab var hcq_12m "Hydroxychloroquine within 12 months" 

. tab hcq_12m if ra_code==1 & has_12m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after hcq script

Hydroxychlo |
    roquine |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        223        2.08        2.08
         No |        527        4.91        6.99
          . |      9,975       93.01      100.00
------------+-----------------------------------
      Total |     10,725      100.00

. tab hcq_12m if ra_code==1 & has_12m_follow_up==1 //for patients with at least 12m registration

Hydroxychlo |
    roquine |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        223       29.73       29.73
         No |        527       70.27      100.00
------------+-----------------------------------
      Total |        750      100.00

. 
. **Hydroxychloroquine time categories for PsA patients
. tab hcq_3m if psa_code==1 & has_6m_follow_up==1, missing

Hydroxychlo |
    roquine |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         63        0.56        0.56
         No |        709        6.35        6.91
          . |     10,399       93.09      100.00
------------+-----------------------------------
      Total |     11,171      100.00

. tab hcq_6m if psa_code==1 & has_6m_follow_up==1, missing

Hydroxychlo |
    roquine |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        108        0.97        0.97
         No |        664        5.94        6.91
          . |     10,399       93.09      100.00
------------+-----------------------------------
      Total |     11,171      100.00

. tab hcq_12m if psa_code==1 & has_12m_follow_up==1, missing //with a least 12m registration

Hydroxychlo |
    roquine |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        241        2.26        2.26
         No |        509        4.77        7.03
          . |      9,921       92.97      100.00
------------+-----------------------------------
      Total |     10,671      100.00

. 
. **Leflunomide use
. gen time_to_lef=(leflunomide_date-rheum_appt_date) if leflunomide==1 & rheum_appt_date!=. & leflunomide_date>rheum_appt_date 
(32,940 missing values generated)

. tabstat time_to_lef if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |       768  594.0391       551       298     865.5
----------------------------------------------------------------

. bys diagnosis_year: tabstat time_to_lef if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by diagnosis year for RA

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |       233  590.2318       552       314       866
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |       251  602.9163       566       343       857
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |       248  581.5363     532.5     247.5     876.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |        36  642.9167       648       433       862
----------------------------------------------------------------

. bys diagnosis_year: tabstat time_to_lef if psa_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by diagnosis year for PsA

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |       255  613.2431       570       296       884
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |       276  599.3514     572.5     293.5       890
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |       236  596.1441       570       277       874
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |        23       616       632       300       896
----------------------------------------------------------------

. bys nuts_region: tabstat time_to_lef if ra_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by region for RA

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |        88  653.1705       639       411       922
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |        78  587.3974       563       275       887
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |       149  587.3289       536       281       839
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |        84  541.0476     503.5       257       784
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |        77  603.0519       510       269       832
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |       155  612.7806       573       324       909
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |        64  622.0625     582.5     310.5     984.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |        73  530.6575       536       248       744
----------------------------------------------------------------

. bys nuts_region: tabstat time_to_lef if psa_code==1 & has_6m_follow_up==1, stats (n mean p50 p25 p75) //by region for PsA

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |        90  541.7111       459       274       815
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |        77   634.987       645       414       842
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |       167       591       573       290       862
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |        78  650.5385     633.5       360       874
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |        80  592.3125     581.5       250     892.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |       156  634.7244       638     316.5     961.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |        67  626.0448       585       229       974
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |        75  549.6267       493       243       842
----------------------------------------------------------------

. 
. **Leflunomide time categories for RA patients //Nb. this is time period from rheum appt (i.e. diagnosis) to shared care, not from referral to first script 
. gen lef_3m=1 if time_to_lef<=90 & time_to_lef!=. 
(35,272 missing values generated)

. replace lef_3m=2 if time_to_lef>90 & time_to_lef!=.
(2,332 real changes made)

. lab define lef_3m 1 "Yes" 2 "No", modify

. lab val lef_3m lef_3m

. lab var lef_3m "Leflunomide within 3 months" 

. tab lef_3m if ra_code==1 & has_6m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after csDMARD script

Leflunomide |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         45        0.40        0.40
         No |        723        6.38        6.78
          . |     10,563       93.22      100.00
------------+-----------------------------------
      Total |     11,331      100.00

. tab lef_3m if ra_code==1 & has_6m_follow_up==1

Leflunomide |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         45        5.86        5.86
         No |        723       94.14      100.00
------------+-----------------------------------
      Total |        768      100.00

. gen lef_6m=1 if time_to_lef<=180 & time_to_lef!=. 
(35,093 missing values generated)

. replace lef_6m=2 if time_to_lef>180 & time_to_lef!=.
(2,153 real changes made)

. lab define lef_6m 1 "Yes" 2 "No", modify

. lab val lef_6m lef_6m

. lab var lef_6m "Leflunomide within 6 months" 

. tab lef_6m if ra_code==1 & has_6m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after csDMARD script

Leflunomide |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        109        0.96        0.96
         No |        659        5.82        6.78
          . |     10,563       93.22      100.00
------------+-----------------------------------
      Total |     11,331      100.00

. tab lef_6m if ra_code==1 & has_6m_follow_up==1

Leflunomide |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        109       14.19       14.19
         No |        659       85.81      100.00
------------+-----------------------------------
      Total |        768      100.00

. gen lef_12m=1 if time_to_lef<=365 & time_to_lef!=. 
(34,674 missing values generated)

. replace lef_12m=2 if time_to_lef>365 & time_to_lef!=.
(1,734 real changes made)

. lab define lef_12m 1 "Yes" 2 "No", modify

. lab val lef_12m lef_12m

. lab var lef_12m "Leflunomide within 12 months" 

. tab lef_12m if ra_code==1 & has_12m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after lef script

Leflunomide |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        222        2.07        2.07
         No |        511        4.76        6.83
          . |      9,992       93.17      100.00
------------+-----------------------------------
      Total |     10,725      100.00

. tab lef_12m if ra_code==1 & has_12m_follow_up==1 //for patients with at least 12m registration

Leflunomide |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        222       30.29       30.29
         No |        511       69.71      100.00
------------+-----------------------------------
      Total |        733      100.00

. 
. **Leflunomide time categories for PsA patients
. tab lef_3m if psa_code==1 & has_6m_follow_up==1, missing

Leflunomide |
   within 3 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         51        0.46        0.46
         No |        739        6.62        7.07
          . |     10,381       92.93      100.00
------------+-----------------------------------
      Total |     11,171      100.00

. tab lef_6m if psa_code==1 & has_6m_follow_up==1, missing

Leflunomide |
   within 6 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        106        0.95        0.95
         No |        684        6.12        7.07
          . |     10,381       92.93      100.00
------------+-----------------------------------
      Total |     11,171      100.00

. tab lef_12m if psa_code==1 & has_12m_follow_up==1, missing //with a least 12m registration

Leflunomide |
  within 12 |
     months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        236        2.21        2.21
         No |        520        4.87        7.08
          . |      9,915       92.92      100.00
------------+-----------------------------------
      Total |     10,671      100.00

. 
. **Time to first biologic script, whereby first rheum appt is classed as diagnosis date (assumes rheum appt present); high_cost drug data available to Nov 2020===============================================================
> =======*/
. 
. *Below analyses are only for patients with at least 12 months of follow-up available after EIA code
. gen time_to_biologic=(biologic_date-rheum_appt_date) if biologic==1 & rheum_appt_date!=. & biologic_date>rheum_appt_date 
(14,457 missing values generated)

. tabstat time_to_biologic if has_12m_follow_up==1, stats (n mean p50 p25 p75) //for all EIA patients

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_bi~c |     18878  461.4607       403       211       666
----------------------------------------------------------------

. bys eia_diagnosis: tabstat time_to_biologic if has_12m_follow_up==1, stats (n mean p50 p25 p75) 

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_bi~c |      6371    459.87       404       211       662
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_bi~c |      6279  462.5905       404       208       669
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_bi~c |      6228  461.9489       402       214       667
----------------------------------------------------------------

. bys diagnosis_year: tabstat time_to_biologic if ra_code==1 & has_12m_follow_up==1, stats (n mean p50 p25 p75) //by diagnosis year

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_bi~c |      2065  466.0499       405       214       673
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_bi~c |      2000   462.998       415       209     668.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_bi~c |      2015  453.0313       396       212       648
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_bi~c |       291  441.8729       374       193       661
----------------------------------------------------------------

. bys nuts_region: tabstat time_to_biologic if ra_code==1 & has_12m_follow_up==1, stats (n mean p50 p25 p75) //by region

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_bi~c |       656  464.0686     417.5     233.5     661.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = East of England

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_bi~c |       644  458.7283     398.5       210     669.5
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = London

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_bi~c |      1270  459.7354       402       217       657
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_bi~c |       640  460.2281       406     206.5       667
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = North West

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_bi~c |       630  470.2302     409.5       216       684
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = South East

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_bi~c |      1245  453.3309       400       206       650
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = West Midlands

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_bi~c |       656  442.8674     375.5     190.5       641
----------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> nuts_region = Yorkshire and the Humber

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_bi~c |       630  476.8397     423.5       214       689
----------------------------------------------------------------

. 
. **What was first biologic
. gen first_bio=""
(35,419 missing values generated)

. foreach var of varlist abatacept_date adalimumab_date baricitinib_date certolizumab_date etanercept_date golimumab_date guselkumab_date infliximab_date ixekizumab_date rituximab_date sarilumab_date secukinumab_date tocili
> zumab_date tofacitinib_date upadacitinib_date ustekinumab_date {
  2.         replace first_bio="`var'" if biologic_date==`var' & biologic_date!=.
  3.         }
variable first_bio was str1 now str14
(1,625 real changes made)
variable first_bio was str14 now str15
(1,585 real changes made)
variable first_bio was str15 now str16
(1,629 real changes made)
variable first_bio was str16 now str17
(1,760 real changes made)
(1,641 real changes made)
(1,626 real changes made)
(1,654 real changes made)
(1,712 real changes made)
(1,624 real changes made)
(1,681 real changes made)
(1,655 real changes made)
(1,624 real changes made)
(1,624 real changes made)
(1,622 real changes made)
(1,677 real changes made)
(1,674 real changes made)

. gen first_biologic = substr(first_bio, 1, length(first_bio) - 5)        
(9,513 missing values generated)

. drop first_bio

. tab first_biologic if has_12m_follow_up==1 //for all EIA patients

first_biolog |
          ic |      Freq.     Percent        Cum.
-------------+-----------------------------------
   abatacept |      1,404        6.01        6.01
  adalimumab |      1,384        5.93       11.94
 baricitinib |      1,424        6.10       18.04
certolizumab |      1,559        6.68       24.72
  etanercept |      1,426        6.11       30.83
   golimumab |      1,444        6.19       37.02
  guselkumab |      1,446        6.19       43.21
  infliximab |      1,506        6.45       49.67
  ixekizumab |      1,462        6.26       55.93
   rituximab |      1,483        6.35       62.28
   sarilumab |      1,464        6.27       68.55
 secukinumab |      1,454        6.23       74.78
 tocilizumab |      1,438        6.16       80.94
 tofacitinib |      1,450        6.21       87.16
upadacitinib |      1,492        6.39       93.55
 ustekinumab |      1,506        6.45      100.00
-------------+-----------------------------------
       Total |     23,342      100.00

. bys eia_diagnosis: tab first_biologic if has_12m_follow_up==1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

first_biolog |
          ic |      Freq.     Percent        Cum.
-------------+-----------------------------------
   abatacept |        498        6.31        6.31
  adalimumab |        446        5.65       11.96
 baricitinib |        465        5.89       17.86
certolizumab |        519        6.58       24.43
  etanercept |        453        5.74       30.17
   golimumab |        473        5.99       36.17
  guselkumab |        498        6.31       42.48
  infliximab |        502        6.36       48.84
  ixekizumab |        462        5.85       54.70
   rituximab |        501        6.35       61.04
   sarilumab |        528        6.69       67.74
 secukinumab |        491        6.22       73.96
 tocilizumab |        514        6.51       80.47
 tofacitinib |        533        6.75       87.23
upadacitinib |        505        6.40       93.63
 ustekinumab |        503        6.37      100.00
-------------+-----------------------------------
       Total |      7,891      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

first_biolog |
          ic |      Freq.     Percent        Cum.
-------------+-----------------------------------
   abatacept |        471        6.05        6.05
  adalimumab |        460        5.91       11.95
 baricitinib |        476        6.11       18.07
certolizumab |        511        6.56       24.63
  etanercept |        492        6.32       30.95
   golimumab |        509        6.54       37.48
  guselkumab |        458        5.88       43.36
  infliximab |        486        6.24       49.60
  ixekizumab |        496        6.37       55.97
   rituximab |        504        6.47       62.44
   sarilumab |        489        6.28       68.72
 secukinumab |        471        6.05       74.77
 tocilizumab |        486        6.24       81.01
 tofacitinib |        465        5.97       86.98
upadacitinib |        513        6.59       93.57
 ustekinumab |        501        6.43      100.00
-------------+-----------------------------------
       Total |      7,788      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

first_biolog |
          ic |      Freq.     Percent        Cum.
-------------+-----------------------------------
   abatacept |        435        5.68        5.68
  adalimumab |        478        6.24       11.91
 baricitinib |        483        6.30       18.22
certolizumab |        529        6.90       25.12
  etanercept |        481        6.28       31.40
   golimumab |        462        6.03       37.43
  guselkumab |        490        6.39       43.82
  infliximab |        518        6.76       50.58
  ixekizumab |        504        6.58       57.16
   rituximab |        478        6.24       63.40
   sarilumab |        447        5.83       69.23
 secukinumab |        492        6.42       75.65
 tocilizumab |        438        5.72       81.37
 tofacitinib |        452        5.90       87.26
upadacitinib |        474        6.19       93.45
 ustekinumab |        502        6.55      100.00
-------------+-----------------------------------
       Total |      7,663      100.00


. 
. **Biologic time categories (for all patients)
. gen biologic_3m=1 if time_to_biologic<=90 & time_to_biologic!=. 
(33,220 missing values generated)

. replace biologic_3m=2 if time_to_biologic>90 & time_to_biologic!=.
(18,763 real changes made)

. lab define biologic_3m 1 "Yes" 2 "No", modify

. lab val biologic_3m biologic_3m

. lab var biologic_3m "bDMARD/tsDMARD within 3 months" 

. bys eia_diagnosis: tab biologic_3m if has_6m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after bDMARD/tsDMARD script

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

bDMARD/tsDM |
 ARD within |
   3 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        708        6.25        6.25
         No |      6,032       53.23       59.48
          . |      4,591       40.52      100.00
------------+-----------------------------------
      Total |     11,331      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

bDMARD/tsDM |
 ARD within |
   3 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        683        6.11        6.11
         No |      5,884       52.67       58.79
          . |      4,604       41.21      100.00
------------+-----------------------------------
      Total |     11,171      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

bDMARD/tsDM |
 ARD within |
   3 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        681        6.12        6.12
         No |      5,922       53.18       59.30
          . |      4,532       40.70      100.00
------------+-----------------------------------
      Total |     11,135      100.00


. bys eia_diagnosis: tab biologic_3m if has_6m_follow_up==1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

bDMARD/tsDM |
 ARD within |
   3 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        708       10.50       10.50
         No |      6,032       89.50      100.00
------------+-----------------------------------
      Total |      6,740      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

bDMARD/tsDM |
 ARD within |
   3 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        683       10.40       10.40
         No |      5,884       89.60      100.00
------------+-----------------------------------
      Total |      6,567      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

bDMARD/tsDM |
 ARD within |
   3 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        681       10.31       10.31
         No |      5,922       89.69      100.00
------------+-----------------------------------
      Total |      6,603      100.00


. gen biologic_6m=1 if time_to_biologic<=180 & time_to_biologic!=. 
(30,941 missing values generated)

. replace biologic_6m=2 if time_to_biologic>180 & time_to_biologic!=.
(16,484 real changes made)

. lab define biologic_6m 1 "Yes" 2 "No", modify

. lab val biologic_6m biologic_6m

. lab var biologic_6m "bDMARD/tsDMARD within 6 months" 

. bys eia_diagnosis: tab biologic_6m if has_6m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after bDMARD/tsDMARD script

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,410       12.44       12.44
         No |      5,330       47.04       59.48
          . |      4,591       40.52      100.00
------------+-----------------------------------
      Total |     11,331      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,436       12.85       12.85
         No |      5,131       45.93       58.79
          . |      4,604       41.21      100.00
------------+-----------------------------------
      Total |     11,171      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,390       12.48       12.48
         No |      5,213       46.82       59.30
          . |      4,532       40.70      100.00
------------+-----------------------------------
      Total |     11,135      100.00


. bys eia_diagnosis: tab biologic_6m if has_6m_follow_up==1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,410       20.92       20.92
         No |      5,330       79.08      100.00
------------+-----------------------------------
      Total |      6,740      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,436       21.87       21.87
         No |      5,131       78.13      100.00
------------+-----------------------------------
      Total |      6,567      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,390       21.05       21.05
         No |      5,213       78.95      100.00
------------+-----------------------------------
      Total |      6,603      100.00


. gen biologic_12m=1 if time_to_biologic<=365 & time_to_biologic!=. 
(25,953 missing values generated)

. replace biologic_12m=2 if time_to_biologic>365 & time_to_biologic!=.
(11,496 real changes made)

. lab define biologic_12m 1 "Yes" 2 "No", modify

. lab val biologic_12m biologic_12m

. lab var biologic_12m "bDMARD/tsDMARD within 12 months" 

. bys eia_diagnosis: tab biologic_12m if has_12m_follow_up==1, missing //missing will be patients with no rheum appt and/or rheum appt after bDMARD/tsDMARD script

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      2,871       26.77       26.77
         No |      3,500       32.63       59.40
          . |      4,354       40.60      100.00
------------+-----------------------------------
      Total |     10,725      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      2,838       26.60       26.60
         No |      3,441       32.25       58.84
          . |      4,392       41.16      100.00
------------+-----------------------------------
      Total |     10,671      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      2,850       27.12       27.12
         No |      3,378       32.15       59.27
          . |      4,279       40.73      100.00
------------+-----------------------------------
      Total |     10,507      100.00


. bys eia_diagnosis: tab biologic_12m if has_12m_follow_up==1 //for patients with at least 12m registration

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      2,871       45.06       45.06
         No |      3,500       54.94      100.00
------------+-----------------------------------
      Total |      6,371      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      2,838       45.20       45.20
         No |      3,441       54.80      100.00
------------+-----------------------------------
      Total |      6,279      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      2,850       45.76       45.76
         No |      3,378       54.24      100.00
------------+-----------------------------------
      Total |      6,228      100.00


. 
. **Biologic time categories (by year)
. bys diagnosis_year: tab biologic_6m if has_6m_follow_up==1, missing //for all EIA patients with at least 6m follow-up

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,316       12.32       12.32
         No |      4,986       46.69       59.01
          . |      4,378       40.99      100.00
------------+-----------------------------------
      Total |     10,680      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,362       12.72       12.72
         No |      4,912       45.89       58.61
          . |      4,431       41.39      100.00
------------+-----------------------------------
      Total |     10,705      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      1,374       12.77       12.77
         No |      5,079       47.22       59.99
          . |      4,303       40.01      100.00
------------+-----------------------------------
      Total |     10,756      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        184       12.30       12.30
         No |        697       46.59       58.89
          . |        615       41.11      100.00
------------+-----------------------------------
      Total |      1,496      100.00


. bys diagnosis_year eia_diagnosis: tab biologic_6m if has_6m_follow_up==1, missing //for each diagnosis with at least 6m follow-up

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020, eia_diagnosis = RA

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        443       12.10       12.10
         No |      1,742       47.57       59.67
          . |      1,477       40.33      100.00
------------+-----------------------------------
      Total |      3,662      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020, eia_diagnosis = PsA

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        417       11.86       11.86
         No |      1,617       45.99       57.85
          . |      1,482       42.15      100.00
------------+-----------------------------------
      Total |      3,516      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020, eia_diagnosis = AxSpA

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        456       13.02       13.02
         No |      1,627       46.46       59.48
          . |      1,419       40.52      100.00
------------+-----------------------------------
      Total |      3,502      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021, eia_diagnosis = RA

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        461       12.90       12.90
         No |      1,639       45.85       58.74
          . |      1,475       41.26      100.00
------------+-----------------------------------
      Total |      3,575      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021, eia_diagnosis = PsA

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        459       12.86       12.86
         No |      1,629       45.64       58.50
          . |      1,481       41.50      100.00
------------+-----------------------------------
      Total |      3,569      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021, eia_diagnosis = AxSpA

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        442       12.41       12.41
         No |      1,644       46.17       58.58
          . |      1,475       41.42      100.00
------------+-----------------------------------
      Total |      3,561      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022, eia_diagnosis = RA

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        439       12.24       12.24
         No |      1,713       47.77       60.01
          . |      1,434       39.99      100.00
------------+-----------------------------------
      Total |      3,586      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022, eia_diagnosis = PsA

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        500       13.90       13.90
         No |      1,665       46.29       60.19
          . |      1,432       39.81      100.00
------------+-----------------------------------
      Total |      3,597      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022, eia_diagnosis = AxSpA

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        435       12.17       12.17
         No |      1,701       47.61       59.78
          . |      1,437       40.22      100.00
------------+-----------------------------------
      Total |      3,573      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = ., eia_diagnosis = RA

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         67       13.19       13.19
         No |        236       46.46       59.65
          . |        205       40.35      100.00
------------+-----------------------------------
      Total |        508      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = ., eia_diagnosis = PsA

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         60       12.27       12.27
         No |        220       44.99       57.26
          . |        209       42.74      100.00
------------+-----------------------------------
      Total |        489      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = ., eia_diagnosis = AxSpA

bDMARD/tsDM |
 ARD within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         57       11.42       11.42
         No |        241       48.30       59.72
          . |        201       40.28      100.00
------------+-----------------------------------
      Total |        499      100.00


. bys diagnosis_year: tab biologic_12m if has_12m_follow_up==1, missing //for all EIA patients

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      2,698       26.70       26.70
         No |      3,279       32.46       59.16
          . |      4,126       40.84      100.00
------------+-----------------------------------
      Total |     10,103      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      2,661       26.12       26.12
         No |      3,305       32.45       58.57
          . |      4,220       41.43      100.00
------------+-----------------------------------
      Total |     10,186      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |      2,826       27.67       27.67
         No |      3,283       32.14       59.81
          . |      4,105       40.19      100.00
------------+-----------------------------------
      Total |     10,214      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = .

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        374       26.71       26.71
         No |        452       32.29       59.00
          . |        574       41.00      100.00
------------+-----------------------------------
      Total |      1,400      100.00


. bys diagnosis_year eia_diagnosis: tab biologic_12m if has_12m_follow_up==1, missing //for each diagnosis

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020, eia_diagnosis = RA

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        927       26.79       26.79
         No |      1,138       32.89       59.68
          . |      1,395       40.32      100.00
------------+-----------------------------------
      Total |      3,460      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020, eia_diagnosis = PsA

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        874       26.17       26.17
         No |      1,073       32.13       58.29
          . |      1,393       41.71      100.00
------------+-----------------------------------
      Total |      3,340      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2019-March 2020, eia_diagnosis = AxSpA

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        897       27.16       27.16
         No |      1,068       32.33       59.49
          . |      1,338       40.51      100.00
------------+-----------------------------------
      Total |      3,303      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021, eia_diagnosis = RA

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        879       26.01       26.01
         No |      1,121       33.18       59.19
          . |      1,379       40.81      100.00
------------+-----------------------------------
      Total |      3,379      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021, eia_diagnosis = PsA

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        894       26.02       26.02
         No |      1,110       32.31       58.32
          . |      1,432       41.68      100.00
------------+-----------------------------------
      Total |      3,436      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2020-March 2021, eia_diagnosis = AxSpA

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        888       26.34       26.34
         No |      1,074       31.86       58.20
          . |      1,409       41.80      100.00
------------+-----------------------------------
      Total |      3,371      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022, eia_diagnosis = RA

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        924       27.22       27.22
         No |      1,091       32.14       59.35
          . |      1,380       40.65      100.00
------------+-----------------------------------
      Total |      3,395      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022, eia_diagnosis = PsA

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        960       27.85       27.85
         No |      1,116       32.38       60.23
          . |      1,371       39.77      100.00
------------+-----------------------------------
      Total |      3,447      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = March 2021-March 2022, eia_diagnosis = AxSpA

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        942       27.94       27.94
         No |      1,076       31.91       59.85
          . |      1,354       40.15      100.00
------------+-----------------------------------
      Total |      3,372      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = ., eia_diagnosis = RA

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        141       28.72       28.72
         No |        150       30.55       59.27
          . |        200       40.73      100.00
------------+-----------------------------------
      Total |        491      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = ., eia_diagnosis = PsA

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        110       24.55       24.55
         No |        142       31.70       56.25
          . |        196       43.75      100.00
------------+-----------------------------------
      Total |        448      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = ., eia_diagnosis = AxSpA

bDMARD/tsDM |
 ARD within |
  12 months |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        123       26.68       26.68
         No |        160       34.71       61.39
          . |        178       38.61      100.00
------------+-----------------------------------
      Total |        461      100.00


. 
. save "$projectdir/output/data/file_eia_all", replace
(file C:/Users/k1754142/OneDrive/PhD Project/OpenSAFELY/Github Practice/output/data/file_eia_all.dta not found)
file C:/Users/k1754142/OneDrive/PhD Project/OpenSAFELY/Github Practice/output/data/file_eia_all.dta saved

. 
. log close
      name:  <unnamed>
       log:  C:/Users/k1754142/OneDrive/PhD Project/OpenSAFELY/Github Practice/logs/cleaning_dataset.log
  log type:  text
 closed on:   6 Apr 2022, 16:36:24
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
