-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/descriptive_tables_allpts.log
  log type:  text
 opened on:   6 Apr 2022, 14:51:15

. 
. **Set Ado file path
. adopath + "$projectdir/analysis/extra_ados"
  [1]  (BASE)      "/usr/local/stata/ado/base/"
  [2]  (SITE)      "/usr/local/ado/"
  [3]              "."
  [4]  (PERSONAL)  "~/ado/personal/"
  [5]  (PLUS)      "~/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "/workspace/analysis/extra_ados"

. 
. **Use cleaned data from previous step
. use "$projectdir/output/data/file_eia_allpts.dta", clear

. 
. /*Tables=====================================================================
> ================*/
. *Baseline table
. preserve

. table1_mc, onecol missing nospacelowpercent iqrmiddle(",")  ///
>         vars(age contn %3.0f \ ///
>                  agegroup cat %5.1f \ ///
>                  male bin %5.1f \ ///
>                  ethnicity cat %5.1f \ ///
>                  imd cat %5.1f \ ///
>                  bmicat cat %5.1f \ ///
>                  smoke cat %5.1f \ ///
>                  hypertension bin %5.1f \ ///
>                  diabetes bin %5.1f \ ///
>                  hba1ccatmm cat %5.1f \ ///
>                  chronic_cardiac_disease bin %5.1f \ /// 
>                  stroke bin %5.1f \ ///
>                  cancer bin %5.1f \ ///
>                  chronic_resp_disease bin  %5.1f \ ///
>                  chronic_liver_disease bin %5.1f \ ///
>                  ckd cat %5.1f \ ///
>                  egfr_cat_nomiss cat %5.1f \ ///
>                  esrf bin %5.1f \ ///
>                  ) clear

  +----------------------------------------------+
  | factor                             N_1   m_1 |
  |----------------------------------------------|
  | Age                             78,818     0 |
  |----------------------------------------------|
  | Age group                       78,818     0 |
  |----------------------------------------------|
  | Male                            78,818     0 |
  |----------------------------------------------|
  | Ethnicity                       78,818     0 |
  |----------------------------------------------|
  | Index of multiple deprivation   78,818     0 |
  |----------------------------------------------|
  | BMI                             78,818     0 |
  |----------------------------------------------|
  | Smoking status                  78,818     0 |
  |----------------------------------------------|
  | Hypertension                    78,818     0 |
  |----------------------------------------------|
  | Diabetes                        78,818     0 |
  |----------------------------------------------|
  | HbA1c                           78,818     0 |
  |----------------------------------------------|
  | Chronic cardiac disease         78,818     0 |
  |----------------------------------------------|
  | Stroke                          78,818     0 |
  |----------------------------------------------|
  | Cancer                          78,818     0 |
  |----------------------------------------------|
  | Chronic respiratory disease     78,818     0 |
  |----------------------------------------------|
  | Chronic liver disease           78,818     0 |
  |----------------------------------------------|
  | Chronic kidney disease          78,818     0 |
  |----------------------------------------------|
  | eGFR                            78,818     0 |
  |----------------------------------------------|
  | End-stage renal failure         78,818     0 |
  +----------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +------------------------------------------------+
  |                                 Total          |
  |------------------------------------------------|
  |                                 N=78,818       |
  |------------------------------------------------|
  | Age                             49 (19)        |
  |------------------------------------------------|
  | Age group                                      |
  |    18-39                        28,537 (36.2%) |
  |    40-49                        12,949 (16.4%) |
  |    50-59                        13,559 (17.2%) |
  |    60-69                        10,604 (13.5%) |
  |    70-79                        8,225 (10.4%)  |
  |    80+                          4,944 (6.3%)   |
  |------------------------------------------------|
  | Male                            38,662 (49.1%) |
  |------------------------------------------------|
  | Ethnicity                                      |
  |    White                        29,581 (37.5%) |
  |    Asian/Asian British          5,871 (7.4%)   |
  |    Black                        5,826 (7.4%)   |
  |    Mixed/Other                  17,880 (22.7%) |
  |                                 19,660 (24.9%) |
  |------------------------------------------------|
  | Index of multiple deprivation                  |
  |    1 least deprived             55,367 (70.2%) |
  |    4                            15,769 (20.0%) |
  |    5 most deprived              7,682 (9.7%)   |
  |------------------------------------------------|
  | BMI                                            |
  |    Underweight (<18.5)          179 (0.2%)     |
  |    Normal (18.5-24.9)           414 (0.5%)     |
  |    Overweight (25-29.9)         562 (0.7%)     |
  |    Obese I (30-34.9)            721 (0.9%)     |
  |    Obese II (35-39.9)           747 (0.9%)     |
  |    Obese III (40+)              1,100 (1.4%)   |
  |                                 75,095 (95.3%) |
  |------------------------------------------------|
  | Smoking status                                 |
  |    Never                        7,860 (10.0%)  |
  |    Former                       3,946 (5.0%)   |
  |    Current                      23,672 (30.0%) |
  |                                 43,340 (55.0%) |
  |------------------------------------------------|
  | Hypertension                    15,798 (20.0%) |
  |------------------------------------------------|
  | Diabetes                        15,721 (19.9%) |
  |------------------------------------------------|
  | HbA1c                                          |
  |    HbA1c <58mmol/mol            2,034 (2.6%)   |
  |    HbA1c >=58mmol/mol           341 (0.4%)     |
  |                                 76,443 (97.0%) |
  |------------------------------------------------|
  | Chronic cardiac disease         15,700 (19.9%) |
  |------------------------------------------------|
  | Stroke                          15,630 (19.8%) |
  |------------------------------------------------|
  | Cancer                          38,585 (49.0%) |
  |------------------------------------------------|
  | Chronic respiratory disease     15,746 (20.0%) |
  |------------------------------------------------|
  | Chronic liver disease           15,734 (20.0%) |
  |------------------------------------------------|
  | Chronic kidney disease                         |
  |    No CKD                       35,184 (44.6%) |
  |    CKD                          43,634 (55.4%) |
  |------------------------------------------------|
  | eGFR                                           |
  |    >=60/missing                 43,937 (55.7%) |
  |    30-59                        20,880 (26.5%) |
  |    <30                          14,001 (17.8%) |
  |------------------------------------------------|
  | End-stage renal failure         15,682 (19.9%) |
  +------------------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 

. restore

.                  
. log close
      name:  <unnamed>
       log:  /workspace/logs/descriptive_tables_allpts.log
  log type:  text
 closed on:   6 Apr 2022, 14:51:18
-------------------------------------------------------------------------------
