-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/descriptive_tables_allpts.log
  log type:  text
 opened on:   6 Apr 2022, 15:58:24

. 
. **Set Ado file path
. adopath + "$projectdir/analysis/extra_ados"
  [1]  (BASE)      "/usr/local/stata/ado/base/"
  [2]  (SITE)      "/usr/local/ado/"
  [3]              "."
  [4]  (PERSONAL)  "~/ado/personal/"
  [5]  (PLUS)      "~/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "/workspace/analysis/extra_ados"

. 
. **Use cleaned data from previous step
. use "$projectdir/output/data/file_eia_allpts.dta", clear

. 
. /*Tables=====================================================================
> ================*/
. *Baseline table
. preserve

. table1_mc, onecol missing nospacelowpercent iqrmiddle(",")  ///
>         vars(age contn %3.0f \ ///
>                  agegroup cat %5.1f \ ///
>                  male bin %5.1f \ ///
>                  ethnicity cat %5.1f \ ///
>                  imd cat %5.1f \ ///
>                  bmicat cat %5.1f \ ///
>                  smoke cat %5.1f \ ///
>                  hypertension bin %5.1f \ ///
>                  diabetes bin %5.1f \ ///
>                  hba1ccatmm cat %5.1f \ ///
>                  chronic_cardiac_disease bin %5.1f \ /// 
>                  stroke bin %5.1f \ ///
>                  cancer bin %5.1f \ ///
>                  chronic_resp_disease bin  %5.1f \ ///
>                  chronic_liver_disease bin %5.1f \ ///
>                  ckd cat %5.1f \ ///
>                  egfr_cat_nomiss cat %5.1f \ ///
>                  esrf bin %5.1f \ ///
>                  ) clear

  +----------------------------------------------+
  | factor                             N_1   m_1 |
  |----------------------------------------------|
  | Age                             78,554     0 |
  |----------------------------------------------|
  | Age group                       78,554     0 |
  |----------------------------------------------|
  | Male                            78,554     0 |
  |----------------------------------------------|
  | Ethnicity                       78,554     0 |
  |----------------------------------------------|
  | Index of multiple deprivation   78,554     0 |
  |----------------------------------------------|
  | BMI                             78,554     0 |
  |----------------------------------------------|
  | Smoking status                  78,554     0 |
  |----------------------------------------------|
  | Hypertension                    78,554     0 |
  |----------------------------------------------|
  | Diabetes                        78,554     0 |
  |----------------------------------------------|
  | HbA1c                           78,554     0 |
  |----------------------------------------------|
  | Chronic cardiac disease         78,554     0 |
  |----------------------------------------------|
  | Stroke                          78,554     0 |
  |----------------------------------------------|
  | Cancer                          78,554     0 |
  |----------------------------------------------|
  | Chronic respiratory disease     78,554     0 |
  |----------------------------------------------|
  | Chronic liver disease           78,554     0 |
  |----------------------------------------------|
  | Chronic kidney disease          78,554     0 |
  |----------------------------------------------|
  | eGFR                            78,554     0 |
  |----------------------------------------------|
  | End-stage renal failure         78,554     0 |
  +----------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +------------------------------------------------+
  |                                 Total          |
  |------------------------------------------------|
  |                                 N=78,554       |
  |------------------------------------------------|
  | Age                             49 (19)        |
  |------------------------------------------------|
  | Age group                                      |
  |    18-39                        28,549 (36.3%) |
  |    40-49                        12,823 (16.3%) |
  |    50-59                        13,360 (17.0%) |
  |    60-69                        10,520 (13.4%) |
  |    70-79                        8,334 (10.6%)  |
  |    80+                          4,968 (6.3%)   |
  |------------------------------------------------|
  | Male                            38,429 (48.9%) |
  |------------------------------------------------|
  | Ethnicity                                      |
  |    White                        29,367 (37.4%) |
  |    Asian/Asian British          5,870 (7.5%)   |
  |    Black                        5,960 (7.6%)   |
  |    Mixed/Other                  17,661 (22.5%) |
  |                                 19,696 (25.1%) |
  |------------------------------------------------|
  | Index of multiple deprivation                  |
  |    1 least deprived             55,129 (70.2%) |
  |    4                            15,678 (20.0%) |
  |    5 most deprived              7,747 (9.9%)   |
  |------------------------------------------------|
  | BMI                                            |
  |    Underweight (<18.5)          167 (0.2%)     |
  |    Normal (18.5-24.9)           379 (0.5%)     |
  |    Overweight (25-29.9)         536 (0.7%)     |
  |    Obese I (30-34.9)            708 (0.9%)     |
  |    Obese II (35-39.9)           717 (0.9%)     |
  |    Obese III (40+)              1,167 (1.5%)   |
  |                                 74,880 (95.3%) |
  |------------------------------------------------|
  | Smoking status                                 |
  |    Never                        7,736 (9.8%)   |
  |    Former                       3,917 (5.0%)   |
  |    Current                      23,725 (30.2%) |
  |                                 43,176 (55.0%) |
  |------------------------------------------------|
  | Hypertension                    15,716 (20.0%) |
  |------------------------------------------------|
  | Diabetes                        15,740 (20.0%) |
  |------------------------------------------------|
  | HbA1c                                          |
  |    HbA1c <58mmol/mol            1,963 (2.5%)   |
  |    HbA1c >=58mmol/mol           363 (0.5%)     |
  |                                 76,228 (97.0%) |
  |------------------------------------------------|
  | Chronic cardiac disease         15,674 (20.0%) |
  |------------------------------------------------|
  | Stroke                          15,772 (20.1%) |
  |------------------------------------------------|
  | Cancer                          38,474 (49.0%) |
  |------------------------------------------------|
  | Chronic respiratory disease     15,674 (20.0%) |
  |------------------------------------------------|
  | Chronic liver disease           15,708 (20.0%) |
  |------------------------------------------------|
  | Chronic kidney disease                         |
  |    No CKD                       34,962 (44.5%) |
  |    CKD                          43,592 (55.5%) |
  |------------------------------------------------|
  | eGFR                                           |
  |    >=60/missing                 43,736 (55.7%) |
  |    30-59                        20,894 (26.6%) |
  |    <30                          13,924 (17.7%) |
  |------------------------------------------------|
  | End-stage renal failure         15,619 (19.9%) |
  +------------------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 

. restore

.                  
. log close
      name:  <unnamed>
       log:  /workspace/logs/descriptive_tables_allpts.log
  log type:  text
 closed on:   6 Apr 2022, 15:58:27
-------------------------------------------------------------------------------
