{smcl}
{txt}{sf}{ul off}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/workspace/logs/descriptive_tables_allpts.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}29 Mar 2022, 15:31:47
{txt}
{com}. 
. **Set Ado file path
. adopath + "$projectdir/analysis/extra_ados"
{txt}  [1]  (BASE)      "{res}/usr/local/stata/ado/base/{txt}"
  [2]  (SITE)      "{res}/usr/local/ado/{txt}"
  [3]              "{res}.{txt}"
  [4]  (PERSONAL)  "{res}~/ado/personal/{txt}"
  [5]  (PLUS)      "{res}~/ado/plus/{txt}"
  [6]  (OLDPLACE)  "{res}~/ado/{txt}"
  [7]              "{res}/workspace/analysis/extra_ados{txt}"

{com}. 
. **Use cleaned data from previous step
. use "$projectdir/output/data/file_eia_allpts.dta", clear
{txt}
{com}. 
. /*Tables=====================================================================================*/
. *Table 1a - 
. preserve
{txt}
{com}. table1_mc, onecol missing nospacelowpercent iqrmiddle(",")  ///
>         vars(age contn %3.0f \ ///
>                  agegroup cat %5.1f \ ///
>                  male bin %5.1f \ ///
>                  ethnicity cat %5.1f \ ///
>                  imd cat %5.1f \ ///
>                  bmicat cat %5.1f \ ///
>                  smoke cat %5.1f \ ///
>                  hypertension bin %5.1f \ ///
>                  diabetes bin %5.1f \ ///
>                  hba1ccatmm cat %5.1f \ ///
>                  chronic_cardiac_disease bin %5.1f \ /// 
>                  stroke bin %5.1f \ ///
>                  cancer bin %5.1f \ ///
>                  chronic_resp_disease bin  %5.1f \ ///
>                  chronic_liver_disease bin %5.1f \ ///
>                  ckd cat %5.1f \ ///
>                  egfr_cat_nomiss cat %5.1f \ ///
>                  esrf bin %5.1f \ ///
>                  ) clear
{res}{txt}
  {c TLC}{hline 31}{c -}{hline 8}{c -}{hline 5}{c TRC}
  {c |} {res}factor                             N_1   m_1 {txt}{c |}
  {c LT}{hline 31}{c -}{hline 8}{c -}{hline 5}{c RT}
  {c |} {res}Age                             78,820     0 {txt}{c |}
  {c LT}{hline 31}{c -}{hline 8}{c -}{hline 5}{c RT}
  {c |} {res}Age group                       78,820     0 {txt}{c |}
  {c LT}{hline 31}{c -}{hline 8}{c -}{hline 5}{c RT}
  {c |} {res}Male                            78,820     0 {txt}{c |}
  {c LT}{hline 31}{c -}{hline 8}{c -}{hline 5}{c RT}
  {c |} {res}Ethnicity                       78,820     0 {txt}{c |}
  {c LT}{hline 31}{c -}{hline 8}{c -}{hline 5}{c RT}
  {c |} {res}Index of multiple deprivation   78,820     0 {txt}{c |}
  {c LT}{hline 31}{c -}{hline 8}{c -}{hline 5}{c RT}
  {c |} {res}BMI                             78,820     0 {txt}{c |}
  {c LT}{hline 31}{c -}{hline 8}{c -}{hline 5}{c RT}
  {c |} {res}Smoking status                  78,820     0 {txt}{c |}
  {c LT}{hline 31}{c -}{hline 8}{c -}{hline 5}{c RT}
  {c |} {res}Hypertension                    78,820     0 {txt}{c |}
  {c LT}{hline 31}{c -}{hline 8}{c -}{hline 5}{c RT}
  {c |} {res}Diabetes                        78,820     0 {txt}{c |}
  {c LT}{hline 31}{c -}{hline 8}{c -}{hline 5}{c RT}
  {c |} {res}HbA1c                           78,820     0 {txt}{c |}
  {c LT}{hline 31}{c -}{hline 8}{c -}{hline 5}{c RT}
  {c |} {res}Chronic cardiac disease         78,820     0 {txt}{c |}
  {c LT}{hline 31}{c -}{hline 8}{c -}{hline 5}{c RT}
  {c |} {res}Stroke                          78,820     0 {txt}{c |}
  {c LT}{hline 31}{c -}{hline 8}{c -}{hline 5}{c RT}
  {c |} {res}Cancer                          78,820     0 {txt}{c |}
  {c LT}{hline 31}{c -}{hline 8}{c -}{hline 5}{c RT}
  {c |} {res}Chronic respiratory disease     78,820     0 {txt}{c |}
  {c LT}{hline 31}{c -}{hline 8}{c -}{hline 5}{c RT}
  {c |} {res}Chronic liver disease           78,820     0 {txt}{c |}
  {c LT}{hline 31}{c -}{hline 8}{c -}{hline 5}{c RT}
  {c |} {res}Chronic kidney disease          78,820     0 {txt}{c |}
  {c LT}{hline 31}{c -}{hline 8}{c -}{hline 5}{c RT}
  {c |} {res}eGFR                            78,820     0 {txt}{c |}
  {c LT}{hline 31}{c -}{hline 8}{c -}{hline 5}{c RT}
  {c |} {res}End-stage renal failure         78,820     0 {txt}{c |}
  {c BLC}{hline 31}{c -}{hline 8}{c -}{hline 5}{c BRC}
   N_ ... #records used below,   m_ ... #records not used
 
  {c TLC}{hline 31}{c -}{hline 16}{c TRC}
  {c |} {res}                                Total          {txt}{c |}
  {c LT}{hline 31}{c -}{hline 16}{c RT}
  {c |} {res}                                N=78,820       {txt}{c |}
  {c LT}{hline 31}{c -}{hline 16}{c RT}
  {c |} {res}Age                             49 (19)        {txt}{c |}
  {c LT}{hline 31}{c -}{hline 16}{c RT}
  {c |} {res}Age group                                      {txt}{c |}
  {c |} {res}   18-39                        28,723 (36.4%) {txt}{c |}
  {c |} {res}   40-49                        12,725 (16.1%) {txt}{c |}
  {c |} {res}   50-59                        13,557 (17.2%) {txt}{c |}
  {c |} {res}   60-69                        10,642 (13.5%) {txt}{c |}
  {c |} {res}   70-79                        8,347 (10.6%)  {txt}{c |}
  {c |} {res}   80+                          4,826 (6.1%)   {txt}{c |}
  {c LT}{hline 31}{c -}{hline 16}{c RT}
  {c |} {res}Male                            38,544 (48.9%) {txt}{c |}
  {c LT}{hline 31}{c -}{hline 16}{c RT}
  {c |} {res}Ethnicity                                      {txt}{c |}
  {c |} {res}   White                        29,396 (37.3%) {txt}{c |}
  {c |} {res}   Asian/Asian British          5,969 (7.6%)   {txt}{c |}
  {c |} {res}   Black                        5,895 (7.5%)   {txt}{c |}
  {c |} {res}   Mixed/Other                  17,819 (22.6%) {txt}{c |}
  {c |} {res}                                19,741 (25.0%) {txt}{c |}
  {c LT}{hline 31}{c -}{hline 16}{c RT}
  {c |} {res}Index of multiple deprivation                  {txt}{c |}
  {c |} {res}   1 least deprived             55,179 (70.0%) {txt}{c |}
  {c |} {res}   4                            15,750 (20.0%) {txt}{c |}
  {c |} {res}   5 most deprived              7,891 (10.0%)  {txt}{c |}
  {c LT}{hline 31}{c -}{hline 16}{c RT}
  {c |} {res}BMI                                            {txt}{c |}
  {c |} {res}   Underweight (<18.5)          195 (0.2%)     {txt}{c |}
  {c |} {res}   Normal (18.5-24.9)           434 (0.6%)     {txt}{c |}
  {c |} {res}   Overweight (25-29.9)         569 (0.7%)     {txt}{c |}
  {c |} {res}   Obese I (30-34.9)            688 (0.9%)     {txt}{c |}
  {c |} {res}   Obese II (35-39.9)           749 (1.0%)     {txt}{c |}
  {c |} {res}   Obese III (40+)              1,132 (1.4%)   {txt}{c |}
  {c |} {res}                                75,053 (95.2%) {txt}{c |}
  {c LT}{hline 31}{c -}{hline 16}{c RT}
  {c |} {res}Smoking status                                 {txt}{c |}
  {c |} {res}   Never                        7,914 (10.0%)  {txt}{c |}
  {c |} {res}   Former                       3,957 (5.0%)   {txt}{c |}
  {c |} {res}   Current                      23,644 (30.0%) {txt}{c |}
  {c |} {res}                                43,305 (54.9%) {txt}{c |}
  {c LT}{hline 31}{c -}{hline 16}{c RT}
  {c |} {res}Hypertension                    15,729 (20.0%) {txt}{c |}
  {c LT}{hline 31}{c -}{hline 16}{c RT}
  {c |} {res}Diabetes                        15,736 (20.0%) {txt}{c |}
  {c LT}{hline 31}{c -}{hline 16}{c RT}
  {c |} {res}HbA1c                                          {txt}{c |}
  {c |} {res}   HbA1c <58mmol/mol            2,015 (2.6%)   {txt}{c |}
  {c |} {res}   HbA1c >=58mmol/mol           361 (0.5%)     {txt}{c |}
  {c |} {res}                                76,444 (97.0%) {txt}{c |}
  {c LT}{hline 31}{c -}{hline 16}{c RT}
  {c |} {res}Chronic cardiac disease         15,714 (19.9%) {txt}{c |}
  {c LT}{hline 31}{c -}{hline 16}{c RT}
  {c |} {res}Stroke                          15,725 (20.0%) {txt}{c |}
  {c LT}{hline 31}{c -}{hline 16}{c RT}
  {c |} {res}Cancer                          38,657 (49.0%) {txt}{c |}
  {c LT}{hline 31}{c -}{hline 16}{c RT}
  {c |} {res}Chronic respiratory disease     15,725 (20.0%) {txt}{c |}
  {c LT}{hline 31}{c -}{hline 16}{c RT}
  {c |} {res}Chronic liver disease           15,818 (20.1%) {txt}{c |}
  {c LT}{hline 31}{c -}{hline 16}{c RT}
  {c |} {res}Chronic kidney disease                         {txt}{c |}
  {c |} {res}   No CKD                       35,229 (44.7%) {txt}{c |}
  {c |} {res}   CKD                          43,591 (55.3%) {txt}{c |}
  {c LT}{hline 31}{c -}{hline 16}{c RT}
  {c |} {res}eGFR                                           {txt}{c |}
  {c |} {res}   >=60/missing                 44,004 (55.8%) {txt}{c |}
  {c |} {res}   30-59                        20,705 (26.3%) {txt}{c |}
  {c |} {res}   <30                          14,111 (17.9%) {txt}{c |}
  {c LT}{hline 31}{c -}{hline 16}{c RT}
  {c |} {res}End-stage renal failure         15,740 (20.0%) {txt}{c |}
  {c BLC}{hline 31}{c -}{hline 16}{c BRC}
Data are presented as mean (SD) for continuous measures, and n (%) for categorical measures.
 

{com}. restore
{txt}
{com}.                  
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/workspace/logs/descriptive_tables_allpts.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}29 Mar 2022, 15:31:50
{txt}{.-}
{smcl}
{txt}{sf}{ul off}