-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/descriptive_tables_allpts.log
  log type:  text
 opened on:  14 Apr 2022, 10:50:48

. 
. **Set Ado file path
. adopath + "$projectdir/analysis/extra_ados"
  [1]  (BASE)      "/usr/local/stata/ado/base/"
  [2]  (SITE)      "/usr/local/ado/"
  [3]              "."
  [4]  (PERSONAL)  "~/ado/personal/"
  [5]  (PLUS)      "~/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "/workspace/analysis/extra_ados"

. 
. **Use cleaned data from previous step
. use "$projectdir/output/data/file_eia_allpts.dta", clear

. 
. /*Tables=====================================================================
> ================*/
. *Baseline table
. table1_mc, onecol missing nospacelowpercent iqrmiddle(",")  ///
>         vars(agegroup cat %5.1f \ ///
>                  male bin %5.1f \ ///
>                  ethnicity cat %5.1f \ ///
>                  imd cat %5.1f \ ///
>                  bmicat cat %5.1f \ ///
>                  smoke cat %5.1f \ ///
>                  hypertension bin %5.1f \ ///
>                  diabcatm cat %5.1f \ ///
>                  chronic_cardiac_disease bin %5.1f \ /// 
>                  stroke bin %5.1f \ ///
>                  cancer bin %5.1f \ ///
>                  chronic_resp_disease bin  %5.1f \ ///
>                  chronic_liver_disease bin %5.1f \ ///
>                  ckd cat %5.1f \ ///
>                  egfr_cat_nomiss cat %5.1f \ ///
>                  ) saving("$projectdir/output/tables/baseline_allpts.csv", re
> place)

  +-----------------------------------------------+
  | factor                              N_1   m_1 |
  |-----------------------------------------------|
  | Age group                       157,657     0 |
  |-----------------------------------------------|
  | Male                            157,657     0 |
  |-----------------------------------------------|
  | Ethnicity                       157,657     0 |
  |-----------------------------------------------|
  | Index of multiple deprivation   157,657     0 |
  |-----------------------------------------------|
  | BMI                             157,657     0 |
  |-----------------------------------------------|
  | Smoking status                  157,657     0 |
  |-----------------------------------------------|
  | Hypertension                    157,657     0 |
  |-----------------------------------------------|
  | Diabetes                        157,657     0 |
  |-----------------------------------------------|
  | Chronic cardiac disease         157,657     0 |
  |-----------------------------------------------|
  | Stroke                          157,657     0 |
  |-----------------------------------------------|
  | Cancer                          157,657     0 |
  |-----------------------------------------------|
  | Chronic respiratory disease     157,657     0 |
  |-----------------------------------------------|
  | Chronic liver disease           157,657     0 |
  |-----------------------------------------------|
  | Chronic kidney disease          157,657     0 |
  |-----------------------------------------------|
  | eGFR                            157,657     0 |
  +-----------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +------------------------------------------------------+
  |                                      Total           |
  |------------------------------------------------------|
  |                                      N=157,657       |
  |------------------------------------------------------|
  | Age group                                            |
  |    18-39                             57,250 (36.3%)  |
  |    40-49                             25,393 (16.1%)  |
  |    50-59                             27,118 (17.2%)  |
  |    60-69                             21,228 (13.5%)  |
  |    70-79                             16,737 (10.6%)  |
  |    80+                               9,931 (6.3%)    |
  |------------------------------------------------------|
  | Male                                 77,243 (49.0%)  |
  |------------------------------------------------------|
  | Ethnicity                                            |
  |    White                             58,986 (37.4%)  |
  |    Asian/Asian British               11,880 (7.5%)   |
  |    Black                             11,862 (7.5%)   |
  |    Mixed/Other                       35,543 (22.5%)  |
  |                                      39,386 (25.0%)  |
  |------------------------------------------------------|
  | Index of multiple deprivation                        |
  |    1 least deprived                  29,924 (19.0%)  |
  |    2                                 30,089 (19.1%)  |
  |    3                                 29,877 (19.0%)  |
  |    4                                 29,948 (19.0%)  |
  |    5 most deprived                   29,899 (19.0%)  |
  |                                      7,920 (5.0%)    |
  |------------------------------------------------------|
  | BMI                                                  |
  |    Underweight (<18.5)               326 (0.2%)      |
  |    Normal (18.5-24.9)                816 (0.5%)      |
  |    Overweight (25-29.9)              1,128 (0.7%)    |
  |    Obese I (30-34.9)                 1,464 (0.9%)    |
  |    Obese II (35-39.9)                1,465 (0.9%)    |
  |    Obese III (40+)                   2,264 (1.4%)    |
  |                                      150,194 (95.3%) |
  |------------------------------------------------------|
  | Smoking status                                       |
  |    Never                             15,593 (9.9%)   |
  |    Former                            7,907 (5.0%)    |
  |    Current                           47,576 (30.2%)  |
  |                                      86,581 (54.9%)  |
  |------------------------------------------------------|
  | Hypertension                         31,558 (20.0%)  |
  |------------------------------------------------------|
  | Diabetes                                             |
  |    No diabetes                       126,068 (80.0%) |
  |    Diabetes with HbA1c <58mmol/mol   819 (0.5%)      |
  |    Diabetes with HbA1c >58mmol/mol   155 (0.1%)      |
  |    Diabetes with no HbA1c measure    30,615 (19.4%)  |
  |------------------------------------------------------|
  | Chronic cardiac disease              31,623 (20.1%)  |
  |------------------------------------------------------|
  | Stroke                               31,503 (20.0%)  |
  |------------------------------------------------------|
  | Cancer                               77,035 (48.9%)  |
  |------------------------------------------------------|
  | Chronic respiratory disease          31,582 (20.0%)  |
  |------------------------------------------------------|
  | Chronic liver disease                31,466 (20.0%)  |
  |------------------------------------------------------|
  | Chronic kidney disease                               |
  |    No CKD                            70,340 (44.6%)  |
  |    CKD                               87,317 (55.4%)  |
  |------------------------------------------------------|
  | eGFR                                                 |
  |    >=60/not Known                    88,075 (55.9%)  |
  |    30-59                             41,671 (26.4%)  |
  |    <30                               27,911 (17.7%)  |
  +------------------------------------------------------+
Data are presented as n (%).
 
file /workspace/output/tables/baseline_allpts.csv saved

.                  
. log close
      name:  <unnamed>
       log:  /workspace/logs/descriptive_tables_allpts.log
  log type:  text
 closed on:  14 Apr 2022, 10:50:53
-------------------------------------------------------------------------------
