-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/descriptive_tables_allpts.log
  log type:  text
 opened on:   8 Apr 2022, 12:21:09

. 
. **Set Ado file path
. adopath + "$projectdir/analysis/extra_ados"
  [1]  (BASE)      "/usr/local/stata/ado/base/"
  [2]  (SITE)      "/usr/local/ado/"
  [3]              "."
  [4]  (PERSONAL)  "~/ado/personal/"
  [5]  (PLUS)      "~/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "/workspace/analysis/extra_ados"

. 
. **Use cleaned data from previous step
. use "$projectdir/output/data/file_eia_allpts.dta", clear

. 
. /*Tables=====================================================================
> ================*/
. *Baseline table
. preserve

. table1_mc, onecol missing nospacelowpercent iqrmiddle(",")  ///
>         vars(agegroup cat %5.1f \ ///
>                  male bin %5.1f \ ///
>                  ethnicity cat %5.1f \ ///
>                  imd cat %5.1f \ ///
>                  bmicat cat %5.1f \ ///
>                  smoke cat %5.1f \ ///
>                  hypertension bin %5.1f \ ///
>                  diabetes bin %5.1f \ ///
>                  hba1ccatmm cat %5.1f \ ///
>                  chronic_cardiac_disease bin %5.1f \ /// 
>                  stroke bin %5.1f \ ///
>                  cancer bin %5.1f \ ///
>                  chronic_resp_disease bin  %5.1f \ ///
>                  chronic_liver_disease bin %5.1f \ ///
>                  ckd cat %5.1f \ ///
>                  egfr_cat_nomiss cat %5.1f \ ///
>                  esrf bin %5.1f \ ///
>                  ) clear

  +--------------------------------------------+
  | factor                           N_1   m_1 |
  |--------------------------------------------|
  | Age group                     78,876     0 |
  |--------------------------------------------|
  | Male                          78,876     0 |
  |--------------------------------------------|
  | Ethnicity                     78,876     0 |
  |--------------------------------------------|
  | imd                           78,876     0 |
  |--------------------------------------------|
  | BMI                           78,876     0 |
  |--------------------------------------------|
  | Smoking status                78,876     0 |
  |--------------------------------------------|
  | Hypertension                  78,876     0 |
  |--------------------------------------------|
  | Diabetes                      78,876     0 |
  |--------------------------------------------|
  | HbA1c                         78,876     0 |
  |--------------------------------------------|
  | Chronic cardiac disease       78,876     0 |
  |--------------------------------------------|
  | Stroke                        78,876     0 |
  |--------------------------------------------|
  | Cancer                        78,876     0 |
  |--------------------------------------------|
  | Chronic respiratory disease   78,876     0 |
  |--------------------------------------------|
  | Chronic liver disease         78,876     0 |
  |--------------------------------------------|
  | Chronic kidney disease        78,876     0 |
  |--------------------------------------------|
  | eGFR                          78,876     0 |
  |--------------------------------------------|
  | End-stage renal failure       78,876     0 |
  +--------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------+
  |                               Total          |
  |----------------------------------------------|
  |                               N=78,876       |
  |----------------------------------------------|
  | Age group                                    |
  |    18-39                      28,688 (36.4%) |
  |    40-49                      12,822 (16.3%) |
  |    50-59                      13,473 (17.1%) |
  |    60-69                      10,595 (13.4%) |
  |    70-79                      8,314 (10.5%)  |
  |    80+                        4,984 (6.3%)   |
  |----------------------------------------------|
  | Male                          38,732 (49.1%) |
  |----------------------------------------------|
  | Ethnicity                                    |
  |    White                      29,486 (37.4%) |
  |    Asian/Asian British        5,968 (7.6%)   |
  |    Black                      6,023 (7.6%)   |
  |    Mixed/Other                17,654 (22.4%) |
  |                               19,745 (25.0%) |
  |----------------------------------------------|
  | imd                                          |
  |    0                          3,982 (5.0%)   |
  |    1                          14,931 (18.9%) |
  |    2                          15,146 (19.2%) |
  |    3                          14,754 (18.7%) |
  |    4                          14,984 (19.0%) |
  |    5                          15,079 (19.1%) |
  |----------------------------------------------|
  | BMI                                          |
  |    Underweight (<18.5)        155 (0.2%)     |
  |    Normal (18.5-24.9)         391 (0.5%)     |
  |    Overweight (25-29.9)       588 (0.7%)     |
  |    Obese I (30-34.9)          715 (0.9%)     |
  |    Obese II (35-39.9)         740 (0.9%)     |
  |    Obese III (40+)            1,090 (1.4%)   |
  |                               75,197 (95.3%) |
  |----------------------------------------------|
  | Smoking status                               |
  |    Never                      7,900 (10.0%)  |
  |    Former                     3,870 (4.9%)   |
  |    Current                    23,702 (30.0%) |
  |                               43,404 (55.0%) |
  |----------------------------------------------|
  | Hypertension                  15,735 (19.9%) |
  |----------------------------------------------|
  | Diabetes                      15,762 (20.0%) |
  |----------------------------------------------|
  | HbA1c                                        |
  |    HbA1c <58mmol/mol          2,012 (2.6%)   |
  |    HbA1c >=58mmol/mol         350 (0.4%)     |
  |                               76,514 (97.0%) |
  |----------------------------------------------|
  | Chronic cardiac disease       15,832 (20.1%) |
  |----------------------------------------------|
  | Stroke                        15,737 (20.0%) |
  |----------------------------------------------|
  | Cancer                        38,516 (48.8%) |
  |----------------------------------------------|
  | Chronic respiratory disease   15,754 (20.0%) |
  |----------------------------------------------|
  | Chronic liver disease         15,771 (20.0%) |
  |----------------------------------------------|
  | Chronic kidney disease                       |
  |    No CKD                     35,384 (44.9%) |
  |    CKD                        43,492 (55.1%) |
  |----------------------------------------------|
  | eGFR                                         |
  |    >=60/missing               44,185 (56.0%) |
  |    30-59                      20,707 (26.3%) |
  |    <30                        13,984 (17.7%) |
  |----------------------------------------------|
  | End-stage renal failure       15,739 (20.0%) |
  +----------------------------------------------+
Data are presented as n (%).
 

. restore

.                  
. log close
      name:  <unnamed>
       log:  /workspace/logs/descriptive_tables_allpts.log
  log type:  text
 closed on:   8 Apr 2022, 12:21:11
-------------------------------------------------------------------------------
