-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/descriptive_tables_allpts.log
  log type:  text
 opened on:  14 Apr 2022, 10:23:01

. 
. **Set Ado file path
. adopath + "$projectdir/analysis/extra_ados"
  [1]  (BASE)      "/usr/local/stata/ado/base/"
  [2]  (SITE)      "/usr/local/ado/"
  [3]              "."
  [4]  (PERSONAL)  "~/ado/personal/"
  [5]  (PLUS)      "~/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "/workspace/analysis/extra_ados"

. 
. **Use cleaned data from previous step
. use "$projectdir/output/data/file_eia_allpts.dta", clear

. 
. /*Tables=====================================================================
> ================*/
. *Baseline table
. table1_mc, onecol missing nospacelowpercent iqrmiddle(",")  ///
>         vars(agegroup cat %5.1f \ ///
>                  male bin %5.1f \ ///
>                  ethnicity cat %5.1f \ ///
>                  imd cat %5.1f \ ///
>                  bmicat cat %5.1f \ ///
>                  smoke cat %5.1f \ ///
>                  hypertension bin %5.1f \ ///
>                  diabcatm cat %5.1f \ ///
>                  chronic_cardiac_disease bin %5.1f \ /// 
>                  stroke bin %5.1f \ ///
>                  cancer bin %5.1f \ ///
>                  chronic_resp_disease bin  %5.1f \ ///
>                  chronic_liver_disease bin %5.1f \ ///
>                  ckd cat %5.1f \ ///
>                  egfr_cat_nomiss cat %5.1f \ ///
>                  ) saving("$projectdir/output/tables/baseline_allpts.csv", re
> place)

  +----------------------------------------------+
  | factor                             N_1   m_1 |
  |----------------------------------------------|
  | Age group                       78,826     0 |
  |----------------------------------------------|
  | Male                            78,826     0 |
  |----------------------------------------------|
  | Ethnicity                       78,826     0 |
  |----------------------------------------------|
  | Index of multiple deprivation   78,826     0 |
  |----------------------------------------------|
  | BMI                             78,826     0 |
  |----------------------------------------------|
  | Smoking status                  78,826     0 |
  |----------------------------------------------|
  | Hypertension                    78,826     0 |
  |----------------------------------------------|
  | Diabetes                        78,826     0 |
  |----------------------------------------------|
  | Chronic cardiac disease         78,826     0 |
  |----------------------------------------------|
  | Stroke                          78,826     0 |
  |----------------------------------------------|
  | Cancer                          78,826     0 |
  |----------------------------------------------|
  | Chronic respiratory disease     78,826     0 |
  |----------------------------------------------|
  | Chronic liver disease           78,826     0 |
  |----------------------------------------------|
  | Chronic kidney disease          78,826     0 |
  |----------------------------------------------|
  | eGFR                            78,826     0 |
  +----------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +-----------------------------------------------------+
  |                                      Total          |
  |-----------------------------------------------------|
  |                                      N=78,826       |
  |-----------------------------------------------------|
  | Age group                                           |
  |    18-39                             28,443 (36.1%) |
  |    40-49                             12,729 (16.1%) |
  |    50-59                             13,736 (17.4%) |
  |    60-69                             10,563 (13.4%) |
  |    70-79                             8,359 (10.6%)  |
  |    80+                               4,996 (6.3%)   |
  |-----------------------------------------------------|
  | Male                                 38,357 (48.7%) |
  |-----------------------------------------------------|
  | Ethnicity                                           |
  |    White                             29,711 (37.7%) |
  |    Asian/Asian British               5,812 (7.4%)   |
  |    Black                             5,903 (7.5%)   |
  |    Mixed/Other                       17,739 (22.5%) |
  |                                      19,661 (24.9%) |
  |-----------------------------------------------------|
  | Index of multiple deprivation                       |
  |    1 least deprived                  14,844 (18.8%) |
  |    2                                 14,905 (18.9%) |
  |    3                                 15,017 (19.1%) |
  |    4                                 14,811 (18.8%) |
  |    5 most deprived                   15,233 (19.3%) |
  |                                      4,016 (5.1%)   |
  |-----------------------------------------------------|
  | BMI                                                 |
  |    Underweight (<18.5)               158 (0.2%)     |
  |    Normal (18.5-24.9)                428 (0.5%)     |
  |    Overweight (25-29.9)              518 (0.7%)     |
  |    Obese I (30-34.9)                 718 (0.9%)     |
  |    Obese II (35-39.9)                762 (1.0%)     |
  |    Obese III (40+)                   1,114 (1.4%)   |
  |                                      75,128 (95.3%) |
  |-----------------------------------------------------|
  | Smoking status                                      |
  |    Never                             7,800 (9.9%)   |
  |    Former                            3,903 (5.0%)   |
  |    Current                           23,676 (30.0%) |
  |                                      43,447 (55.1%) |
  |-----------------------------------------------------|
  | Hypertension                         15,868 (20.1%) |
  |-----------------------------------------------------|
  | Diabetes                                            |
  |    No diabetes                       63,160 (80.1%) |
  |    Diabetes with HbA1c <58mmol/mol   445 (0.6%)     |
  |    Diabetes with HbA1c >58mmol/mol   65 (0.1%)      |
  |    Diabetes with no HbA1c measure    15,156 (19.2%) |
  |-----------------------------------------------------|
  | Chronic cardiac disease              15,813 (20.1%) |
  |-----------------------------------------------------|
  | Stroke                               15,789 (20.0%) |
  |-----------------------------------------------------|
  | Cancer                               38,541 (48.9%) |
  |-----------------------------------------------------|
  | Chronic respiratory disease          15,780 (20.0%) |
  |-----------------------------------------------------|
  | Chronic liver disease                15,844 (20.1%) |
  |-----------------------------------------------------|
  | Chronic kidney disease                              |
  |    No CKD                            35,152 (44.6%) |
  |    CKD                               43,674 (55.4%) |
  |-----------------------------------------------------|
  | eGFR                                                |
  |    >=60/not Known                    43,874 (55.7%) |
  |    30-59                             20,927 (26.5%) |
  |    <30                               14,025 (17.8%) |
  +-----------------------------------------------------+
Data are presented as n (%).
 
file /workspace/output/tables/baseline_allpts.csv saved

.                  
. log close
      name:  <unnamed>
       log:  /workspace/logs/descriptive_tables_allpts.log
  log type:  text
 closed on:  14 Apr 2022, 10:23:03
-------------------------------------------------------------------------------
