{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/logs/descriptive_tables_allpts.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 1 Apr 2022, 16:34:34
{txt}
{com}. 
. **Set Ado file path
. adopath + "$projectdir/analysis/extra_ados"
{txt}  [1]  (BASE)      "{res}C:\Program Files\Stata17\ado\base/{txt}"
  [2]  (SITE)      "{res}C:\Program Files\Stata17\ado\site/{txt}"
  [3]              "{res}.{txt}"
  [4]  (PERSONAL)  "{res}C:\Users\k1754142\ado\personal/{txt}"
  [5]  (PLUS)      "{res}C:\Users\k1754142\ado\plus/{txt}"
  [6]  (OLDPLACE)  "{res}c:\ado/{txt}"
  [7]              "{res}C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/analysis/extra_ados{txt}"

{com}. 
. **Use cleaned data from previous step
. use "$projectdir/output/data/file_eia_allpts.dta", clear
{txt}
{com}. 
. /*Tables=====================================================================================*/
. *Table 1a - 
. preserve
{txt}
{com}. table1_mc, onecol missing nospacelowpercent iqrmiddle(",")  ///
>         vars(age contn %3.0f \ ///
>                  agegroup cat %5.1f \ ///
>                  male bin %5.1f \ ///
>                  ethnicity cat %5.1f \ ///
>                  imd cat %5.1f \ ///
>                  bmicat cat %5.1f \ ///
>                  smoke cat %5.1f \ ///
>                  hypertension bin %5.1f \ ///
>                  diabetes bin %5.1f \ ///
>                  hba1ccatmm cat %5.1f \ ///
>                  chronic_cardiac_disease bin %5.1f \ /// 
>                  stroke bin %5.1f \ ///
>                  cancer bin %5.1f \ ///
>                  chronic_resp_disease bin  %5.1f \ ///
>                  chronic_liver_disease bin %5.1f \ ///
>                  ckd cat %5.1f \ ///
>                  egfr_cat_nomiss cat %5.1f \ ///
>                  esrf bin %5.1f \ ///
>                  ) clear
{res}{txt}
  {c TLC}{hline 31}{c -}{hline 8}{c -}{hline 5}{c TRC}
  {c |} {res}factor                             N_1   m_1 {txt}{c |}
  {c LT}{hline 31}{c -}{hline 8}{c -}{hline 5}{c RT}
  {c |} {res}Age                             78,829     0 {txt}{c |}
  {c LT}{hline 31}{c -}{hline 8}{c -}{hline 5}{c RT}
  {c |} {res}Age group                       78,829     0 {txt}{c |}
  {c LT}{hline 31}{c -}{hline 8}{c -}{hline 5}{c RT}
  {c |} {res}Male                            78,829     0 {txt}{c |}
  {c LT}{hline 31}{c -}{hline 8}{c -}{hline 5}{c RT}
  {c |} {res}Ethnicity                       78,829     0 {txt}{c |}
  {c LT}{hline 31}{c -}{hline 8}{c -}{hline 5}{c RT}
  {c |} {res}Index of multiple deprivation   78,829     0 {txt}{c |}
  {c LT}{hline 31}{c -}{hline 8}{c -}{hline 5}{c RT}
  {c |} {res}BMI                             78,829     0 {txt}{c |}
  {c LT}{hline 31}{c -}{hline 8}{c -}{hline 5}{c RT}
  {c |} {res}Smoking status                  78,829     0 {txt}{c |}
  {c LT}{hline 31}{c -}{hline 8}{c -}{hline 5}{c RT}
  {c |} {res}Hypertension                    78,829     0 {txt}{c |}
  {c LT}{hline 31}{c -}{hline 8}{c -}{hline 5}{c RT}
  {c |} {res}Diabetes                        78,829     0 {txt}{c |}
  {c LT}{hline 31}{c -}{hline 8}{c -}{hline 5}{c RT}
  {c |} {res}HbA1c                           78,829     0 {txt}{c |}
  {c LT}{hline 31}{c -}{hline 8}{c -}{hline 5}{c RT}
  {c |} {res}Chronic cardiac disease         78,829     0 {txt}{c |}
  {c LT}{hline 31}{c -}{hline 8}{c -}{hline 5}{c RT}
  {c |} {res}Stroke                          78,829     0 {txt}{c |}
  {c LT}{hline 31}{c -}{hline 8}{c -}{hline 5}{c RT}
  {c |} {res}Cancer                          78,829     0 {txt}{c |}
  {c LT}{hline 31}{c -}{hline 8}{c -}{hline 5}{c RT}
  {c |} {res}Chronic respiratory disease     78,829     0 {txt}{c |}
  {c LT}{hline 31}{c -}{hline 8}{c -}{hline 5}{c RT}
  {c |} {res}Chronic liver disease           78,829     0 {txt}{c |}
  {c LT}{hline 31}{c -}{hline 8}{c -}{hline 5}{c RT}
  {c |} {res}Chronic kidney disease          78,829     0 {txt}{c |}
  {c LT}{hline 31}{c -}{hline 8}{c -}{hline 5}{c RT}
  {c |} {res}eGFR                            78,829     0 {txt}{c |}
  {c LT}{hline 31}{c -}{hline 8}{c -}{hline 5}{c RT}
  {c |} {res}End-stage renal failure         78,829     0 {txt}{c |}
  {c BLC}{hline 31}{c -}{hline 8}{c -}{hline 5}{c BRC}
   N_ ... #records used below,   m_ ... #records not used
 
  {c TLC}{hline 31}{c -}{hline 16}{c TRC}
  {c |} {res}                                Total          {txt}{c |}
  {c LT}{hline 31}{c -}{hline 16}{c RT}
  {c |} {res}                                N=78,829       {txt}{c |}
  {c LT}{hline 31}{c -}{hline 16}{c RT}
  {c |} {res}Age                             49 (19)        {txt}{c |}
  {c LT}{hline 31}{c -}{hline 16}{c RT}
  {c |} {res}Age group                                      {txt}{c |}
  {c |} {res}   18-39                        28,592 (36.3%) {txt}{c |}
  {c |} {res}   40-49                        12,753 (16.2%) {txt}{c |}
  {c |} {res}   50-59                        13,523 (17.2%) {txt}{c |}
  {c |} {res}   60-69                        10,818 (13.7%) {txt}{c |}
  {c |} {res}   70-79                        8,175 (10.4%)  {txt}{c |}
  {c |} {res}   80+                          4,968 (6.3%)   {txt}{c |}
  {c LT}{hline 31}{c -}{hline 16}{c RT}
  {c |} {res}Male                            38,626 (49.0%) {txt}{c |}
  {c LT}{hline 31}{c -}{hline 16}{c RT}
  {c |} {res}Ethnicity                                      {txt}{c |}
  {c |} {res}   White                        29,621 (37.6%) {txt}{c |}
  {c |} {res}   Asian/Asian British          5,898 (7.5%)   {txt}{c |}
  {c |} {res}   Black                        5,881 (7.5%)   {txt}{c |}
  {c |} {res}   Mixed/Other                  17,748 (22.5%) {txt}{c |}
  {c |} {res}                                19,681 (25.0%) {txt}{c |}
  {c LT}{hline 31}{c -}{hline 16}{c RT}
  {c |} {res}Index of multiple deprivation                  {txt}{c |}
  {c |} {res}   1 least deprived             55,247 (70.1%) {txt}{c |}
  {c |} {res}   4                            15,782 (20.0%) {txt}{c |}
  {c |} {res}   5 most deprived              7,800 (9.9%)   {txt}{c |}
  {c LT}{hline 31}{c -}{hline 16}{c RT}
  {c |} {res}BMI                                            {txt}{c |}
  {c |} {res}   Underweight (<18.5)          164 (0.2%)     {txt}{c |}
  {c |} {res}   Normal (18.5-24.9)           421 (0.5%)     {txt}{c |}
  {c |} {res}   Overweight (25-29.9)         563 (0.7%)     {txt}{c |}
  {c |} {res}   Obese I (30-34.9)            701 (0.9%)     {txt}{c |}
  {c |} {res}   Obese II (35-39.9)           733 (0.9%)     {txt}{c |}
  {c |} {res}   Obese III (40+)              1,188 (1.5%)   {txt}{c |}
  {c |} {res}                                75,059 (95.2%) {txt}{c |}
  {c LT}{hline 31}{c -}{hline 16}{c RT}
  {c |} {res}Smoking status                                 {txt}{c |}
  {c |} {res}   Never                        7,932 (10.1%)  {txt}{c |}
  {c |} {res}   Former                       3,932 (5.0%)   {txt}{c |}
  {c |} {res}   Current                      23,621 (30.0%) {txt}{c |}
  {c |} {res}                                43,344 (55.0%) {txt}{c |}
  {c LT}{hline 31}{c -}{hline 16}{c RT}
  {c |} {res}Hypertension                    15,783 (20.0%) {txt}{c |}
  {c LT}{hline 31}{c -}{hline 16}{c RT}
  {c |} {res}Diabetes                        15,673 (19.9%) {txt}{c |}
  {c LT}{hline 31}{c -}{hline 16}{c RT}
  {c |} {res}HbA1c                                          {txt}{c |}
  {c |} {res}   HbA1c <58mmol/mol            1,975 (2.5%)   {txt}{c |}
  {c |} {res}   HbA1c >=58mmol/mol           389 (0.5%)     {txt}{c |}
  {c |} {res}                                76,465 (97.0%) {txt}{c |}
  {c LT}{hline 31}{c -}{hline 16}{c RT}
  {c |} {res}Chronic cardiac disease         15,733 (20.0%) {txt}{c |}
  {c LT}{hline 31}{c -}{hline 16}{c RT}
  {c |} {res}Stroke                          15,795 (20.0%) {txt}{c |}
  {c LT}{hline 31}{c -}{hline 16}{c RT}
  {c |} {res}Cancer                          38,338 (48.6%) {txt}{c |}
  {c LT}{hline 31}{c -}{hline 16}{c RT}
  {c |} {res}Chronic respiratory disease     15,705 (19.9%) {txt}{c |}
  {c LT}{hline 31}{c -}{hline 16}{c RT}
  {c |} {res}Chronic liver disease           15,780 (20.0%) {txt}{c |}
  {c LT}{hline 31}{c -}{hline 16}{c RT}
  {c |} {res}Chronic kidney disease                         {txt}{c |}
  {c |} {res}   No CKD                       35,219 (44.7%) {txt}{c |}
  {c |} {res}   CKD                          43,610 (55.3%) {txt}{c |}
  {c LT}{hline 31}{c -}{hline 16}{c RT}
  {c |} {res}eGFR                                           {txt}{c |}
  {c |} {res}   >=60/missing                 44,058 (55.9%) {txt}{c |}
  {c |} {res}   30-59                        20,880 (26.5%) {txt}{c |}
  {c |} {res}   <30                          13,891 (17.6%) {txt}{c |}
  {c LT}{hline 31}{c -}{hline 16}{c RT}
  {c |} {res}End-stage renal failure         15,736 (20.0%) {txt}{c |}
  {c BLC}{hline 31}{c -}{hline 16}{c BRC}
Data are presented as mean (SD) for continuous measures, and n (%) for categorical measures.
 

{com}. restore
{txt}
{com}.                  
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/logs/descriptive_tables_allpts.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 1 Apr 2022, 16:34:38
{txt}{.-}
{smcl}
{txt}{sf}{ul off}