-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/descriptive_tables_allpts.log
  log type:  text
 opened on:   7 Apr 2022, 09:53:40

. 
. **Set Ado file path
. adopath + "$projectdir/analysis/extra_ados"
  [1]  (BASE)      "/usr/local/stata/ado/base/"
  [2]  (SITE)      "/usr/local/ado/"
  [3]              "."
  [4]  (PERSONAL)  "~/ado/personal/"
  [5]  (PLUS)      "~/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "/workspace/analysis/extra_ados"

. 
. **Use cleaned data from previous step
. use "$projectdir/output/data/file_eia_allpts.dta", clear

. 
. /*Tables=====================================================================
> ================*/
. *Baseline table
. preserve

. table1_mc, onecol missing nospacelowpercent iqrmiddle(",")  ///
>         vars(age contn %3.0f \ ///
>                  agegroup cat %5.1f \ ///
>                  male bin %5.1f \ ///
>                  ethnicity cat %5.1f \ ///
>                  imd cat %5.1f \ ///
>                  bmicat cat %5.1f \ ///
>                  smoke cat %5.1f \ ///
>                  hypertension bin %5.1f \ ///
>                  diabetes bin %5.1f \ ///
>                  hba1ccatmm cat %5.1f \ ///
>                  chronic_cardiac_disease bin %5.1f \ /// 
>                  stroke bin %5.1f \ ///
>                  cancer bin %5.1f \ ///
>                  chronic_resp_disease bin  %5.1f \ ///
>                  chronic_liver_disease bin %5.1f \ ///
>                  ckd cat %5.1f \ ///
>                  egfr_cat_nomiss cat %5.1f \ ///
>                  esrf bin %5.1f \ ///
>                  ) clear

  +----------------------------------------------+
  | factor                             N_1   m_1 |
  |----------------------------------------------|
  | Age                             78,742     0 |
  |----------------------------------------------|
  | Age group                       78,742     0 |
  |----------------------------------------------|
  | Male                            78,742     0 |
  |----------------------------------------------|
  | Ethnicity                       78,742     0 |
  |----------------------------------------------|
  | Index of multiple deprivation   78,742     0 |
  |----------------------------------------------|
  | BMI                             78,742     0 |
  |----------------------------------------------|
  | Smoking status                  78,742     0 |
  |----------------------------------------------|
  | Hypertension                    78,742     0 |
  |----------------------------------------------|
  | Diabetes                        78,742     0 |
  |----------------------------------------------|
  | HbA1c                           78,742     0 |
  |----------------------------------------------|
  | Chronic cardiac disease         78,742     0 |
  |----------------------------------------------|
  | Stroke                          78,742     0 |
  |----------------------------------------------|
  | Cancer                          78,742     0 |
  |----------------------------------------------|
  | Chronic respiratory disease     78,742     0 |
  |----------------------------------------------|
  | Chronic liver disease           78,742     0 |
  |----------------------------------------------|
  | Chronic kidney disease          78,742     0 |
  |----------------------------------------------|
  | eGFR                            78,742     0 |
  |----------------------------------------------|
  | End-stage renal failure         78,742     0 |
  +----------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +------------------------------------------------+
  |                                 Total          |
  |------------------------------------------------|
  |                                 N=78,742       |
  |------------------------------------------------|
  | Age                             49 (19)        |
  |------------------------------------------------|
  | Age group                                      |
  |    18-39                        28,367 (36.0%) |
  |    40-49                        13,041 (16.6%) |
  |    50-59                        13,567 (17.2%) |
  |    60-69                        10,483 (13.3%) |
  |    70-79                        8,304 (10.5%)  |
  |    80+                          4,980 (6.3%)   |
  |------------------------------------------------|
  | Male                            38,441 (48.8%) |
  |------------------------------------------------|
  | Ethnicity                                      |
  |    White                        29,437 (37.4%) |
  |    Asian/Asian British          5,932 (7.5%)   |
  |    Black                        5,883 (7.5%)   |
  |    Mixed/Other                  17,769 (22.6%) |
  |                                 19,721 (25.0%) |
  |------------------------------------------------|
  | Index of multiple deprivation                  |
  |    1 least deprived             54,848 (69.7%) |
  |    4                            15,828 (20.1%) |
  |    5 most deprived              8,066 (10.2%)  |
  |------------------------------------------------|
  | BMI                                            |
  |    Underweight (<18.5)          171 (0.2%)     |
  |    Normal (18.5-24.9)           384 (0.5%)     |
  |    Overweight (25-29.9)         535 (0.7%)     |
  |    Obese I (30-34.9)            689 (0.9%)     |
  |    Obese II (35-39.9)           740 (0.9%)     |
  |    Obese III (40+)              1,134 (1.4%)   |
  |                                 75,089 (95.4%) |
  |------------------------------------------------|
  | Smoking status                                 |
  |    Never                        7,905 (10.0%)  |
  |    Former                       3,931 (5.0%)   |
  |    Current                      23,572 (29.9%) |
  |                                 43,334 (55.0%) |
  |------------------------------------------------|
  | Hypertension                    15,735 (20.0%) |
  |------------------------------------------------|
  | Diabetes                        15,640 (19.9%) |
  |------------------------------------------------|
  | HbA1c                                          |
  |    HbA1c <58mmol/mol            2,133 (2.7%)   |
  |    HbA1c >=58mmol/mol           367 (0.5%)     |
  |                                 76,242 (96.8%) |
  |------------------------------------------------|
  | Chronic cardiac disease         15,798 (20.1%) |
  |------------------------------------------------|
  | Stroke                          15,737 (20.0%) |
  |------------------------------------------------|
  | Cancer                          38,512 (48.9%) |
  |------------------------------------------------|
  | Chronic respiratory disease     15,695 (19.9%) |
  |------------------------------------------------|
  | Chronic liver disease           15,784 (20.0%) |
  |------------------------------------------------|
  | Chronic kidney disease                         |
  |    No CKD                       35,195 (44.7%) |
  |    CKD                          43,547 (55.3%) |
  |------------------------------------------------|
  | eGFR                                           |
  |    >=60/missing                 44,013 (55.9%) |
  |    30-59                        20,836 (26.5%) |
  |    <30                          13,893 (17.6%) |
  |------------------------------------------------|
  | End-stage renal failure         15,728 (20.0%) |
  +------------------------------------------------+
Data are presented as mean (SD) for continuous measures, and n (%) for categori
> cal measures.
 

. restore

.                  
. log close
      name:  <unnamed>
       log:  /workspace/logs/descriptive_tables_allpts.log
  log type:  text
 closed on:   7 Apr 2022, 09:53:43
-------------------------------------------------------------------------------
