-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/logs/descriptive_tables.log
  log type:  text
 opened on:  13 Apr 2022, 16:54:49

. 
. **Set Ado file path
. adopath + "$projectdir/analysis/extra_ados"
  [1]  (BASE)      "C:\Program Files\Stata17\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata17\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "C:\Users\k1754142\ado\personal/"
  [5]  (PLUS)      "C:\Users\k1754142\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/analysis/extra_ados"

. 
. **Use cleaned data from previous step
. use "$projectdir/output/data/file_eia_all.dta", clear

. 
. **Set index dates ===========================================================*/
. global year_preceding = "01/03/2018"

. global start_date = "01/03/2019"

. global outpatient_date = "01/10/2019"

. global fup_6m_date = "01/09/2021"

. global end_date = "01/03/2022"

. 
. *Descriptive statistics======================================================================*/
. 
. **All patients with eia code in window after 1st March 2019 and before 1st March 2022
. tab eia_code

   eia_code |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     35,539      100.00      100.00
------------+-----------------------------------
      Total |     35,539      100.00

. codebook eia_code_date

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
eia_code_date                                                                                                                                                                                                       (unlabeled)
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

                  Type: Numeric daily date (float)

                 Range: [21609,22705]                 Units: 1
       Or equivalently: [01mar2019,01mar2022]         Units: days
         Unique values: 1,097                     Missing .: 0/35,539

                  Mean: 22157.6 = 30aug2020(+ 13 hours)
             Std. dev.:   316.5
           Percentiles:       10%        25%        50%        75%        90%
                            21719      21885      22157      22430      22597
                        19jun2019  02dec2019  30aug2020  30may2021  13nov2021

. 
. **EIA sub-diagnosis (most recent code)
. tab eia_diagnosis, missing

eia_diagnos |
         is |      Freq.     Percent        Cum.
------------+-----------------------------------
         RA |     11,794       33.19       33.19
        PsA |     11,727       33.00       66.18
      AxSpA |     12,018       33.82      100.00
------------+-----------------------------------
      Total |     35,539      100.00

. 
. **Demographics
. tab agegroup, missing

  Age group |      Freq.     Percent        Cum.
------------+-----------------------------------
      18-39 |     12,932       36.39       36.39
      40-49 |      5,702       16.04       52.43
      50-59 |      6,086       17.12       69.56
      60-69 |      4,779       13.45       83.00
      70-79 |      3,771       10.61       93.62
        80+ |      2,269        6.38      100.00
------------+-----------------------------------
      Total |     35,539      100.00

. tab male, missing

       Male |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |     18,171       51.13       51.13
        Yes |     17,368       48.87      100.00
------------+-----------------------------------
      Total |     35,539      100.00

. tab ethnicity, missing

          Ethnicity |      Freq.     Percent        Cum.
--------------------+-----------------------------------
              White |     13,393       37.69       37.69
Asian/Asian British |      2,627        7.39       45.08
              Black |      2,626        7.39       52.47
        Mixed/Other |      7,944       22.35       74.82
          Not known |      8,949       25.18      100.00
--------------------+-----------------------------------
              Total |     35,539      100.00

. tab imd, missing

        Index of |
        multiple |
     deprivation |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |      6,759       19.02       19.02
               2 |      6,649       18.71       37.73
               3 |      6,743       18.97       56.70
               4 |      6,812       19.17       75.87
 5 most deprived |      6,762       19.03       94.90
       Not known |      1,814        5.10      100.00
-----------------+-----------------------------------
           Total |     35,539      100.00

. tab region, missing

                  region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
           East Midlands |      3,549        9.99        9.99
         East of England |      3,441        9.68       19.67
                  London |      7,091       19.95       39.62
              North East |      3,423        9.63       49.25
              North West |      3,528        9.93       59.18
               Not known |        342        0.96       60.14
              South East |      7,083       19.93       80.07
           West Midlands |      3,660       10.30       90.37
Yorkshire and the Humber |      3,422        9.63      100.00
-------------------------+-----------------------------------
                   Total |     35,539      100.00

. 
. **Comorbidities
. tab smoke, missing

    Smoking |
     status |      Freq.     Percent        Cum.
------------+-----------------------------------
      Never |      3,573       10.05       10.05
     Former |      1,721        4.84       14.90
    Current |     10,874       30.60       45.49
  Not known |     19,371       54.51      100.00
------------+-----------------------------------
      Total |     35,539      100.00

. tabstat bmi_value, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
   bmi_value |      1951  34.86145  34.68891  28.24333  41.29651
----------------------------------------------------------------

. tab bmicat, missing

                 BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |         86        0.24        0.24
  Normal (18.5-24.9) |        214        0.60        0.84
Overweight (25-29.9) |        311        0.88        1.72
   Obese I (30-34.9) |        383        1.08        2.80
  Obese II (35-39.9) |        404        1.14        3.93
     Obese III (40+) |        553        1.56        5.49
           Not known |     33,588       94.51      100.00
---------------------+-----------------------------------
               Total |     35,539      100.00

. tabstat creatinine_value, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
creatinin~ue |     26625   137.562  128.0179  78.18311  185.3314
----------------------------------------------------------------

. tabstat egfr, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
        egfr |     26625  61.82486  49.19413  30.71862  87.65826
----------------------------------------------------------------

. tab egfr_cat, missing

       eGFR |      Freq.     Percent        Cum.
------------+-----------------------------------
       >=60 |     10,703       30.12       30.12
      30-59 |      9,581       26.96       57.08
        <30 |      6,341       17.84       74.92
  Not known |      8,914       25.08      100.00
------------+-----------------------------------
      Total |     35,539      100.00

. tab egfr_cat_nomiss, missing

          eGFR |      Freq.     Percent        Cum.
---------------+-----------------------------------
>=60/not known |     19,617       55.20       55.20
         30-59 |      9,581       26.96       82.16
           <30 |      6,341       17.84      100.00
---------------+-----------------------------------
         Total |     35,539      100.00

. tab esrf, missing

  End-stage |
      renal |
    failure |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     28,378       79.85       79.85
          1 |      7,161       20.15      100.00
------------+-----------------------------------
      Total |     35,539      100.00

. tab ckd, missing //combination of creatinine and esrf codes

    Chronic |
     kidney |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
     No CKD |     15,626       43.97       43.97
        CKD |     19,913       56.03      100.00
------------+-----------------------------------
      Total |     35,539      100.00

. tab diabetes, missing 

   Diabetes |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     28,462       80.09       80.09
          1 |      7,077       19.91      100.00
------------+-----------------------------------
      Total |     35,539      100.00

. tabstat hba1c_percentage, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
hba1c_per~ge |       908  5.179401  5.136863  3.764966  6.497193
----------------------------------------------------------------

. tabstat hba1c_mmol_per_mol, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
hba1c_mmol~l |       932  43.26899  42.17334  30.43942  54.61879
----------------------------------------------------------------

. tabstat hba1c_pct, stats (n mean p50 p25 p75) //with conversion of mmol values

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
   hba1c_pct |      1824   5.65614       5.6       4.4       6.9
----------------------------------------------------------------

. tab hba1ccat, missing

   hba1ccat |      Freq.     Percent        Cum.
------------+-----------------------------------
      <6.5% |      1,219        3.43        3.43
  >=6.5-7.4 |        325        0.91        4.34
  >=7.5-7.9 |         85        0.24        4.58
    >=8-8.9 |        132        0.37        4.96
        >=9 |         63        0.18        5.13
          . |     33,715       94.87      100.00
------------+-----------------------------------
      Total |     35,539      100.00

. tabstat hba1c_mmol, stats (n mean p50 p25 p75) //with conversion of % values

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
  hba1c_mmol |      1824  38.31305  37.97405   24.2125  51.38633
----------------------------------------------------------------

. tab hba1ccatmm, missing

             HbA1c |      Freq.     Percent        Cum.
-------------------+-----------------------------------
 HbA1c <58mmol/mol |      1,544        4.34        4.34
HbA1c >=58mmol/mol |        280        0.79        5.13
         Not known |     33,715       94.87      100.00
-------------------+-----------------------------------
             Total |     35,539      100.00

. tab diabcatm, missing //on basis of converted %

                       Diabetes |      Freq.     Percent        Cum.
--------------------------------+-----------------------------------
                    No diabetes |     28,462       80.09       80.09
Diabetes with HbA1c <58mmol/mol |        314        0.88       80.97
Diabetes with HbA1c >58mmol/mol |         53        0.15       81.12
 Diabetes with no HbA1c measure |      6,710       18.88      100.00
--------------------------------+-----------------------------------
                          Total |     35,539      100.00

. tab cancer, missing //lung, haem or other cancer

     Cancer |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     18,120       50.99       50.99
          1 |     17,419       49.01      100.00
------------+-----------------------------------
      Total |     35,539      100.00

. tab hypertension, missing

Hypertensio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     28,426       79.99       79.99
          1 |      7,113       20.01      100.00
------------+-----------------------------------
      Total |     35,539      100.00

. tab stroke, missing

     Stroke |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     28,435       80.01       80.01
          1 |      7,104       19.99      100.00
------------+-----------------------------------
      Total |     35,539      100.00

. tab chronic_resp_disease, missing

    Chronic |
respiratory |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     28,452       80.06       80.06
          1 |      7,087       19.94      100.00
------------+-----------------------------------
      Total |     35,539      100.00

. tab copd, missing

       COPD |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     28,485       80.15       80.15
          1 |      7,054       19.85      100.00
------------+-----------------------------------
      Total |     35,539      100.00

. tab chronic_liver_disease, missing

    Chronic |
      liver |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     28,418       79.96       79.96
          1 |      7,121       20.04      100.00
------------+-----------------------------------
      Total |     35,539      100.00

. tab chronic_cardiac_disease, missing

    Chronic |
    cardiac |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     28,499       80.19       80.19
          1 |      7,040       19.81      100.00
------------+-----------------------------------
      Total |     35,539      100.00

. 
. /*Tables=====================================================================================*/
. *Baseline table by eia diagnosis
. table1_mc, by(eia_diagnosis) total(before) onecol missing nospacelowpercent iqrmiddle(",")  ///
>         vars(agegroup cat %5.1f \ ///
>                  male bin %5.1f \ ///
>                  ethnicity cat %5.1f \ ///
>                  imd cat %5.1f \ ///
>                  bmicat cat %5.1f \ ///
>                  smoke cat %5.1f \ ///
>                  hypertension bin %5.1f \ ///
>                  diabcatm cat %5.1f \ ///
>                  chronic_cardiac_disease bin %5.1f \ /// 
>                  stroke bin %5.1f \ ///
>                  cancer bin %5.1f \ ///
>                  chronic_resp_disease bin  %5.1f \ ///
>                  chronic_liver_disease bin %5.1f \ ///
>                  ckd cat %5.1f \ ///
>                  egfr_cat_nomiss cat %5.1f \ ///
>                  )

  +-------------------------------------------------------------------------------------------+
  | factor                             N_T      N_1      N_2      N_3   m_T   m_1   m_2   m_3 |
  |-------------------------------------------------------------------------------------------|
  | Age group                       35,539   11,794   11,727   12,018     0     0     0     0 |
  |-------------------------------------------------------------------------------------------|
  | Male                            35,539   11,794   11,727   12,018     0     0     0     0 |
  |-------------------------------------------------------------------------------------------|
  | Ethnicity                       35,539   11,794   11,727   12,018     0     0     0     0 |
  |-------------------------------------------------------------------------------------------|
  | Index of multiple deprivation   35,539   11,794   11,727   12,018     0     0     0     0 |
  |-------------------------------------------------------------------------------------------|
  | BMI                             35,539   11,794   11,727   12,018     0     0     0     0 |
  |-------------------------------------------------------------------------------------------|
  | Smoking status                  35,539   11,794   11,727   12,018     0     0     0     0 |
  |-------------------------------------------------------------------------------------------|
  | Hypertension                    35,539   11,794   11,727   12,018     0     0     0     0 |
  |-------------------------------------------------------------------------------------------|
  | Diabetes                        35,539   11,794   11,727   12,018     0     0     0     0 |
  |-------------------------------------------------------------------------------------------|
  | Chronic cardiac disease         35,539   11,794   11,727   12,018     0     0     0     0 |
  |-------------------------------------------------------------------------------------------|
  | Stroke                          35,539   11,794   11,727   12,018     0     0     0     0 |
  |-------------------------------------------------------------------------------------------|
  | Cancer                          35,539   11,794   11,727   12,018     0     0     0     0 |
  |-------------------------------------------------------------------------------------------|
  | Chronic respiratory disease     35,539   11,794   11,727   12,018     0     0     0     0 |
  |-------------------------------------------------------------------------------------------|
  | Chronic liver disease           35,539   11,794   11,727   12,018     0     0     0     0 |
  |-------------------------------------------------------------------------------------------|
  | Chronic kidney disease          35,539   11,794   11,727   12,018     0     0     0     0 |
  |-------------------------------------------------------------------------------------------|
  | eGFR                            35,539   11,794   11,727   12,018     0     0     0     0 |
  +-------------------------------------------------------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +------------------------------------------------------------------------------------------------------------------+
  |                                      Total            RA               PsA              AxSpA            p-value |
  |------------------------------------------------------------------------------------------------------------------|
  |                                      N=35,539         N=11,794         N=11,727         N=12,018                 |
  |------------------------------------------------------------------------------------------------------------------|
  | Age group                                                                                                 0.12   |
  |    18-39                             12,932 (36.4%)   4,328 (36.7%)    4,347 (37.1%)    4,257 (35.4%)            |
  |    40-49                             5,702 (16.0%)    1,876 (15.9%)    1,875 (16.0%)    1,951 (16.2%)            |
  |    50-59                             6,086 (17.1%)    2,039 (17.3%)    1,979 (16.9%)    2,068 (17.2%)            |
  |    60-69                             4,779 (13.4%)    1,585 (13.4%)    1,577 (13.4%)    1,617 (13.5%)            |
  |    70-79                             3,771 (10.6%)    1,238 (10.5%)    1,181 (10.1%)    1,352 (11.2%)            |
  |    80+                               2,269 (6.4%)     728 (6.2%)       768 (6.5%)       773 (6.4%)               |
  |------------------------------------------------------------------------------------------------------------------|
  | Male                                 17,368 (48.9%)   5,822 (49.4%)    5,726 (48.8%)    5,820 (48.4%)     0.35   |
  |------------------------------------------------------------------------------------------------------------------|
  | Ethnicity                                                                                                 0.69   |
  |    White                             13,393 (37.7%)   4,423 (37.5%)    4,468 (38.1%)    4,502 (37.5%)            |
  |    Asian/Asian British               2,627 (7.4%)     859 (7.3%)       855 (7.3%)       913 (7.6%)               |
  |    Black                             2,626 (7.4%)     880 (7.5%)       859 (7.3%)       887 (7.4%)               |
  |    Mixed/Other                       7,944 (22.4%)    2,698 (22.9%)    2,607 (22.2%)    2,639 (22.0%)            |
  |                                      8,949 (25.2%)    2,934 (24.9%)    2,938 (25.1%)    3,077 (25.6%)            |
  |------------------------------------------------------------------------------------------------------------------|
  | Index of multiple deprivation                                                                             0.22   |
  |    1 least deprived                  6,759 (19.0%)    2,266 (19.2%)    2,178 (18.6%)    2,315 (19.3%)            |
  |    2                                 6,649 (18.7%)    2,277 (19.3%)    2,188 (18.7%)    2,184 (18.2%)            |
  |    3                                 6,743 (19.0%)    2,271 (19.3%)    2,248 (19.2%)    2,224 (18.5%)            |
  |    4                                 6,812 (19.2%)    2,227 (18.9%)    2,269 (19.3%)    2,316 (19.3%)            |
  |    5 most deprived                   6,762 (19.0%)    2,195 (18.6%)    2,233 (19.0%)    2,334 (19.4%)            |
  |                                      1,814 (5.1%)     558 (4.7%)       611 (5.2%)       645 (5.4%)               |
  |------------------------------------------------------------------------------------------------------------------|
  | BMI                                                                                                      <0.001  |
  |    Underweight (<18.5)               86 (0.2%)        33 (0.3%)        38 (0.3%)        15 (0.1%)                |
  |    Normal (18.5-24.9)                214 (0.6%)       80 (0.7%)        61 (0.5%)        73 (0.6%)                |
  |    Overweight (25-29.9)              311 (0.9%)       110 (0.9%)       108 (0.9%)       93 (0.8%)                |
  |    Obese I (30-34.9)                 383 (1.1%)       126 (1.1%)       144 (1.2%)       113 (0.9%)               |
  |    Obese II (35-39.9)                404 (1.1%)       122 (1.0%)       153 (1.3%)       129 (1.1%)               |
  |    Obese III (40+)                   553 (1.6%)       187 (1.6%)       152 (1.3%)       214 (1.8%)               |
  |                                      33,588 (94.5%)   11,136 (94.4%)   11,071 (94.4%)   11,381 (94.7%)           |
  |------------------------------------------------------------------------------------------------------------------|
  | Smoking status                                                                                            0.73   |
  |    Never                             3,573 (10.1%)    1,213 (10.3%)    1,183 (10.1%)    1,177 (9.8%)             |
  |    Former                            1,721 (4.8%)     558 (4.7%)       579 (4.9%)       584 (4.9%)               |
  |    Current                           10,874 (30.6%)   3,621 (30.7%)    3,564 (30.4%)    3,689 (30.7%)            |
  |                                      19,371 (54.5%)   6,402 (54.3%)    6,401 (54.6%)    6,568 (54.7%)            |
  |------------------------------------------------------------------------------------------------------------------|
  | Hypertension                         7,113 (20.0%)    2,314 (19.6%)    2,402 (20.5%)    2,397 (19.9%)     0.25   |
  |------------------------------------------------------------------------------------------------------------------|
  | Diabetes                                                                                                  0.65   |
  |    No diabetes                       28,462 (80.1%)   9,449 (80.1%)    9,427 (80.4%)    9,586 (79.8%)            |
  |    Diabetes with HbA1c <58mmol/mol   314 (0.9%)       108 (0.9%)       100 (0.9%)       106 (0.9%)               |
  |    Diabetes with HbA1c >58mmol/mol   53 (0.1%)        13 (0.1%)        22 (0.2%)        18 (0.1%)                |
  |    Diabetes with no HbA1c measure    6,710 (18.9%)    2,224 (18.9%)    2,178 (18.6%)    2,308 (19.2%)            |
  |------------------------------------------------------------------------------------------------------------------|
  | Chronic cardiac disease              7,040 (19.8%)    2,337 (19.8%)    2,312 (19.7%)    2,391 (19.9%)     0.94   |
  |------------------------------------------------------------------------------------------------------------------|
  | Stroke                               7,104 (20.0%)    2,284 (19.4%)    2,372 (20.2%)    2,448 (20.4%)     0.11   |
  |------------------------------------------------------------------------------------------------------------------|
  | Cancer                               17,419 (49.0%)   5,827 (49.4%)    5,714 (48.7%)    5,878 (48.9%)     0.56   |
  |------------------------------------------------------------------------------------------------------------------|
  | Chronic respiratory disease          7,087 (19.9%)    2,407 (20.4%)    2,341 (20.0%)    2,339 (19.5%)     0.19   |
  |------------------------------------------------------------------------------------------------------------------|
  | Chronic liver disease                7,121 (20.0%)    2,351 (19.9%)    2,388 (20.4%)    2,382 (19.8%)     0.55   |
  |------------------------------------------------------------------------------------------------------------------|
  | Chronic kidney disease                                                                                    0.37   |
  |    No CKD                            15,626 (44.0%)   5,219 (44.3%)    5,185 (44.2%)    5,222 (43.5%)            |
  |    CKD                               19,913 (56.0%)   6,575 (55.7%)    6,542 (55.8%)    6,796 (56.5%)            |
  |------------------------------------------------------------------------------------------------------------------|
  | eGFR                                                                                                      0.47   |
  |    >=60/not known                    19,617 (55.2%)   6,543 (55.5%)    6,505 (55.5%)    6,569 (54.7%)            |
  |    30-59                             9,581 (27.0%)    3,184 (27.0%)    3,109 (26.5%)    3,288 (27.4%)            |
  |    <30                               6,341 (17.8%)    2,067 (17.5%)    2,113 (18.0%)    2,161 (18.0%)            |
  +------------------------------------------------------------------------------------------------------------------+
Data are presented as n (%).
 

. 
. *Baseline table by year of diagnosis
. table1_mc, by(diagnosis_year) total(before) onecol missing nospacelowpercent iqrmiddle(",")  ///
>         vars(agegroup cat %5.1f \ ///
>                  male bin %5.1f \ ///
>                  ethnicity cat %5.1f \ ///
>                  imd cat %5.1f \ ///
>                  bmicat cat %5.1f \ ///
>                  smoke cat %5.1f \ ///
>                  hypertension bin %5.1f \ ///
>                  diabcatm cat %5.1f \ ///
>                  chronic_cardiac_disease bin %5.1f \ /// 
>                  stroke bin %5.1f \ ///
>                  cancer bin %5.1f \ ///
>                  chronic_resp_disease bin  %5.1f \ ///
>                  chronic_liver_disease bin %5.1f \ ///
>                  ckd cat %5.1f \ ///
>                  egfr_cat_nomiss cat %5.1f \ ///
>                  )

  +-------------------------------------------------------------------------------------------+
  | factor                             N_T      N_1      N_2      N_3   m_T   m_1   m_2   m_3 |
  |-------------------------------------------------------------------------------------------|
  | Age group                       35,539   11,816   11,854   11,869     0     0     0     0 |
  |-------------------------------------------------------------------------------------------|
  | Male                            35,539   11,816   11,854   11,869     0     0     0     0 |
  |-------------------------------------------------------------------------------------------|
  | Ethnicity                       35,539   11,816   11,854   11,869     0     0     0     0 |
  |-------------------------------------------------------------------------------------------|
  | Index of multiple deprivation   35,539   11,816   11,854   11,869     0     0     0     0 |
  |-------------------------------------------------------------------------------------------|
  | BMI                             35,539   11,816   11,854   11,869     0     0     0     0 |
  |-------------------------------------------------------------------------------------------|
  | Smoking status                  35,539   11,816   11,854   11,869     0     0     0     0 |
  |-------------------------------------------------------------------------------------------|
  | Hypertension                    35,539   11,816   11,854   11,869     0     0     0     0 |
  |-------------------------------------------------------------------------------------------|
  | Diabetes                        35,539   11,816   11,854   11,869     0     0     0     0 |
  |-------------------------------------------------------------------------------------------|
  | Chronic cardiac disease         35,539   11,816   11,854   11,869     0     0     0     0 |
  |-------------------------------------------------------------------------------------------|
  | Stroke                          35,539   11,816   11,854   11,869     0     0     0     0 |
  |-------------------------------------------------------------------------------------------|
  | Cancer                          35,539   11,816   11,854   11,869     0     0     0     0 |
  |-------------------------------------------------------------------------------------------|
  | Chronic respiratory disease     35,539   11,816   11,854   11,869     0     0     0     0 |
  |-------------------------------------------------------------------------------------------|
  | Chronic liver disease           35,539   11,816   11,854   11,869     0     0     0     0 |
  |-------------------------------------------------------------------------------------------|
  | Chronic kidney disease          35,539   11,816   11,854   11,869     0     0     0     0 |
  |-------------------------------------------------------------------------------------------|
  | eGFR                            35,539   11,816   11,854   11,869     0     0     0     0 |
  +-------------------------------------------------------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +---------------------------------------------------------------------------------------------------------------------------------------+
  |                                      Total            March 2019-March 2020   March 2020-March 2021   March 2021-March 2022   p-value |
  |---------------------------------------------------------------------------------------------------------------------------------------|
  |                                      N=35,539         N=11,816                N=11,854                N=11,869                        |
  |---------------------------------------------------------------------------------------------------------------------------------------|
  | Age group                                                                                                                      0.23   |
  |    18-39                             12,932 (36.4%)   4,328 (36.6%)           4,272 (36.0%)           4,332 (36.5%)                   |
  |    40-49                             5,702 (16.0%)    1,902 (16.1%)           1,851 (15.6%)           1,949 (16.4%)                   |
  |    50-59                             6,086 (17.1%)    2,035 (17.2%)           2,010 (17.0%)           2,041 (17.2%)                   |
  |    60-69                             4,779 (13.4%)    1,560 (13.2%)           1,646 (13.9%)           1,573 (13.3%)                   |
  |    70-79                             3,771 (10.6%)    1,220 (10.3%)           1,283 (10.8%)           1,268 (10.7%)                   |
  |    80+                               2,269 (6.4%)     771 (6.5%)              792 (6.7%)              706 (5.9%)                      |
  |---------------------------------------------------------------------------------------------------------------------------------------|
  | Male                                 17,368 (48.9%)   5,795 (49.0%)           5,765 (48.6%)           5,808 (48.9%)            0.81   |
  |---------------------------------------------------------------------------------------------------------------------------------------|
  | Ethnicity                                                                                                                      0.84   |
  |    White                             13,393 (37.7%)   4,431 (37.5%)           4,498 (37.9%)           4,464 (37.6%)                   |
  |    Asian/Asian British               2,627 (7.4%)     889 (7.5%)              865 (7.3%)              873 (7.4%)                      |
  |    Black                             2,626 (7.4%)     907 (7.7%)              852 (7.2%)              867 (7.3%)                      |
  |    Mixed/Other                       7,944 (22.4%)    2,640 (22.3%)           2,656 (22.4%)           2,648 (22.3%)                   |
  |                                      8,949 (25.2%)    2,949 (25.0%)           2,983 (25.2%)           3,017 (25.4%)                   |
  |---------------------------------------------------------------------------------------------------------------------------------------|
  | Index of multiple deprivation                                                                                                  0.19   |
  |    1 least deprived                  6,759 (19.0%)    2,237 (18.9%)           2,204 (18.6%)           2,318 (19.5%)                   |
  |    2                                 6,649 (18.7%)    2,273 (19.2%)           2,182 (18.4%)           2,194 (18.5%)                   |
  |    3                                 6,743 (19.0%)    2,203 (18.6%)           2,271 (19.2%)           2,269 (19.1%)                   |
  |    4                                 6,812 (19.2%)    2,279 (19.3%)           2,314 (19.5%)           2,219 (18.7%)                   |
  |    5 most deprived                   6,762 (19.0%)    2,186 (18.5%)           2,287 (19.3%)           2,289 (19.3%)                   |
  |                                      1,814 (5.1%)     638 (5.4%)              596 (5.0%)              580 (4.9%)                      |
  |---------------------------------------------------------------------------------------------------------------------------------------|
  | BMI                                                                                                                            0.16   |
  |    Underweight (<18.5)               86 (0.2%)        30 (0.3%)               35 (0.3%)               21 (0.2%)                       |
  |    Normal (18.5-24.9)                214 (0.6%)       87 (0.7%)               68 (0.6%)               59 (0.5%)                       |
  |    Overweight (25-29.9)              311 (0.9%)       127 (1.1%)              110 (0.9%)              74 (0.6%)                       |
  |    Obese I (30-34.9)                 383 (1.1%)       158 (1.3%)              127 (1.1%)              98 (0.8%)                       |
  |    Obese II (35-39.9)                404 (1.1%)       135 (1.1%)              138 (1.2%)              131 (1.1%)                      |
  |    Obese III (40+)                   553 (1.6%)       224 (1.9%)              195 (1.6%)              134 (1.1%)                      |
  |                                      33,588 (94.5%)   11,055 (93.6%)          11,181 (94.3%)          11,352 (95.6%)                  |
  |---------------------------------------------------------------------------------------------------------------------------------------|
  | Smoking status                                                                                                                 0.14   |
  |    Never                             3,573 (10.1%)    1,254 (10.6%)           1,152 (9.7%)            1,167 (9.8%)                    |
  |    Former                            1,721 (4.8%)     554 (4.7%)              593 (5.0%)              574 (4.8%)                      |
  |    Current                           10,874 (30.6%)   3,596 (30.4%)           3,684 (31.1%)           3,594 (30.3%)                   |
  |                                      19,371 (54.5%)   6,412 (54.3%)           6,425 (54.2%)           6,534 (55.1%)                   |
  |---------------------------------------------------------------------------------------------------------------------------------------|
  | Hypertension                         7,113 (20.0%)    2,363 (20.0%)           2,351 (19.8%)           2,399 (20.2%)            0.76   |
  |---------------------------------------------------------------------------------------------------------------------------------------|
  | Diabetes                                                                                                                      <0.001  |
  |    No diabetes                       28,462 (80.1%)   9,449 (80.0%)           9,517 (80.3%)           9,496 (80.0%)                   |
  |    Diabetes with HbA1c <58mmol/mol   314 (0.9%)       143 (1.2%)              103 (0.9%)              68 (0.6%)                       |
  |    Diabetes with HbA1c >58mmol/mol   53 (0.1%)        27 (0.2%)               20 (0.2%)               6 (0.1%)                        |
  |    Diabetes with no HbA1c measure    6,710 (18.9%)    2,197 (18.6%)           2,214 (18.7%)           2,299 (19.4%)                   |
  |---------------------------------------------------------------------------------------------------------------------------------------|
  | Chronic cardiac disease              7,040 (19.8%)    2,260 (19.1%)           2,399 (20.2%)           2,381 (20.1%)            0.070  |
  |---------------------------------------------------------------------------------------------------------------------------------------|
  | Stroke                               7,104 (20.0%)    2,379 (20.1%)           2,367 (20.0%)           2,358 (19.9%)            0.87   |
  |---------------------------------------------------------------------------------------------------------------------------------------|
  | Cancer                               17,419 (49.0%)   5,748 (48.6%)           5,821 (49.1%)           5,850 (49.3%)            0.60   |
  |---------------------------------------------------------------------------------------------------------------------------------------|
  | Chronic respiratory disease          7,087 (19.9%)    2,367 (20.0%)           2,361 (19.9%)           2,359 (19.9%)            0.95   |
  |---------------------------------------------------------------------------------------------------------------------------------------|
  | Chronic liver disease                7,121 (20.0%)    2,396 (20.3%)           2,371 (20.0%)           2,354 (19.8%)            0.69   |
  |---------------------------------------------------------------------------------------------------------------------------------------|
  | Chronic kidney disease                                                                                                         0.91   |
  |    No CKD                            15,626 (44.0%)   5,200 (44.0%)           5,194 (43.8%)           5,232 (44.1%)                   |
  |    CKD                               19,913 (56.0%)   6,616 (56.0%)           6,660 (56.2%)           6,637 (55.9%)                   |
  |---------------------------------------------------------------------------------------------------------------------------------------|
  | eGFR                                                                                                                           0.67   |
  |    >=60/not known                    19,617 (55.2%)   6,530 (55.3%)           6,541 (55.2%)           6,546 (55.2%)                   |
  |    30-59                             9,581 (27.0%)    3,152 (26.7%)           3,182 (26.8%)           3,247 (27.4%)                   |
  |    <30                               6,341 (17.8%)    2,134 (18.1%)           2,131 (18.0%)           2,076 (17.5%)                   |
  +---------------------------------------------------------------------------------------------------------------------------------------+
Data are presented as n (%).
 

. 
. *Medications pre-time windows=====================================================================================*/
. 
. **Proportion with a csDMARD shared care prescription at any point after diagnosis (unequal follow-up); patients excluded if csDMARD or biologic was >60 days before rheumatology appt date (if present)
. tab csdmard, missing

    csdmard |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     22,757       64.03       64.03
          1 |     12,782       35.97      100.00
------------+-----------------------------------
      Total |     35,539      100.00

. bys eia_diagnosis: tab csdmard

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

    csdmard |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,510       63.68       63.68
          1 |      4,284       36.32      100.00
------------+-----------------------------------
      Total |     11,794      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    csdmard |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,466       63.67       63.67
          1 |      4,261       36.33      100.00
------------+-----------------------------------
      Total |     11,727      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    csdmard |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,781       64.74       64.74
          1 |      4,237       35.26      100.00
------------+-----------------------------------
      Total |     12,018      100.00


. tab csdmard_hcd, missing //including high cost MTX scripts (not shared care)

csdmard_hcd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     20,436       57.50       57.50
          1 |     15,103       42.50      100.00
------------+-----------------------------------
      Total |     35,539      100.00

. bys eia_diagnosis: tab csdmard_hcd, missing //including high cost MTX scripts (not shared care)

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

csdmard_hcd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,715       56.94       56.94
          1 |      5,079       43.06      100.00
------------+-----------------------------------
      Total |     11,794      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

csdmard_hcd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,729       57.38       57.38
          1 |      4,998       42.62      100.00
------------+-----------------------------------
      Total |     11,727      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

csdmard_hcd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,992       58.18       58.18
          1 |      5,026       41.82      100.00
------------+-----------------------------------
      Total |     12,018      100.00


. tab csdmard if rheum_appt_date!=. & csdmard_date!=. & (csdmard_date + 60)<rheum_appt_date //verify that no prescriptions were >60 days before rheumatology appt date
no observations

. 
. **Proportion with a bDMARD or tsDMARD prescription at any point after diagnosis (unequal follow-up); patients excluded if csDMARD or biologic was >60 days before rheumatology appt date (if present)
. tab biologic, missing

   biologic |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,993       25.30       25.30
          1 |     26,546       74.70      100.00
------------+-----------------------------------
      Total |     35,539      100.00

. bys eia_diagnosis: tab biologic, missing 

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

   biologic |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,937       24.90       24.90
          1 |      8,857       75.10      100.00
------------+-----------------------------------
      Total |     11,794      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

   biologic |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,984       25.45       25.45
          1 |      8,743       74.55      100.00
------------+-----------------------------------
      Total |     11,727      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

   biologic |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,072       25.56       25.56
          1 |      8,946       74.44      100.00
------------+-----------------------------------
      Total |     12,018      100.00


. tab biologic if rheum_appt_date!=. & biologic_date!=. & (biologic_date + 60)<rheum_appt_date  //verify that no prescriptions were >60 days before rheumatology appt date
no observations

. 
. **Number of EIA diagnoses in 1-year time windows
. tab diagnosis_year, missing

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |     11,816       33.25       33.25
March 2020-March 2021 |     11,854       33.35       66.60
March 2021-March 2022 |     11,869       33.40      100.00
----------------------+-----------------------------------
                Total |     35,539      100.00

. bys eia_diagnosis: tab diagnosis_year, missing

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |      3,947       33.47       33.47
March 2020-March 2021 |      3,937       33.38       66.85
March 2021-March 2022 |      3,910       33.15      100.00
----------------------+-----------------------------------
                Total |     11,794      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |      3,881       33.09       33.09
March 2020-March 2021 |      3,931       33.52       66.62
March 2021-March 2022 |      3,915       33.38      100.00
----------------------+-----------------------------------
                Total |     11,727      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

    Year of diagnosis |      Freq.     Percent        Cum.
----------------------+-----------------------------------
March 2019-March 2020 |      3,988       33.18       33.18
March 2020-March 2021 |      3,986       33.17       66.35
March 2021-March 2022 |      4,044       33.65      100.00
----------------------+-----------------------------------
                Total |     12,018      100.00


. 
. *Referral and appointment performance==============================================================================*/
. 
end of do-file

. preserve
already preserved
r(621);

. do "C:\Users\k1754142\AppData\Local\Temp\STD40bc_000000.tmp"

. keep if eia_code_date>=date("$outpatient_date", "DMY")
(6,892 observations deleted)

. 
end of do-file

. codebook eia_code

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
eia_code                                                                                                                                                                                                            (unlabeled)
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

                  Type: Numeric (float)

                 Range: [1,1]                         Units: 1
         Unique values: 1                         Missing .: 0/28,647

            Tabulation: Freq.  Value
                       28,647  1

. exit, clear
