-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/logs/itsa_models.log
  log type:  text
 opened on:  13 Apr 2022, 16:52:57

. 
. **Set Ado file path
. adopath + "$projectdir/analysis/extra_ados"
  [1]  (BASE)      "C:\Program Files\Stata17\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata17\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "C:\Users\k1754142\ado\personal/"
  [5]  (PLUS)      "C:\Users\k1754142\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/analysis/extra_ados"

. 
. **Use cleaned data from previous step
. use "$projectdir/output/data/file_eia_all.dta", clear

. 
. set scheme plotplainblind

. 
. **Set index dates ===========================================================*/
. global year_preceding = "01/03/2018"

. global start_date = "01/03/2019"

. global outpatient_date = "01/10/2019"

. global fup_6m_date = "01/09/2021"

. global end_date = "01/03/2022"

. 
. /*ITSA models for appt and referral times===========================================================================*/
. 
. **Nb. not excluding those without 6m+ follow-up for this section
. 
. **Keep those with at least 6m of GP registration prior to EIA code 
. keep if eia_code_date>=date("$outpatient_date", "DMY")
(6,892 observations deleted)

. 
end of do-file

. codebook eia_code

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
eia_code                                                                                                                                                                                                            (unlabeled)
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

                  Type: Numeric (float)

                 Range: [1,1]                         Units: 1
         Unique values: 1                         Missing .: 0/28,647

            Tabulation: Freq.  Value
                       28,647  1

. do "C:\Users\k1754142\AppData\Local\Temp\STD4564_000000.tmp"

. preserve

. keep if time_ref_rheum_appt!=. //drop those with no rheum ref and/or rheum appt
(23,302 observations deleted)

. eststo X: estpost tabstat time_ref_rheum_appt, by(mo_year_diagn_s) stat(count p50 p75 p25 mean sd) 

Summary statistics: count p50 p75 p25 mean sd
     for variables: time_ref_rheum_appt
  by categories of: mo_year_diagn_s

mo_year_diag |  e(count)     e(p50)     e(p75)     e(p25)    e(mean)      e(sd) 
-------------+------------------------------------------------------------------
     2019m10 |        89        193        314         90    209.382    146.866 
     2019m11 |       106      190.5        328         67   209.5943   155.5424 
     2019m12 |       103        181        349         96   224.0485   150.5725 
     2020m01 |       124      215.5        388       87.5   244.4194   179.5914 
     2020m02 |       103        182        337         81   224.9709   174.7401 
     2020m03 |       137        243        394        118   266.2555   185.6948 
     2020m04 |       152      197.5        342         85   224.5395   160.1644 
     2020m05 |       165        219        409        107   260.7515   193.2823 
     2020m06 |       146        181        400         80   251.1233   214.5092 
     2020m07 |       153        246        382        123   272.2157   186.6132 
     2020m08 |       165        212        394         87   259.7697   204.2837 
     2020m09 |       187        286        498        111   322.6578   237.3018 
     2020m10 |       177        244        396        109    280.209   217.9449 
     2020m11 |       169        260        464        128    321.284   237.8809 
     2020m12 |       169        231        390        104    283.142    225.239 
     2021m01 |       216        271        514      121.5   327.5833   246.8817 
     2021m02 |       189        233        408        119   292.6032   229.4629 
     2021m03 |       228        264        451        123   319.6798   256.7831 
     2021m04 |       237        281        472        146   321.7342   228.5597 
     2021m05 |       215        300        494        131   330.9953    232.256 
     2021m06 |       219        282        500        124   337.3881   270.8605 
     2021m07 |       219        311        480        126   328.8311   238.3383 
     2021m08 |       223        297        554        140   375.5561   294.3923 
     2021m09 |       233        275        523        143     357.97   276.2662 
     2021m10 |       225        274        516        129   347.5422   276.6139 
     2021m11 |       235        267        532        132   359.0596   300.7235 
     2021m12 |       274        298        559        123   379.4708   301.9391 
     2022m01 |       269        296        560        130   382.2007    305.082 
     2022m02 |       213        289        497        154   370.0892   284.9576 
     2022m03 |         5        300        486        269      376.2   257.8715 
-------------+------------------------------------------------------------------
       Total |      5345        255        454        116   313.1506   248.7185 

. esttab X using "$projectdir/output/tables/diagnostic_delay_ref_rheum_appt.csv", cells("count p50 p75 p25 mean sd") replace plain nomtitle noobs
(file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/tables/diagnostic_delay_ref_rheum_appt.csv not found)
(output written to C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/tables/diagnostic_delay_ref_rheum_appt.csv)

. collapse (p50) p50_diag_delay=time_ref_rheum_appt (p75) p75_diag_delay=time_ref_rheum_appt (p25) p25_diag_delay=time_ref_rheum_appt (mean) mean_diag_delay=time_ref_rheum_appt (sd) sd_diag_delay=time_ref_rheum_appt (count)
>  n_diag_delay=time_ref_rheum_appt, by(mo_year_diagn)

. 
. tsset mo_year_diagn

Time variable: mo_year_diagn, 2019m10 to 2022m3
        Delta: 1 month

. 
. **Newey Standard Errors with 6 lags
. itsa p50_diag_delay if inrange(mo_year_diagn, tm(2019m3), tm(2022m3)), single trperiod(2020m3) lag(6) replace figure(title("", size(small)) subtitle("", size(medsmall)) ytitle("Median time to diagnosis, days", size(medsma
> ll) margin(small)) ylabel(, nogrid) xtitle("Date of diagnosis", size(medsmall) margin(medsmall)) xlabel(710 "Mar 2019" 716 "Sep 2019" 722 "Mar 2020" 728 "Sep 2020" 734 "Mar 2021" 740 "Sep 2021" 746 "Mar 2022", nogrid) not
> e("", size(v.small)) legend(off) saving("$projectdir/output/figures/ITSA_diagnostic_delay_newey.gph", replace)) posttrend 



Time variable: mo_year_diagn, 2019m10 to 2022m3
        Delta: 1 month

Regression with Newey–West standard errors      Number of obs     =         30
Maximum lag = 6                                 F(  3,        26) =      94.60
                                                Prob > F          =     0.0000

------------------------------------------------------------------------------
             |             Newey–West
_p50_diag_~y | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
          _t |         .3   1.272326     0.24   0.815    -2.315303    2.915303
    _x2020m3 |       24.9   7.629997     3.26   0.003     9.216317    40.58368
  _x_t2020m3 |      3.375   1.476296     2.29   0.031     .3404306    6.409569
       _cons |      191.8   1.834181   104.57   0.000     188.0298    195.5702
------------------------------------------------------------------------------


                    Postintervention Linear Trend: 2020m3

Treated: _b[_t]+_b[_x_t2020m3]
------------------------------------------------------------------------------
Linear Trend |      Coef.   Std. Err.      t              [95% Conf. Interval]
-------------+----------------------------------------------------------------
     Treated |      3.675   .5291757     6.94   0.000     2.587264    4.762736
------------------------------------------------------------------------------
(note:  named style v.small not found in class gsize, default attributes used)
(file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/figures/ITSA_diagnostic_delay_newey.gph not found)
file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/figures/ITSA_diagnostic_delay_newey.gph saved

.         graph export "$projectdir/output/figures/ITSA_diagnostic_delay_newey.svg", as(svg) replace
(file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/figures/ITSA_diagnostic_delay_newey.svg not found)
file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/figures/ITSA_diagnostic_delay_newey.svg saved as SVG format

. actest, lag(18) 

Cumby-Huizinga test for autocorrelation (Breusch-Godfrey)
  H0: variable is MA process up to order q
  HA: serial correlation present at specified lags >q
-----------------------------------------------------------------------------
  H0: q=0 (serially uncorrelated)        |  H0: q=specified lag-1
  HA: s.c. present at range specified    |  HA: s.c. present at lag specified
-----------------------------------------+-----------------------------------
    lags   |      chi2      df     p-val | lag |      chi2      df     p-val
-----------+-----------------------------+-----+-----------------------------
   1 -  1  |      0.802      1    0.3704 |   1 |      0.802      1    0.3704
   1 -  2  |      6.471      2    0.0393 |   2 |      5.905      1    0.0151
   1 -  3  |     11.597      3    0.0089 |   3 |      4.903      1    0.0268
   1 -  4  |     11.678      4    0.0199 |   4 |      0.431      1    0.5115
   1 -  5  |     13.248      5    0.0212 |   5 |      4.924      1    0.0265
   1 -  6  |     13.262      6    0.0391 |   6 |      0.795      1*   0.3726
   1 -  7  |     13.528      7    0.0602 |   7 |      0.576      1    0.4479
   1 -  8  |     14.083      8    0.0796 |   8 |      1.201      1    0.2732
   1 -  9  |     14.121      9    0.1181 |   9 |      0.115      1    0.7346
   1 - 10  |     16.190      10   0.0943 |  10 |      0.209      1    0.6479
   1 - 11  |     16.190      11   0.1342 |  11 |      0.526      1    0.4683
   1 - 12  |     16.295      12   0.1781 |  12 |      0.021      1    0.8859
   1 - 13  |     19.578      13   0.1062 |  13 |      0.646      1    0.4216
   1 - 14  |     21.144      14   0.0980 |  14 |      0.106      1    0.7445
   1 - 15  |     21.146      15   0.1322 |  15 |      0.007      1*   0.9322
   1 - 16  |     21.161      16   0.1724 |  16 |      0.095      1*   0.7580
   1 - 17  |     23.935      17   0.1212 |  17 |      0.081      1    0.7756
   1 - 18  |     24.743      18   0.1321 |  18 |      0.042      1    0.8375
-----------------------------------------------------------------------------
  Test allows predetermined regressors/instruments
  Test requires conditional homoskedasticity
  * Eigenvalues adjusted to make matrix positive semidefinite

. 
. **Prais-Winsten 
. itsa p50_diag_delay if inrange(mo_year_diagn, tm(2019m3), tm(2022m3)), single trperiod(2020m3) replace prais rhotype(tscorr) vce(robust) figure(title("", size(small)) subtitle("", size(medsmall)) ytitle("Median time to di
> agnosis, days", size(medsmall) margin(small)) ylabel(, nogrid) xtitle("Date of diagnosis", size(medsmall) margin(medsmall)) xlabel(710 "Mar 2019" 716 "Sep 2019" 722 "Mar 2020" 728 "Sep 2020" 734 "Mar 2021" 740 "Sep 2021" 
> 746 "Mar 2022", nogrid) note("", size(v.small)) legend(off) saving("$projectdir/output/figures/ITSA_diagnostic_delay_prais.gph", replace)) posttrend 



Time variable: mo_year_diagn, 2019m10 to 2022m3
        Delta: 1 month

Iteration 0:   rho = 0.0000
Iteration 1:   rho = -0.1622
Iteration 2:   rho = -0.1748
Iteration 3:   rho = -0.1755
Iteration 4:   rho = -0.1756
Iteration 5:   rho = -0.1756
Iteration 6:   rho = -0.1756

Prais–Winsten AR(1) regression with iterated estimates

Linear regression                               Number of obs     =         30
                                                F(3, 26)          =     103.17
                                                Prob > F          =     0.0000
                                                R-squared         =     0.8281
                                                Root MSE          =     21.597

------------------------------------------------------------------------------
             |             Semirobust
_p50_diag_~y | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
          _t |   1.633932   2.928069     0.56   0.582      -4.3848    7.652664
    _x2020m3 |   19.07874   15.59018     1.22   0.232    -12.96734    51.12481
  _x_t2020m3 |   2.101091   2.966461     0.71   0.485    -3.996557    8.198739
       _cons |   190.0682   4.077884    46.61   0.000      181.686    198.4504
-------------+----------------------------------------------------------------
         rho |  -.1755566
------------------------------------------------------------------------------
Durbin–Watson statistic (original)    = 2.320906
Durbin–Watson statistic (transformed) = 1.840621


                    Postintervention Linear Trend: 2020m3

Treated: _b[_t]+_b[_x_t2020m3]
------------------------------------------------------------------------------
Linear Trend |      Coef.   Std. Err.      t              [95% Conf. Interval]
-------------+----------------------------------------------------------------
     Treated |   3.735023   .5367899     6.96   0.000     2.631635    4.838411
------------------------------------------------------------------------------
(note:  named style v.small not found in class gsize, default attributes used)
(file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/figures/ITSA_diagnostic_delay_prais.gph not found)
file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/figures/ITSA_diagnostic_delay_prais.gph saved

.         graph export "$projectdir/output/figures/ITSA_diagnostic_delay_prais.svg", as(svg) replace      
(file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/figures/ITSA_diagnostic_delay_prais.svg not found)
file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/figures/ITSA_diagnostic_delay_prais.svg saved as SVG format

. 
. **Time from rheum referral to rheum appt (all diagnoses) with second cut point corresponding to Jan 2021 lockdown
. **Newey Standard Errors with 6 lags
. itsa p50_diag_delay if inrange(mo_year_diagn, tm(2019m3), tm(2022m3)), single trperiod(2020m3; 2021m1) lag(6) replace figure(title("", size(small)) subtitle("", size(medsmall)) ytitle("Median time to diagnosis, days", siz
> e(medsmall) margin(small)) ylabel(, nogrid) xtitle("Date of diagnosis", size(medsmall) margin(medsmall)) xlabel(710 "Mar 2019" 716 "Sep 2019" 722 "Mar 2020" 728 "Sep 2020" 734 "Mar 2021" 740 "Sep 2021" 746 "Mar 2022", nog
> rid) note("", size(v.small)) legend(off) saving("$projectdir/output/figures/ITSA_diagnostic_delay_newey_2cuts.gph", replace)) posttrend 



Time variable: mo_year_diagn, 2019m10 to 2022m3
        Delta: 1 month

Regression with Newey–West standard errors      Number of obs     =         30
Maximum lag = 6                                 F(  5,        24) =     145.61
                                                Prob > F          =     0.0000

------------------------------------------------------------------------------
             |             Newey–West
_p50_diag_~y | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
          _t |         .3   1.324279     0.23   0.823    -2.433177    3.033177
    _x2020m3 |   18.59091   10.37062     1.79   0.086    -2.813002    39.99482
  _x_t2020m3 |   4.157576   2.166161     1.92   0.067    -.3131616    8.628313
    _x2021m1 |   10.66667   12.78343     0.83   0.412    -15.71704    37.05038
  _x_t2021m1 |  -2.257576   2.029286    -1.11   0.277    -6.445815    1.930664
       _cons |      191.8   1.909076   100.47   0.000     187.8599    195.7401
------------------------------------------------------------------------------


                    Postintervention Linear Trend: 2020m3

Treated: _b[_t]+_b[_x_t2020m3]
------------------------------------------------------------------------------
Linear Trend |      Coef.   Std. Err.      t              [95% Conf. Interval]
-------------+----------------------------------------------------------------
     Treated |   4.457576   1.753314     2.54   0.018     .8389138    8.076238
------------------------------------------------------------------------------


                    Postintervention Linear Trend: 2021m1

Treated: _b[_t]+_b[_x_t2020m3]+_b[_x_t2021m1]
------------------------------------------------------------------------------
Linear Trend |      Coef.   Std. Err.      t              [95% Conf. Interval]
-------------+----------------------------------------------------------------
     Treated |        2.2   .8540125     2.58   0.017     .4374049    3.962595
------------------------------------------------------------------------------
(note:  named style v.small not found in class gsize, default attributes used)
(file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/figures/ITSA_diagnostic_delay_newey_2cuts.gph not found)
file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/figures/ITSA_diagnostic_delay_newey_2cuts.gph saved

.         graph export "$projectdir/output/figures/ITSA_diagnostic_delay_newey_2cuts.svg", as(svg) replace
(file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/figures/ITSA_diagnostic_delay_newey_2cuts.svg not found)
file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/figures/ITSA_diagnostic_delay_newey_2cuts.svg saved as SVG format

. actest, lag(18) 

Cumby-Huizinga test for autocorrelation (Breusch-Godfrey)
  H0: variable is MA process up to order q
  HA: serial correlation present at specified lags >q
-----------------------------------------------------------------------------
  H0: q=0 (serially uncorrelated)        |  H0: q=specified lag-1
  HA: s.c. present at range specified    |  HA: s.c. present at lag specified
-----------------------------------------+-----------------------------------
    lags   |      chi2      df     p-val | lag |      chi2      df     p-val
-----------+-----------------------------+-----+-----------------------------
   1 -  1  |      1.695      1    0.1930 |   1 |      1.695      1    0.1930
   1 -  2  |      5.670      2    0.0587 |   2 |      4.557      1    0.0328
   1 -  3  |     13.216      3    0.0042 |   3 |      7.570      1    0.0059
   1 -  4  |     14.267      4    0.0065 |   4 |      0.103      1    0.7482
   1 -  5  |     17.299      5    0.0040 |   5 |      5.378      1    0.0204
   1 -  6  |     17.926      6    0.0064 |   6 |      0.811      1    0.3678
   1 -  7  |     17.967      7    0.0121 |   7 |      0.240      1    0.6240
   1 -  8  |     19.053      8    0.0146 |   8 |      2.027      1    0.1545
   1 -  9  |     19.077      9    0.0245 |   9 |      0.003      1*   0.9600
   1 - 10  |     22.638      10   0.0122 |  10 |      0.419      1*   0.5174
   1 - 11  |     24.480      11   0.0109 |  11 |      0.409      1*   0.5223
   1 - 12  |     24.768      12   0.0160 |  12 |      0.009      1*   0.9239
   1 - 13  |     24.980      13   0.0232 |  13 |      0.482      1    0.4877
   1 - 14  |     26.063      14   0.0254 |  14 |      0.034      1*   0.8536
   1 - 15  |     26.152      15   0.0365 |  15 |      0.019      1*   0.8889
   1 - 16  |     27.843      16   0.0330 |  16 |      0.174      1*   0.6764
   1 - 17  |     28.963      17   0.0349 |  17 |      0.076      1*   0.7821
   1 - 18  |     29.237      18   0.0456 |  18 |      0.022      1    0.8833
-----------------------------------------------------------------------------
  Test allows predetermined regressors/instruments
  Test requires conditional homoskedasticity
  * Eigenvalues adjusted to make matrix positive semidefinite

. 
. **Prais-Winsten 
. itsa p50_diag_delay if inrange(mo_year_diagn, tm(2019m3), tm(2022m3)), single trperiod(2020m3; 2021m1) replace prais rhotype(tscorr) vce(robust) figure(title("", size(small)) subtitle("", size(medsmall)) ytitle("Median ti
> me to diagnosis, days", size(medsmall) margin(small)) ylabel(, nogrid) xtitle("Date of diagnosis", size(medsmall) margin(medsmall)) xlabel(710 "Mar 2019" 716 "Sep 2019" 722 "Mar 2020" 728 "Sep 2020" 734 "Mar 2021" 740 "Se
> p 2021" 746 "Mar 2022", nogrid) note("", size(v.small)) legend(off) saving("$projectdir/output/figures/ITSA_diagnostic_delay_prais_2cuts.gph", replace)) posttrend 



Time variable: mo_year_diagn, 2019m10 to 2022m3
        Delta: 1 month

Iteration 0:   rho = 0.0000
Iteration 1:   rho = -0.2318
Iteration 2:   rho = -0.2742
Iteration 3:   rho = -0.2790
Iteration 4:   rho = -0.2795
Iteration 5:   rho = -0.2795
Iteration 6:   rho = -0.2795
Iteration 7:   rho = -0.2795

Prais–Winsten AR(1) regression with iterated estimates

Linear regression                               Number of obs     =         30
                                                F(5, 24)          =      79.05
                                                Prob > F          =     0.0000
                                                R-squared         =     0.8740
                                                Root MSE          =     21.325

------------------------------------------------------------------------------
             |             Semirobust
_p50_diag_~y | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
          _t |   2.663351   3.112409     0.86   0.401    -3.760345    9.087046
    _x2020m3 |   5.467541   16.43086     0.33   0.742    -28.44408    39.37916
  _x_t2020m3 |   2.687726     3.9232     0.69   0.500    -5.409361    10.78481
    _x2021m1 |   4.944964   16.40955     0.30   0.766    -28.92267     38.8126
  _x_t2021m1 |  -3.030826   2.172019    -1.40   0.176    -7.513653       1.452
       _cons |   188.6903   4.821471    39.14   0.000     178.7393    198.6414
-------------+----------------------------------------------------------------
         rho |   -.279531
------------------------------------------------------------------------------
Durbin–Watson statistic (original)    = 2.463046
Durbin–Watson statistic (transformed) = 1.795988


                    Postintervention Linear Trend: 2020m3

Treated: _b[_t]+_b[_x_t2020m3]
------------------------------------------------------------------------------
Linear Trend |      Coef.   Std. Err.      t              [95% Conf. Interval]
-------------+----------------------------------------------------------------
     Treated |   5.351077   2.059447     2.60   0.016     1.100588    9.601567
------------------------------------------------------------------------------


                    Postintervention Linear Trend: 2021m1

Treated: _b[_t]+_b[_x_t2020m3]+_b[_x_t2021m1]
------------------------------------------------------------------------------
Linear Trend |      Coef.   Std. Err.      t              [95% Conf. Interval]
-------------+----------------------------------------------------------------
     Treated |   2.320251   .8944985     2.59   0.016     .4740966    4.166405
------------------------------------------------------------------------------
(note:  named style v.small not found in class gsize, default attributes used)
(file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/figures/ITSA_diagnostic_delay_prais_2cuts.gph not found)
file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/figures/ITSA_diagnostic_delay_prais_2cuts.gph saved

.         graph export "$projectdir/output/figures/ITSA_diagnostic_delay_prais_2cuts.svg", as(svg) replace        
(file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/figures/ITSA_diagnostic_delay_prais_2cuts.svg not found)
file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/figures/ITSA_diagnostic_delay_prais_2cuts.svg saved as SVG format

. restore

. 
end of do-file

. do "C:\Users\k1754142\AppData\Local\Temp\STD4564_000000.tmp"

. preserve

. keep if time_gp_rheum_ref_appt!=. //drop those with no last GP appt and/or rheum ref
(27,632 observations deleted)

. eststo X: estpost tabstat time_gp_rheum_ref_appt, by(mo_year_diagn_s) stat(count p50 p75 p25 mean sd) 

Summary statistics: count p50 p75 p25 mean sd
     for variables: time_gp_rheum_ref_appt
  by categories of: mo_year_diagn_s

mo_year_diag |  e(count)     e(p50)     e(p75)     e(p25)    e(mean)      e(sd) 
-------------+------------------------------------------------------------------
     2019m10 |        13        165        260         69   180.6923   126.6059 
     2019m11 |        13        135        184         58   131.7692   87.56917 
     2019m12 |        14      127.5        244         40   155.4286   140.1316 
     2020m01 |        16        157        277       62.5   167.6875    117.417 
     2020m02 |        18      252.5        351         69   236.0556   186.5689 
     2020m03 |        18        134        191         63   146.1667   102.5391 
     2020m04 |        23        194        334        128   246.1304   170.9347 
     2020m05 |        21        178        313         71        223   176.2371 
     2020m06 |        22      222.5        384        117   247.1364   175.7594 
     2020m07 |        22      130.5        240         39      147.5    115.178 
     2020m08 |        33        207        291         93   227.2121   182.6906 
     2020m09 |        28        239      335.5       59.5   237.3214   198.5173 
     2020m10 |        29        208        366         64   243.6552   198.2645 
     2020m11 |        30      196.5        364         99      240.1   202.4105 
     2020m12 |        31        216        403         49   249.0645   212.6399 
     2021m01 |        40        226        369       71.5    253.625   204.8569 
     2021m02 |        32      188.5      300.5         67   209.5625   168.2983 
     2021m03 |        43        224        403         92   257.3023    193.866 
     2021m04 |        60        224        466      126.5     287.95   208.3514 
     2021m05 |        43        214        345        106    242.093   181.7012 
     2021m06 |        59        234        384         81   265.7797   218.6948 
     2021m07 |        48        172      403.5       71.5   261.4792    239.785 
     2021m08 |        55        220        459        106      274.2   224.8102 
     2021m09 |        50      252.5        539        115     338.46   295.7761 
     2021m10 |        48      230.5      383.5         99   272.4167   206.2066 
     2021m11 |        61        164        359         77   272.4918   272.9288 
     2021m12 |        49        299        422        113   329.3878   270.4075 
     2022m01 |        48        243      470.5       44.5   297.7708    279.133 
     2022m02 |        46        338        663        141   390.5217   291.6038 
     2022m03 |         2      437.5        597        278      437.5   225.5671 
-------------+------------------------------------------------------------------
       Total |      1015        210        370         87   261.8404   222.9053 

. esttab X using "$projectdir/output/tables/referral_delay_GP_to_ref.csv", cells("count p50 p75 p25 mean sd") replace plain nomtitle noobs
(file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/tables/referral_delay_GP_to_ref.csv not found)
(output written to C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/tables/referral_delay_GP_to_ref.csv)

. collapse (p50) p50_ref_delay=time_gp_rheum_ref_appt (p75) p75_ref_delay=time_gp_rheum_ref_appt (p25) p25_ref_delay=time_gp_rheum_ref_appt (mean) mean_ref_delay=time_gp_rheum_ref_appt (sd) sd_ref_delay=time_gp_rheum_ref_ap
> pt (count) n_ref_delay=time_gp_rheum_ref_appt, by(mo_year_diagn)

. 
. tsset mo_year_diagn

Time variable: mo_year_diagn, 2019m10 to 2022m3
        Delta: 1 month

. 
. **Newey Standard Errors with 6 lags
. itsa p50_ref_delay if inrange(mo_year_diagn, tm(2019m3), tm(2022m3)), single trperiod(2020m3) lag(6) replace figure(title("", size(small)) subtitle("", size(medsmall)) ytitle("Median time to referral, days", size(medsmall
> ) margin(small)) ylabel(, nogrid) xtitle("Date of diagnosis", size(medsmall) margin(medsmall)) xlabel(710 "Mar 2019" 716 "Sep 2019" 722 "Mar 2020" 728 "Sep 2020" 734 "Mar 2021" 740 "Sep 2021" 746 "Mar 2022", nogrid) note(
> "", size(v.small)) legend(off) saving("$projectdir/output/figures/ITSA_referral_delay_newey.gph", replace)) posttrend 



Time variable: mo_year_diagn, 2019m10 to 2022m3
        Delta: 1 month

Regression with Newey–West standard errors      Number of obs     =         30
Maximum lag = 6                                 F(  3,        26) =       7.74
                                                Prob > F          =     0.0007

------------------------------------------------------------------------------
             |             Newey–West
_p50_ref_d~y | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
          _t |       19.7   8.388638     2.35   0.027     2.456907    36.94309
    _x2020m3 |  -68.38923    29.4318    -2.32   0.028    -128.8872   -7.891306
  _x_t2020m3 |  -14.23423   8.710703    -1.63   0.114    -32.13934    3.670875
       _cons |        128   17.72513     7.22   0.000     91.56547    164.4345
------------------------------------------------------------------------------


                    Postintervention Linear Trend: 2020m3

Treated: _b[_t]+_b[_x_t2020m3]
------------------------------------------------------------------------------
Linear Trend |      Coef.   Std. Err.      t              [95% Conf. Interval]
-------------+----------------------------------------------------------------
     Treated |   5.465769     1.8332     2.98   0.006     1.697572    9.233966
------------------------------------------------------------------------------
(note:  named style v.small not found in class gsize, default attributes used)
(file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/figures/ITSA_referral_delay_newey.gph not found)
file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/figures/ITSA_referral_delay_newey.gph saved

.         graph export "$projectdir/output/figures/ITSA_referral_delay_newey.svg", as(svg) replace
(file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/figures/ITSA_referral_delay_newey.svg not found)
file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/figures/ITSA_referral_delay_newey.svg saved as SVG format

. actest, lag(18) 

Cumby-Huizinga test for autocorrelation (Breusch-Godfrey)
  H0: variable is MA process up to order q
  HA: serial correlation present at specified lags >q
-----------------------------------------------------------------------------
  H0: q=0 (serially uncorrelated)        |  H0: q=specified lag-1
  HA: s.c. present at range specified    |  HA: s.c. present at lag specified
-----------------------------------------+-----------------------------------
    lags   |      chi2      df     p-val | lag |      chi2      df     p-val
-----------+-----------------------------+-----+-----------------------------
   1 -  1  |      0.441      1    0.5065 |   1 |      0.441      1    0.5065
   1 -  2  |      0.587      2    0.7458 |   2 |      0.018      1    0.8921
   1 -  3  |      1.080      3    0.7818 |   3 |      0.418      1    0.5181
   1 -  4  |      1.120      4    0.8910 |   4 |      0.223      1    0.6370
   1 -  5  |      3.754      5    0.5853 |   5 |      1.752      1    0.1857
   1 -  6  |      3.766      6    0.7083 |   6 |      0.114      1    0.7351
   1 -  7  |      4.395      7    0.7333 |   7 |      0.515      1    0.4731
   1 -  8  |      6.811      8    0.5572 |   8 |      2.951      1    0.0858
   1 -  9  |      7.333      9    0.6024 |   9 |      0.724      1    0.3948
   1 - 10  |     12.729      10   0.2392 |  10 |      2.678      1    0.1018
   1 - 11  |     12.843      11   0.3037 |  11 |      0.030      1    0.8624
   1 - 12  |     13.074      12   0.3637 |  12 |      0.034      1    0.8527
   1 - 13  |     16.700      13   0.2134 |  13 |      2.562      1    0.1095
   1 - 14  |     17.203      14   0.2455 |  14 |      0.364      1    0.5464
   1 - 15  |     18.521      15   0.2363 |  15 |      0.059      1    0.8076
   1 - 16  |     18.854      16   0.2763 |  16 |      0.219      1    0.6401
   1 - 17  |     19.141      17   0.3205 |  17 |      0.729      1    0.3931
   1 - 18  |     19.220      18   0.3784 |  18 |      3.864      1    0.0493
-----------------------------------------------------------------------------
  Test allows predetermined regressors/instruments
  Test requires conditional homoskedasticity

. 
. **Prais-Winsten 
. itsa p50_ref_delay if inrange(mo_year_diagn, tm(2019m3), tm(2022m3)), single trperiod(2020m3) replace prais rhotype(tscorr) vce(robust) figure(title("", size(small)) subtitle("", size(medsmall)) ytitle("Median time to ref
> erral, days", size(medsmall) margin(small)) ylabel(, nogrid) xtitle("Date of diagnosis", size(medsmall) margin(medsmall)) xlabel(710 "Mar 2019" 716 "Sep 2019" 722 "Mar 2020" 728 "Sep 2020" 734 "Mar 2021" 740 "Sep 2021" 74
> 6 "Mar 2022", nogrid) note("", size(v.small)) legend(off) saving("$projectdir/output/figures/ITSA_referral_delay_prais.gph", replace)) posttrend 



Time variable: mo_year_diagn, 2019m10 to 2022m3
        Delta: 1 month

Iteration 0:   rho = 0.0000
Iteration 1:   rho = 0.0879
Iteration 2:   rho = 0.1028
Iteration 3:   rho = 0.1058
Iteration 4:   rho = 0.1064
Iteration 5:   rho = 0.1065
Iteration 6:   rho = 0.1065
Iteration 7:   rho = 0.1065
Iteration 8:   rho = 0.1065
Iteration 9:   rho = 0.1065

Prais–Winsten AR(1) regression with iterated estimates

Linear regression                               Number of obs     =         30
                                                F(3, 26)          =       4.73
                                                Prob > F          =     0.0092
                                                R-squared         =     0.4360
                                                Root MSE          =     48.477

------------------------------------------------------------------------------
             |             Semirobust
_p50_ref_d~y | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
          _t |   20.58183   13.53785     1.52   0.141     -7.24561    48.40927
    _x2020m3 |  -76.26586    50.2869    -1.52   0.141    -179.6321    27.10034
  _x_t2020m3 |  -14.86223   13.76993    -1.08   0.290    -43.16672    13.44227
       _cons |   128.7768   29.88937     4.31   0.000     67.33833    190.2153
-------------+----------------------------------------------------------------
         rho |   .1065353
------------------------------------------------------------------------------
Durbin–Watson statistic (original)    = 1.447373
Durbin–Watson statistic (transformed) = 1.594528


                    Postintervention Linear Trend: 2020m3

Treated: _b[_t]+_b[_x_t2020m3]
------------------------------------------------------------------------------
Linear Trend |      Coef.   Std. Err.      t              [95% Conf. Interval]
-------------+----------------------------------------------------------------
     Treated |   5.719604   2.030529     2.82   0.009     1.545791    9.893416
------------------------------------------------------------------------------
(note:  named style v.small not found in class gsize, default attributes used)
(file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/figures/ITSA_referral_delay_prais.gph not found)
file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/figures/ITSA_referral_delay_prais.gph saved

.         graph export "$projectdir/output/figures/ITSA_referral_delay_prais.svg", as(svg) replace        
(file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/figures/ITSA_referral_delay_prais.svg not found)
file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/figures/ITSA_referral_delay_prais.svg saved as SVG format

. restore

. 
end of do-file

. exit, clear
