-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/itsa_models.log
  log type:  text
 opened on:  14 Apr 2022, 10:51:29

. 
. **Set Ado file path
. adopath + "$projectdir/analysis/extra_ados"
  [1]  (BASE)      "/usr/local/stata/ado/base/"
  [2]  (SITE)      "/usr/local/ado/"
  [3]              "."
  [4]  (PERSONAL)  "~/ado/personal/"
  [5]  (PLUS)      "~/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "/workspace/analysis/extra_ados"

. 
. **Use cleaned data from previous step
. use "$projectdir/output/data/file_eia_all.dta", clear

. 
. set scheme plotplainblind

. 
. **Set index dates ===========================================================
> */
. global year_preceding = "01/03/2018"

. global start_date = "01/03/2019"

. global outpatient_date = "01/04/2019"

. global fup_6m_date = "01/09/2021"

. global end_date = "01/03/2022"

. 
. /*ITSA models for appt and referral times====================================
> =======================================*/
. 
. **Time from last GP appt to rheum referral (all diagnoses)
. preserve

. keep if time_gp_rheum_ref_appt!=. //drop those with no last GP appt and/or rh
> eum ref
(66,373 observations deleted)

. eststo X: estpost tabstat time_gp_rheum_ref_appt, by(mo_year_diagn_s) stat(co
> unt p50 p75 p25 mean sd) 

Summary statistics: count p50 p75 p25 mean sd
     for variables: time_gp_rheum_ref_appt
  by categories of: mo_year_diagn_s

mo_year_diag |  e(count)     e(p50)     e(p75)     e(p25)    e(mean) 
-------------+-------------------------------------------------------
     2019m03 |        52        112      182.5         67   128.7885 
     2019m04 |        74        112        204         37   135.1081 
     2019m05 |        61        136        238         77   159.7705 
     2019m06 |        68      137.5        270       61.5   169.6912 
     2019m07 |        62        160        240         83   179.6129 
     2019m08 |        61        180        273         86   193.3279 
     2019m09 |        59        119        219         68   151.2034 
     2019m10 |        59        206        344         97   220.7797 
     2019m11 |        51        175        332         85    207.451 
     2019m12 |        58      173.5        292         84   201.1897 
     2020m01 |        46        177        316         98   221.3478 
     2020m02 |        44        244      344.5         95        239 
     2020m03 |        54        200        324         72   209.0556 
     2020m04 |        42      148.5        393         87   223.0238 
     2020m05 |        30      223.5        424        125      255.2 
     2020m06 |        39        185        365         88   228.7949 
     2020m07 |        36      206.5      346.5       85.5   233.4722 
     2020m08 |        43        268        504        105   308.4884 
     2020m09 |        21        283        485        127   315.1905 
     2020m10 |        27        266        561         64   314.9259 
     2020m11 |        18      238.5        389        164   288.5556 
     2020m12 |        23        378        661        149   422.0435 
     2021m01 |        18        226        660        146   375.5556 
     2021m02 |        13        239        366         70   228.0769 
     2021m03 |        11        215        633         89   324.9091 
     2021m04 |        12      387.5        528      262.5     422.75 
     2021m05 |         8      187.5        352         94        251 
     2021m06 |         6      408.5        878        249   503.6667 
     2021m07 |        11        280        498        108   329.2727 
     2021m08 |         2        391        582        200        391 
     2021m09 |         7        889        967        620        822 
     2021m10 |         8        309        501        212      363.5 
     2021m11 |         2        649       1087        211        649 
     2021m12 |         2        150        221         79        150 
     2022m02 |         1        753        753        753        753 
-------------+-------------------------------------------------------
       Total |      1129        182        323         83   224.5793 

mo_year_diag |     e(sd) 
-------------+-----------
     2019m03 |  83.26813 
     2019m04 |  105.6443 
     2019m05 |  113.1505 
     2019m06 |  124.3349 
     2019m07 |  114.8793 
     2019m08 |   127.459 
     2019m09 |  110.9428 
     2019m10 |  142.1848 
     2019m11 |  141.9922 
     2019m12 |  149.7888 
     2020m01 |  168.5487 
     2020m02 |  155.0652 
     2020m03 |  150.7405 
     2020m04 |  166.5958 
     2020m05 |  163.9235 
     2020m06 |  169.0799 
     2020m07 |  172.5393 
     2020m08 |  231.2868 
     2020m09 |  220.4311 
     2020m10 |  225.8779 
     2020m11 |  155.5942 
     2020m12 |  285.6362 
     2021m01 |     310.6 
     2021m02 |  179.3514 
     2021m03 |  253.6874 
     2021m04 |  229.7948 
     2021m05 |  217.3148 
     2021m06 |  408.0052 
     2021m07 |  275.0277 
     2021m08 |  270.1148 
     2021m09 |  218.4765 
     2021m10 |  255.5073 
     2021m11 |  619.4255 
     2021m12 |  100.4092 
     2022m02 |         . 
-------------+-----------
       Total |  184.4221 

. esttab X using "$projectdir/output/tables/referral_delay_GP_to_ref.csv", cell
> s("count p50 p75 p25 mean sd") replace plain nomtitle noobs
(note: file /workspace/output/tables/referral_delay_GP_to_ref.csv not found)
(output written to /workspace/output/tables/referral_delay_GP_to_ref.csv)

. collapse (p50) p50_ref_delay=time_gp_rheum_ref_appt (p75) p75_ref_delay=time_
> gp_rheum_ref_appt (p25) p25_ref_delay=time_gp_rheum_ref_appt (mean) mean_ref_
> delay=time_gp_rheum_ref_appt (sd) sd_ref_delay=time_gp_rheum_ref_appt (count)
>  n_ref_delay=time_gp_rheum_ref_appt, by(mo_year_diagn)

. 
. tsset mo_year_diagn
        time variable:  mo_year_diagn, 2019m3 to 2022m2, but with a gap
                delta:  1 month

. 
. **Newey Standard Errors with 6 lags
. itsa p50_ref_delay if inrange(mo_year_diagn, tm(2019m3), tm(2022m3)), single 
> trperiod(2020m3) lag(6) replace figure(title("", size(small)) subtitle("", si
> ze(medsmall)) ytitle("Median time to referral, days", size(medsmall) margin(s
> mall)) ylabel(, nogrid) xtitle("Date of diagnosis", size(medsmall) margin(med
> small)) xlabel(710 "Mar 2019" 716 "Sep 2019" 722 "Mar 2020" 728 "Sep 2020" 73
> 4 "Mar 2021" 740 "Sep 2021" 746 "Mar 2022", nogrid) note("", size(v.small)) l
> egend(off) saving("$projectdir/output/figures/ITSA_referral_delay_newey.gph",
>  replace)) posttrend 


        time variable:  mo_year_diagn, 2019m3 to 2022m2, but with a gap
                delta:  1 month
mo_year_diagn is not regularly spaced
r(198);

end of do-file
r(198);

end of do-file

r(198);


