-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/logs/itsa_models.log
  log type:  text
 opened on:  11 Apr 2022, 12:35:45

. 
. **Set Ado file path
. adopath + "$projectdir/analysis/extra_ados"
  [1]  (BASE)      "C:\Program Files\Stata17\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata17\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "C:\Users\k1754142\ado\personal/"
  [5]  (PLUS)      "C:\Users\k1754142\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/analysis/extra_ados"

. 
. **Use cleaned data from previous step
. use "$projectdir/output/data/file_eia_all.dta", clear

. 
. set scheme plotplainblind

. 
. /*ITSA models===========================================================================*/
. 
. **Time from rheum referral to rheum appt (all diagnoses)
. preserve

. keep if time_ref_rheum_appt!=. //drop those with no rheum ref and/or rheum appt
(28,870 observations deleted)

. eststo X: estpost tabstat time_ref_rheum_appt, by(mo_year_diagn_s) stat(count p50 p75 p25 mean sd) 

Summary statistics: count p50 p75 p25 mean sd
     for variables: time_ref_rheum_appt
  by categories of: mo_year_diagn_s

mo_year_diag |  e(count)     e(p50)     e(p75)     e(p25)    e(mean)      e(sd) 
-------------+------------------------------------------------------------------
     2019m03 |        40       94.5      167.5       52.5      112.5   84.97632 
     2019m04 |        43        130        200         78   141.2093   96.38281 
     2019m05 |        54        112        214         52   129.6852   86.80727 
     2019m06 |        63        134        207         71   152.8889   104.0253 
     2019m07 |        65        120        212         61      147.6   115.0595 
     2019m08 |        67        106        251         53   148.4776    120.295 
     2019m09 |        96        138        265       55.5   161.6042   124.8104 
     2019m10 |        75        168        303         76     192.56   144.0845 
     2019m11 |        75        173        267         58   184.6667   137.7361 
     2019m12 |        88        181      321.5         87   215.2045    157.817 
     2020m01 |       114        195        329         74   216.4386   159.6747 
     2020m02 |        92        156        307         59   203.7609   162.8909 
     2020m03 |       124        171      306.5       84.5   209.3952   158.1822 
     2020m04 |       132        191      350.5       85.5   232.4621   175.0921 
     2020m05 |       122      216.5        372        109   257.8033   174.0601 
     2020m06 |       120      170.5      347.5         73   224.2417   179.8163 
     2020m07 |       136        231      373.5       74.5   253.0515    200.343 
     2020m08 |       130        185        392         99   254.4231    204.324 
     2020m09 |       149        238        379        124   264.6309   182.5251 
     2020m10 |       143        208        393         95   263.3427   213.6937 
     2020m11 |       159        218        443         95    265.717   193.8601 
     2020m12 |       167        228        420         87   274.6707   216.3473 
     2021m01 |       179        248        390        117   278.3184   196.3094 
     2021m02 |       179        296        490        109   318.4134   236.3224 
     2021m03 |       169        290        504        151   341.1953   249.4026 
     2021m04 |       186      285.5        478        125   322.8011   238.8453 
     2021m05 |       194        263        518        124   329.7938   252.9498 
     2021m06 |       182        223        489         94   311.6868   269.9502 
     2021m07 |       192        288      547.5      131.5   351.4583   258.7526 
     2021m08 |       208        231      445.5        113    293.375    224.631 
     2021m09 |       187        290        534        137   337.0428   243.2358 
     2021m10 |       189        304        598        147   383.5873   292.0001 
     2021m11 |       182        324        544        120   357.9945   280.2085 
     2021m12 |       242      281.5        552        140   366.8223   287.1361 
     2022m01 |       219        290        494        135   343.4749   277.3077 
     2022m02 |       223        301        539        123   373.3229   298.8778 
     2022m03 |        13        423        562        284   450.9231     243.15 
-------------+------------------------------------------------------------------
       Total |      4998        227        421        101   285.7409   234.4129 

. esttab X using "$projectdir/output/tables/diagnostic_delay_ref_rheum_appt.csv", cells("count p50 p75 p25 mean sd") replace plain nomtitle noobs
(output written to C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/tables/diagnostic_delay_ref_rheum_appt.csv)

. collapse (p50) p50_diag_delay=time_ref_rheum_appt (p75) p75_diag_delay=time_ref_rheum_appt (p25) p25_diag_delay=time_ref_rheum_appt (mean) mean_diag_delay=time_ref_rheum_appt (sd) sd_diag_delay=time_ref_rheum_appt (count)
>  n_diag_delay=time_ref_rheum_appt, by(mo_year_diagn)

. 
. tsset mo_year_diagn

Time variable: mo_year_diagn, 2019m3 to 2022m3
        Delta: 1 month

. 
. **Newey Standard Errors with 6 lags
. itsa p50_diag_delay if inrange(mo_year_diagn, tm(2019m3), tm(2022m3)), single trperiod(2020m3) lag(6) replace figure(title("", size(small)) subtitle("", size(medsmall)) ytitle("Median time to diagnosis, days", size(medsma
> ll) margin(small)) ylabel(, nogrid) xtitle("Date of diagnosis", size(medsmall) margin(medsmall)) xlabel(710 "Mar 2019" 716 "Sep 2019" 722 "Mar 2020" 728 "Sep 2020" 734 "Mar 2021" 740 "Sep 2021" 746 "Mar 2022", nogrid) not
> e("", size(v.small)) legend(off) saving("$projectdir/output/figures/ITSA_diagnostic_delay_newey.gph", replace)) posttrend 



Time variable: mo_year_diagn, 2019m3 to 2022m3
        Delta: 1 month

Regression with Newey–West standard errors      Number of obs     =         37
Maximum lag = 6                                 F(  3,        33) =     182.98
                                                Prob > F          =     0.0000

------------------------------------------------------------------------------
             |             Newey–West
_p50_diag_~y | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
          _t |   7.396853   .9283688     7.97   0.000     5.508073    9.285634
    _x2020m3 |  -10.78506   9.354368    -1.15   0.257    -29.81666    8.246546
  _x_t2020m3 |  -1.045699   1.164395    -0.90   0.376     -3.41468    1.323281
       _cons |    101.609   5.173802    19.64   0.000     91.08279    112.1352
------------------------------------------------------------------------------


                    Postintervention Linear Trend: 2020m3

Treated: _b[_t]+_b[_x_t2020m3]
------------------------------------------------------------------------------
Linear Trend |      Coef.   Std. Err.      t              [95% Conf. Interval]
-------------+----------------------------------------------------------------
     Treated |   6.351154   .7092298     8.96   0.000     4.908215    7.794093
------------------------------------------------------------------------------
(note:  named style v.small not found in class gsize, default attributes used)
(file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/figures/ITSA_diagnostic_delay_newey.gph not found)
file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/figures/ITSA_diagnostic_delay_newey.gph saved

.         graph export "$projectdir/output/figures/ITSA_diagnostic_delay_newey.svg", as(svg) replace
(file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/figures/ITSA_diagnostic_delay_newey.svg not found)
file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/figures/ITSA_diagnostic_delay_newey.svg saved as SVG format

. actest, lag(18) 

Cumby-Huizinga test for autocorrelation (Breusch-Godfrey)
  H0: variable is MA process up to order q
  HA: serial correlation present at specified lags >q
-----------------------------------------------------------------------------
  H0: q=0 (serially uncorrelated)        |  H0: q=specified lag-1
  HA: s.c. present at range specified    |  HA: s.c. present at lag specified
-----------------------------------------+-----------------------------------
    lags   |      chi2      df     p-val | lag |      chi2      df     p-val
-----------+-----------------------------+-----+-----------------------------
   1 -  1  |      0.078      1    0.7794 |   1 |      0.078      1    0.7794
   1 -  2  |      0.102      2    0.9501 |   2 |      0.023      1    0.8787
   1 -  3  |      6.149      3    0.1046 |   3 |      6.072      1    0.0137
   1 -  4  |      6.394      4    0.1716 |   4 |      0.108      1    0.7423
   1 -  5  |      6.487      5    0.2617 |   5 |      0.374      1    0.5408
   1 -  6  |      6.679      6    0.3515 |   6 |      0.156      1    0.6925
   1 -  7  |      8.470      7    0.2930 |   7 |      0.314      1    0.5752
   1 -  8  |      8.531      8    0.3834 |   8 |      0.393      1    0.5307
   1 -  9  |     11.543      9    0.2403 |   9 |      1.722      1    0.1894
   1 - 10  |     12.583      10   0.2479 |  10 |      0.178      1*   0.6728
   1 - 11  |     18.634      11   0.0680 |  11 |      0.917      1*   0.3383
   1 - 12  |     20.387      12   0.0601 |  12 |      0.967      1*   0.3255
   1 - 13  |     21.727      13   0.0597 |  13 |      0.424      1*   0.5148
   1 - 14  |     23.649      14   0.0505 |  14 |      1.214      1*   0.2705
   1 - 15  |     23.864      15   0.0674 |  15 |      0.359      1    0.5490
   1 - 16  |     24.108      16   0.0872 |  16 |      0.308      1    0.5787
   1 - 17  |     25.575      17   0.0826 |  17 |      0.721      1    0.3957
   1 - 18  |     27.747      18   0.0660 |  18 |      0.609      1    0.4350
-----------------------------------------------------------------------------
  Test allows predetermined regressors/instruments
  Test requires conditional homoskedasticity
  * Eigenvalues adjusted to make matrix positive semidefinite

. 
. **Prais-Winsten 
. itsa p50_diag_delay if inrange(mo_year_diagn, tm(2019m3), tm(2022m3)), single trperiod(2020m3) replace prais rhotype(tscorr) vce(robust) figure(title("", size(small)) subtitle("", size(medsmall)) ytitle("Median time to di
> agnosis, days", size(medsmall) margin(small)) ylabel(, nogrid) xtitle("Date of diagnosis", size(medsmall) margin(medsmall)) xlabel(710 "Mar 2019" 716 "Sep 2019" 722 "Mar 2020" 728 "Sep 2020" 734 "Mar 2021" 740 "Sep 2021" 
> 746 "Mar 2022", nogrid) note("", size(v.small)) legend(off) saving("$projectdir/output/figures/ITSA_diagnostic_delay_prais.gph", replace)) posttrend 



Time variable: mo_year_diagn, 2019m3 to 2022m3
        Delta: 1 month

Iteration 0:   rho = 0.0000
Iteration 1:   rho = -0.0373
Iteration 2:   rho = -0.0389
Iteration 3:   rho = -0.0390
Iteration 4:   rho = -0.0390
Iteration 5:   rho = -0.0390

Prais–Winsten AR(1) regression with iterated estimates

Linear regression                               Number of obs     =         37
                                                F(3, 33)          =      83.10
                                                Prob > F          =     0.0000
                                                R-squared         =     0.8635
                                                Root MSE          =     29.196

------------------------------------------------------------------------------
             |             Semirobust
_p50_diag_~y | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
          _t |   7.417282   1.518187     4.89   0.000     4.328506    10.50606
    _x2020m3 |  -10.81916   16.24466    -0.67   0.510    -43.86918    22.23086
  _x_t2020m3 |  -1.094472   1.838153    -0.60   0.556    -4.834223    2.645278
       _cons |   101.5741   8.413271    12.07   0.000      84.4572    118.6911
-------------+----------------------------------------------------------------
         rho |  -.0389927
------------------------------------------------------------------------------
Durbin–Watson statistic (original)    = 1.779093
Durbin–Watson statistic (transformed) = 1.728355


                    Postintervention Linear Trend: 2020m3

Treated: _b[_t]+_b[_x_t2020m3]
------------------------------------------------------------------------------
Linear Trend |      Coef.   Std. Err.      t              [95% Conf. Interval]
-------------+----------------------------------------------------------------
     Treated |   6.322809   1.052621     6.01   0.000     4.181236    8.464383
------------------------------------------------------------------------------
(note:  named style v.small not found in class gsize, default attributes used)
(file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/figures/ITSA_diagnostic_delay_prais.gph not found)
file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/figures/ITSA_diagnostic_delay_prais.gph saved

.         graph export "$projectdir/output/figures/ITSA_diagnostic_delay_prais.svg", as(svg) replace      
(file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/figures/ITSA_diagnostic_delay_prais.svg not found)
file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/figures/ITSA_diagnostic_delay_prais.svg saved as SVG format

. 
. **Time from rheum referral to rheum appt (all diagnoses) with second cut point corresponding to Jan 2021 lockdown
. **Newey Standard Errors with 6 lags
. itsa p50_diag_delay if inrange(mo_year_diagn, tm(2019m3), tm(2022m3)), single trperiod(2020m3; 2021m1) lag(6) replace figure(title("", size(small)) subtitle("", size(medsmall)) ytitle("Median time to diagnosis, days", siz
> e(medsmall) margin(small)) ylabel(, nogrid) xtitle("Date of diagnosis", size(medsmall) margin(medsmall)) xlabel(710 "Mar 2019" 716 "Sep 2019" 722 "Mar 2020" 728 "Sep 2020" 734 "Mar 2021" 740 "Sep 2021" 746 "Mar 2022", nog
> rid) note("", size(v.small)) legend(off) saving("$projectdir/output/figures/ITSA_diagnostic_delay_newey_2cuts.gph", replace)) posttrend 



Time variable: mo_year_diagn, 2019m3 to 2022m3
        Delta: 1 month

Regression with Newey–West standard errors      Number of obs     =         37
Maximum lag = 6                                 F(  5,        31) =     202.36
                                                Prob > F          =     0.0000

------------------------------------------------------------------------------
             |             Newey–West
_p50_diag_~y | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
          _t |   7.396853   .9578481     7.72   0.000     5.443309    9.350397
    _x2020m3 |  -6.925758   8.564354    -0.81   0.425    -24.39287    10.54136
  _x_t2020m3 |  -2.451399   1.131104    -2.17   0.038    -4.758301   -.1444965
    _x2021m1 |      16.65   18.41737     0.90   0.373    -20.91248    54.21248
  _x_t2021m1 |   .7188312   2.246024     0.32   0.751    -3.861966    5.299628
       _cons |    101.609   5.338091    19.03   0.000     90.72187    112.4961
------------------------------------------------------------------------------


                    Postintervention Linear Trend: 2020m3

Treated: _b[_t]+_b[_x_t2020m3]
------------------------------------------------------------------------------
Linear Trend |      Coef.   Std. Err.      t              [95% Conf. Interval]
-------------+----------------------------------------------------------------
     Treated |   4.945455   .6269726     7.89   0.000     3.666735    6.224174
------------------------------------------------------------------------------


                    Postintervention Linear Trend: 2021m1

Treated: _b[_t]+_b[_x_t2020m3]+_b[_x_t2021m1]
------------------------------------------------------------------------------
Linear Trend |      Coef.   Std. Err.      t              [95% Conf. Interval]
-------------+----------------------------------------------------------------
     Treated |   5.664286   2.264372     2.50   0.018     1.046068     10.2825
------------------------------------------------------------------------------
(note:  named style v.small not found in class gsize, default attributes used)
(file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/figures/ITSA_diagnostic_delay_newey_2cuts.gph not found)
file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/figures/ITSA_diagnostic_delay_newey_2cuts.gph saved

.         graph export "$projectdir/output/figures/ITSA_diagnostic_delay_newey_2cuts.svg", as(svg) replace
(file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/figures/ITSA_diagnostic_delay_newey_2cuts.svg not found)
file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/figures/ITSA_diagnostic_delay_newey_2cuts.svg saved as SVG format

. actest, lag(18) 

Cumby-Huizinga test for autocorrelation (Breusch-Godfrey)
  H0: variable is MA process up to order q
  HA: serial correlation present at specified lags >q
-----------------------------------------------------------------------------
  H0: q=0 (serially uncorrelated)        |  H0: q=specified lag-1
  HA: s.c. present at range specified    |  HA: s.c. present at lag specified
-----------------------------------------+-----------------------------------
    lags   |      chi2      df     p-val | lag |      chi2      df     p-val
-----------+-----------------------------+-----+-----------------------------
   1 -  1  |      0.232      1    0.6303 |   1 |      0.232      1    0.6303
   1 -  2  |      0.254      2    0.8806 |   2 |      0.042      1    0.8373
   1 -  3  |      5.377      3    0.1462 |   3 |      5.230      1    0.0222
   1 -  4  |      5.623      4    0.2291 |   4 |      0.017      1    0.8970
   1 -  5  |      5.663      5    0.3404 |   5 |      0.123      1    0.7257
   1 -  6  |      6.144      6    0.4073 |   6 |      0.113      1    0.7363
   1 -  7  |      8.516      7    0.2893 |   7 |      0.240      1    0.6244
   1 -  8  |      8.631      8    0.3744 |   8 |      0.233      1    0.6290
   1 -  9  |     14.823      9    0.0959 |   9 |      2.835      1    0.0922
   1 - 10  |     16.067      10   0.0977 |  10 |      0.389      1*   0.5330
   1 - 11  |     17.381      11   0.0971 |  11 |      1.036      1*   0.3088
   1 - 12  |     18.315      12   0.1065 |  12 |      0.972      1*   0.3242
   1 - 13  |     19.664      13   0.1039 |  13 |      0.160      1*   0.6891
   1 - 14  |     22.454      14   0.0698 |  14 |      0.468      1*   0.4937
   1 - 15  |     23.022      15   0.0837 |  15 |      0.449      1*   0.5027
   1 - 16  |     23.153      16   0.1097 |  16 |      0.354      1    0.5516
   1 - 17  |     26.376      17   0.0679 |  17 |      0.394      1    0.5301
   1 - 18  |     28.524      18   0.0545 |  18 |      1.134      1    0.2870
-----------------------------------------------------------------------------
  Test allows predetermined regressors/instruments
  Test requires conditional homoskedasticity
  * Eigenvalues adjusted to make matrix positive semidefinite

. 
. **Prais-Winsten 
. itsa p50_diag_delay if inrange(mo_year_diagn, tm(2019m3), tm(2022m3)), single trperiod(2020m3; 2021m1) replace prais rhotype(tscorr) vce(robust) figure(title("", size(small)) subtitle("", size(medsmall)) ytitle("Median ti
> me to diagnosis, days", size(medsmall) margin(small)) ylabel(, nogrid) xtitle("Date of diagnosis", size(medsmall) margin(medsmall)) xlabel(710 "Mar 2019" 716 "Sep 2019" 722 "Mar 2020" 728 "Sep 2020" 734 "Mar 2021" 740 "Se
> p 2021" 746 "Mar 2022", nogrid) note("", size(v.small)) legend(off) saving("$projectdir/output/figures/ITSA_diagnostic_delay_prais_2cuts.gph", replace)) posttrend 



Time variable: mo_year_diagn, 2019m3 to 2022m3
        Delta: 1 month

Iteration 0:   rho = 0.0000
Iteration 1:   rho = -0.0596
Iteration 2:   rho = -0.0650
Iteration 3:   rho = -0.0655
Iteration 4:   rho = -0.0655
Iteration 5:   rho = -0.0655
Iteration 6:   rho = -0.0655

Prais–Winsten AR(1) regression with iterated estimates

Linear regression                               Number of obs     =         37
                                                F(5, 31)          =      58.17
                                                Prob > F          =     0.0000
                                                R-squared         =     0.8717
                                                Root MSE          =     29.859

------------------------------------------------------------------------------
             |             Semirobust
_p50_diag_~y | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
          _t |   7.421554   1.530524     4.85   0.000      4.30003    10.54308
    _x2020m3 |  -7.435771   16.17483    -0.46   0.649    -40.42455    25.55301
  _x_t2020m3 |  -2.444834   2.021198    -1.21   0.236    -6.567094    1.677426
    _x2021m1 |   17.39043   19.86747     0.88   0.388    -23.12953     57.9104
  _x_t2021m1 |    .516801   3.128271     0.17   0.870     -5.86335    6.896952
       _cons |   101.5816   8.498661    11.95   0.000     84.24846    118.9147
-------------+----------------------------------------------------------------
         rho |  -.0655082
------------------------------------------------------------------------------
Durbin–Watson statistic (original)    = 1.798413
Durbin–Watson statistic (transformed) = 1.716346


                    Postintervention Linear Trend: 2020m3

Treated: _b[_t]+_b[_x_t2020m3]
------------------------------------------------------------------------------
Linear Trend |      Coef.   Std. Err.      t              [95% Conf. Interval]
-------------+----------------------------------------------------------------
     Treated |   4.976719   1.356735     3.67   0.001      2.20964    7.743799
------------------------------------------------------------------------------


                    Postintervention Linear Trend: 2021m1

Treated: _b[_t]+_b[_x_t2020m3]+_b[_x_t2021m1]
------------------------------------------------------------------------------
Linear Trend |      Coef.   Std. Err.      t              [95% Conf. Interval]
-------------+----------------------------------------------------------------
     Treated |    5.49352   2.872621     1.91   0.065    -.3652278    11.35227
------------------------------------------------------------------------------
(note:  named style v.small not found in class gsize, default attributes used)
(file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/figures/ITSA_diagnostic_delay_prais_2cuts.gph not found)
file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/figures/ITSA_diagnostic_delay_prais_2cuts.gph saved

.         graph export "$projectdir/output/figures/ITSA_diagnostic_delay_prais_2cuts.svg", as(svg) replace        
(file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/figures/ITSA_diagnostic_delay_prais_2cuts.svg not found)
file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/figures/ITSA_diagnostic_delay_prais_2cuts.svg saved as SVG format

. restore

. 
. **Sensitivity analysis using time from last GP (pre-rheum appt) to rheum appt (all diagnoses)
. preserve

. keep if time_gp_rheum_appt!=. //drop those with no rheum ref and/or rheum appt
(28,774 observations deleted)

. eststo X: estpost tabstat time_gp_rheum_appt, by(mo_year_diagn_s) stat(count p50 p75 p25 mean sd) 

Summary statistics: count p50 p75 p25 mean sd
     for variables: time_gp_rheum_appt
  by categories of: mo_year_diagn_s

mo_year_diag |  e(count)     e(p50)     e(p75)     e(p25)    e(mean)      e(sd) 
-------------+------------------------------------------------------------------
     2019m03 |        36      123.5      192.5       63.5   128.9444   83.72607 
     2019m04 |        48        101        174         54   129.2083   97.91246 
     2019m05 |        54        153        214         85   158.3333   92.53597 
     2019m06 |        55        129        248         53   154.3273   108.2023 
     2019m07 |        60        128      177.5       60.5   138.3333    94.8177 
     2019m08 |        79        135        267         59   174.8354   136.1301 
     2019m09 |        71        177        274        103   193.7465   120.3955 
     2019m10 |        81        163        269         69   176.1358   123.5462 
     2019m11 |       103        138        297         80   184.0485   138.8404 
     2019m12 |        95        159        311         51   191.9684   156.3332 
     2020m01 |       110      189.5        330         96   217.8273   159.1763 
     2020m02 |        93        172        320         79   210.9032      157.2 
     2020m03 |       125        196        298         99    215.624   153.2821 
     2020m04 |       115        171        344         61   217.2174   167.1221 
     2020m05 |       120        158      271.5       80.5   201.6917   158.7516 
     2020m06 |       148        184        316         90   228.2027   179.8686 
     2020m07 |       145        197        386        101   251.7103   185.1827 
     2020m08 |       137        174        354         83   237.5693   192.5624 
     2020m09 |       136      191.5        374         76   256.4559   215.7585 
     2020m10 |       145        215        354         98   250.1862   178.9463 
     2020m11 |       171        272        430        108   282.0409   205.7413 
     2020m12 |       169        240        446         87   287.7929   234.6553 
     2021m01 |       174      227.5        380         99   263.2184   200.3475 
     2021m02 |       168      243.5      470.5        115   315.8393   245.4186 
     2021m03 |       170      276.5        426        122   299.1824   214.1054 
     2021m04 |       180      241.5        400        102   285.1167   219.7136 
     2021m05 |       198      243.5        442        107   307.8081   252.7481 
     2021m06 |       196      256.5        474         99   314.0153   246.2611 
     2021m07 |       203        285        455        135   328.2808   234.4802 
     2021m08 |       209        274        507        129    332.177   255.9602 
     2021m09 |       208      277.5      522.5      143.5   353.7644   274.2513 
     2021m10 |       200        290        546        141     350.91   266.5712 
     2021m11 |       200        300      579.5        127    375.275   289.5464 
     2021m12 |       229        272        568        110   363.4847   306.0689 
     2022m01 |       217        270        611        122   378.7327   315.7284 
     2022m02 |       232      281.5      516.5      118.5   349.8664   290.9394 
     2022m03 |        14      444.5        586        106   357.2857   263.2943 
-------------+------------------------------------------------------------------
       Total |      5094        224        405         98   281.8567   235.1645 

. esttab X using "$projectdir/output/tables/diagnostic_delay_GP_rheum_appt.csv", cells("count p50 p75 p25 mean sd") replace plain nomtitle noobs
(file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/tables/diagnostic_delay_GP_rheum_appt.csv not found)
(output written to C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/tables/diagnostic_delay_GP_rheum_appt.csv)

. collapse (p50) p50_diag_delay=time_gp_rheum_appt (p75) p75_diag_delay=time_gp_rheum_appt (p25) p25_diag_delay=time_gp_rheum_appt (mean) mean_diag_delay=time_gp_rheum_appt (sd) sd_diag_delay=time_gp_rheum_appt (count) n_di
> ag_delay=time_gp_rheum_appt, by(mo_year_diagn)

. 
. tsset mo_year_diagn

Time variable: mo_year_diagn, 2019m3 to 2022m3
        Delta: 1 month

. 
. **Newey Standard Errors with 6 lags
. itsa p50_diag_delay if inrange(mo_year_diagn, tm(2019m3), tm(2022m3)), single trperiod(2020m3) lag(6) replace figure(title("", size(small)) subtitle("", size(medsmall)) ytitle("Median time to diagnosis, days", size(medsma
> ll) margin(small)) ylabel(, nogrid) xtitle("Date of diagnosis", size(medsmall) margin(medsmall)) xlabel(710 "Mar 2019" 716 "Sep 2019" 722 "Mar 2020" 728 "Sep 2020" 734 "Mar 2021" 740 "Sep 2021" 746 "Mar 2022", nogrid) not
> e("", size(v.small)) legend(off) saving("$projectdir/output/figures/ITSA_diagnostic_delay_GP_newey.gph", replace)) posttrend 



Time variable: mo_year_diagn, 2019m3 to 2022m3
        Delta: 1 month

Regression with Newey–West standard errors      Number of obs     =         37
Maximum lag = 6                                 F(  3,        33) =     202.45
                                                Prob > F          =     0.0000

------------------------------------------------------------------------------
             |             Newey–West
_p50_diag_~y | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
          _t |   5.468531   .4584894    11.93   0.000     4.535728    6.401335
    _x2020m3 |  -15.79571   8.641841    -1.83   0.077    -33.37767    1.786247
  _x_t2020m3 |   1.214545     .92358     1.32   0.198    -.6644921    3.093583
       _cons |   117.2564   2.909482    40.30   0.000      111.337    123.1758
------------------------------------------------------------------------------


                    Postintervention Linear Trend: 2020m3

Treated: _b[_t]+_b[_x_t2020m3]
------------------------------------------------------------------------------
Linear Trend |      Coef.   Std. Err.      t              [95% Conf. Interval]
-------------+----------------------------------------------------------------
     Treated |   6.683077   .8072705     8.28   0.000     5.040673    8.325481
------------------------------------------------------------------------------
(note:  named style v.small not found in class gsize, default attributes used)
(file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/figures/ITSA_diagnostic_delay_GP_newey.gph not found)
file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/figures/ITSA_diagnostic_delay_GP_newey.gph saved

.         graph export "$projectdir/output/figures/ITSA_diagnostic_delay_GP_newey.svg", as(svg) replace
(file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/figures/ITSA_diagnostic_delay_GP_newey.svg not found)
file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/figures/ITSA_diagnostic_delay_GP_newey.svg saved as SVG format

. actest, lag(18) 

Cumby-Huizinga test for autocorrelation (Breusch-Godfrey)
  H0: variable is MA process up to order q
  HA: serial correlation present at specified lags >q
-----------------------------------------------------------------------------
  H0: q=0 (serially uncorrelated)        |  H0: q=specified lag-1
  HA: s.c. present at range specified    |  HA: s.c. present at lag specified
-----------------------------------------+-----------------------------------
    lags   |      chi2      df     p-val | lag |      chi2      df     p-val
-----------+-----------------------------+-----+-----------------------------
   1 -  1  |      0.188      1    0.6646 |   1 |      0.188      1    0.6646
   1 -  2  |      5.540      2    0.0627 |   2 |      5.561      1    0.0184
   1 -  3  |      7.686      3    0.0530 |   3 |      2.055      1    0.1517
   1 -  4  |      8.206      4    0.0843 |   4 |      1.560      1    0.2117
   1 -  5  |      9.528      5    0.0898 |   5 |      0.357      1    0.5504
   1 -  6  |     10.045      6    0.1228 |   6 |      1.450      1    0.2284
   1 -  7  |     11.238      7    0.1286 |   7 |      0.438      1    0.5079
   1 -  8  |     11.510      8    0.1744 |   8 |      2.471      1*   0.1159
   1 -  9  |     12.039      9    0.2111 |   9 |      0.052      1    0.8202
   1 - 10  |     12.078      10   0.2798 |  10 |      0.354      1    0.5517
   1 - 11  |     15.520      11   0.1599 |  11 |      1.867      1    0.1718
   1 - 12  |     15.667      12   0.2070 |  12 |      0.853      1*   0.3556
   1 - 13  |     17.442      13   0.1799 |  13 |      0.061      1*   0.8048
   1 - 14  |     21.148      14   0.0979 |  14 |      0.343      1*   0.5578
   1 - 15  |     26.521      15   0.0329 |  15 |      0.279      1*   0.5973
   1 - 16  |     27.620      16   0.0351 |  16 |      5.721      1*   0.0168
   1 - 17  |     28.714      17   0.0373 |  17 |      0.877      1    0.3490
   1 - 18  |     28.794      18   0.0510 |  18 |      0.448      1    0.5032
-----------------------------------------------------------------------------
  Test allows predetermined regressors/instruments
  Test requires conditional homoskedasticity
  * Eigenvalues adjusted to make matrix positive semidefinite

. 
. **Prais-Winsten 
. itsa p50_diag_delay if inrange(mo_year_diagn, tm(2019m3), tm(2022m3)), single trperiod(2020m3) replace prais rhotype(tscorr) vce(robust) figure(title("", size(small)) subtitle("", size(medsmall)) ytitle("Median time to di
> agnosis, days", size(medsmall) margin(small)) ylabel(, nogrid) xtitle("Date of diagnosis", size(medsmall) margin(medsmall)) xlabel(710 "Mar 2019" 716 "Sep 2019" 722 "Mar 2020" 728 "Sep 2020" 734 "Mar 2021" 740 "Sep 2021" 
> 746 "Mar 2022", nogrid) note("", size(v.small)) legend(off) saving("$projectdir/output/figures/ITSA_diagnostic_delay_GP_prais.gph", replace)) posttrend 



Time variable: mo_year_diagn, 2019m3 to 2022m3
        Delta: 1 month

Iteration 0:   rho = 0.0000
Iteration 1:   rho = -0.0472
Iteration 2:   rho = -0.0506
Iteration 3:   rho = -0.0509
Iteration 4:   rho = -0.0509
Iteration 5:   rho = -0.0509

Prais–Winsten AR(1) regression with iterated estimates

Linear regression                               Number of obs     =         37
                                                F(3, 33)          =      58.60
                                                Prob > F          =     0.0000
                                                R-squared         =     0.8480
                                                Root MSE          =     29.274

------------------------------------------------------------------------------
             |             Semirobust
_p50_diag_~y | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
          _t |    5.54622   1.224579     4.53   0.000     3.054794    8.037645
    _x2020m3 |  -16.20646   14.76923    -1.10   0.280    -46.25468    13.84176
  _x_t2020m3 |    1.09578   1.764758     0.62   0.539    -2.494648    4.686208
       _cons |   116.9357   8.638734    13.54   0.000      99.3601    134.5114
-------------+----------------------------------------------------------------
         rho |  -.0508915
------------------------------------------------------------------------------
Durbin–Watson statistic (original)    = 1.610576
Durbin–Watson statistic (transformed) = 1.598818


                    Postintervention Linear Trend: 2020m3

Treated: _b[_t]+_b[_x_t2020m3]
------------------------------------------------------------------------------
Linear Trend |      Coef.   Std. Err.      t              [95% Conf. Interval]
-------------+----------------------------------------------------------------
     Treated |      6.642   1.282349     5.18   0.000     4.033041    9.250959
------------------------------------------------------------------------------
(note:  named style v.small not found in class gsize, default attributes used)
(file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/figures/ITSA_diagnostic_delay_GP_prais.gph not found)
file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/figures/ITSA_diagnostic_delay_GP_prais.gph saved

.         graph export "$projectdir/output/figures/ITSA_diagnostic_delay_GP_prais.svg", as(svg) replace   
(file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/figures/ITSA_diagnostic_delay_GP_prais.svg not found)
file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/figures/ITSA_diagnostic_delay_GP_prais.svg saved as SVG format

. restore

. 
. **Sensitivity analyses using combination of time from rheum ref to rheum appt; or, if no ref present, time from last GP appt to rheum appt (all diagnoses)
. preserve

. keep if time_refgp_rheum_appt!=. //drop those with no rheum ref and/or rheum appt
(25,482 observations deleted)

. eststo X: estpost tabstat time_refgp_rheum_appt, by(mo_year_diagn_s) stat(count p50 p75 p25 mean sd) 

Summary statistics: count p50 p75 p25 mean sd
     for variables: time_refgp_rheum_appt
  by categories of: mo_year_diagn_s

mo_year_diag |  e(count)     e(p50)     e(p75)     e(p25)    e(mean)      e(sd) 
-------------+------------------------------------------------------------------
     2019m03 |        70      108.5        181         57      120.7   84.45037 
     2019m04 |        89        114        190         58   133.7753   96.35573 
     2019m05 |        97        129        209         60        139   87.25442 
     2019m06 |       101        128        210         67   148.3267   103.7749 
     2019m07 |       118        128        199         65   147.1102   105.5279 
     2019m08 |       133        128        251         59   161.1805   127.4895 
     2019m09 |       157        154        271         62    175.535    125.812 
     2019m10 |       142      156.5        291         69   184.5704   137.8996 
     2019m11 |       151        159        259         71   182.5166    136.281 
     2019m12 |       162        160        320         78   201.4444   155.8654 
     2020m01 |       194      177.5        322         71    205.268   156.0222 
     2020m02 |       162        153        308         66    204.321   159.6515 
     2020m03 |       211        182        293         82   206.6209   155.4325 
     2020m04 |       213        175        332         77   221.1408   169.5051 
     2020m05 |       207        199        350        101   236.8599   169.5551 
     2020m06 |       235        160        317         78   219.6851   178.9992 
     2020m07 |       237        205        368         85   243.0549   187.8715 
     2020m08 |       227        172        349         92   236.1101   192.9267 
     2020m09 |       234        205        351        104   250.8034   186.0312 
     2020m10 |       243        208        373         96   257.8519   200.1766 
     2020m11 |       270        220        409         86   260.5667   195.1839 
     2020m12 |       291        227        420         82   272.0756   218.4261 
     2021m01 |       300      244.5        387        116     273.48    195.515 
     2021m02 |       288      240.5        453        109   299.1667   230.2071 
     2021m03 |       277        280        453        122   313.0036   232.5901 
     2021m04 |       302      248.5        414        108   294.5331   227.9859 
     2021m05 |       311        257        481        110   314.2926   255.0161 
     2021m06 |       303        225        455         96   294.5314   246.7557 
     2021m07 |       314      283.5        463        128   328.5255   240.2718 
     2021m08 |       336        228      445.5        112   299.9464   238.5819 
     2021m09 |       316      259.5        457        133   317.3323   239.9483 
     2021m10 |       309        277        538        135   352.6472   274.9463 
     2021m11 |       295        288        535        111   346.1797   277.8822 
     2021m12 |       378        250        482        116   331.9762   272.5762 
     2022m01 |       347        253        493        127   341.4467    286.324 
     2022m02 |       348      276.5        484      109.5   335.7328   275.0038 
     2022m03 |        18        418        562        151   397.8889   259.4836 
-------------+------------------------------------------------------------------
       Total |      8386        212        391         95   269.7406   224.3894 

. esttab X using "$projectdir/output/tables/diagnostic_delay_GPref_rheum_appt.csv", cells("count p50 p75 p25 mean sd") replace plain nomtitle noobs
(file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/tables/diagnostic_delay_GPref_rheum_appt.csv not found)
(output written to C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/tables/diagnostic_delay_GPref_rheum_appt.csv)

. collapse (p50) p50_diag_delay=time_refgp_rheum_appt (p75) p75_diag_delay=time_refgp_rheum_appt (p25) p25_diag_delay=time_refgp_rheum_appt (mean) mean_diag_delay=time_refgp_rheum_appt (sd) sd_diag_delay=time_refgp_rheum_ap
> pt (count) n_diag_delay=time_refgp_rheum_appt, by(mo_year_diagn)

. 
. tsset mo_year_diagn

Time variable: mo_year_diagn, 2019m3 to 2022m3
        Delta: 1 month

. 
. **Newey Standard Errors with 6 lags
. itsa p50_diag_delay if inrange(mo_year_diagn, tm(2019m3), tm(2022m3)), single trperiod(2020m3) lag(6) replace figure(title("", size(small)) subtitle("", size(medsmall)) ytitle("Median time to diagnosis, days", size(medsma
> ll) margin(small)) ylabel(, nogrid) xtitle("Date of diagnosis", size(medsmall) margin(medsmall)) xlabel(710 "Mar 2019" 716 "Sep 2019" 722 "Mar 2020" 728 "Sep 2020" 734 "Mar 2021" 740 "Sep 2021" 746 "Mar 2022", nogrid) not
> e("", size(v.small)) legend(off) saving("$projectdir/output/figures/ITSA_diagnostic_delay_GPref_newey.gph", replace)) posttrend 



Time variable: mo_year_diagn, 2019m3 to 2022m3
        Delta: 1 month

Regression with Newey–West standard errors      Number of obs     =         37
Maximum lag = 6                                 F(  3,        33) =     215.22
                                                Prob > F          =     0.0000

------------------------------------------------------------------------------
             |             Newey–West
_p50_diag_~y | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
          _t |    5.40035   .4810183    11.23   0.000     4.421711    6.378989
    _x2020m3 |  -5.472401   8.276343    -0.66   0.513    -22.31075    11.36595
  _x_t2020m3 |   .2961888   .9476722     0.31   0.757    -1.631865    2.224242
       _cons |   111.5897   2.297632    48.57   0.000     106.9152    116.2643
------------------------------------------------------------------------------


                    Postintervention Linear Trend: 2020m3

Treated: _b[_t]+_b[_x_t2020m3]
------------------------------------------------------------------------------
Linear Trend |      Coef.   Std. Err.      t              [95% Conf. Interval]
-------------+----------------------------------------------------------------
     Treated |   5.696538   .8324846     6.84   0.000     4.002836    7.390241
------------------------------------------------------------------------------
(note:  named style v.small not found in class gsize, default attributes used)
(file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/figures/ITSA_diagnostic_delay_GPref_newey.gph not found)
file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/figures/ITSA_diagnostic_delay_GPref_newey.gph saved

.         graph export "$projectdir/output/figures/ITSA_diagnostic_delay_GPref_newey.svg", as(svg) replace
(file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/figures/ITSA_diagnostic_delay_GPref_newey.svg not found)
file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/figures/ITSA_diagnostic_delay_GPref_newey.svg saved as SVG format

. actest, lag(18) 

Cumby-Huizinga test for autocorrelation (Breusch-Godfrey)
  H0: variable is MA process up to order q
  HA: serial correlation present at specified lags >q
-----------------------------------------------------------------------------
  H0: q=0 (serially uncorrelated)        |  H0: q=specified lag-1
  HA: s.c. present at range specified    |  HA: s.c. present at lag specified
-----------------------------------------+-----------------------------------
    lags   |      chi2      df     p-val | lag |      chi2      df     p-val
-----------+-----------------------------+-----+-----------------------------
   1 -  1  |      0.629      1    0.4276 |   1 |      0.629      1    0.4276
   1 -  2  |      0.679      2    0.7120 |   2 |      0.024      1    0.8779
   1 -  3  |      6.328      3    0.0967 |   3 |      5.935      1    0.0148
   1 -  4  |      8.686      4    0.0694 |   4 |      3.076      1    0.0794
   1 -  5  |      8.777      5    0.1183 |   5 |      1.205      1    0.2722
   1 -  6  |      9.501      6    0.1473 |   6 |      0.000      1    0.9908
   1 -  7  |     14.282      7    0.0464 |   7 |      5.862      1    0.0155
   1 -  8  |     14.311      8    0.0740 |   8 |      1.547      1*   0.2136
   1 -  9  |     20.374      9    0.0157 |   9 |      9.210      1    0.0024
   1 - 10  |     22.372      10   0.0133 |  10 |      0.050      1*   0.8223
   1 - 11  |     27.021      11   0.0046 |  11 |      1.733      1*   0.1881
   1 - 12  |     27.070      12   0.0075 |  12 |      7.692      1*   0.0055
   1 - 13  |     28.935      13   0.0067 |  13 |      0.909      1*   0.3403
   1 - 14  |     30.448      14   0.0066 |  14 |      3.609      1*   0.0575
   1 - 15  |     30.794      15   0.0094 |  15 |      0.015      1    0.9012
   1 - 16  |     33.395      16   0.0065 |  16 |      2.046      1*   0.1526
   1 - 17  |     33.811      17   0.0089 |  17 |      0.119      1    0.7302
   1 - 18  |     33.937      18   0.0128 |  18 |      1.873      1    0.1711
-----------------------------------------------------------------------------
  Test allows predetermined regressors/instruments
  Test requires conditional homoskedasticity
  * Eigenvalues adjusted to make matrix positive semidefinite

. 
. **Prais-Winsten 
. itsa p50_diag_delay if inrange(mo_year_diagn, tm(2019m3), tm(2022m3)), single trperiod(2020m3) replace prais rhotype(tscorr) vce(robust) figure(title("", size(small)) subtitle("", size(medsmall)) ytitle("Median time to di
> agnosis, days", size(medsmall) margin(small)) ylabel(, nogrid) xtitle("Date of diagnosis", size(medsmall) margin(medsmall)) xlabel(710 "Mar 2019" 716 "Sep 2019" 722 "Mar 2020" 728 "Sep 2020" 734 "Mar 2021" 740 "Sep 2021" 
> 746 "Mar 2022", nogrid) note("", size(v.small)) legend(off) saving("$projectdir/output/figures/ITSA_diagnostic_delay_GPref_prais.gph", replace)) posttrend 



Time variable: mo_year_diagn, 2019m3 to 2022m3
        Delta: 1 month

Iteration 0:   rho = 0.0000
Iteration 1:   rho = -0.0851
Iteration 2:   rho = -0.0908
Iteration 3:   rho = -0.0911
Iteration 4:   rho = -0.0911
Iteration 5:   rho = -0.0911

Prais–Winsten AR(1) regression with iterated estimates

Linear regression                               Number of obs     =         37
                                                F(3, 33)          =     163.24
                                                Prob > F          =     0.0000
                                                R-squared         =     0.8590
                                                Root MSE          =     27.114

------------------------------------------------------------------------------
             |             Semirobust
_p50_diag_~y | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
          _t |   5.486156   .8032544     6.83   0.000     3.851923     7.12039
    _x2020m3 |  -5.844527   12.37419    -0.47   0.640       -31.02    19.33095
  _x_t2020m3 |   .1391117   1.385833     0.10   0.921    -2.680386     2.95861
       _cons |   111.3247   3.434651    32.41   0.000     104.3368    118.3125
-------------+----------------------------------------------------------------
         rho |  -.0910872
------------------------------------------------------------------------------
Durbin–Watson statistic (original)    = 1.673750
Durbin–Watson statistic (transformed) = 1.602951


                    Postintervention Linear Trend: 2020m3

Treated: _b[_t]+_b[_x_t2020m3]
------------------------------------------------------------------------------
Linear Trend |      Coef.   Std. Err.      t              [95% Conf. Interval]
-------------+----------------------------------------------------------------
     Treated |   5.625268    1.15902     4.85   0.000     3.267224    7.983312
------------------------------------------------------------------------------
(note:  named style v.small not found in class gsize, default attributes used)
(file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/figures/ITSA_diagnostic_delay_GPref_prais.gph not found)
file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/figures/ITSA_diagnostic_delay_GPref_prais.gph saved

.         graph export "$projectdir/output/figures/ITSA_diagnostic_delay_GPref_prais.svg", as(svg) replace        
(file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/figures/ITSA_diagnostic_delay_GPref_prais.svg not found)
file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/figures/ITSA_diagnostic_delay_GPref_prais.svg saved as SVG format

. restore

. 
. /*
> **Time from last GP appt to rheum referral (all diagnoses)
> preserve
> keep if time_gp_rheum_ref_appt!=. //drop those with no last GP appt and/or rheum ref
> eststo X: estpost tabstat time_gp_rheum_ref_appt, by(mo_year_diagn_s) stat(count p50 p75 p25 mean sd) 
> esttab X using "$projectdir/output/tables/referral_delay_GP_to_ref.csv", cells("count p50 p75 p25 mean sd") replace plain nomtitle noobs
> collapse (p50) p50_ref_delay=time_gp_rheum_ref_appt (p75) p75_ref_delay=time_gp_rheum_ref_appt (p25) p25_ref_delay=time_gp_rheum_ref_appt (mean) mean_ref_delay=time_gp_rheum_ref_appt (sd) sd_ref_delay=time_gp_rheum_ref_ap
> pt (count) n_ref_delay=time_gp_rheum_ref_appt, by(mo_year_diagn)
> 
> tsset mo_year_diagn
> 
> **Newey Standard Errors with 6 lags
> itsa p50_ref_delay if inrange(mo_year_diagn, tm(2019m3), tm(2022m3)), single trperiod(2020m3) lag(6) replace figure(title("", size(small)) subtitle("", size(medsmall)) ytitle("Median time to referral, days", size(medsmall
> ) margin(small)) ylabel(, nogrid) xtitle("Date of diagnosis", size(medsmall) margin(medsmall)) xlabel(710 "Mar 2019" 716 "Sep 2019" 722 "Mar 2020" 728 "Sep 2020" 734 "Mar 2021" 740 "Sep 2021" 746 "Mar 2022", nogrid) note(
> "", size(v.small)) legend(off) saving("$projectdir/output/figures/ITSA_referral_delay_newey.gph", replace)) posttrend 
>         graph export "$projectdir/output/figures/ITSA_referral_delay_newey.svg", as(svg) replace
> actest, lag(18) 
> 
> **Prais-Winsten 
> itsa p50_ref_delay if inrange(mo_year_diagn, tm(2019m3), tm(2022m3)), single trperiod(2020m3) replace prais rhotype(tscorr) vce(robust) figure(title("", size(small)) subtitle("", size(medsmall)) ytitle("Median time to ref
> erral, days", size(medsmall) margin(small)) ylabel(, nogrid) xtitle("Date of diagnosis", size(medsmall) margin(medsmall)) xlabel(710 "Mar 2019" 716 "Sep 2019" 722 "Mar 2020" 728 "Sep 2020" 734 "Mar 2021" 740 "Sep 2021" 74
> 6 "Mar 2022", nogrid) note("", size(v.small)) legend(off) saving("$projectdir/output/figures/ITSA_referral_delay_prais.gph", replace)) posttrend 
>         graph export "$projectdir/output/figures/ITSA_referral_delay_prais.svg", as(svg) replace        
> restore
> */
. 
. **Time from rheum appt to shared care csDMARD for RA patients (not including MTX high-cost drug) 
. preserve

. keep if time_to_csdmard!=. & ra_code==1 & has_6m_follow_up==1 //drop those with no rheum appt and/or csDMARD prescription; must have minimum of 6m follow-up after diagnosis
(30,777 observations deleted)

. eststo X: estpost tabstat time_to_csdmard, by(mo_year_diagn_s) stat(count p50 p75 p25 mean sd) 

Summary statistics: count p50 p75 p25 mean sd
     for variables: time_to_csdmard
  by categories of: mo_year_diagn_s

mo_year_diag |  e(count)     e(p50)     e(p75)     e(p25)    e(mean)      e(sd) 
-------------+------------------------------------------------------------------
     2019m03 |        78        476        817        294   561.0256   336.3068 
     2019m04 |        89        572        916        371   639.0899   372.8627 
     2019m05 |        95        505        758        303   557.2526   328.5163 
     2019m06 |        78      528.5        829        232   554.6026   349.3104 
     2019m07 |       103        444        763        238   523.3107   355.5059 
     2019m08 |        76      437.5        799      218.5   517.6184   361.8987 
     2019m09 |        86      566.5        744        298   564.5233   329.4539 
     2019m10 |        79        473        749        187   495.6076     334.47 
     2019m11 |        92      483.5        769      290.5   549.5326   335.9703 
     2019m12 |        82        589        866        349   612.9024   352.8202 
     2020m01 |       103        633        922        346   648.9029   357.0853 
     2020m02 |        82        488        798        302    560.622   357.6013 
     2020m03 |        82        609        876        286   610.4268   368.1073 
     2020m04 |        84      630.5      851.5      340.5   603.2024   345.5946 
     2020m05 |        97        518        853        244   571.5773   373.5622 
     2020m06 |        79        551        877        367   612.5063   355.3539 
     2020m07 |       108        489      718.5      237.5   481.4907   301.7244 
     2020m08 |        73        389        758        243   514.9178   346.6896 
     2020m09 |        75        537        691        328   556.9467   300.6815 
     2020m10 |        95        485        822        313   563.6316   357.4861 
     2020m11 |        79        653        941        429   659.0127   334.2343 
     2020m12 |       101        516        784        266   549.6337   328.3562 
     2021m01 |        80      511.5        813        300   564.2375    350.474 
     2021m02 |        78        548        877        305   589.7308   346.5623 
     2021m03 |        65        599        839        386   606.8462   305.1205 
     2021m04 |       103        553        841        319   593.3495   335.0517 
     2021m05 |        86        491        806        309   554.5698   344.0733 
     2021m06 |        68        553      774.5        340   584.4118   337.0982 
     2021m07 |        89        496        806        285   551.1348   356.3914 
     2021m08 |        92        575        966      258.5    595.913   388.6639 
     2021m09 |        89        532        766        318   558.2472   317.0455 
     2021m10 |        76      601.5        873        402   640.7763   324.2727 
     2021m11 |        84      575.5        866        367   642.3214   372.8542 
     2021m12 |        89        562        805        234   554.5506   367.8138 
     2022m01 |        95        488        813        285   551.2105   335.9958 
     2022m02 |        77        500        871        290   569.3247   340.2881 
     2022m03 |         4        162        655        132      393.5   499.6729 
-------------+------------------------------------------------------------------
       Total |      3091        530        819        298   572.9259   346.2621 

. esttab X using "$projectdir/output/tables/csDMARD_delay_RA.csv", cells("count p50 p75 p25 mean sd") replace plain nomtitle noobs
(file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/tables/csDMARD_delay_RA.csv not found)
(output written to C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/tables/csDMARD_delay_RA.csv)

. collapse (p50) p50_csdmard_delay=time_to_csdmard (p75) p75_csdmard_delay=time_to_csdmard (p25) p25_csdmard_delay=time_to_csdmard (mean) mean_csdmard_delay=time_to_csdmard (sd) sd_csdmard_delay=time_to_csdmard (count) n_cs
> dmard_delay=time_to_csdmard, by(mo_year_diagn)

. 
. tsset mo_year_diagn

Time variable: mo_year_diagn, 2019m3 to 2022m3
        Delta: 1 month

. 
. **Newey Standard Errors with 6 lags
. itsa p50_csdmard_delay if inrange(mo_year_diagn, tm(2019m3), tm(2022m3)), single trperiod(2020m3) lag(6) replace figure(title("", size(small)) subtitle("", size(medsmall)) ytitle("Median time to csDMARD, days", size(medsm
> all) margin(small)) ylabel(, nogrid) xtitle("Date of diagnosis", size(medsmall) margin(medsmall)) xlabel(710 "Mar 2019" 716 "Sep 2019" 722 "Mar 2020" 728 "Sep 2020" 734 "Mar 2021" 740 "Sep 2021" 746 "Mar 2022", nogrid) no
> te("", size(v.small)) legend(off) saving("$projectdir/output/figures/ITSA_csDMARD_delay_newey_ra.gph", replace)) posttrend 



Time variable: mo_year_diagn, 2019m3 to 2022m3
        Delta: 1 month

Regression with Newey–West standard errors      Number of obs     =         37
Maximum lag = 6                                 F(  3,        33) =       1.38
                                                Prob > F          =     0.2661

------------------------------------------------------------------------------
             |             Newey–West
_p50_csdma~y | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
          _t |   4.405594    3.13668     1.40   0.170     -1.97603    10.78722
    _x2020m3 |   25.75953    37.1765     0.69   0.493    -49.87662    101.3957
  _x_t2020m3 |  -8.216364   4.638865    -1.77   0.086    -17.65421    1.221478
       _cons |   492.1026   19.20791    25.62   0.000     453.0238    531.1813
------------------------------------------------------------------------------


                    Postintervention Linear Trend: 2020m3

Treated: _b[_t]+_b[_x_t2020m3]
------------------------------------------------------------------------------
Linear Trend |      Coef.   Std. Err.      t              [95% Conf. Interval]
-------------+----------------------------------------------------------------
     Treated |  -3.810769   3.161917    -1.21   0.237    -10.24374    2.622199
------------------------------------------------------------------------------
(note:  named style v.small not found in class gsize, default attributes used)
(file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/figures/ITSA_csDMARD_delay_newey_ra.gph not found)
file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/figures/ITSA_csDMARD_delay_newey_ra.gph saved

.         graph export "$projectdir/output/figures/ITSA_csDMARD_delay_newey_ra.svg", replace
(file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/figures/ITSA_csDMARD_delay_newey_ra.svg not found)
file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/figures/ITSA_csDMARD_delay_newey_ra.svg saved as SVG format

. actest, lag(18) 

Cumby-Huizinga test for autocorrelation (Breusch-Godfrey)
  H0: variable is MA process up to order q
  HA: serial correlation present at specified lags >q
-----------------------------------------------------------------------------
  H0: q=0 (serially uncorrelated)        |  H0: q=specified lag-1
  HA: s.c. present at range specified    |  HA: s.c. present at lag specified
-----------------------------------------+-----------------------------------
    lags   |      chi2      df     p-val | lag |      chi2      df     p-val
-----------+-----------------------------+-----+-----------------------------
   1 -  1  |      0.279      1    0.5976 |   1 |      0.279      1    0.5976
   1 -  2  |      0.654      2    0.7209 |   2 |      0.393      1    0.5310
   1 -  3  |      0.836      3    0.8408 |   3 |      0.154      1    0.6946
   1 -  4  |      1.731      4    0.7850 |   4 |      0.911      1    0.3399
   1 -  5  |      4.108      5    0.5339 |   5 |      2.599      1    0.1069
   1 -  6  |      4.613      6    0.5943 |   6 |      0.647      1    0.4210
   1 -  7  |      5.597      7    0.5875 |   7 |      1.158      1    0.2819
   1 -  8  |      5.697      8    0.6811 |   8 |      0.050      1    0.8227
   1 -  9  |      5.725      9    0.7671 |   9 |      0.006      1    0.9407
   1 - 10  |      5.733      10   0.8372 |  10 |      0.196      1    0.6583
   1 - 11  |      5.744      11   0.8899 |  11 |      0.146      1    0.7021
   1 - 12  |      6.712      12   0.8761 |  12 |      0.210      1    0.6466
   1 - 13  |      9.415      13   0.7409 |  13 |      0.650      1    0.4203
   1 - 14  |      9.704      14   0.7835 |  14 |      0.001      1    0.9819
   1 - 15  |     10.437      15   0.7914 |  15 |      0.469      1    0.4935
   1 - 16  |     22.023      16   0.1424 |  16 |      8.922      1    0.0028
   1 - 17  |     22.663      17   0.1605 |  17 |      0.591      1*   0.4419
   1 - 18  |     25.852      18   0.1032 |  18 |      0.000      1*   0.9963
-----------------------------------------------------------------------------
  Test allows predetermined regressors/instruments
  Test requires conditional homoskedasticity
  * Eigenvalues adjusted to make matrix positive semidefinite

. 
. **Prais-Winsten 
. itsa p50_csdmard_delay if inrange(mo_year_diagn, tm(2019m3), tm(2022m3)), single trperiod(2020m3) replace prais rhotype(tscorr) vce(robust) figure(title("", size(small)) subtitle("", size(medsmall)) ytitle("Median time to
>  csDMARD, days", size(medsmall) margin(small)) ylabel(, nogrid) xtitle("Date of diagnosis", size(medsmall) margin(medsmall)) xlabel(710 "Mar 2019" 716 "Sep 2019" 722 "Mar 2020" 728 "Sep 2020" 734 "Mar 2021" 740 "Sep 2021"
>  746 "Mar 2022", nogrid) note("", size(v.small))  legend(off) saving("$projectdir/output/figures/ITSA_csDMARD_delay_prais_ra.gph", replace)) posttrend 



Time variable: mo_year_diagn, 2019m3 to 2022m3
        Delta: 1 month

Iteration 0:   rho = 0.0000
Iteration 1:   rho = 0.0599
Iteration 2:   rho = 0.0672
Iteration 3:   rho = 0.0682
Iteration 4:   rho = 0.0684
Iteration 5:   rho = 0.0684
Iteration 6:   rho = 0.0684
Iteration 7:   rho = 0.0684

Prais–Winsten AR(1) regression with iterated estimates

Linear regression                               Number of obs     =         37
                                                F(3, 33)          =       0.96
                                                Prob > F          =     0.4215
                                                R-squared         =     0.0798
                                                Root MSE          =      83.72

------------------------------------------------------------------------------
             |             Semirobust
_p50_csdma~y | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
          _t |   4.173427    5.37377     0.78   0.443     -6.75959    15.10644
    _x2020m3 |   30.83791   57.47012     0.54   0.595    -86.08594    147.7618
  _x_t2020m3 |  -8.280083   6.601022    -1.25   0.219    -21.70996    5.149797
       _cons |   492.7124   29.36872    16.78   0.000     432.9613    552.4635
-------------+----------------------------------------------------------------
         rho |   .0684051
------------------------------------------------------------------------------
Durbin–Watson statistic (original)    = 1.446552
Durbin–Watson statistic (transformed) = 1.523414


                    Postintervention Linear Trend: 2020m3

Treated: _b[_t]+_b[_x_t2020m3]
------------------------------------------------------------------------------
Linear Trend |      Coef.   Std. Err.      t              [95% Conf. Interval]
-------------+----------------------------------------------------------------
     Treated |  -4.106656   3.714085    -1.11   0.277    -11.66302    3.449707
------------------------------------------------------------------------------
(note:  named style v.small not found in class gsize, default attributes used)
(file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/figures/ITSA_csDMARD_delay_prais_ra.gph not found)
file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/figures/ITSA_csDMARD_delay_prais_ra.gph saved

.         graph export "$projectdir/output/figures/ITSA_csDMARD_delay_prais_ra.svg", replace      
(file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/figures/ITSA_csDMARD_delay_prais_ra.svg not found)
file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/figures/ITSA_csDMARD_delay_prais_ra.svg saved as SVG format

. restore

. 
. **Time from rheum appt to shared care csDMARD for PsA patients (not including MTX high-cost drug)
. preserve

. keep if time_to_csdmard!=. & psa_code==1 & has_6m_follow_up==1 //drop those with no rheum appt and/or csDMARD prescription; must have minimum of 6m follow-up after diagnosis
(30,835 observations deleted)

. eststo X: estpost tabstat time_to_csdmard, by(mo_year_diagn_s) stat(count p50 p75 p25 mean sd) 

Summary statistics: count p50 p75 p25 mean sd
     for variables: time_to_csdmard
  by categories of: mo_year_diagn_s

mo_year_diag |  e(count)     e(p50)     e(p75)     e(p25)    e(mean)      e(sd) 
-------------+------------------------------------------------------------------
     2019m03 |       105        532        786        269   559.8381    344.778 
     2019m04 |        85        453        675        253   494.0118   318.4839 
     2019m05 |        90        521        835        321   571.7778   333.0066 
     2019m06 |        81        514        782        265   542.0494   331.7509 
     2019m07 |        81        653        926        399   664.6543   325.3959 
     2019m08 |        80        607      917.5      298.5      606.8   353.3242 
     2019m09 |        88        485        716        251   511.2273   311.3957 
     2019m10 |        72      549.5      812.5        326   576.7778   339.7505 
     2019m11 |        81        591        821        328        606   376.9124 
     2019m12 |        75        600        876        296   606.1333   363.5082 
     2020m01 |        92        523        735      264.5   525.3043   314.3847 
     2020m02 |        90      531.5        823        283   569.6778    347.242 
     2020m03 |        88      599.5      920.5      262.5   605.2045   375.7926 
     2020m04 |        95        586        981        295   624.2526   387.7689 
     2020m05 |        73        517        829        295   582.4795   368.2068 
     2020m06 |        80      458.5      772.5      256.5   535.9625    368.074 
     2020m07 |        69        631       1005        327   629.3768   395.3869 
     2020m08 |        89        429        741        225   501.8876    349.651 
     2020m09 |        82        403        720        194   498.2805   372.5912 
     2020m10 |        88        438        765      233.5     508.25   330.0706 
     2020m11 |        69        411        663        264   468.6667   296.8213 
     2020m12 |        74        620        784        234   578.8378   349.0582 
     2021m01 |        99        501        808        226   523.0404     330.18 
     2021m02 |        74      466.5        610        318   520.2432   268.7388 
     2021m03 |        86      559.5        892        330      613.5    378.561 
     2021m04 |        81        441        726        265   501.0617   310.0687 
     2021m05 |        78        517        777        248   535.8846   336.9408 
     2021m06 |        91        569        752        313   570.1758   333.1401 
     2021m07 |        86      521.5        790        334   573.7442   331.3196 
     2021m08 |        81        700        884        300   624.0988   366.0262 
     2021m09 |        83        494        774        320   550.2169   316.5552 
     2021m10 |        85        446        787        224   529.1059   371.3936 
     2021m11 |        74        557        830        319   591.7568   327.5718 
     2021m12 |       104        609      914.5      247.5   603.3654   387.1681 
     2022m01 |        92        472        903        266   582.0326   379.1321 
     2022m02 |        90        483        813        282   554.0222   338.9915 
     2022m03 |         2      177.5        341         14      177.5   231.2239 
-------------+------------------------------------------------------------------
       Total |      3033        517        823        274   561.8678   347.8064 

. esttab X using "$projectdir/output/tables/csDMARD_delay_PsA.csv", cells("count p50 p75 p25 mean sd") replace plain nomtitle noobs
(file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/tables/csDMARD_delay_PsA.csv not found)
(output written to C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/tables/csDMARD_delay_PsA.csv)

. collapse (p50) p50_csdmard_delay=time_to_csdmard (p75) p75_csdmard_delay=time_to_csdmard (p25) p25_csdmard_delay=time_to_csdmard (mean) mean_csdmard_delay=time_to_csdmard (sd) sd_csdmard_delay=time_to_csdmard (count) n_cs
> dmard_delay=time_to_csdmard, by(mo_year_diagn)

. 
. tsset mo_year_diagn

Time variable: mo_year_diagn, 2019m3 to 2022m3
        Delta: 1 month

. 
. **Newey Standard Errors with 6 lags
. itsa p50_csdmard_delay if inrange(mo_year_diagn, tm(2019m3), tm(2022m3)), single trperiod(2020m3) lag(6) replace figure(title("", size(small)) subtitle("", size(medsmall)) ytitle("Median time to csDMARD, days", size(medsm
> all) margin(small)) ylabel(, nogrid) xtitle("Date of diagnosis", size(medsmall) margin(medsmall)) xlabel(710 "Mar 2019" 716 "Sep 2019" 722 "Mar 2020" 728 "Sep 2020" 734 "Mar 2021" 740 "Sep 2021" 746 "Mar 2022", nogrid) no
> te("", size(v.small)) legend(off) saving("$projectdir/output/figures/ITSA_csDMARD_delay_newey_psa.gph", replace)) posttrend 



Time variable: mo_year_diagn, 2019m3 to 2022m3
        Delta: 1 month

Regression with Newey–West standard errors      Number of obs     =         37
Maximum lag = 6                                 F(  3,        33) =       1.72
                                                Prob > F          =     0.1811

------------------------------------------------------------------------------
             |             Newey–West
_p50_csdma~y | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
          _t |   3.951049   2.781969     1.42   0.165     -1.70891    9.611008
    _x2020m3 |  -34.70848   43.34397    -0.80   0.429    -122.8924    53.47548
  _x_t2020m3 |  -6.731049   3.909973    -1.72   0.095    -14.68595    1.223852
       _cons |   524.9359    19.4226    27.03   0.000     485.4203    564.4515
------------------------------------------------------------------------------


                    Postintervention Linear Trend: 2020m3

Treated: _b[_t]+_b[_x_t2020m3]
------------------------------------------------------------------------------
Linear Trend |      Coef.   Std. Err.      t              [95% Conf. Interval]
-------------+----------------------------------------------------------------
     Treated |      -2.78   3.144627    -0.88   0.383    -9.177791    3.617791
------------------------------------------------------------------------------
(note:  named style v.small not found in class gsize, default attributes used)
(file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/figures/ITSA_csDMARD_delay_newey_psa.gph not found)
file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/figures/ITSA_csDMARD_delay_newey_psa.gph saved

.         graph export "$projectdir/output/figures/ITSA_csDMARD_delay_newey_psa.svg", replace
(file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/figures/ITSA_csDMARD_delay_newey_psa.svg not found)
file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/figures/ITSA_csDMARD_delay_newey_psa.svg saved as SVG format

. actest, lag(18) 

Cumby-Huizinga test for autocorrelation (Breusch-Godfrey)
  H0: variable is MA process up to order q
  HA: serial correlation present at specified lags >q
-----------------------------------------------------------------------------
  H0: q=0 (serially uncorrelated)        |  H0: q=specified lag-1
  HA: s.c. present at range specified    |  HA: s.c. present at lag specified
-----------------------------------------+-----------------------------------
    lags   |      chi2      df     p-val | lag |      chi2      df     p-val
-----------+-----------------------------+-----+-----------------------------
   1 -  1  |      0.089      1    0.7649 |   1 |      0.089      1    0.7649
   1 -  2  |      0.336      2    0.8453 |   2 |      0.258      1    0.6118
   1 -  3  |      0.465      3    0.9266 |   3 |      0.147      1    0.7011
   1 -  4  |      0.825      4    0.9351 |   4 |      0.221      1    0.6383
   1 -  5  |      3.336      5    0.6484 |   5 |      2.358      1    0.1246
   1 -  6  |      4.150      6    0.6564 |   6 |      0.391      1    0.5317
   1 -  7  |      8.157      7    0.3189 |   7 |      5.138      1    0.0234
   1 -  8  |      9.788      8    0.2803 |   8 |      0.990      1    0.3198
   1 -  9  |     12.014      9    0.2125 |   9 |      1.635      1    0.2010
   1 - 10  |     16.611      10   0.0834 |  10 |      3.374      1    0.0662
   1 - 11  |     16.649      11   0.1187 |  11 |      0.004      1    0.9466
   1 - 12  |     16.664      12   0.1627 |  12 |      0.223      1    0.6364
   1 - 13  |     21.566      13   0.0625 |  13 |      0.005      1*   0.9455
   1 - 14  |     22.003      14   0.0785 |  14 |      0.862      1*   0.3532
   1 - 15  |     26.877      15   0.0298 |  15 |      6.527      1*   0.0106
   1 - 16  |     29.878      16   0.0186 |  16 |      2.197      1*   0.1382
   1 - 17  |     29.912      17   0.0270 |  17 |      5.070      1*   0.0243
   1 - 18  |     31.532      18   0.0250 |  18 |      0.236      1*   0.6274
-----------------------------------------------------------------------------
  Test allows predetermined regressors/instruments
  Test requires conditional homoskedasticity
  * Eigenvalues adjusted to make matrix positive semidefinite

. 
. **Prais-Winsten 
. itsa p50_csdmard_delay if inrange(mo_year_diagn, tm(2019m3), tm(2022m3)), single trperiod(2020m3) replace prais rhotype(tscorr) vce(robust) figure(title("", size(small)) subtitle("", size(medsmall)) ytitle("Median time to
>  csDMARD, days", size(medsmall) margin(small)) ylabel(, nogrid) xtitle("Date of diagnosis", size(medsmall) margin(medsmall)) xlabel(710 "Mar 2019" 716 "Sep 2019" 722 "Mar 2020" 728 "Sep 2020" 734 "Mar 2021" 740 "Sep 2021"
>  746 "Mar 2022", nogrid) note("", size(v.small))  legend(off) saving("$projectdir/output/figures/ITSA_csDMARD_delay_prais_psa.gph", replace)) posttrend 



Time variable: mo_year_diagn, 2019m3 to 2022m3
        Delta: 1 month

Iteration 0:   rho = 0.0000
Iteration 1:   rho = 0.0389
Iteration 2:   rho = 0.0426
Iteration 3:   rho = 0.0430
Iteration 4:   rho = 0.0431
Iteration 5:   rho = 0.0431
Iteration 6:   rho = 0.0431

Prais–Winsten AR(1) regression with iterated estimates

Linear regression                               Number of obs     =         37
                                                F(3, 33)          =       1.32
                                                Prob > F          =     0.2840
                                                R-squared         =     0.0887
                                                Root MSE          =     91.389

------------------------------------------------------------------------------
             |             Semirobust
_p50_csdma~y | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
          _t |   3.753499   3.782401     0.99   0.328    -3.941853    11.44885
    _x2020m3 |  -31.31692   46.08586    -0.68   0.502    -125.0793    62.44547
  _x_t2020m3 |  -6.708559   5.283928    -1.27   0.213    -17.45879    4.041673
       _cons |   525.6716   29.67913    17.71   0.000      465.289    586.0543
-------------+----------------------------------------------------------------
         rho |   .0430651
------------------------------------------------------------------------------
Durbin–Watson statistic (original)    = 1.610326
Durbin–Watson statistic (transformed) = 1.659790


                    Postintervention Linear Trend: 2020m3

Treated: _b[_t]+_b[_x_t2020m3]
------------------------------------------------------------------------------
Linear Trend |      Coef.   Std. Err.      t              [95% Conf. Interval]
-------------+----------------------------------------------------------------
     Treated |   -2.95506   3.644023    -0.81   0.423    -10.36888     4.45876
------------------------------------------------------------------------------
(note:  named style v.small not found in class gsize, default attributes used)
(file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/figures/ITSA_csDMARD_delay_prais_psa.gph not found)
file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/figures/ITSA_csDMARD_delay_prais_psa.gph saved

.         graph export "$projectdir/output/figures/ITSA_csDMARD_delay_prais_psa.svg", replace     
(file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/figures/ITSA_csDMARD_delay_prais_psa.svg not found)
file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/figures/ITSA_csDMARD_delay_prais_psa.svg saved as SVG format

. restore

. 
. **Time from rheum appt to shared care MTX for RA patients (not including MTX high-cost drug) 
. preserve

. keep if time_to_mtx!=. & ra_code==1 & has_6m_follow_up==1 //drop those with no rheum appt and/or MTX prescription; must have minimum of 6m follow-up after diagnosis
(32,449 observations deleted)

. eststo X: estpost tabstat time_to_mtx, by(mo_year_diagn_s) stat(count p50 p75 p25 mean sd) 

Summary statistics: count p50 p75 p25 mean sd
     for variables: time_to_mtx
  by categories of: mo_year_diagn_s

mo_year_diag |  e(count)     e(p50)     e(p75)     e(p25)    e(mean)      e(sd) 
-------------+------------------------------------------------------------------
     2019m03 |        40      446.5      731.5        202     500.15    325.312 
     2019m04 |        45        632        960        479   715.0444   350.2501 
     2019m05 |        43        632        974        379   662.4884   341.7405 
     2019m06 |        39        591        924        318   625.3077   349.6385 
     2019m07 |        45        496        898        276   595.0889   379.5304 
     2019m08 |        41        358        737        169        470   360.3776 
     2019m09 |        43        568        874        276   617.9535   368.3785 
     2019m10 |        33        537        793        252   576.1515   362.7647 
     2019m11 |        43        442        779        247   562.7907   373.7185 
     2019m12 |        35        677        907        490   690.6857   306.9163 
     2020m01 |        38        608        929        281   617.2368   383.1789 
     2020m02 |        36        386        763        267   515.1944   373.7922 
     2020m03 |        35        493        858        219   575.1714   382.0488 
     2020m04 |        39        694        893        357   678.2308   346.1196 
     2020m05 |        48        538        888      253.5   597.3333   396.3456 
     2020m06 |        28      608.5      816.5        348   611.0714   344.3226 
     2020m07 |        52        494      788.5        292   546.6538    348.017 
     2020m08 |        39        380        675        234    485.359   307.3453 
     2020m09 |        37        628        787        334   613.2703    319.595 
     2020m10 |        49        466        822        343   564.1224   360.3908 
     2020m11 |        44        671        982        518   694.8864   327.4698 
     2020m12 |        52        567        841        282   587.9038   338.4658 
     2021m01 |        33        470        743        201   537.3333   381.7117 
     2021m02 |        37        668        925        274   644.1622   368.4825 
     2021m03 |        26        718       1019        380   706.8077   340.2891 
     2021m04 |        44      589.5      885.5        385   637.0682   331.4982 
     2021m05 |        37        500        818        293   584.0541   360.7201 
     2021m06 |        33        447        786        297   546.2727   329.5061 
     2021m07 |        35        516       1012        301        639   416.7851 
     2021m08 |        41        732       1031        433   727.2927   375.5116 
     2021m09 |        39        538        868        376        593   332.2448 
     2021m10 |        29        682        938        374   676.5172   357.6916 
     2021m11 |        43        549        810        369   636.8605   386.9131 
     2021m12 |        40      575.5      892.5      257.5    597.925   363.5813 
     2022m01 |        44        655      867.5      319.5   603.6591   324.4303 
     2022m02 |        32      398.5      759.5      283.5   479.0625   310.2827 
     2022m03 |         2      589.5       1023        156      589.5   613.0616 
-------------+------------------------------------------------------------------
       Total |      1419        562        874        313   602.6624   356.4072 

. esttab X using "$projectdir/output/tables/MTX_delay_RA.csv", cells("count p50 p75 p25 mean sd") replace plain nomtitle noobs
(file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/tables/MTX_delay_RA.csv not found)
(output written to C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/tables/MTX_delay_RA.csv)

. collapse (p50) p50_mtx_delay=time_to_mtx (p75) p75_mtx_delay=time_to_mtx (p25) p25_mtx_delay=time_to_mtx (mean) mean_mtx_delay=time_to_mtx (sd) sd_mtx_delay=time_to_mtx (count) n_mtx_delay=time_to_mtx, by(mo_year_diagn)

. 
. tsset mo_year_diagn

Time variable: mo_year_diagn, 2019m3 to 2022m3
        Delta: 1 month

. 
. **Newey Standard Errors with 6 lags
. itsa p50_mtx_delay if inrange(mo_year_diagn, tm(2019m3), tm(2022m3)), single trperiod(2020m3) lag(6) replace figure(title("", size(small)) subtitle("", size(medsmall)) ytitle("Median time to methotrexate, days", size(meds
> mall) margin(small)) ylabel(, nogrid) xtitle("Date of diagnosis", size(medsmall) margin(medsmall)) xlabel(710 "Mar 2019" 716 "Sep 2019" 722 "Mar 2020" 728 "Sep 2020" 734 "Mar 2021" 740 "Sep 2021" 746 "Mar 2022", nogrid) n
> ote("", size(v.small)) legend(off) saving("$projectdir/output/figures/ITSA_mtx_delay_newey_ra.gph", replace)) posttrend 



Time variable: mo_year_diagn, 2019m3 to 2022m3
        Delta: 1 month

Regression with Newey–West standard errors      Number of obs     =         37
Maximum lag = 6                                 F(  3,        33) =       2.16
                                                Prob > F          =     0.1109

------------------------------------------------------------------------------
             |             Newey–West
_p50_mtx_d~y | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
          _t |  -3.421329   4.749905    -0.72   0.476    -13.08508    6.242425
    _x2020m3 |   47.41979   36.34873     1.30   0.201    -26.53227    121.3718
  _x_t2020m3 |   4.287483   5.085534     0.84   0.405    -6.059115    14.63408
       _cons |   549.9423   28.01888    19.63   0.000     492.9375    606.9471
------------------------------------------------------------------------------


                    Postintervention Linear Trend: 2020m3

Treated: _b[_t]+_b[_x_t2020m3]
------------------------------------------------------------------------------
Linear Trend |      Coef.   Std. Err.      t              [95% Conf. Interval]
-------------+----------------------------------------------------------------
     Treated |   .8661538   1.436026     0.60   0.551    -2.055462     3.78777
------------------------------------------------------------------------------
(note:  named style v.small not found in class gsize, default attributes used)
(file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/figures/ITSA_mtx_delay_newey_ra.gph not found)
file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/figures/ITSA_mtx_delay_newey_ra.gph saved

.         graph export "$projectdir/output/figures/ITSA_mtx_delay_newey_ra.svg", replace
(file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/figures/ITSA_mtx_delay_newey_ra.svg not found)
file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/figures/ITSA_mtx_delay_newey_ra.svg saved as SVG format

. actest, lag(18) 

Cumby-Huizinga test for autocorrelation (Breusch-Godfrey)
  H0: variable is MA process up to order q
  HA: serial correlation present at specified lags >q
-----------------------------------------------------------------------------
  H0: q=0 (serially uncorrelated)        |  H0: q=specified lag-1
  HA: s.c. present at range specified    |  HA: s.c. present at lag specified
-----------------------------------------+-----------------------------------
    lags   |      chi2      df     p-val | lag |      chi2      df     p-val
-----------+-----------------------------+-----+-----------------------------
   1 -  1  |      0.704      1    0.4015 |   1 |      0.704      1    0.4015
   1 -  2  |      3.599      2    0.1654 |   2 |      2.346      1    0.1256
   1 -  3  |      4.188      3    0.2418 |   3 |      0.080      1    0.7773
   1 -  4  |      9.986      4    0.0407 |   4 |      2.221      1    0.1362
   1 -  5  |     10.003      5    0.0752 |   5 |      1.448      1    0.2289
   1 -  6  |     11.490      6    0.0744 |   6 |      0.002      1    0.9633
   1 -  7  |     12.345      7    0.0898 |   7 |      0.270      1    0.6035
   1 -  8  |     13.244      8    0.1037 |   8 |      0.042      1*   0.8382
   1 -  9  |     13.649      9    0.1354 |   9 |      0.005      1*   0.9451
   1 - 10  |     15.423      10   0.1174 |  10 |      0.034      1*   0.8530
   1 - 11  |     16.324      11   0.1295 |  11 |      2.979      1*   0.0844
   1 - 12  |     18.194      12   0.1099 |  12 |      0.764      1    0.3822
   1 - 13  |     18.210      13   0.1497 |  13 |      0.364      1    0.5465
   1 - 14  |     18.623      14   0.1798 |  14 |      0.277      1*   0.5986
   1 - 15  |     18.624      15   0.2313 |  15 |      0.811      1    0.3680
   1 - 16  |     18.901      16   0.2738 |  16 |      0.630      1*   0.4274
   1 - 17  |     19.187      17   0.3179 |  17 |      0.152      1    0.6965
   1 - 18  |     19.232      18   0.3777 |  18 |      0.022      1*   0.8828
-----------------------------------------------------------------------------
  Test allows predetermined regressors/instruments
  Test requires conditional homoskedasticity
  * Eigenvalues adjusted to make matrix positive semidefinite

. 
. **Prais-Winsten 
. itsa p50_mtx_delay if inrange(mo_year_diagn, tm(2019m3), tm(2022m3)), single trperiod(2020m3) replace prais rhotype(tscorr) vce(robust) figure(title("", size(small)) subtitle("", size(medsmall)) ytitle("Median time to met
> hotrexate, days", size(medsmall) margin(small)) ylabel(, nogrid) xtitle("Date of diagnosis", size(medsmall) margin(medsmall)) xlabel(710 "Mar 2019" 716 "Sep 2019" 722 "Mar 2020" 728 "Sep 2020" 734 "Mar 2021" 740 "Sep 2021
> " 746 "Mar 2022", nogrid) note("", size(v.small))  legend(off) saving("$projectdir/output/figures/ITSA_mtx_delay_prais_ra.gph", replace)) posttrend 



Time variable: mo_year_diagn, 2019m3 to 2022m3
        Delta: 1 month

Iteration 0:   rho = 0.0000
Iteration 1:   rho = -0.1363
Iteration 2:   rho = -0.1372
Iteration 3:   rho = -0.1372
Iteration 4:   rho = -0.1372

Prais–Winsten AR(1) regression with iterated estimates

Linear regression                               Number of obs     =         37
                                                F(3, 33)          =       0.44
                                                Prob > F          =     0.7258
                                                R-squared         =     0.1029
                                                Root MSE          =     101.87

------------------------------------------------------------------------------
             |             Semirobust
_p50_mtx_d~y | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
          _t |  -3.636791   8.239087    -0.44   0.662    -20.39934    13.12576
    _x2020m3 |   46.33264   73.83894     0.63   0.535    -103.8938    196.5591
  _x_t2020m3 |   4.546211      8.527     0.53   0.597     -12.8021    21.89452
       _cons |    552.764   48.00378    11.52   0.000     455.0996    650.4284
-------------+----------------------------------------------------------------
         rho |  -.1371769
------------------------------------------------------------------------------
Durbin–Watson statistic (original)    = 2.241444
Durbin–Watson statistic (transformed) = 2.039583


                    Postintervention Linear Trend: 2020m3

Treated: _b[_t]+_b[_x_t2020m3]
------------------------------------------------------------------------------
Linear Trend |      Coef.   Std. Err.      t              [95% Conf. Interval]
-------------+----------------------------------------------------------------
     Treated |   .9094203   2.412368     0.38   0.709     -3.99858    5.817421
------------------------------------------------------------------------------
(note:  named style v.small not found in class gsize, default attributes used)
(file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/figures/ITSA_mtx_delay_prais_ra.gph not found)
file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/figures/ITSA_mtx_delay_prais_ra.gph saved

.         graph export "$projectdir/output/figures/ITSA_mtx_delay_prais_ra.svg", replace  
(file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/figures/ITSA_mtx_delay_prais_ra.svg not found)
file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/figures/ITSA_mtx_delay_prais_ra.svg saved as SVG format

. restore

. 
. **Time from rheum appt to shared care MTX for PsA patients (not including MTX high-cost drug)
. preserve

. keep if time_to_mtx!=. & psa_code==1 & has_6m_follow_up==1 //drop those with no rheum appt and/or MTX prescription; must have minimum of 6m follow-up after diagnosis
(32,476 observations deleted)

. eststo X: estpost tabstat time_to_mtx, by(mo_year_diagn_s) stat(count p50 p75 p25 mean sd) 

Summary statistics: count p50 p75 p25 mean sd
     for variables: time_to_mtx
  by categories of: mo_year_diagn_s

mo_year_diag |  e(count)     e(p50)     e(p75)     e(p25)    e(mean)      e(sd) 
-------------+------------------------------------------------------------------
     2019m03 |        48        729        885        378   664.2917    339.728 
     2019m04 |        42      481.5        735        278   505.3095     311.09 
     2019m05 |        42        546        855        323   586.5714   359.4655 
     2019m06 |        39        549        819        220   549.2308   327.2099 
     2019m07 |        38        639        922        435   671.5263   322.6593 
     2019m08 |        30      564.5        741        251      547.3   344.0317 
     2019m09 |        38        551        783        288   575.5526   370.2462 
     2019m10 |        32      565.5      779.5      342.5    559.375   324.1241 
     2019m11 |        34        691        923        457   699.3235   375.9725 
     2019m12 |        40      781.5      989.5        470      741.7   402.6153 
     2020m01 |        45        531        818        204   536.5333   363.1773 
     2020m02 |        50      530.5        805        295     569.28   356.8722 
     2020m03 |        37        525        840        302        570   382.1687 
     2020m04 |        38        647       1033        348   683.5789   410.5271 
     2020m05 |        38      507.5        810        299   573.4737   363.3858 
     2020m06 |        33        468        749        226   549.8788   390.8151 
     2020m07 |        35        646        923        339   610.6857   378.3446 
     2020m08 |        40        375        815        241     473.55   354.5315 
     2020m09 |        37        403        697        203   528.4865   384.2799 
     2020m10 |        44        503        894      217.5   562.3409   400.4129 
     2020m11 |        36      436.5      544.5        247   451.6111   307.1862 
     2020m12 |        33        640        774        267   553.3939   323.1901 
     2021m01 |        48      551.5        920        350    603.625   322.0309 
     2021m02 |        39        474        696        337   547.1538   259.6155 
     2021m03 |        40      580.5        993        375    646.325   362.4739 
     2021m04 |        35        455        726        272   537.6571   324.3558 
     2021m05 |        34        476        777        176   511.6765   348.2595 
     2021m06 |        37        470        708        243   498.2973   315.5497 
     2021m07 |        38      544.5        790        351   581.5526   312.8357 
     2021m08 |        34      509.5        885        287   590.3824   383.0071 
     2021m09 |        36      447.5        714      309.5   539.6667   311.1075 
     2021m10 |        30      717.5        937        280   686.4333   405.9493 
     2021m11 |        40      624.5      864.5      283.5    591.925   367.1326 
     2021m12 |        54      652.5        879        363   615.8148   325.9755 
     2022m01 |        33        432        894        209   536.0909   375.1478 
     2022m02 |        44        577      795.5        355   595.1818   307.9565 
     2022m03 |         1         14         14         14         14          . 
-------------+------------------------------------------------------------------
       Total |      1392        546        846        293   579.6681   352.6197 

. esttab X using "$projectdir/output/tables/MTX_delay_PsA.csv", cells("count p50 p75 p25 mean sd") replace plain nomtitle noobs
(file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/tables/MTX_delay_PsA.csv not found)
(output written to C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/tables/MTX_delay_PsA.csv)

. collapse (p50) p50_mtx_delay=time_to_mtx (p75) p75_mtx_delay=time_to_mtx (p25) p25_mtx_delay=time_to_mtx (mean) mean_mtx_delay=time_to_mtx (sd) sd_mtx_delay=time_to_mtx (count) n_mtx_delay=time_to_mtx, by(mo_year_diagn)

. 
. tsset mo_year_diagn

Time variable: mo_year_diagn, 2019m3 to 2022m3
        Delta: 1 month

. 
. **Newey Standard Errors with 6 lags
. itsa p50_mtx_delay if inrange(mo_year_diagn, tm(2019m3), tm(2022m3)), single trperiod(2020m3) lag(6) replace figure(title("", size(small)) subtitle("", size(medsmall)) ytitle("Median time to methotrexate, days", size(meds
> mall) margin(small)) ylabel(, nogrid) xtitle("Date of diagnosis", size(medsmall) margin(medsmall)) xlabel(710 "Mar 2019" 716 "Sep 2019" 722 "Mar 2020" 728 "Sep 2020" 734 "Mar 2021" 740 "Sep 2021" 746 "Mar 2022", nogrid) n
> ote("", size(v.small)) legend(off) saving("$projectdir/output/figures/ITSA_mtx_delay_newey_psa.gph", replace)) posttrend 



Time variable: mo_year_diagn, 2019m3 to 2022m3
        Delta: 1 month

Regression with Newey–West standard errors      Number of obs     =         37
Maximum lag = 6                                 F(  3,        33) =       4.46
                                                Prob > F          =     0.0098

------------------------------------------------------------------------------
             |             Newey–West
_p50_mtx_d~y | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
          _t |   1.351399   4.735806     0.29   0.777     -8.28367    10.98647
    _x2020m3 |  -63.99524   51.41779    -1.24   0.222    -168.6055    40.61504
  _x_t2020m3 |  -4.212552   6.117214    -0.69   0.496    -16.65812    8.233013
       _cons |   589.1923   29.24362    20.15   0.000     529.6957    648.6889
------------------------------------------------------------------------------


                    Postintervention Linear Trend: 2020m3

Treated: _b[_t]+_b[_x_t2020m3]
------------------------------------------------------------------------------
Linear Trend |      Coef.   Std. Err.      t              [95% Conf. Interval]
-------------+----------------------------------------------------------------
     Treated |  -2.861154   4.007078    -0.71   0.480    -11.01362    5.291308
------------------------------------------------------------------------------
(note:  named style v.small not found in class gsize, default attributes used)
(file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/figures/ITSA_mtx_delay_newey_psa.gph not found)
file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/figures/ITSA_mtx_delay_newey_psa.gph saved

.         graph export "$projectdir/output/figures/ITSA_mtx_delay_newey_psa.svg", replace
(file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/figures/ITSA_mtx_delay_newey_psa.svg not found)
file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/figures/ITSA_mtx_delay_newey_psa.svg saved as SVG format

. actest, lag(18) 

Cumby-Huizinga test for autocorrelation (Breusch-Godfrey)
  H0: variable is MA process up to order q
  HA: serial correlation present at specified lags >q
-----------------------------------------------------------------------------
  H0: q=0 (serially uncorrelated)        |  H0: q=specified lag-1
  HA: s.c. present at range specified    |  HA: s.c. present at lag specified
-----------------------------------------+-----------------------------------
    lags   |      chi2      df     p-val | lag |      chi2      df     p-val
-----------+-----------------------------+-----+-----------------------------
   1 -  1  |      0.276      1    0.5992 |   1 |      0.276      1    0.5992
   1 -  2  |      0.339      2    0.8441 |   2 |      0.094      1    0.7593
   1 -  3  |      1.939      3    0.5853 |   3 |      1.435      1    0.2309
   1 -  4  |      2.527      4    0.6397 |   4 |      0.646      1    0.4215
   1 -  5  |      5.252      5    0.3859 |   5 |      2.344      1    0.1257
   1 -  6  |      6.405      6    0.3794 |   6 |      0.530      1    0.4664
   1 -  7  |      6.906      7    0.4388 |   7 |      0.000      1    0.9954
   1 -  8  |      7.047      8    0.5315 |   8 |      0.014      1    0.9055
   1 -  9  |      7.052      9    0.6317 |   9 |      0.446      1    0.5041
   1 - 10  |      7.070      10   0.7189 |  10 |      0.004      1    0.9517
   1 - 11  |      7.108      11   0.7903 |  11 |      0.000      1    0.9912
   1 - 12  |      7.122      12   0.8494 |  12 |      0.025      1    0.8738
   1 - 13  |      7.223      13   0.8903 |  13 |      0.015      1    0.9022
   1 - 14  |      9.455      14   0.8009 |  14 |      1.924      1    0.1655
   1 - 15  |     12.161      15   0.6668 |  15 |      1.937      1*   0.1639
   1 - 16  |     12.240      16   0.7273 |  16 |      1.156      1*   0.2824
   1 - 17  |     15.293      17   0.5744 |  17 |      0.027      1*   0.8691
   1 - 18  |     18.686      18   0.4114 |  18 |      0.129      1*   0.7190
-----------------------------------------------------------------------------
  Test allows predetermined regressors/instruments
  Test requires conditional homoskedasticity
  * Eigenvalues adjusted to make matrix positive semidefinite

. 
. **Prais-Winsten 
. itsa p50_mtx_delay if inrange(mo_year_diagn, tm(2019m3), tm(2022m3)), single trperiod(2020m3) replace prais rhotype(tscorr) vce(robust) figure(title("", size(small)) subtitle("", size(medsmall)) ytitle("Median time to met
> hotrexate, days", size(medsmall) margin(small)) ylabel(, nogrid) xtitle("Date of diagnosis", size(medsmall) margin(medsmall)) xlabel(710 "Mar 2019" 716 "Sep 2019" 722 "Mar 2020" 728 "Sep 2020" 734 "Mar 2021" 740 "Sep 2021
> " 746 "Mar 2022", nogrid) note("", size(v.small))  legend(off) saving("$projectdir/output/figures/ITSA_mtx_delay_prais_psa.gph", replace)) posttrend 



Time variable: mo_year_diagn, 2019m3 to 2022m3
        Delta: 1 month

Iteration 0:   rho = 0.0000
Iteration 1:   rho = -0.0620
Iteration 2:   rho = -0.0676
Iteration 3:   rho = -0.0681
Iteration 4:   rho = -0.0681
Iteration 5:   rho = -0.0681
Iteration 6:   rho = -0.0681

Prais–Winsten AR(1) regression with iterated estimates

Linear regression                               Number of obs     =         37
                                                F(3, 33)          =       2.15
                                                Prob > F          =     0.1124
                                                R-squared         =     0.1153
                                                Root MSE          =     125.77

------------------------------------------------------------------------------
             |             Semirobust
_p50_mtx_d~y | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
          _t |   1.939424   8.780056     0.22   0.827    -15.92373    19.80258
    _x2020m3 |  -70.27401   80.72392    -0.87   0.390    -234.5081    93.96004
  _x_t2020m3 |  -4.472297   10.04124    -0.45   0.659    -24.90135    15.95675
       _cons |   585.5082   52.36877    11.18   0.000     478.9632    692.0533
-------------+----------------------------------------------------------------
         rho |  -.0681156
------------------------------------------------------------------------------
Durbin–Watson statistic (original)    = 1.686266
Durbin–Watson statistic (transformed) = 1.612363


                    Postintervention Linear Trend: 2020m3

Treated: _b[_t]+_b[_x_t2020m3]
------------------------------------------------------------------------------
Linear Trend |      Coef.   Std. Err.      t              [95% Conf. Interval]
-------------+----------------------------------------------------------------
     Treated |  -2.532874   5.023799    -0.50   0.617    -12.75387    7.688122
------------------------------------------------------------------------------
(note:  named style v.small not found in class gsize, default attributes used)
(file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/figures/ITSA_mtx_delay_prais_psa.gph not found)
file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/figures/ITSA_mtx_delay_prais_psa.gph saved

.         graph export "$projectdir/output/figures/ITSA_mtx_delay_prais_psa.svg", replace 
(file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/figures/ITSA_mtx_delay_prais_psa.svg not found)
file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/output/figures/ITSA_mtx_delay_prais_psa.svg saved as SVG format

. restore

. 
. /*
> **Time from rheum appt to biologic for all EIA patients (data available to 2020-11-27) - for patients who have at least 12 months of follow-up post-diagnosis
> preserve
> keep if time_to_biologic!=. & has_12m_follow_up==1 //drop those with no rheum appt and/or biologic prescription; must have a minimum of 12m follow-up after diagnosis
> eststo X: estpost tabstat time_to_biologic, by(mo_year_diagn_s) stat(count p50 p75 p25 mean sd) 
> esttab X using "$projectdir/output/tables/Biol_delay_all.csv", cells("count p50 p75 p25 mean sd") replace plain nomtitle noobs
> collapse (p50) p50_biologic_delay=time_to_biologic (p75) p75_biologic_delay=time_to_biologic (p25) p25_biologic_delay=time_to_biologic (mean) mean_biologic_delay=time_to_biologic (sd) sd_biologic_delay=time_to_biologic (c
> ount) n_biologic_delay=time_to_biologic, by(mo_year_diagn)
> 
> tsset mo_year_diagn
> 
> **Newey Standard Errors with 6 lags
> itsa p50_biologic_delay if inrange(mo_year_diagn, tm(2019m3), tm(2020m11)), single trperiod(2020m3) lag(6) replace figure(title("", size(small)) subtitle("", size(medsmall)) ytitle("Median time to biologic, days", size(me
> dsmall) margin(small)) ylabel(, nogrid) xtitle("Date of diagnosis", size(medsmall) margin(medsmall)) xlabel(710 "Mar 2019" 716 "Sep 2019" 722 "Mar 2020" 728 "Sep 2020" 734 "Mar 2021" 740 "Sep 2021" 746 "Mar 2022", nogrid)
>  note("", size(v.small)) legend(off) saving("$projectdir/output/figures/ITSA_biologic_delay_newey_all.gph", replace)) posttrend 
>         graph export "$projectdir/output/figures/ITSA_biologic_delay_newey_all.svg", replace
> actest, lag(18) 
> 
> **Prais-Winsten 
> itsa p50_biologic_delay if inrange(mo_year_diagn, tm(2019m3), tm(2020m11)), single trperiod(2020m3) replace prais rhotype(tscorr) vce(robust) figure(title("", size(small)) subtitle("", size(medsmall)) ytitle("Median time 
> to biologic, days", size(medsmall) margin(small)) ylabel(, nogrid) xtitle("Date of diagnosis", size(medsmall) margin(medsmall)) xlabel(710 "Mar 2019" 716 "Sep 2019" 722 "Mar 2020" 728 "Sep 2020" 734 "Mar 2021" 740 "Sep 20
> 21" 746 "Mar 2022", nogrid) note("", size(v.small))  legend(off) saving("$projectdir/output/figures/ITSA_biologic_delay_prais_all.gph", replace)) posttrend 
>         graph export "$projectdir/output/figures/ITSA_biologic_delay_prais_all.svg", replace    
> restore
> 
> **Time from rheum appt to biologic for RA patients
> preserve
> keep if time_to_biologic!=. & ra_code==1 & has_12m_follow_up==1 //drop those with no rheum appt and/or biologic prescription; must have a minimum of 12m follow-up after diagnosis
> eststo X: estpost tabstat time_to_biologic, by(mo_year_diagn_s) stat(count p50 p75 p25 mean sd) 
> esttab X using "$projectdir/output/tables/Biol_delay_ra.csv", cells("count p50 p75 p25 mean sd") replace plain nomtitle noobs
> collapse (p50) p50_biologic_delay=time_to_biologic (p75) p75_biologic_delay=time_to_biologic (p25) p25_biologic_delay=time_to_biologic (mean) mean_biologic_delay=time_to_biologic (sd) sd_biologic_delay=time_to_biologic (c
> ount) n_biologic_delay=time_to_biologic, by(mo_year_diagn)
> 
> tsset mo_year_diagn
> 
> **Newey Standard Errors with 6 lags
> itsa p50_biologic_delay if inrange(mo_year_diagn, tm(2019m3), tm(2020m11)), single trperiod(2020m3) lag(6) replace figure(title("", size(small)) subtitle("", size(medsmall)) ytitle("Median time to biologic, days", size(me
> dsmall) margin(small)) ylabel(, nogrid) xtitle("Date of diagnosis", size(medsmall) margin(medsmall)) xlabel(710 "Mar 2019" 716 "Sep 2019" 722 "Mar 2020" 728 "Sep 2020" 734 "Mar 2021" 740 "Sep 2021" 746 "Mar 2022", nogrid)
>  note("", size(v.small)) legend(off) saving("$projectdir/output/figures/ITSA_biologic_delay_newey_ra.gph", replace)) posttrend 
>         graph export "$projectdir/output/figures/ITSA_biologic_delay_newey_ra.svg", replace
> actest, lag(18) 
> 
> **Prais-Winsten 
> itsa p50_biologic_delay if inrange(mo_year_diagn, tm(2019m3), tm(2020m11)), single trperiod(2020m3) replace prais rhotype(tscorr) vce(robust) figure(title("", size(small)) subtitle("", size(medsmall)) ytitle("Median time 
> to biologic, days", size(medsmall) margin(small)) ylabel(, nogrid) xtitle("Date of diagnosis", size(medsmall) margin(medsmall)) xlabel(710 "Mar 2019" 716 "Sep 2019" 722 "Mar 2020" 728 "Sep 2020" 734 "Mar 2021" 740 "Sep 20
> 21" 746 "Mar 2022", nogrid) note("", size(v.small))  legend(off) saving("$projectdir/output/figures/ITSA_biologic_delay_prais_ra.gph", replace)) posttrend 
>         graph export "$projectdir/output/figures/ITSA_biologic_delay_prais_ra.svg", replace     
> restore
> 
> **Time from rheum appt to biologic for PsA patients
> preserve
> keep if time_to_biologic!=. & psa_code==1 & has_12m_follow_up==1 //drop those with no rheum appt and/or biologic prescription; must have a minimum of 12m follow-up after diagnosis
> eststo X: estpost tabstat time_to_biologic, by(mo_year_diagn_s) stat(count p50 p75 p25 mean sd) 
> esttab X using "$projectdir/output/tables/Biol_delay_PsA.csv", cells("count p50 p75 p25 mean sd") replace plain nomtitle noobs
> collapse (p50) p50_biologic_delay=time_to_biologic (p75) p75_biologic_delay=time_to_biologic (p25) p25_biologic_delay=time_to_biologic (mean) mean_biologic_delay=time_to_biologic (sd) sd_biologic_delay=time_to_biologic (c
> ount) n_biologic_delay=time_to_biologic, by(mo_year_diagn)
> 
> tsset mo_year_diagn
> 
> **Newey Standard Errors with 6 lags
> itsa p50_biologic_delay if inrange(mo_year_diagn, tm(2019m3), tm(2020m11)), single trperiod(2020m3) lag(6) replace figure(title("", size(small)) subtitle("", size(medsmall)) ytitle("Median time to biologic, days", size(me
> dsmall) margin(small)) ylabel(, nogrid) xtitle("Date of diagnosis", size(medsmall) margin(medsmall)) xlabel(710 "Mar 2019" 716 "Sep 2019" 722 "Mar 2020" 728 "Sep 2020" 734 "Mar 2021" 740 "Sep 2021" 746 "Mar 2022", nogrid)
>  note("", size(v.small)) legend(off) saving("$projectdir/output/figures/ITSA_biologic_delay_newey_psa.gph", replace)) posttrend 
>         graph export "$projectdir/output/figures/ITSA_biologic_delay_newey_psa.svg", replace
> actest, lag(18) 
> 
> **Prais-Winsten 
> itsa p50_biologic_delay if inrange(mo_year_diagn, tm(2019m3), tm(2020m11)), single trperiod(2020m3) replace prais rhotype(tscorr) vce(robust) figure(title("", size(small)) subtitle("", size(medsmall)) ytitle("Median time 
> to biologic, days", size(medsmall) margin(small)) ylabel(, nogrid) xtitle("Date of diagnosis", size(medsmall) margin(medsmall)) xlabel(710 "Mar 2019" 716 "Sep 2019" 722 "Mar 2020" 728 "Sep 2020" 734 "Mar 2021" 740 "Sep 20
> 21" 746 "Mar 2022", nogrid) note("", size(v.small))  legend(off) saving("$projectdir/output/figures/ITSA_biologic_delay_prais_psa.gph", replace)) posttrend 
>         graph export "$projectdir/output/figures/ITSA_biologic_delay_prais_psa.svg", replace    
> restore
> 
> **Time from rheum appt to biologic for AxSpA patients
> preserve
> keep if time_to_biologic!=. & anksp_code==1 & has_12m_follow_up==1 //drop those with no rheum appt and/or biologic prescription; must have a minimum of 12m follow-up after diagnosis
> eststo X: estpost tabstat time_to_biologic, by(mo_year_diagn_s) stat(count p50 p75 p25 mean sd) 
> esttab X using "$projectdir/output/tables/Biol_delay_anksp.csv", cells("count p50 p75 p25 mean sd") replace plain nomtitle noobs
> collapse (p50) p50_biologic_delay=time_to_biologic (p75) p75_biologic_delay=time_to_biologic (p25) p25_biologic_delay=time_to_biologic (mean) mean_biologic_delay=time_to_biologic (sd) sd_biologic_delay=time_to_biologic (c
> ount) n_biologic_delay=time_to_biologic, by(mo_year_diagn)
> 
> tsset mo_year_diagn
> 
> **Newey Standard Errors with 6 lags
> itsa p50_biologic_delay if inrange(mo_year_diagn, tm(2019m3), tm(2020m11)), single trperiod(2020m3) lag(6) replace figure(title("", size(small)) subtitle("", size(medsmall)) ytitle("Median time to biologic, days", size(me
> dsmall) margin(small)) ylabel(, nogrid) xtitle("Date of diagnosis", size(medsmall) margin(medsmall)) xlabel(710 "Mar 2019" 716 "Sep 2019" 722 "Mar 2020" 728 "Sep 2020" 734 "Mar 2021" 740 "Sep 2021" 746 "Mar 2022", nogrid)
>  note("", size(v.small)) legend(off) saving("$projectdir/output/figures/ITSA_biologic_delay_newey_anksp.gph", replace)) posttrend 
>         graph export "$projectdir/output/figures/ITSA_biologic_delay_newey_anksp.svg", replace
> actest, lag(18) 
> 
> **Prais-Winsten 
> itsa p50_biologic_delay if inrange(mo_year_diagn, tm(2019m3), tm(2020m11)), single trperiod(2020m3) replace prais rhotype(tscorr) vce(robust) figure(title("", size(small)) subtitle("", size(medsmall)) ytitle("Median time 
> to biologic, days", size(medsmall) margin(small)) ylabel(, nogrid) xtitle("Date of diagnosis", size(medsmall) margin(medsmall)) xlabel(710 "Mar 2019" 716 "Sep 2019" 722 "Mar 2020" 728 "Sep 2020" 734 "Mar 2021" 740 "Sep 20
> 21" 746 "Mar 2022", nogrid) note("", size(v.small))  legend(off) saving("$projectdir/output/figures/ITSA_biologic_delay_prais_anksp.gph", replace)) posttrend 
>         graph export "$projectdir/output/figures/ITSA_biologic_delay_prais_anksp.svg", replace  
> restore
> */
. 
. log close
      name:  <unnamed>
       log:  C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY\Github Practice/logs/itsa_models.log
  log type:  text
 closed on:  11 Apr 2022, 12:36:12
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
